{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum pro rata"}}, "datePosted": "2020-10-26T10:55:35+0000", "description": "&lt;p&gt;&lt;span&gt;Leicestershire Partnership NHS Trust are working together with Adult Social Care across Leicester, Leicestershire and Rutland (LLR) in order to deliver a newly commissioned HomeFirst service offer alongside core Community Therapy. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;As a result there has been significant investment in staffing in order to ensure that services can be delivered by the right therapist in the right place at the right time, and to ensure that the local population across LLR receive timely high quality therapy.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This is therefore a really exciting time to be joining this newly formed service which brings together an integrated health and social care offer delivered by community-based nursing, therapy and adult social care teams and will allow you to use your therapy skills to:&lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;support people to remain in their homes when they are having a health or social care crisis, rather than needing to go into hospital or a care home&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;help people get home from hospital quickly and provide them with rehabilitation and reablement to help restore their health, wellbeing and independence&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;deliver high quality core therapy reablement, rehabilitation and recovery to people within their own homes&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;span&gt;We are really proud of this recent feedback for our new service offer:&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;&lt;span&gt;“I really didn’t want him to go back to hospital, he doesn’t get on well there, he doesn’t know anyone and they don’t really know him. He’s only just come out and he got another infection when he was there. We have got one carer once a day and they couldn’t get him to stand up on Thursday night. By Friday he had been stuck in his chair all night as he was too tired and weak to get up, the Home First Therapists came in and helped. They were so kind; they got him out of the chair and into bed. They made him feel comfortable; they treated him like he was special and not just a number, they made me feel better to” &lt;/span&gt;&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Do you have the ability to deliver similar high quality compassionate care and think you will be the right person to join our team which is already proven to make a difference? &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are looking for a Band 6 Physiotherapists to provide an effective and efficient therapy service. This post requires a level of personal responsibility and we are looking for someone highly motivated, resilient and proactive with the ability to prioritise their own workload, use their initiative and the ability to work on their own and as part of a team. You will demonstrate excellent communication and organisational skills and be able to adapt to a changing and pressurised environment. You will also demonstrate that you hold a Degree / Diploma in Physiotherapy, be registered with the HPC, have relevant, recent NHS experience either pre or post qualification, evidence of continuing professional development and be able to be flexible to meet the needs of the service.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The therapy teams operate in an integrated way whereby Occupational Therapists and Physiotherapists are encouraged to work synergistically in order to provide the best possible outcomes for our patients. You will be encouraged and supported to grow your skillset, and to challenge the way we do things. We are looking for determined and self-motivated individuals who can make a difference to the care of patients from all backgrounds, and to promote therapy services within the trust.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;span&gt;Due to further additional funding to expand our Home First Service we are looking for 3 Band 6 Physiotherapists.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Post 1 - based within the Charnwood Nursing and Therapy hub (Based at Loughborough Hospital), 37.5 hours, will consider part time hours&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Post 2 - based within the North West Nursing and Therapy hub (Based at Coalville Health Centre) 37.5 hours&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Post 3 - based within the Hinckley and Bosworth Nursing and Therapy hub (Based at Hinckley and Bosworth Community Hospital) 37.5 hours&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;As a service we operate Monday to Friday 8-6 and Saturday/Sunday/Bank holidays 8-4. Hours/days worked are based on a rota system.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;CAR DRIVER AND ACCESS TO A CAR IS ESSENTIAL FOR THIS POST.&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;span&gt;IF YOU ARE NOT A CAR DRIVER OR DO NOT HAVE ACCESS TO A CAR WE REQUEST AN APPLICATION IS NOT SUBMITTED.&lt;/span&gt;&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We recognise the need to develop modern working practices to enable employees to maximise their performance and productivity whilst maintaining a good work life balance. To this aim the Trust has adopted an Agile working methodology as outlined within the Trust Agile working Policy.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The post advertised falls under the Trust’s Agile working methodology, if successful you will be appointed as an Agile Worker, and will need to work to the Trusts Agile working policy. Talk to the recruiting manager about what this means in practice for you.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;For further information about this post please contact Emma Smith on 07341778502 or Michelle Walker on 07919590988.. &lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Leicestershire Partnership Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120650"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Leicestershire", "postalCode": "LE4 8PQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6765", "longitude": "-1.10301"}}, "title": "Band 6 Physiotherapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242092", "validThrough": "2020-11-09T23:59:59+0000"}