{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 to £21,142 pro rata,pa"}}, "datePosted": "2020-11-04T12:15:31+0000", "description": "&lt;p&gt;&lt;strong&gt;30 hours per week covering North/Central Shropshire (based in Oswestry)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is an exciting time for the Public Health Nursing Service in Shropshire. Successful candidates will be part of a dynamic team who are committed to improving outcomes for children and young people through service transformation and partnership working.&lt;/p&gt;\n&lt;p&gt;We are proud of the quality of our service provision and welcome innovation and staff who embrace change. The Trust has a commitment to clinical supervision/professional support and staff are actively encouraged to contribute to the continuing development of the service. Using the 456 Model we are utilising a variety of methods to engage families and meet health needs.&lt;/p&gt;\n&lt;p&gt;We have a vacancy in the Shropshire Public Health Nursing Service for a Public Health Support Worker.&lt;/p&gt;\n&lt;p&gt;As a Public Health Support Worker you will be supporting the Specialist Community Health Nurses in delivering the targeted support to families as well as undertaking mandated development reviews under supervision. You must have experience of working with children under 5 years and their families supporting and empowering them to improve health outcomes.&lt;/p&gt;\n&lt;p&gt;If you are interested in joining our forward thinking service you will need to be flexible and adaptable with a ‘can do’ problem solving approach. In return you can expect exposure to a varied workload, close liaison with multiagency colleagues in local authority and children’s centre teams, plus opportunities to develop professional skills/ knowledge through the use of personal development plans.&lt;/p&gt;\n&lt;p&gt;The Trust is a family friendly employer, and we are happy to consider flexible working arrangements wherever possible.&lt;/p&gt;\n&lt;p&gt;For further information or an informal discussion about this post, please contact Jayne Christie, Locality Lead North Shropshire Public Health Nursing Team on 07775 633357&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;AS A MANDATORY PART OF THE RECRUITMENT PROCESS YOU SHOULD ANSWER THE FOLLOWING QUESTION IN YOUR SUPPORTING STATEMENT&lt;/span&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;(MAXIMUM OF 200 WORDS):&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;‘What do you understand by the term ‘public health’ and how might it be integrated into this role?’&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/127016.jpg", "name": "Shropshire Community Health NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127016"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Oswestry", "postalCode": "SY11 1GA"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.8625", "longitude": "-3.05883"}}, "title": "Public Health Nursing Service Support Worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255773", "validThrough": "2020-11-18T23:59:59+0000"}