{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 per annum"}}, "datePosted": "2020-10-30T09:31:01+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for a Clinical Administrator to work within the Planned Care &amp; Recovery Team based at St Mary&#39;s Hospital. The post hours will be 37.5 hours per week, Monday to Friday 9am-5pm.&lt;/p&gt;\n&lt;p&gt;We are looking to recruit a suitably qualified Clinical Administrator to support 2 of our Consultant Psychiatrists. The post-holder will be required to provide a full and confidential secretarial and administrative service to the Consultants and their respective junior doctors. A range of secretarial and clerical skills will be required to support the smooth running of day to day operational issues for the medical staff.&lt;/p&gt;\n&lt;p&gt;The post-holder will need be flexible in their approach and use initiative and judgement to organise their own workload and that of junior administrative staff within the service when required. Good organisational ability, strong IT skills (including use of Microsoft packages and SystmOne use) and flexibility are required.&lt;/p&gt;\n&lt;p&gt;We are seeking an individual who is enthusiastic, compassionate, flexible and creative in their approach and can work alongside nursing staff and the wider multi-disciplinary team to provide quality and effective administrative support.&lt;/p&gt;\n&lt;p&gt;You will demonstrate an enthusiasm for professional development and will be motivated to further your understanding and skills through various training opportunities.&lt;/p&gt;\n&lt;p&gt;You will be part of a dynamic and supportive team, benefiting from a comprehensive supervision and appraisal system, with a commitment to staff development.&lt;/p&gt;\n&lt;p&gt;NHFT welcomes applications from people, regardless of age, disability, gender, gender reassignment, race, religion or belief, sexual orientation, marital or civil partnership status or pregnancy or maternity status.&lt;/p&gt;\n&lt;p&gt;We would encourage applications from groups who are currently underrepresented in the organisation. In particular, applications from disabled people (with both visible and non-visible disabilities), people from black and minority ethnic communities and lesbian, gay, bisexual or transgendered (LGBT) people.&lt;/p&gt;\n&lt;p&gt;Car owner/driver and current driving license essential or access to a car as you may be required to cross cover other sites (unless you have a disability as defined by the Equality Act 2010)&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Please contact Heather Rawley, Business Support Manager on 07720346349 or email heather.rawley@nhft.nhs.uk for an informal discussion.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Northamptonshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121219"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St Mary&#39;s Hospital, Kettering, Kettering", "postalCode": "NN15 7PW"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.3941", "longitude": "-.722184"}}, "title": "Clinical Administrator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249495", "validThrough": "2020-11-13T23:59:59+0000"}