{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 per annum"}}, "datePosted": "2020-11-02T12:31:28+0000", "description": "&lt;p&gt;&lt;strong&gt;Are you committed to delivering high quality patient care?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Do you have the attitude, emotional robustness and skills to work positively with women service users with complex needs?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Do you enjoy working in a supportive and skilled team and enjoy a challenge?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Thames House is a resource for the whole of the Thames Valley area providing specialist assessment, outreach, consultancy and standard setting. This is a rare and exciting opportunity to help continue to shape the service and advance the standards of care for our users. The unit works directly with women planning their recovery and ultimately aims to support their move back into the community.&lt;/p&gt;\n&lt;p&gt;We are looking for highly motivated and enthusiastic qualified Mental Health Nurses to join our multi-disciplinary team. You will deliver excellent care to our clients as part of a dynamic and developing team. You will have a good knowledge base, excellent communication skills and a flexible and positive attitude. Applicants with a caring, non-judgmental and inclusive attitude who are committed to the delivery of safe, high quality care are welcomed. Some experience in a secure setting may be an advantage but is not essential.&lt;/p&gt;\n&lt;p&gt;It is mandatory for you to complete Management of Violence Aggression Training, Breakaway Training and other training directly related to the job.&lt;/p&gt;\n&lt;p&gt;Please note, this post attracts an Regional Secure Unit allowance of £1,446 per annum paid monthly.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Caroline Thomas-Wilkinson, Ward Manager on 01865 902019&lt;/p&gt;\n&lt;p&gt;Rachel Baxter, Ward Manager on 01865 902612&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Oxford Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122233"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Oxford", "postalCode": "OX4 4XN"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7175", "longitude": "-1.22952"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252061", "validThrough": "2020-12-01T23:59:59+0000"}