{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "42712", "minValue": "28691", "unitText": "YEAR", "value": "£28,691 - £42,712 pa inclusive of HCAS"}}, "datePosted": "2020-11-05T09:31:02+0000", "description": "&lt;p&gt;&lt;strong&gt;Better Births Midwife&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;It is an exciting time to join Epsom &amp; St Helier NHS Trust maternity team. We provide care to around 4,700 women per year across two sites at Epsom and St Helier. We pride ourselves in the promotion of women centred care and have well established co-located birth centres in addition to the obstetric led labour wards, fetal medicine and specialist midwifery teams.&lt;/p&gt;\n&lt;p&gt;We have an established home birth team and pathways in place to look after women with complex care needs. Women and their families using our maternity service consistently report very positive childbirth experiences, we have an active Maternity Voices Partnership and we have a number of improvement projects underway which will further develop our service and workforce. We have been awarded the CNST Incentive funding for safety, we are Baby Friendly Gold accredited, we have moved to Badgernet digital records, and our unique Maternity Advice Line has been shortlisted for an HSJ award.&lt;/p&gt;\n&lt;p&gt;In line with the national Better Births agenda, we have reconfigured the way we provide care to ensure we provide consistent quality, safety and continuity. We have a shared vision for high quality, safe and sustainable maternity services with the SW London and Surrey Heartlands Local Maternity Systems.&lt;/p&gt;\n&lt;p&gt;We are looking for midwives who share our passion for high quality care and experience for women, and offer opportunities to be involved at the front line of service transformation. We have opportunities now to join the pioneering integrated teams at the Epsom site, and welcome applications from either newly qualified or more experienced band 6 midwives to join us on our journey. These roles ensure that all midwives grow and maintain competency in all areas of the maternity pathway, and also play a key part in the significant development of our services.&lt;/p&gt;\n&lt;p&gt;We have a very robust preceptorship programme for newly qualified midwives in addition to many opportunities for in house training and development. If you are passionate about being at the forefront of the changes occurring in midwifery services and shaping sustainable quality improvements, we would love to hear from you. This is an excellent opportunity for you to progress in your career and to develop your midwifery skills in a fully supported environment.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121992.jpg", "name": "Epsom and St Helier University Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121992"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Epsom", "postalCode": "KT18 7EG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.325", "longitude": "-.273383"}}, "title": "Band 5/6 Midwife", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257060", "validThrough": "2020-11-19T23:59:59+0000"}