{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "31249", "minValue": "31249", "unitText": "YEAR", "value": "£18.59 per hour"}}, "datePosted": "2020-10-21T12:42:15+0100", "description": "&lt;p&gt;&lt;span&gt;Are you a Registered Staff Nurse looking for a new opportunity to work in an organisation that will help you to develop and achieve your goals to become the best you can be? &lt;/span&gt;&lt;/p&gt;\n&lt;span&gt;As a Nurse from the NHS or private care, you&#39;ll join the team as a Bank Staff Nurse where you&#39;ll receive your perfect work/life balance, 12.07% hourly pay uplift and will be able to book your shifts through the Temployer App.&lt;/span&gt;\n&lt;span&gt; &lt;/span&gt;\n&lt;span&gt;Your career within Elysium will be enjoyable and rewarding as you develop specialist skills and make a real difference for some of the most vulnerable people in society. &lt;/span&gt;\n&lt;span&gt; &lt;/span&gt;\n&lt;p&gt;&lt;span&gt;It’s a career that you can take pride in and enjoy. It’s what delivering great healthcare should feel like.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;What you will be doing&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;As a qualified RMN or RNLD nurse you will ensure our service users Male &amp; Female Service users (Adults 18+) in our Rehabilitation facility receive high-quality care, while also supporting your colleagues and promote good teamwork.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;No two days are the same, with plenty to keep you engaged and motivated, but also a good amount of routine. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will have access to the Elysium Wellbeing team, which is on hand to keep you feeling great; be it a chat, massage or group activities. Who doesn’t like a free massage at work?&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;There are also career development opportunities, with a huge range of courses that will help you grow and succeed. If you have the aspiration, capability and dedication, we can give you the support and opportunities to help you achieve your career goals.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;Location: &lt;/strong&gt;&lt;span&gt;Ballington Gardens, Leek, Staffordshire, ST13 5LW&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Ballington House is a 10 bed mental health rehabilitation hospital that provides services for women with complex mental health needs.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The environment at Ballington House is a unique aspect of the service with care provided in one of six apartments which offer single and two person accommodation. The apartments create a domestic living environment that encourages people to be responsible for maintaining their own living space.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The apartments provide a structured, safe and private environment to help reinforce social boundaries&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;In addition to the apartments, Ballington House has communal areas such as the conservatory to help the individual to socialise and forge relationships.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;What you will get&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;span&gt;Hourly rate of £17.24 (including the 12.07% holiday allowance uplift)&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Free meals and parking&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Mandatory training&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Wellbeing support and Activities&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Flexible working&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Paid induction&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Transfer to perm in the future (optional)&lt;/span&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;About your next employer&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will be working for an established, stable and agile company with a unique approach to the delivery of care.  &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Each and every employee is valued and supported, as everyone has an important role to play in the success of Elysium. It is only with the dedication, passion and hard work from staff that excellent care programs that truly benefit the service users can be delivered.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;With a network of over 70 services across England and Wales, providing four services including: Mental Health, Neurological, Learning Disabilities &amp; Autism, Children &amp; Education, there is opportunity for you to grow and move with Elysium.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;span&gt;Elysium Healthcare follows safer recruitment of staff for all appointments. It is a requirement that all staff understand it is each person’s individual responsibility and are committed to promoting and safeguarding the welfare of service users. Candidates will be subject to an Enhanced DBS disclosure.&lt;/span&gt;&lt;/em&gt;&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "Elysium Healthcare", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133794"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Leek", "postalCode": "ST13 5LW"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.103", "longitude": "-2.02173"}}, "title": "Bank Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916236412", "validThrough": "2021-01-31T23:59:59+0000"}