{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "28988", "minValue": "26365", "unitText": "YEAR", "value": "£26,365 - £28,988 pa Incl"}}, "datePosted": "2020-11-05T15:16:22+0000", "description": "&lt;p&gt;&lt;strong&gt;Looked After Children Coordinator - 2 x Band 4&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Looked After Children’s (LAC) Health Team works in close partnership with the Local Authority. Both the Designated Doctor and LAC Specialist Nurse have office facilities in the Social Service Department.&lt;/p&gt;\n&lt;p&gt;The Designated Doctor for Looked After Children is responsible for all medical advice issued to the Local Authority in relation to Looked After Children and children being placed for adoption and attends regular meetings of the Adoption and Permanency Panel as Medical Advisor.&lt;/p&gt;\n&lt;p&gt;The Local Authority (LB Wandsworth) is responsible for approximately 390 Looked After Children. There are approximately 150 new accommodations each year.&lt;/p&gt;\n&lt;p&gt;The LAC Co-ordinator Team provides day-to-day operational administrative support to the LAC Health Team to ensure the service is running effectively and efficiently. The team receives all referrals for LAC health assessments and adult health report reviews from the LA and co-ordinates the work of the health team to ensure statutory timescales are met.&lt;/p&gt;\n&lt;p&gt;We are looking for 1 LAC Coordinators to join our team to provide day to day support to the LAC Health Team. This is a unique and varied role which offers&lt;/p&gt;\n&lt;p&gt;The post holder will maintain all administrative tasks associated with health assessments, adult review and adoption and permanence. This requires high quality secretarial and administrative support working in close co-operation with other administrative staff, health professionals, partner agencies, Looked After Children and their parents, foster carers, guardians and adopters. All activity must be recorded accurately on a number of information systems. This is a key to providing data required by the Trust Board and Partner Agencies.&lt;/p&gt;\n&lt;p&gt;The post holder must be aware of the vulnerable client group the LAC Health Team support and must be able to act with discretion and confidentiality at all times. This is a demanding role requiring high levels of administrative skills, communications skills and the ability to work as part of a team.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Carys EdwardsService Manager&lt;/p&gt;\n&lt;p&gt;Email Carys.Edwards@stgeorges.nhs.uk 020 8725 1805Additional contact information&lt;/p&gt;\n&lt;p&gt;Heather Hearty, Deputy General Manager, Heather.Hearty@stgeorges.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "St George's University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121185"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "London", "postalCode": "SW17 0QT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4267", "longitude": "-.175721"}}, "title": "Looked After Children Administrator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258298", "validThrough": "2020-11-09T23:59:59+0000"}