{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 to £24,157 pa pro rata"}}, "datePosted": "2020-11-05T12:15:23+0000", "description": "&lt;p&gt;&lt;strong&gt;CHILDREN’S SPEECH &amp; LANGUAGE THERAPY&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;FRANCHE CLINIC, KIDDERMINSTER/KINGS COURT 1, WORCESTER&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;SPECIALIST NURSERY NURSE&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;BAND 4&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;28.5 hours per week – Term Time Only&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are looking to recruit an enthusiastic and motivated specialist nursery nurse to work within the Child Development Centre Service providing support to children with complex additional needs and their families.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Child Development Services in Worcestershire offer specialist support to children and their families who present with complex and additional needs. As part of this service, identified children are referred for specialist interventions  that offer support to children and their parents in acquiring skills and applying strategies to enhance development opportunities. This service also provides multi-disciplinary assessment of preschool children; this includes the preschool assessment for Autistic Spectrum Disorder.   &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;A successful candidate will be able to demonstrate knowledge and skills in supporting parents to provide opportunities for their children to develop through play and therapy based activities. They will be experienced in working with children with developmental delay, (social communication, sensory processing, cognition and manipulation, gross motor). They will need a sound knowledge of children’s development in the preschool years. An understanding of the family’s needs and capacity will need to be demonstrated, alongside empathetic skills. Recognition of the scope of this role, and signposting to other support services will be developed through induction and supervision.  Knowledge and skills using I.T. and an interest in health promotion through social media would also be useful.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;A successful candidate would be based at the Child Development Centre in Worcester but would need to be flexible in working with colleagues in Redditch and the Wyre Forest.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Child Development Services are managed through the Paediatric Speech and Language  Therapy Service with close liaison and joint working with Occupational Therapy and Physiotherapy colleagues, Health Visitors and Paediatricians.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further detail or the opportunity to visit the Centre, please contact Fiona Totney  Paediatric Speech and Language Therapist and Child Development Centre Team on 01562 752749&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;em&gt;All staff whatever their role, level or responsibility will be encouraged and supported to do their job well and to improve their job.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt; &lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Making Every Day Better for patients, staff, service users and carers is the responsibility of all of us and we want to embed a culture within the organisation that encourages and supports the drive to improve what we do.&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120795.jpg", "name": "Herefordshire and Worcestershire Health and Care NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120795"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Worcestershire", "postalCode": "WR5 1JR"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1917", "longitude": "-2.17905"}}, "title": "Specialist Nursery Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257594", "validThrough": "2020-11-19T23:59:59+0000"}