{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum pro rata"}}, "datePosted": "2020-11-04T08:30:35+0000", "description": "&lt;p&gt;&lt;strong&gt;BCSP Specialist Screening Practitioner Band 6 W.T.E. - 30.0 HOURS per week&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Post based in: Carlisle Cumberland Infirmary.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This is an exciting, innovative and substantive post working as part of the local team for NHS Bowel Cancer Screening Programme in England. You will have a key role in the specialist team who deliver the bowel screening to the Cumbria and Morecambe Bay population. We are seeking enthusiastic, self-motivated individuals to work within our team.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The screening practitioner acts as the patient’s advocate, supporting them and their carers to navigate and make informed choices through all stages of the screening process. You will pre-assess patients for colonoscopy and discuss findings and diagnosis of colorectal disease.&lt;/p&gt;\n&lt;p&gt;Advanced communication skills will be required to assist in complex decision making, and dealing with sensitive issues.&lt;/p&gt;\n&lt;p&gt;The Screening Practitioner will be involved in health promotion activities with our local Public Health services to encourage access to screening by all sections of our society.&lt;/p&gt;\n&lt;p&gt;Participation in the screening training module at Liverpool John Moores University ( 40 credits at level 6) is mandatory and fully funded.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will work collaboratively with the Programme Hub to co-ordinate and provide care from the screening centre. The post holders will be expected to adhere to and review clinical practice, work with the screening hub in the administration and audit of the service and utilise research to inform practice.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Your role will include delivery of clinics within the community, support of the patient and carer through Colonoscopy as well as attendance at multi-disciplinary team meetings in the relevant Hospital Trusts. The above post is based at The Cumberland Infirmary with clinics at West Cumberland hospital The post requires staff to work flexibly, including covering absences of colleagues across the Cumbria &amp; Morecambe Bay BCSP; there is the possibility that you will need to cover clinics and lists at Westmorland General hospital, clinics at Queen Victoria hospital Morecambe, Furness General hospital Barrow in Furness. Candidates should note that the future expansion plans for the service may require working patterns for Saturdays and some evenings.&lt;/p&gt;\n&lt;p&gt;Anyone newly appointed to the Trust will be subject to the completion of a satisfactory 6 month probationary period (this includes bank staff). This will give the new staff member an opportunity to become familiar with the role and working environment.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;For informal enquiries please contact Sara Underwood Specialist screening Practitioner Bowel Cancer Screening Programme, Cumbria &amp; Morecambe Bay on 01228 814487, Jane Chester, Lead Specialist Screening Practitioner 01539 716742 ,&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameSara UnderwoodJob titleSpecialist Screening PractitionerEmail addresssara.underwood@ncic.nhs.ukTelephone number01228814487Additional contact information&lt;/p&gt;\n&lt;p&gt;further contacts Jane Chester, Lead Specialist Screening Practitioner 01539 716742 ,&lt;/p&gt;\n&lt;p&gt;Mary Doherty Programme Manager.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University Hospitals of Morecambe Bay NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121712"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Cumberland Infirmary, Carlisle", "postalCode": "CA2 7HY"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.8958", "longitude": "-2.9553"}}, "title": "Specialist Screening Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255088", "validThrough": "2020-11-18T23:59:59+0000"}