{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "28000", "minValue": "3500", "unitText": "YEAR", "value": "£28,000-£35,00"}}, "datePosted": "2020-10-28T10:15:17+0000", "description": "&lt;p&gt;As part of a national focus on GP Practices co-ordinating the delivery of Enhanced Health in Care Homes, Greater Peterborough Network, an organisation owned and run by the GP Practices across Greater Peterborough, are looking to recruit a Project Manager. You will lead a team of six, implementing an exciting project to introduce virtual consultations and telehealth technologies into the 45 care homes across the Greater Peterborough area.&lt;/p&gt;\n&lt;p&gt;You will lead and manage a team of six Care Co-ordinators who will organise and handle the day to day activities within their allocation of homes. You will engage with the teams, clinicians, management and other stakeholders to deliver a single reliable approach throughout the project, and ensure that robust project control is in place including documentation, scheduling tasks and setting milestones, and confirming that timescales and objectives are met and benefits are delivered. You will provide day to day management of the team, developing individuals and managing performance and absence. You will lead and coordinate team communication, holding regular team meetings and acting as a conduit of information between the wider project, senior management, external agencies and the team.&lt;/p&gt;\n&lt;p&gt;You will have oversight of the set-up of new technology in each of the 45 Care Homes, prioritising the teams work and planning roll out of the equipment and training as well as capturing the benefits and reporting to stakeholders on impact. The Co-ordinators will provide on the ground support to set up IT systems to enable remote consultations and provide training to care home staff to ensure they are able to support their use.&lt;/p&gt;\n&lt;p&gt;The Co-ordinators will lead and manage meetings of a Multi-Disciplinary Team (MDT) of clinical roles, care home staff, community practitioners and residents for roughly 8 care homes. As Project Manager, you will help to understand the needs and ways of working for all 45 care homes, ensuring this is reflected in how meetings are organised and run and sharing the learning from other care homes locally and nationally. You will also be responsible for issue resolution and getting the best from all health and care professionals involved in the MDT.&lt;/p&gt;\n&lt;p&gt;You will support and train the Co-ordinators to capture and share information in the most efficient and effective way for all stakeholders. This will include ensuring that each resident has an electronic Personal Care and Support Plan (PCSP) on file, and that all members of the MDT have access to it. Any changes or trends within these plans should be reflected in the planning of the MDT meetings.&lt;/p&gt;\n&lt;p&gt;The role will work flexibly including from home, GP Practices, Care Homes and Greater Peterborough Network Head Office at Allia Future Business Centre in the City Centre. You will need to travel between service sites, so having your own transport is essential.&lt;/p&gt;\n&lt;p&gt;As this is a new and evolving role, we are looking for applicants with a flexible attitude who are keen to work and learn as part of a team. You’ll be people focused, able to work effectively with stakeholders of different levels, including GPs and care home managers. You will have experience in finding solutions, and be comfortable raising issues directly with the practice or home directly. You will have a strong working knowledge of Office 365 programs, with experience of presenting reports using many sources of data, both qualitative and quantitative. You will be able to exercise initiative and demonstrate consistently high standards of professionalism, always aware of the need for confidentiality and integrity. You will strive for continuous improvement, both in terms of the impact and learnings from the current project as well as identifying business cases for future investments and related projects.&lt;/p&gt;\n&lt;p&gt;This is a fantastic opportunity to make your mark in a successful, growing healthcare organisation that is committed to seeking new, creative and better ways to deliver and develop our services.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Essential:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Highly efficient at multi-tasking and driving progress&lt;/li&gt;\n&lt;li&gt;Knowledge of recognised project management methodologies and techniques&lt;/li&gt;\n&lt;li&gt;Experience in reporting and Continuous Improvement&lt;/li&gt;\n&lt;li&gt;Highly computer literate (MS Office, MS Teams)&lt;/li&gt;\n&lt;li&gt;Ability to manage various stakeholders and communicate at the appropriate levels&lt;/li&gt;\n&lt;li&gt;Experience of managing a team&lt;/li&gt;\n&lt;li&gt;Own transport to move between sites&lt;/li&gt;\n&lt;li&gt;A satisfactory Disclosure and Barring check&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;strong&gt;Desirable:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Knowledge of Health and Social Care including terminology, structures and pathways&lt;/li&gt;\n&lt;/ul&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central Advertising - Other", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130656"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Peterborough", "postalCode": "PE2 8AN"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5651", "longitude": "-.241865"}}, "title": "Care Home Project Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245992", "validThrough": "2020-11-10T23:59:59+0000"}