{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 p.a"}}, "datePosted": "2020-10-23T08:41:27+0100", "description": "&lt;p&gt;&lt;em&gt;We don&#39;t often use the phrase &#39;an exciting opportunity has arisen&#39; in our job adverts, but there is no other way to describe this innovative new role. Developed in collaboration with the Clinical Education Department, this really is an exciting opportunity for a talented, experienced pharmacy technician with a genuine passion for education and training, and for medication safety.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;The role will be split between the Pharmacy and Clinical Education Departments for Dartford &amp; Gravesham NHS Trust. In the Pharmacy, you will provide expert leadership as part of our growing Education &amp; Training Team, supporting the growth and development of pharmacy assistants, technicians, and pharmacists, as well as maintaining your core technical and medicines management competencies. Working with clinical education, you will help to embed medicines safety and medicines optimisation as a golden thread throughout the clinical education programme. This will include delivering and facilitating medicines-related training to a wide range of trainees and HCPs, including simulation-based training.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;You will need to be an experienced educational and practice supervisor, and be confident and capable in delivering engaging and inspiring training sessions. You will also need to be able to identify and develop innovative new ways to provide training for medicines optimisation, and be able to evaluate the success of your training methods.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;If you think you have what it takes to develop and grow this brand new post, we&#39;d love to hear from you.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;For an informal chat about this role, please contact Julia Scott, Chief Pharmacist (&lt;/em&gt;&lt;em&gt;juliascott1@nhs.net&lt;/em&gt;&lt;em&gt;)&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Interviews will be held on Tuesday 24th November via Microsoft Teams.&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121400.png", "name": "Dartford and Gravesham NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121400"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Dartford", "postalCode": "DA2 8DA"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4351", "longitude": ".25819"}}, "title": "Principal Pharmacy Technician – Clinical Education", "url": "https://www.jobs.nhs.uk/xi/vacancy/916239710", "validThrough": "2020-11-06T23:59:59+0000"}