{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 Per Annum"}}, "datePosted": "2020-10-09T16:01:09+0100", "description": "&lt;p&gt;&lt;strong&gt;Consultant Interventional Radiologist&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The team at York Hospital have a range of opportunities within the Interventional Radiology service and would like to hear from any Interventionists who would be interested in working at York. York is a beautiful city with easy access to attractive countryside and coast. York Hospital is a vascular and Trauma centre. Relocation packages are available. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Are you currently training as an interventional Radiologist? We would love to hear from you. Please get in touch.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We welcome applications for an Interventional Radiologist based at York Hospital NHS Foundation Trust. The successful applicant will join a team of 26 consultants, including currently 5 Interventional Radiologists, working across our York and Scarborough sites.&lt;/p&gt;\n&lt;p&gt;York Hospital has been a vascular centre since 2011, serving the population of North Yorkshire. It is a busy department where the work is varied and rewarding, including Vascular and Non Vascular intervention, EVAR and FEVAR. The York Vascular Unit fosters a multidisciplinary approach to patient care and there is an excellent working relationship between the surgeons and interventional radiologists. Interventional radiology lists take place in two labs, both with new Siemens Artis Zee C- arms. The primary lab is within the 13 bed Vascular Imaging Unit complex. The second lab is in the main theatres suite. Funding has been secured to expand the Vascular Imaging Unit to accommodate more day beds and improved catheter lab facility.&lt;/p&gt;\n&lt;p&gt;Based at York Hospital you would work within both the multidisciplinary vascular unit and the general radiology teams, undertaking a wide range of interventional radiology procedures and contribution to the diagnostic radiology service. The post is offered at 10 PA’s with the option of an additional PA. Duties will be split between interventional radiology and diagnostic radiology. Diagnostic radiology commitments largely support specialties relevant to intervention, but with scope to develop other sub-specialty interests. We could also accommodate a more focussed interventional role if general radiology skills cannot be offered.&lt;/p&gt;\n&lt;p&gt;The radiology service covers the whole trust and the radiology team contribute to service provision at Scarborough Hospital with occasional cross site working.&lt;/p&gt;\n&lt;p&gt;You would participate in the1 in 6 interventional radiology on call rota.&lt;/p&gt;\n&lt;p&gt;The radiology department is committed to teaching. We support radiology trainees from the Leeds rotation and play an active role in teaching Hull and York Medical School (HYMS) students.&lt;/p&gt;\n&lt;p&gt;We are a cohesive and friendly department, working well as a team and with referring clinicians. There is a strong culture of sharing expertise and seeking advice. The management team is supportive and forward thinking. The department is currently embarking on a wide ranging programme of development and modernisation.&lt;/p&gt;\n&lt;p&gt;York is internationally renowned for its beauty and heritage. It has excellent rail and road links which ensure easy access to major cities and to the wonderful North Yorkshire countryside. An extensive cycle network allows a pleasant, alternative commute to work. York has been recently voted as one of the best places to live in the UK. It is a lovely place to raise a family and has a plethora of excellent schools. The two universities in the city are highly renowned.&lt;/p&gt;\n&lt;p&gt;In joining the Trust you will have access to a wide range of staff benefits including health and wellbeing support, finance schemes and discounts. There is also a competitive relocation package of up to £8,000. To support your learning and development you will be entitled to a study leave budget of £3,000 across three years, along with support from our learning and development team. We have an active research department and also have strong links with Hull York Medical School providing opportunities in teaching and training.&lt;/p&gt;\n&lt;p&gt;There is also the opportunity to undertake private practice.&lt;/p&gt;\n&lt;p&gt;Pre-interview visits to the department are encouraged. We would love to meet with you and discuss further.&lt;/p&gt;\n&lt;p&gt;Further information can be obtained by contacting Dr Victoria Birkett, Clinical Director, and Dr Marcus Nicholls, Interventional Radiology Clinical Lead via their secretary on 01904 726675 or by emailing RadiologyMedicalSecretaries@York.NHS.uk&lt;strong&gt;. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameVictoria BirkettJob titleClinical DirectorEmail addressVictoria.Birkett@YORK.NHS.UKTelephone number01723 342451Additional contact information&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further information please contact Dr Marcus Nicholls via email Radiologymedicalsecretaries@York.NHS.uk&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For Job pack details please see trac jobs 419-2052927 ID 2696420&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "York Teaching Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120856"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "York, York", "postalCode": "YO31 8HE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.9706", "longitude": "-1.08365"}}, "title": "Consultant Interventional Radiologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916220990", "validThrough": "2020-11-09T23:59:59+0000"}