{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum pro-rata"}}, "datePosted": "2020-11-03T18:00:32+0000", "description": "&lt;p&gt;Applications are invited for a Locum Consultant in Reproductive Medicine at Cambridge IVF to commence as soon as possible for 6 months in the first instance.&lt;/p&gt;\n&lt;p&gt;Cambridge IVF needs to recruit a Locum Consultant to cover the absence of a substantive Consultant. The majority of the work will comprise informal discussions with patients prior to treatment, consultations and diagnosis, oocyte collections and embryo transfers. An area of focus will be the training of clinical staff to carry out routine procedures and consultations.&lt;/p&gt;\n&lt;p&gt;You will have 5 years+ experience within Gynaecology and have a minimum of 18 months experience in an IVF Unit, and be highly skilled at egg collections, embryo transfers, diagnostic scanning and fertility consultations.&lt;/p&gt;\n&lt;p&gt;Applicants &lt;strong&gt;must&lt;/strong&gt; be fully registered with the GMC at point of application and ideally have a CCT or be within six months of award of CCT at the time of interview.&lt;/p&gt;\n&lt;p&gt;Applications are welcomed from those unable to work full time for personal reasons or those wishing to job-share.&lt;/p&gt;\n&lt;p&gt;Cambridge University Hospitals NHS Foundation Trust includes Addenbrooke’s and the Rosie Hospitals. We are one of the largest and busiest hospitals in the country with an outstanding reputation that is down to the exceptional people that work here.&lt;/p&gt;\n&lt;p&gt;Our philosophy is to keep the patient at the heart of everything we do. Every person that works for the Trust, regardless of their role, comes into contact with our patients and visitors and is expected to uphold our values of &lt;strong&gt;Together - Safe, Kind, Excellent&lt;/strong&gt; at all times.&lt;/p&gt;\n&lt;p&gt;We look for people who are willing to go the extra mile, not because they are asked to, but because they are committed to being part of a healthcare team that delivers an excellent caring service to our patients.&lt;/p&gt;\n&lt;p&gt;The applicant must have demonstrable skills in listening, reading, writing and speaking in English that enable effective communication about medical topics with patients and colleagues, as set out in the GMC’s Good Medical Practice (2013).&lt;/p&gt;\n&lt;p&gt;Applications from job seekers who require Tier 2 sponsorship to work in the UK are welcome and will be considered alongside all other applications. For further information please visit the UK Visas and Immigration website.&lt;/p&gt;\n&lt;p&gt;From 6 April 2017, Tier 2 skilled worker applicants, applying for entry clearance into the UK, must present a criminal record certificate from each country they have resided continuously or cumulatively for 12 months or more in the past 10 years. Adult dependants (over 18 years old) will also be subject to this requirement.&lt;/p&gt;\n&lt;p&gt;Cambridge University Hospitals NHS Foundation Trust is an Equal Opportunities Employer.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Informal enquiries about this post should be addressed to Dr Tulay Karasu, Acting Clinical Lead for Reproductive Medicine and IVF at tulay.karasu@addenbrookes.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Cambridge University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121319"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Addenbrooke&#39;s Hospital, Cambridge", "postalCode": "CB2 0QQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1751", "longitude": ".141751"}}, "title": "Locum Consultant in Reproductive Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254979", "validThrough": "2020-11-09T23:59:59+0000"}