{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 to £24,157 per annum"}}, "datePosted": "2020-10-27T12:01:05+0000", "description": "&lt;p&gt;&lt;span&gt;&lt;span&gt;Here at The Mid Yorkshire Hospitals NHS Trust an exciting opportunity has arisen for a Personal Assistant to the Deputy Director of Operations and the Head of Clinical Service for Radiology. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;We require someone who has excellent organisational and Interpersonal skills and who can continuously improve themselves and help others to do so within our department. The successful candidate will be able to demonstrate confidentiality, professionalism and conscientious working. You must be able to work to tight deadlines and produce high quality work.&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;We are a challenging and fast-paced service and require someone who can step into this role with confidence and the ability to motivate themselves and others. &lt;/span&gt;&lt;span&gt;We are looking for someone who can uphold our trust values &amp; behaviours and play a crucial role in delivering excellent care. Are you caring, ensuring this is in the heart of all you do? Are you willing to contribute to help improve aspects of the care being delivered and to improve yourself? Are you respectful of others and treat people the way they would expect to be treated? Are you able to provide a high standard of work, for both patients and the services we provide? Then you just might be the candidate we are looking for. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This position is full time Monday-Friday however; the working hours can be flexible to the right candidate.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This role will predominately be based at Pinderfields Hospital however we are a 3-site trust and as part of your role, you may be required to work across all three sites (Pinderfields, Pontefract and Dewsbury). We offer a regular staff shuttle service between all 3 sites for staff convenience and ease. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Mid Yorkshire Trust has excellent travel links to Leeds, Sheffield, Doncaster and Bradford. We are close to both the M1 and the M62. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;If you would like to attend for an informal chat or a look round please contact Chloe Broadhurst 01977747021 or &lt;/span&gt;&lt;span&gt;chloe.broadhurst@nhs.net&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120735.png", "name": "Mid Yorkshire Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120735"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Trustwide", "postalCode": "WF1 4DG"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.6949", "longitude": "-1.48592"}}, "title": "Personal Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244373", "validThrough": "2020-11-15T23:59:59+0000"}