{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-11-05T14:16:29+0000", "description": "&lt;p&gt;An excellent opportunity has arisen within the Informatics Department at Wirral University Teaching Hospital as we seek to appoint a highly motivated Senior Project Manager to join out team. We&#39;re looking for someone with several years of experience of successful implementations through the project lifecycle, from business case development to change management and handover into business as usual.&lt;/p&gt;\n&lt;p&gt;The successful applicant will engage with stakeholders across the Trust and with external partner agencies. You will work as a key member of the Project Management Team, liaising closely with other members of the Informatics department and the wider Trust.&lt;/p&gt;\n&lt;p&gt;With significant Project Management experience and the ability to lead and influence staff members, you will have excellent communication skills and demonstrate a record of successful implementation to time and budget.&lt;/p&gt;\n&lt;p&gt;You will have a good understanding of the issues which challenge large organisations when implementing complex ICT solutions. You will be able to deal with competing priorities and at the same time you will be able to guide stakeholders through formal project management governance.&lt;/p&gt;\n&lt;p&gt;This is an exciting and challenging role and you will make a vital contribution to the Trust’s continued delivery of its ICT strategy, and to make a positive contribution to the shaping of an ambitious Informatics team.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Gerard Hussey&lt;/p&gt;\n&lt;p&gt;Job title: Implementation Programme Manager&lt;/p&gt;\n&lt;p&gt;Email address: gerrard.hussey@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone numberTel: 0151 678 5111 Ext: 8489&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121461.jpg", "name": "Wirral University Teaching Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121461"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Cedar House, Clatterbridge, Bebington", "postalCode": "CH63 4JY"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3323", "longitude": "-3.02585"}}, "title": "Senior Project Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258081", "validThrough": "2020-11-19T23:59:59+0000"}