{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "73664", "minValue": "63751", "unitText": "YEAR", "value": "£63,751 - £73,664 per annum"}}, "datePosted": "2020-10-28T09:46:23+0000", "description": "&lt;p&gt;COMMUNITY SERVICES &amp; AGEING WELL PROGRAMME&lt;/p&gt;\n&lt;p&gt;NHS ENGLAND AND NHS IMPROVEMENT&lt;/p&gt;\n&lt;p&gt;Are you an enthusiastic, driven and motivated individual who is determined to improve the lives of people living within the community? Do you want to ensure more people are able to be cared for in their own homes and care homes with well-coordinated personalised services that make sense for them? Working in NHS England and Improvement’s Community Services &amp; Ageing Well (CSAW) team, that’s exactly what you’ll do.&lt;/p&gt;\n&lt;p&gt;As a Delivery and Policy Lead, the post holder will work as part of a new and dynamic team in delivering an effective service supporting managers and staff across the Community Services and Ageing Well programme and beyond to ensure policy and delivery of the Anticipatory Care workstream within the programme.&lt;/p&gt;\n&lt;p&gt;The programme holds high national profile with high expectation and accountability for delivery as a key part of the NHS Long Term Plan. Working with a large variety of stakeholders across multiple systems including regional teams, patients, clinicians and charities, our team’s aim is to deliver more joined-up and coordinated out of hospital care, ensure more proactive services are provided to people and that these services are transformative in their support offer to individuals.&lt;/p&gt;\n&lt;p&gt;The team is responsible for delivery and the development of national policy for these key deliverables of the NHS Long Term Plan through 3 workstreams:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;The Urgent Community Response workstream will focus on capacity building and quality improvement of key community services – building on existing intermediate care service provision, implementing 2-hour/2-day standards for community crisis response and reablement&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;The Anticipatory Care (AC) workstream will develop, implement and scale a proactive population health approach for people with complex issues and frailty through Primary Care Network Community Teams, providing preventative care and supporting early identification and avoidable admissions&lt;/li&gt;\n&lt;li&gt;The Enhanced Health in Care Homes (EHCH) workstream seeks to scale the successful vanguard EHCH approach to improve the provision and quality of NHS healthcare across all care homes in England&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;In addition to the programmes above, the Better Care Fund, Continuing Health Care Strategic Improvement Programme (CHC-SIP), and Delayed Transfer of Care teams joined us in January 2020. A new Discharge to Assess team is also being set up.&lt;/p&gt;\n&lt;p&gt;These programmes will be supported and enhanced by a wider community services team focussing on efficiency and productivity as well as the core hub of the programme being provided by a dedicated Business Management and Programme Management Office which includes the critical functions of data, analytics and finance.&lt;/p&gt;\n&lt;p&gt;This is a very exciting time to be joining the national NHS CSAW team. We are a growing and forming team, with a great deal of focus and expectation on what we need to deliver over the next 5 years. This critical role brings a real opportunity to have a significant impact. We are looking for a skilled, collaborative and experienced leader, with knowledge and experience of community services, who will be able to ensure we are delivering our programmes and that they are making the difference we want to see, as well as make strategic connections across the whole of our team’s growing portfolio of programmes and with external and internal stakeholders. If that’s you, please apply or be in touch for an informal conversation.&lt;/p&gt;\n&lt;p&gt;For queries, please first access the FAQ document in the attached documents. Please ensure you watch the video of our Director of Community Health Matthew Winn speak about the Ageing Well programme, the link is available in the FAQs document.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;To contact us for any questions or concerns that aren’t addressed in the attachments, please email recruitment.ageingwell@nhs.net&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Email address - recruitment.ageingwell@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/126694.png", "name": "NHS England and NHS Improvement", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126694"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Leeds/London", "postalCode": "SE1 6LH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4963", "longitude": "-.100723"}}, "title": "Delivery and Policy Lead", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245871", "validThrough": "2020-11-15T23:59:59+0000"}