{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Dependent on experience"}}, "datePosted": "2020-10-27T10:11:09+0000", "description": "&lt;p&gt;&lt;strong&gt;About Us&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Ramsay Health Care UK is a well-established global hospital group with over 50 years’ experience. It is well respected within the healthcare industry and is one of the leading providers of independent hospital services in England.&lt;/p&gt;\n&lt;p&gt;Woodland Hospital in Kettering has four laminar flow theatres, operating 6 days week, covering a diverse range of elective services including Orthopaedic, General Surgery, Weight Loss Surgery, Cosmetic Surgery, Urology, Gynaecology, ENT and Ophthalmology.&lt;/p&gt;\n&lt;p&gt;We love people with a positive, “can do” attitude who want to make a difference in their work. &quot;Our employees are Ramsay.&quot; The skills and commitment of our employees forms the basis for our success.&lt;/p&gt;\n&lt;p&gt;“&lt;strong&gt;The Ramsay Way&lt;/strong&gt;” culture recognises that people – staff and doctors – are Ramsay Health Care’s most important asset and this has been key to our ongoing success. Click here to find out more.&lt;/p&gt;\n&lt;p&gt;Woodland Hospital in Kettering is proud to have been treating patients in Northamptonshire for 30years and the hospital continues to focus on delivering high standards of patient care in a friendly and approachable manner. Thestaff at Woodland Hospital work extremely hard to deliver a personal service to patients, tailored to meet their needs and we receive regular complimentary feedback from our patients. Woodland Hospital has four laminar flow theatres, operating 6 days week, covering a diverse range of elective services including Orthopaedic, General Surgery, Weight Loss Surgery, Cosmetic Surgery, Urology, Gynaecology, ENT and Ophthalmology. We love people with a positive, “can do” attitude who want to make a difference in their work. The skills and commitment of our employees forms the basis for our success.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Due to the hospital expanding its Outpatient facilities we have an exciting opportunity within the team for a staff nurse with Ophthalmology experience to join our team within our new busy Ophthalmic Outpatient setting. We are looking for a nurse who is interested in utilising their Ophthalmology experience to assist in developing pathways within the hospital.&lt;/p&gt;\n&lt;p&gt;The Woodland hospital offers a comprehensive ophthalmic service to our patients in Northamptonshire and surrounding counties. This is an exciting opportunity to join our dynamic team of nursing staff. You will need to have strong leadership skills ensuring and maintaining the delivery of high quality, safe patient care. The successful candidate will be an excellent communicator and role model. They will be flexible, motivated and enthusiastic in supporting the Outpatient’s Manager to drive forward developments and high standards of care.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;You will:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Have Strong Leadership skills&lt;/li&gt;\n&lt;li&gt;Be A Positive Role Model&lt;/li&gt;\n&lt;li&gt;Have Ophthalmology experience&lt;/li&gt;\n&lt;li&gt;Maintain High Standards of Care&lt;/li&gt;\n&lt;li&gt;Maintain high standards of Infection Control&lt;/li&gt;\n&lt;li&gt;Medicines Management&lt;/li&gt;\n&lt;li&gt;Audit&lt;/li&gt;\n&lt;li&gt;Service Improvement&lt;/li&gt;\n&lt;li&gt;Be Involved in the running of clinics, working closely with Consultants&lt;/li&gt;\n&lt;li&gt;Clinical treatments&lt;/li&gt;\n&lt;li&gt;Assisting with minor outpatient procedures&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;What you’ll bring with you &lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A warm, considerate and empathetic character&lt;/li&gt;\n&lt;li&gt;A commitment to support individuals and assist as necessary whilst preparing patients for surgery socially, emotionally.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;The ability to make decisions and use your initiative&lt;/li&gt;\n&lt;li&gt;Strong communication skill&lt;/li&gt;\n&lt;li&gt;Passion to deliver excellent care in a rewarding and what can be emotionally challenging environment&lt;/li&gt;\n&lt;li&gt;A flexible and positive attitude&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Benefits &lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Contributory pension scheme&lt;/li&gt;\n&lt;li&gt;Access to the Ramsay Academy – genuine opportunities to grow, develop and specialise in your career&lt;/li&gt;\n&lt;li&gt;25 days’ annual leave plus the opportunity to buy/sell more&lt;/li&gt;\n&lt;li&gt;Flexible shift options&lt;/li&gt;\n&lt;li&gt;Private Healthcare and Life Assurance&lt;/li&gt;\n&lt;li&gt;Free onsite parking and a subsidised staff restaurant&lt;/li&gt;\n&lt;li&gt;Free uniform&lt;/li&gt;\n&lt;li&gt;Access to our employee Discount Programme&lt;/li&gt;\n&lt;li&gt;Wellbeing centre and access to 24/7 employee assistance line for free advice&lt;/li&gt;\n&lt;/ul&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Ramsay Health Care UK", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=131134"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Kettering", "postalCode": "NN16 8XF"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4119", "longitude": "-.768808"}}, "title": "Ophthalmic Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243952", "validThrough": "2020-11-15T23:59:59+0000"}