{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 per annum"}}, "datePosted": "2020-11-03T09:29:53+0000", "description": "&lt;p&gt;1 x Permanent Band 6 Mammographer or a Radiographer, willing to be trained to acquire the PGCert Mammography Qualification.&lt;/p&gt;\n&lt;p&gt;We are looking to recruit a band 6 mammographer, to join our team at the Primrose Breast Care Centre at University Hospital Plymouth in the beautiful West Country. Interest is also invited from any qualified radiographer wishing to specialise in mammography, willing undertake the PgCert in Mammography. Remuneration for the trainee will be band 5/6 depending on previous experience. This post is open to female applicants only*.&lt;/p&gt;\n&lt;p&gt;The service provided by Breast Imaging team incorporates the West Devon and East Cornwall Breast Screening Service, which is largely working in the community and the symptomatic breast service within the Primrose Breast Care Centre in Derriford Hospital, Plymouth, Devon.&lt;/p&gt;\n&lt;p&gt;Our screening programme has a target population in excess of 82,000. Women are invited for breast cancer screening once every 3 years. Currently approximately 25,000 women between the ages of 50 and 70 are invited to be screened each year. The symptomatic breast service undertakes in excess of 6,000 mammograms per annum and is supported by our breast imaging team.&lt;/p&gt;\n&lt;p&gt;We have a mobile unit which provides mammography screening for women in outlying areas. A city centre static unit provides screening for women living more centrally. In the Hospital Breast Unit we have two Siemens Mammography Machines, both with Tomographic capabilities, and one with contrast enhanced mammography, a Prone Stereotactic unit, and three Canon Ultrasound rooms. Radiographers have acquired Advanced Practice skills such as film reading, ultrasound and interventional skills.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be expected to demonstrate and maintain a high standard of imaging and communication skills within this busy unit. A proactive approach to maintaining CPD is expected. The workload will involve screening and symptomatic imaging, assessment and one-stop clinics. Experience in the ability to provide x-ray guidance for interventional and localisation procedures. The unit embraces skill mix and you would be expected to provide guidance and supervision to the assistant practitioners working in the unit and screening.&lt;/p&gt;\n&lt;p&gt;Some weekend work will be required.&lt;/p&gt;\n&lt;p&gt;*A genuine occupational qualification applies to this post under section 6 of the Sex Discrimination Act of 1975 and therefore it is restricted to female applicants only.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Work to the Hospital Trust values –Put patients first, Take ownership, Respect others, Be positive.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further information regarding this post contact: Diana Nicholson, Lead Radiographer on 01752 432050, Sue Haly or Louise Cann, Deputy Lead Radiographers on 01752 431880&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120815.jpg", "name": "University Hospitals Plymouth NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120815"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "PLYMOUTH", "postalCode": "PL6 8DH"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.4167", "longitude": "-4.11371"}}, "title": "Radiographer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253272", "validThrough": "2020-11-17T23:59:59+0000"}