{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum"}}, "datePosted": "2020-11-05T15:31:13+0000", "description": "&lt;p&gt;An exciting opportunity has arisen in the Scheduled Care Directorate within Hywel Dda University Health Board. The post holder will work as the Lead Trauma Manager and report to the Service Delivery Manager. There is extensive collaboration with all staff disciplines across other Scheduled Care portfolios and across the four hospital sites.&lt;/p&gt;\n&lt;p&gt;We welcome applications from all disciplines who would be interested in this new exciting post.&lt;/p&gt;\n&lt;p&gt;Key areas of responsibility for this post include providing support to the Service Delivery Manager in the management of the Major Trauma Network to ensure high levels of service, quality and performance in the delivery of key objectives and to ensure that the network meets the required standard of quality and delivers the expected outcomes. Regular travelling across the four hospital sites is required.&lt;/p&gt;\n&lt;p&gt;You will have a strong background and experience of working within an acute NHS hospital setting; be dynamic, able to work under pressure and manage competing priorities. You will be a team player and able to work with senior managerial and clinical staff, having excellent interpersonal, communication and IT skills.&lt;/p&gt;\n&lt;p&gt;The post consists of budgetary and performance responsibility to ensure services continue to meet their exciting strategic visions. In doing so, the post holder is expected to demonstrate clear leadership skills and develop effective working relationships with clinicians, nurses, AHPs and managers throughout the Scheduled Care Directorate&lt;/p&gt;\n&lt;p&gt;The post is full time and provides extensive opportunities to lead on service improvement projects to ensure that budget, performance and strategic requirements are met. This is a challenging but exciting position and lots of support is available within the Directorate in order to succeed and progress in your careers.&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; Welsh and/or English speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameStephanie HireJob titleGeneral ManagerEmail addressstephanie.hire@wales.nhs.ukTelephone number01267 283154Additional contact information&lt;/p&gt;\n&lt;p&gt;Stephanie Hire, General Manager, Scheduled Care&lt;/p&gt;\n&lt;p&gt;stephanie.hire@wales.nhs.uk&lt;/p&gt;\n&lt;p&gt;01267 283154&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123194.gif", "name": "Hywel Dda University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123194"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Glangwili General Hospital, Carmarthen", "postalCode": "SA31 2AF"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.8675", "longitude": "-4.28474"}}, "title": "Trauma Lead Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258338", "validThrough": "2020-11-26T23:59:59+0000"}