{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "107668", "minValue": "79860", "unitText": "YEAR", "value": "£79,860 to £107,668 pa"}}, "datePosted": "2020-11-02T09:54:42+0000", "description": "&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Applications are invited for a full time Consultant post in the Gastroenterology department. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;The post holder will be based at Pinderfields Hospital, but will have commitments at other Trust sites; including Dewsbury District Hospital and Pontefract General Infirmary. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;The dynamic Gastroenterology team at Mid Yorkshire Hospitals NHS Trust consists of Consultants, Nurse Endoscopists, and Specialist Nurses with varied specialist interests including, but not limited to; IBD, biologics, nutrition, capsule endoscopy, functional bowel disorders, hepatology and cancer screening; as well as general gastroenterology.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;There are established MDT structures which support the department including close links with GI surgeons and interventional radiologists, both internally and with the tertiary specialist centre. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;The successful candidate will have the opportunity to develop their own specialist interest, contributing to the range of services currently provided at Mid Yorkshire. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;The post holder will join the out of hours GI Bleed rota (currently 1:6).&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Every one of our 8,000 staff at the Mid Yorkshire Hospitals NHS Trust plays a vital role in providing quality care to the 500,000 population of people living across Wakefield and North Kirklees each year.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;We’re proud that our workforce - our greatest asset - strives for excellence every day in providing care and support to those who use our services. Mid-Yorkshire celebrates excellence and innovation. We have modern, state-of-the-art facilities and provide first class learning and development opportunities. Mid-Yorkshire is transforming, grounded in our values to care and improve, respecting our patients, our community and our staff, to deliver the highest standards of care.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;If you are a dynamic, innovative and forward-thinking clinician with a passion for your profession and an enthusiasm to be part of a Trust striving to be the best, get in touch to see what a career at Mid-Yorkshire could be like for you.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Applicants should possess, or be within 6 months of receiving a CCT at the time of the advisory appointments committee.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;The appointment will be on the basis of the new consultant contract laid down by the Hospital Medical and Dental Staff Terms and Conditions of Service and will be remunerated as appropriate on the salary scale £79,860 - £107,668 per annum.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Should applicants be currently or recently employed in a medical capacity the Mid Yorkshire Hospitals NHS Trust reserves the right to request a reference from the Medical Director and/ or Responsible Officer of any previous or current employing organisations.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;For further enquiries or to arrange a visit please contact Dr John Hutchinson Head of Clinical Services for Gastroenterology/ Hepatology and Endoscopy on 01924 542375 or email: &lt;/span&gt;&lt;span&gt;john.hutchinson4@nhs.net&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Candidates are very welcome to visit the department.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120735.png", "name": "Mid Yorkshire Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120735"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wakefield", "postalCode": "WF1 4DG"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.6949", "longitude": "-1.48592"}}, "title": "CONSULTANT IN GASTROENTEROLOGY", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251496", "validThrough": "2020-11-27T23:59:59+0000"}