{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "VSM"}}, "datePosted": "2020-10-26T09:45:54+0000", "description": "&lt;p&gt;This is a critical, exciting time for the Trust. Through the extraordinary events of COVID-19, colleagues have worked extraordinarily hard to treat and protect patients: the pandemic has presented a distinctive challenge, which the Trust has met with energy, determination and compassion. Significant opportunities, around integrated care, system working, population health, and digital possibilities have combined with the momentum of the pandemic response to make real the potential for change in health service provision.&lt;/p&gt;\n&lt;p&gt;The Chief Financial Officer will be accountable to the Board and the Chief Executive for ensuring the financial management and sustainability of the Trust in delivering the Trust’s strategy and vision, enhancing its ability to deliver its ambitious goals of providing excellent care and outstanding clinical services within a modern estate. This is an exceptional opportunity to share your talents and expertise to make a positive difference to people’s lives and to support one of the UK’s leading NHS Trusts as it embraces the exciting and life enhancing developments of integrated healthcare for the 21st century.&lt;/p&gt;\n&lt;p&gt;Particularly in light of recent events, candidates will be agile leaders with experience of leading the financial agenda in an operationally complex customer- or patient-facing context. Bringing credibility and impact to a high-performing board, they will be able to challenge constructively and probe performance in a large-scale organisation. Candidates will embody the Trust’s patient-first values and have a track record leading decisive change in times of uncertainty.&lt;/p&gt;\n&lt;p&gt;For further information about the role, including details about how to apply, please contact Dawn Sullivan, Deputy Director P&amp;OD - HR Operations &amp; Resourcing on dawn.sullivan1@nhs.net&lt;/p&gt;\n&lt;p&gt;The Trust is committed to equality, diversity and inclusion and welcomes diversity of thought, approach and background in all our people. The Trust welcomes applications from diverse candidates.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123032.jpg", "name": "Imperial College Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123032"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St. Mary&#39;s Hospital, London", "postalCode": "W2 1NY"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5171", "longitude": "-.174187"}}, "title": "Chief Financial Officer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241882", "validThrough": "2020-11-12T23:59:59+0000"}