{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 gross per annum"}}, "datePosted": "2020-10-23T10:02:17+0100", "description": "&lt;p&gt;&lt;em&gt;At Wedgwood House, we have exciting opportunities for Clinical Support Workers to join the team on Northgate and&lt;/em&gt;&lt;em&gt; Southgate Wards. If you have the qualities described above then we want you to think about coming to be part of our Wedgwood family and join us.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;As part of our ongoing strive for excellence we are developing a &#39;care team&#39; approach around patient centred care. Clinical support workers will take part in ongoing assessments, they will plan, deliver and evaluate the needs of our service users, in accordance with their Care Plans. They will take part in ongoing risk assessments, recognising and responding to any changes, ensuring that the care and safety of the service user remains the priority. The role also provides the opportunity to provide therapeutic interventions, both 1:1 and within a group setting, to further enhance the care and support offered to our service users.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Wedgwood House is a purpose-built mental health unit comprising 2 acute mental health inpatient wards, an older person’s inpatient ward, as well as crisis, home treatment and psychiatric liaison services.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;If you have the drive to provide excellent care and are willing to go the extra mile to help make a difference to people’s lives then we would love to hear from you. In return, we offer excellent benefits and we are keen to support those looking to progress within the nursing field.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;We welcome informal discussions and would love you to get in touch to talk about the opportunities available and come and visit to see what we are all about.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;Benefits included with this role are:-&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;NHS pension&lt;/li&gt;\n&lt;li&gt;a comprehensive in house &amp; external training programmes&lt;/li&gt;\n&lt;li&gt;career progression&lt;/li&gt;\n&lt;li&gt;starting annual leave of 27 days per annum increasing to 33 days pa based on length of service (plus paid bank holidays)&lt;/li&gt;\n&lt;li&gt;staff physio service&lt;/li&gt;\n&lt;li&gt;gym membership&lt;/li&gt;\n&lt;li&gt;NHS discounts and many more.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;em&gt;Please find attached our Job Description and Person Specification for more detail on your Key Accountabilities, then if you feel you have what it takes to make a difference in your local communities, click APPLY!&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Interview dates are yet to be set; you will be contacted via email and invited to book a time. These emails may go to your SPAM, so please keep checking all your emails if applying.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Please visit our Facebook and Twitter page @NSFTjobs&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;NSFT is committed to lifelong learning and continuous professional development (CPD) for its entire staff. There are a variety of definitions of CPD across the professions but it is usually taken to mean learning activities which update existing skills. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;CPD is determined through appraisal with a personal development plan agreed between an individual and their manager, with the commitment of the necessary time and resources. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Lucy Wall  Job title: Ward Manager  Email address: lucy.wall@nsft.nhs.uk Telephone number: 01284719785  Additional contact information:&lt;/p&gt;\n&lt;p&gt;Luke Upson - luke.upson@nsft.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121326.png", "name": "Norfolk and Suffolk NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121326"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "West Suffolk Hospital, Bury St Edmunds", "postalCode": "IP33 2QZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.2317", "longitude": ".709205"}}, "title": "Clinical Support Worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916239957", "validThrough": "2020-11-08T23:59:59+0000"}