{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Competitive"}}, "datePosted": "2020-10-30T15:20:55+0000", "description": "&lt;p&gt;35 hours per week available&lt;/p&gt;\n&lt;p&gt;Due to retirement Shap Medical Practice are seeking a practice manager for our small, (busy,) rural dispensing practice. Our ideal candidate would be someone with experience as a Practice Manager or with administrative experience in primary care. The Managers task will be to continue the smooth running of the practice, working with our practice team and community colleagues as well as the CCG, Primary Care Network, and CQC.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Main duties of the job&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Overseeing the day to day operations of the practice&lt;/p&gt;\n&lt;p&gt;Management of clinical, administrative and dispensary staff including recruitment, induction and training, staff appraisal and support, with the ability to maintain a positive team culture, particularly at the current time.&lt;/p&gt;\n&lt;p&gt;Business Management of the practice – managing the financial elements of the practice including budgeting, payments and receipts, PAYE and pensions for staff. Overseeing practice accounts, liaising with the accountants, procuring equipment, supplies and services, ensuring the practice meets QoF, QIS and LES/DES targets in conjunction with clinical staff&lt;/p&gt;\n&lt;p&gt;Information Technology- thorough knowledge of the practice IT system, liaising with CCG and software providers and ensuring compliance with Information Governance standards. Update the practice communications (working with practice staff), including website and Facebook pages and local community links.&lt;/p&gt;\n&lt;p&gt;CQC- ensuring the practice is run in a safe and effective manner and has up to date documentation preparing for CQC inspections. Maintain practice health and safety policy and standards.&lt;/p&gt;\n&lt;p&gt;Premises and Equipment- liaising with NHS Property Services to ensure the safe running of our building.&lt;/p&gt;\n&lt;p&gt;Supporting the partners in the strategic direction of the business&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About Us&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are a rural dispensing practice, proud of the care we give our 3,000 patients. We have high QOF achievement, our CQC rating is good and our patient survey results are extremely good. The practice is located right on the borders of the Lake District and Yorkshire Dales national parks and we have some stunning countryside around us. We have 3 part-time GP partners, 3 part-time practice nurses a healthcare assistant and a team of receptionists and dispensers.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "General Practices in W, N,E Cumbria ", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133254"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Shap, Penrith, Cumbria", "postalCode": "CA10 3LW"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.5292", "longitude": "-2.67817"}}, "title": "Practice Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250732", "validThrough": "2020-11-18T23:59:59+0000"}