{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 pa"}}, "datePosted": "2020-11-02T13:45:36+0000", "description": "&lt;p&gt;Job Title: Mammographer&lt;/p&gt;\n&lt;p&gt;Area of Work: Breast Screening / Symptomatic Unit&lt;/p&gt;\n&lt;p&gt;Employer: Royal Berkshire NHS Foundation Trust&lt;/p&gt;\n&lt;p&gt;Department: Radiology / Breast Screening&lt;/p&gt;\n&lt;p&gt;Location: Reading&lt;/p&gt;\n&lt;p&gt;Working Pattern: Part time / Full time&lt;/p&gt;\n&lt;p&gt;An opportunity has arisen for a Qualified Mammographer to join our multi-professional team at The West Berkshire Breast Screening Unit. We are looking for an enthusiastic Mammographer with an interest in women’s health who would like to join our friendly team.&lt;/p&gt;\n&lt;p&gt;In addition to holding a Radiography Degree or the Diploma of the College of Radiographers, you must hold a UK recognised Post Graduate Award in Mammography or Certificate of Competence in Mammography from the College of Radiographers. Candidates must be registered with the HCPC and currently residing in the United Kingdom.&lt;/p&gt;\n&lt;p&gt;We can offer permanent and part time working contracts to suitable applicants and if you have what we are looking for we want to recruit you now and welcome you to our friendly and dynamic team. If we like what we see in your application we will contact you immediately and invite you for interview.&lt;/p&gt;\n&lt;p&gt;Excellent interpersonal and communication skills are essential, as is the ability to work both autonomously and in a team environment.&lt;/p&gt;\n&lt;p&gt;We would like to give you the opportunity to deliver the National Breast Screening Programme at The West Berkshire Breast Screening Unit and participate in symptomatic clinics within the Royal Berkshire Hospital.&lt;/p&gt;\n&lt;p&gt;The West Berkshire Breast Screening Service at present provides regular screening for 64,000 women over 3 years in a Breast Screening unit located opposite The Royal Berkshire Hospital in Reading and on two mobiles which visit various sites around the lovely countryside of West Berkshire. This figure will rise to 80,000 with the full implementation of the Age Extension.&lt;/p&gt;\n&lt;p&gt;A car and a full driving licence are essential for this post as some travelling will be involved.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are not able to carry out telephone/Skpe interviews therefore you must be prepared to travel to interview and already be entitled to work within the UK.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This position is exempt from the Sex Discrimination Act and is therefore only open to female applicants.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Erin White on Erin.White@royalberkshire.nhs.uk or on: 0118 322 8567&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122060.jpg", "name": "Royal Berkshire NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122060"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Berkshire Hospital NHS Foundation Trust, Reading", "postalCode": "RG1 5AN"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4514", "longitude": "-.958624"}}, "title": "Mammographer (Breast Screening)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252267", "validThrough": "2020-11-16T23:59:59+0000"}