{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 Per annum"}}, "datePosted": "2020-10-27T15:16:20+0000", "description": "&lt;p&gt;We are seeking to appoint exceptional matrons to lead the nursing team within the General &amp; Specialist Medicine Care Group at all of our hospitals based across east Kent (Ashford/Canterbury and Margate).&lt;/p&gt;\n&lt;p&gt;These are challenging times for the whole of the NHS and East Kent Hospitals University Foundation Trust is no exception.&lt;/p&gt;\n&lt;p&gt;However, we are confident our staff are the key to our improvement and are proud that we have just developed a team of nurse educators for the Care Group and are linking this to a new educational strategy and career pathway for the nursing workforce.&lt;/p&gt;\n&lt;p&gt;Your role will be to provide effective, visible and accessible leadership and operational management.&lt;/p&gt;\n&lt;p&gt;You will be supported by a senior team that is committed to improvement.&lt;/p&gt;\n&lt;p&gt;You will monitor and maintain professional nursing standards to ensure the care environment is clean, safe and protects the privacy and dignity of patients. You will work with your senior staff to ensure that robust systems of governance and performance management are in place to deliver high quality patient centred services.&lt;/p&gt;\n&lt;p&gt;Why not come and see for yourself or give us a call and have a chat.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Sue Brassington, Job title: Care Group Head of Nursing, Email address: susan.brassington@nhs.net, Telephone number: 07880 796918&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "East Kent Hospitals University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121462"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "William Harvey Hospital, Ashford", "postalCode": "TN24 0LZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.1415", "longitude": ".91624"}}, "title": "Matron", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245146", "validThrough": "2020-11-10T23:59:59+0000"}