{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "82096", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 per annum"}}, "datePosted": "2020-10-21T17:15:52+0100", "description": "&lt;p&gt;University Hospitals of Derby and Burton NHS Foundation Trust (UHDB) is seeking to appoint a Consultant to work with a committed team in our ENT Department. The primary base for this position will be Queen’s Hospital Burton although there will be the opportunity to work from both main UHDB sites (Royal Derby and our Community Hospitals). The initial contract term is 9 months.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are looking for someone who has thorough general ENT experience including Paediatrics.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;A strong commitment from the appointee to the department and involvement with activities within the department such as audit, appraisal and assessment, clinical governance and development of guidelines is expected. The successful applicant will be expected to work as part of a team of consultants and will be required to contribute to the ongoing development of the ENT Department at UHDB Trust.&lt;/p&gt;\n&lt;p&gt;Applicants must hold a licence to practise.&lt;/p&gt;\n&lt;p&gt;This post is for 10 programmed activities and the post holder will be expected to participate in a 1:5 non-resident on-call rota. The ENT department may soon develop a joint, non-resident on-call rota between both the Queen’s Hospital site and the Derby site, creating a 1:9 rota.&lt;/p&gt;\n&lt;p&gt;Appointment to this post is subject to the provisions of the Terms and Conditions of the New Consultant Contract (2003). Further conditions have been implemented by the Trust that have been negotiated with the Medical and Dental Local Negotiating Committee. The national salary scale will apply.&lt;/p&gt;\n&lt;p&gt;The post offers the opportunity to live in an area of outstanding natural beauty within the National Forest area and the Peak District National Park is also within close vicinity. Visits can be arranged for candidates in order to appreciate the quality of life our Hospital and the surrounding area can offer including:-&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;desirable country and executive properties at realistic prices&lt;/li&gt;\n&lt;li&gt;an excellent standard of education from both state and private schools&lt;/li&gt;\n&lt;li&gt;excellent road (A50/M1/M6), rail and airport links (Nottingham East Midlands, Birmingham and Manchester Airport)&lt;/li&gt;\n&lt;li&gt;Easy access to the cities of Birmingham, Nottingham, Leicester and Sheffield&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Please note that informal visits do not form part of the selection process but could be arranged for shortlisted candidates.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Adrian Thompson Job title Consultant&lt;/p&gt;\n&lt;p&gt;Email address adrian.thompson5@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number01283511511 ext 4003Additional contact information&lt;/p&gt;\n&lt;p&gt;To arrange a visit please contact Donna Garner (between 8am and 3pm), secretary to Mr Thompson on 01283 511511 ext 4003&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120972.jpg", "name": "University Hospitals of Derby and Burton NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120972"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Queens Hospital Burton, Burton Upon Trent and Derby", "postalCode": "DE13 0RB"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.8172", "longitude": "-1.65552"}}, "title": "Locum Consultant in ENT", "url": "https://www.jobs.nhs.uk/xi/vacancy/916237431", "validThrough": "2020-11-18T23:59:59+0000"}