{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "18171", "minValue": "18171", "unitText": "YEAR", "value": "10.81ph"}}, "datePosted": "2020-11-02T18:16:26+0000", "description": "&lt;p&gt;&lt;strong&gt;Professional Practice Administrator &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Colchester Hospital (&lt;strong&gt;Turner Rd, Mile End, Colchester CO4 5JL)&lt;/strong&gt; have a new full time placement for an immediate start which will be part office based and part working from home.&lt;/p&gt;\n&lt;p&gt;Monday – Friday 8:30-4:30&lt;/p&gt;\n&lt;p&gt;Band 3 £10.81&lt;/p&gt;\n&lt;p&gt;This position will be running through to November 2020,&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Role Descriptor:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To provide administrative support to the Professional Practice Team in the delivery of a full and comprehensive education agenda.&lt;/li&gt;\n&lt;li&gt;To support the Professional Practice Team with developmental learning improvements across the organisation.&lt;/li&gt;\n&lt;li&gt;To support the Professional Practice Team co-ordinate and monitor Professional education with HEIS and within the organisation.&lt;/li&gt;\n&lt;li&gt;To support raising of invoices according to approved education requirement&lt;/li&gt;\n&lt;li&gt;To support the day-to-day management and ongoing development and maintenance of financial monitoring through the administration of an accurate data base.&lt;/li&gt;\n&lt;li&gt;To support Professional Practice team with the recruitment process.&lt;/li&gt;\n&lt;li&gt;To support Professional Practice team with delivery and administration of education programmes.&lt;/li&gt;\n&lt;li&gt;To prepare and update documentation for courses in a timely manner – including course booking, forms, and registers.&lt;/li&gt;\n&lt;li&gt;To ensure attendance of education provision is accurately captured in line with reporting requirements.&lt;/li&gt;\n&lt;li&gt;As required organise meetings, prepare agendas, book rooms, attend meetings, take notes, and follow up progress on action points on own initiative to ensure deadlines are met.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Key Responsibilities:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Deal with external and internal queries. This may include providing complex or sensitive non clinical information or advice to patients or relatives.&lt;/li&gt;\n&lt;li&gt;Pass on messages as appropriate to the relevant person in a timely way.&lt;/li&gt;\n&lt;li&gt;Use initiative to deal with routine and some non-routine problems that may arise, and only exceptionally refer more complex issues to the appropriate person.&lt;/li&gt;\n&lt;li&gt;Assist in developing, maintaining efficient electronic and manual filing systems.&lt;/li&gt;\n&lt;li&gt;Responsible for the maintenance of accurate data on hospital systems as appropriate.&lt;/li&gt;\n&lt;li&gt;Manage your own workload to ensure completion of the full range of your tasks using the knowledge, skills and experience you have gained. Support other team members to undertake the full range of administrative/secretarial activities.&lt;/li&gt;\n&lt;li&gt;Provide a range of administrative/secretarial support relevant to area, ensuring that urgent matters are actioned and escalated without delay.&lt;/li&gt;\n&lt;li&gt;Monitor supplies to ensure stocks are maintained at an appropriate level, and order/notify relevant person as appropriate.&lt;/li&gt;\n&lt;li&gt;Give guidance, support and empathetic approach to any complaints or concerns raised and liaise with the relevant manager&lt;/li&gt;\n&lt;li&gt;To actively participate in the development of improvements for the service. Incorporate new practices to take account of new technology, demand/capacity tools.&lt;/li&gt;\n&lt;li&gt;You may be required to undertake training in your own discipline, which may include new starter induction.&lt;/li&gt;\n&lt;li&gt;To understand other admin roles within the department and ensure other admin staff are aware of your role.&lt;/li&gt;\n&lt;li&gt;Work to standing operating procedures and departmental guidelines.&lt;/li&gt;\n&lt;li&gt;Support and supervise and co-ordinate other members of the team as required to ensure the smooth running of the department.&lt;/li&gt;\n&lt;li&gt;Keeping up to date with relevant IT/information systems.&lt;/li&gt;\n&lt;li&gt;Ensure any information is accurate and up to date before sharing internally or externally.&lt;/li&gt;\n&lt;li&gt;Support the team in gathering any data for audit research purposes.&lt;/li&gt;\n&lt;li&gt;Operate office equipment eg photocopier, printer etc to support administrative processes.&lt;/li&gt;\n&lt;li&gt;Undertake any other admin or clerical duties as may be delegated.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are looking for &lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Previous administrative role&lt;/li&gt;\n&lt;li&gt;Working collaboratively as part of a team&lt;/li&gt;\n&lt;li&gt;Advanced IT Systems including - Microsoft Office&lt;/li&gt;\n&lt;li&gt;Experience of communicating with a range of people both within and external to the organisation&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;NHS exposure is beneficial&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;In return for your hard work commitment NHS Professionals (NHSP) can offer you some fantastic benefits: –&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Competitive Pay Rates&lt;/strong&gt;- work this week, get paid next week!&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;First choice of placements at over 50 NHS Trusts in England&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Dedicated consultants&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Flexible working options&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Free DBS and free training&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Build holiday allowance&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Support when you need it – 24/7 365 days&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Stakeholder pension scheme&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Who are NHS Professionals?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;NHS Professionals (NHSP), owned by the Department of Health and Social Care (DHSC), works in partnership with hospital trusts to provide a bank of highly skilled temporary workers who want to work flexibly within the NHS.&lt;/p&gt;\n&lt;p&gt;Working through the NHSP bank means Trusts do not have to rely on expensive agencies. Right now, we have over 130,000 members registered on our bank from various roles, grades, and specialties, saving the NHS over&lt;strong&gt;£70 million&lt;/strong&gt;each year. This money is then reinvested back into the NHS.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Apply&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Register today for various flexible working options and long-term placement opportunities.&lt;/p&gt;\n&lt;p&gt;For more information on the roles or details on how to join NHS Professionals, simply get in touch with the admin and clerical team on 03330 144354.&lt;/p&gt;\n&lt;p&gt;We look forward to hearing from you soon.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Disclaimer&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "NHS Professionals - Non-Clinical", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121070"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Colchester", "postalCode": "CO4 5JL"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.9102", "longitude": ".899214"}}, "title": "Professional Practice Administrator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253050", "validThrough": "2020-11-16T23:59:59+0000"}