{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "36738", "minValue": "29888", "unitText": "YEAR", "value": "£29,888 - £36,738 per annum inclusive"}}, "datePosted": "2020-10-26T13:00:57+0000", "description": "&lt;p&gt;A great opportunity has arisen across the surgical floors at UCLH for band 5 and band 6 staff nurses following a reorganisation and restructure of the wards. We are looking for committed and dynamic nurses with excellent communication skills and above all a real desire and passion for caring for surgical patients in the acute hospital setting. We currently are looking for band 5/6 nurses to join our teams on our green pathway floors, T6 H&amp;N and multi-specialities surgical floor, T7 GI, Gynae and Day surgery surgical floor and in our blue pathway floors, T9 GI medicine/surgical Unit and T14 Acute Surgical Unit.&lt;/p&gt;\n&lt;p&gt;The green pathway refers to our elective patients and blue pathway refers to the A&amp;E/direct clinic admissions patients and the tower has been reconfigured as a response to the COVID 19 pandemic.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;T6 &lt;/strong&gt;will be a twenty bedded Head and Neck and multi-speciality elective surgical unit which is co-located on the same floor as a newly established ten bedded ITU. This will be a busy surgical floor and enhanced recovery and excellent patient outcomes will be ethos from the outset when it opens in December 2020. It will be a newly established Nursing team as a result of the reorganisation of the UCLH Tower and this team will work closely with our ITU colleagues, surgical teams and wider MDT.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;T7 &lt;/strong&gt;floor is also elective surgery and will consist of Colorectal, upper GI, Bariatric and vascular surgeries co-located alongside Gynaecology and day surgery beds. It will also be a busy high turnover floor for the elective pathway and have a diverse mix of acuity and complexity of patients.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;T9&lt;/strong&gt; GI medicine/surgical will be a 40 bedded unit caring for our patients on the blue pathway with a diverse range of complexity and medical and nursing needs. GI division prides itself on a strong and supportive Multi-disciplinary Team and staff have the opportunity to work with specialist Consultants and Specialist Nurses who are leading experts in their fields.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;T14 south&lt;/strong&gt; will be a newly established 15 bedded Acute surgical unit caring for our multi-speciality surgical patients that are admitted via our A&amp;E department. This will be a high turnover fast paced environment with close working relationships with theatres.&lt;/p&gt;\n&lt;p&gt;This is an exciting time to be part of the development of our new surgical wards/floors and new teams with a focus on providing the best possible patient care and reflecting the trusts core values. Within our surgical floors we have a variety of training and education programmes and opportunities available and we have excellent CPF’s who support staff training and development across specialities. You will be fully supported with an induction programme in your chosen area and there will be opportunities for rotation and to further develop your nursing skills. You will have the opportunity to attend study days within specialist areas and complete further education courses.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;For further information on the positions available on T7 or T9 please contact :&lt;/p&gt;\n&lt;p&gt;Ward Sister Maria Ridulme 07939486390&lt;/p&gt;\n&lt;p&gt;Ward Sister Louisa Kamara 07970698392&lt;/p&gt;\n&lt;p&gt;For further information on the positions available on T6 or T14 south please contact:&lt;/p&gt;\n&lt;p&gt;Matron Niamh Gavaghan on 07812484276 or via email : Niamh.gavaghan@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University College London Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120731"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "UCLH, London", "postalCode": "NW1 2PG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5257", "longitude": "-.13737"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242547", "validThrough": "2020-11-09T23:59:59+0000"}