{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "17265", "minValue": "17265", "unitText": "YEAR", "value": "£17,265.85"}}, "datePosted": "2020-11-03T11:21:34+0000", "description": "&lt;p&gt;WE ARE LOOKING FOR TALENTED PEOPLE LIKE YOU!!&lt;/p&gt;\n&lt;p&gt;Knowing that you’re making a difference to people’s lives is rewarding in itself. But our many roles offer much more than that. As well as helping you grow and develop your talent, we want you to feel proud of where you work and what you do&lt;/p&gt;\n&lt;p&gt;Pelham Woods is a 21 bed inpatient rehabilitation service which serves the needs of women who have complex mental health problems and a history of challenging behaviour.&lt;/p&gt;\n&lt;p&gt;Pelham Woods is set in picturesque grounds overlooking the Surrey Hills and has extensive facilities including onsite Gym, Purpose Built Bake off Kitchen as well as Occupational and Educational Facilities.&lt;/p&gt;\nThe role:\n&lt;p&gt;If you are passionate about offering high quality care to patients with mental health needs, and would like a long, rewarding and fulfilling career, then we would welcome your application to work as a Healthcare Worker at Pelham Woods.&lt;/p&gt;\n&lt;p&gt;As a Health Care Worker you will be working within a team that includes a range of professionals. You will make an effective contribution to providing high quality care to our patients.&lt;/p&gt;\n&lt;p&gt;You will work under the supervision of a Qualified Nurse and will receive support from a Care Certificate Assessor to complete your Care Certificate and competency development portfolios.&lt;/p&gt;\n&lt;p&gt;To be successful in this role you will need to have good communication skills, excellent team working skills, be highly self-motivated with a flexible and common sense approach to problem solving, and have some appreciation of mental health problems.&lt;/p&gt;\n&lt;p&gt;You will be required to be qualified to GCSE standard (or equivalent) and an NVQ (or equivalent) would be an advantage.&lt;/p&gt;\nSome of the benefits we offer our Healthcare Workers are:\n&lt;ul&gt;\n&lt;li&gt;Career Development across the Healthcare Worker Grading System&lt;/li&gt;\n&lt;li&gt;Free onsite meals and free onsite parking&lt;/li&gt;\n&lt;li&gt;Private Medical Cover and Life Assurance&lt;/li&gt;\n&lt;li&gt;Contributory Pension Scheme&lt;/li&gt;\n&lt;li&gt;25 Days annual leave + Bank Holidays&lt;/li&gt;\n&lt;li&gt;Full Extensive Training Induction plus opportunities to do further training while in the role.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\nAbout us\n&lt;p&gt;From education to hospitals, care homes and secure facilities, the Priory Group of Companies offers individually tailored, multidisciplinary treatment programmes for those with complex educational needs or requiring acute, long-term and respite mental healthcare.&lt;/p&gt;\n&lt;p&gt;The integrated strength of each service provides a seamless transition for the individual as they progress between higher and lower dependency care and across services. This unique approach ensures that every individual has the opportunity to achieve the best possible outcomes and quality of life with the Priory Group.&lt;/p&gt;\n&lt;p&gt;As 85% of our services are publicly funded and delivered in partnership with commissioners, our teams work with commissioning bodies across the country to provide transparent pricing models and evidence-based care programmes.&lt;/p&gt;\nDisclosure\n&lt;p&gt;All roles will be subject to a successful disclosure at an appropriate level from the Disclosure and Barring Service (DBS), Access NI or Disclosure Scotland. We are an equal opportunities employer.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Priory Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133434"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Dorking, Surrey", "postalCode": "RH4 2RA"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2253", "longitude": "-.328962"}}, "title": "Mental Healthcare Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253701", "validThrough": "2021-01-10T23:59:59+0000"}