{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 to £44,503 pa"}}, "datePosted": "2020-10-16T13:15:17+0100", "description": "&lt;p&gt;37.5 hours per week – permanent.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen to recruit a Band 7 Practice Lead for Complex Needs and Dementia within the Liaison Psychiatry team based Derriford Hospital (University Hospitals Plymouth NHS Trust).&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We would welcome applications from experienced Mental Health Professionals including Nurses, OTs, Physiotherapists and Social Workers who have an extensive history in mental health settings, particularly older people’s services but experience in acute adult psychiatry would be an advantage. The successful candidate will be highly motivated and willing to effect change in this fast-paced environment and developing team. You will be familiar with working in a challenging environment and possess the ability to balance different pressures. Evidence of transferable skills is essential. Your responsibilities will include training needs for the team, NICE guidance, eRoster, competencies for the staff group and how to enhance and support these.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will be expected to be responsive and proactive in your role, developing existing clinical pathways further and acting as the practice lead for the practitioners. There will also be a significant supervisory element to the role, both formally and on an ‘ad hoc’ daily basis to the clinical shift. An aspect of this role will require you to engage bio-psychosocial assessments/ risk assessments both within the Emergency Department and the Acute Hospital in support of the team.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This is an exciting and rare opportunity to work primarily in a clinical role whilst supporting management structures. You will be expected to work closely with the Team Manager, the Practice Lead for Acute Adult and Consultant Psychiatrists to provide structured leadership to this developing team and you will be supported in this. You will also deputise for the Team Manager in their absence.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Liaison Psychiatry provides prompt, specialist assessment and advises around management of people in the acute hospital who are experiencing co-existing physical and mental health difficulties or attend in mental health crisis. Our hours of operation have extended to 24hrs/7 days a week with an overnight focus on the Emergency Department.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The multi-disciplinary team has two Consultant Psychiatrist posts, Band 5 &amp; 6 Mental Health Practitioners, Mental Health Support Workers and Team Administrators. There is a strong focus upon continuing to build relationships with colleagues in the acute hospital setting.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The team has developed in line with CORE 24.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This role is full-time, working hours would normally be 0800-1600 Mon-Fri however flexibility will be required due to the clinical nature of this role. It will be anticipated that some weekend working will be necessary.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We would encourage telephone contact from applicants which can be arranged by contacting the Team Manager, Tracey Weymouth on 01752 437499.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please begin your application, “I would like to apply for the position of Practice Lead for Complex Needs and Dementia with Liaison Psychiatry.”&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Livewell Southwest values its staff and makes investment in their development a priority. Currently we offer the following development opportunities for staff:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A minimum of three days protected CPD for registered staff&lt;/li&gt;\n&lt;li&gt;Development pathways for unregistered staff from apprentice to bands 2, 3 and 4 and for registered staff in bands 5, 6, 7 and 8&lt;/li&gt;\n&lt;li&gt;Leadership programmes&lt;/li&gt;\n&lt;li&gt;Coaching and mentoring&lt;/li&gt;\n&lt;li&gt;Medicines Management, leg Ulcer Management and Assessment Training&lt;/li&gt;\n&lt;li&gt;Access and funding for training including Care Certificate, Assistant Practitioners Course and Scholarship Into Nurse Training&lt;/li&gt;\n&lt;li&gt;Robust Preceptorship&lt;/li&gt;\n&lt;li&gt;An induction programme tailored to your needs&lt;/li&gt;\n&lt;li&gt;Relocation package may be considered for the right candidate for certain roles&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Rewards and benefits &lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Discounts available from retailers, UK hotels and main attractions – often up to 15% savings&lt;/li&gt;\n&lt;li&gt;NHS Pension Scheme and competitive Pension Scheme with Scottish Widows and/or Government Pension scheme (conditions apply)&lt;/li&gt;\n&lt;li&gt;Lease car scheme (available after satisfactory completion of probation/conditions apply)&lt;/li&gt;\n&lt;li&gt;Cycle to work scheme (available after satisfactory completion of probation)&lt;/li&gt;\n&lt;li&gt;School holiday childcare subsidies&lt;/li&gt;\n&lt;li&gt;Multiple flexible working options&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Livewell Southwest can allow existing members of the NHS Pension Scheme to continue their membership when they join the organisation.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;All Livewell Southwest staff are expected to able and willing to work across a 7 day service.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Job share(s) considered.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/127014.jpg", "name": "Livewell Southwest CIC", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127014"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Plymouth", "postalCode": "PL6 8DH"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.4167", "longitude": "-4.11371"}}, "title": "Practice Lead for Complex Needs and Dementia", "url": "https://www.jobs.nhs.uk/xi/vacancy/916230352", "validThrough": "2020-11-06T23:59:59+0000"}