{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 Per Annum"}}, "datePosted": "2020-10-26T10:16:53+0000", "description": "&lt;p&gt;&lt;strong&gt;We are looking for enthusiastic, hard working Pharmacy Assistant to join our team at the Southend Hospital site.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Your duties will include dispensing Inpatient, Outpatient and Discharge prescriptions for ward areas both near patient and within the pharmacy department. The role will see you supporting the patient discharge service by reducing waiting times associated with the supply of medications. This will not only enhance patient experience but also help with the patient flow within the Trust, You will also aid in medication history data gathering and be the main point of contact for the discharge coordinator team. Further development of the role will see you assisting in the setup and continuation of a new Oral Oncology Homecare service improving the experience of our outpatients.&lt;br /&gt;&lt;br /&gt;You must have excellent communication &amp; interpersonal skills; be motivated, flexible, adaptable and able to work well in an environment of change and transition.&lt;/p&gt;\n&lt;p&gt;No previous experience in Pharmacy is required as full in house training will be given.&lt;br /&gt;&lt;br /&gt;Southend-On-Sea is an exciting place to live, work and enjoy life. Just under an hour from London and Europe (either by rail or air), Southend and the surrounding area is vibrant and cosmopolitan. Local schools have an excellent reputation and the nearby seaside provides a pleasant backdrop as well as opportunities for fun and relaxation. The attractive nearby town of Leigh-On-Sea provides an alternative location for many professionals to settle and wind down after work.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameHelen HallJob titleSenior Pharmacy TechnicianEmail addressHelen.hall@southend.nhs.ukTelephone number01702 435555 Ext 5458&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121033.jpg", "name": "Mid and South Essex NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121033"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southend Hospital, Westcliff on sea", "postalCode": "SS0 0RY"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5538", "longitude": ".689123"}}, "title": "Pharmacy Dispensing Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241992", "validThrough": "2020-11-09T23:59:59+0000"}