{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "33620", "minValue": "26896", "unitText": "YEAR", "value": "£16.00 - £20.00 per hour"}}, "datePosted": "2020-10-20T09:15:31+0100", "description": "&lt;p&gt;Right now we are looking to appoint an HCPC registered Physiotherapist to join the Physiotherapy team as a member of our bank staff (zero hours contract).&lt;/p&gt;\n&lt;p&gt;Our workload is varied with an outpatient team managing postoperative orthopaedic and general musculoskeletal caseloads including sports, recent injuries, and private patients, and an inpatient team managing a mainly orthopaedic and day-surgery caseload.&lt;/p&gt;\n&lt;p&gt;The purpose of this role is to provide the highest quality of physiotherapy services to patients and visitors at the Treatment Centre. To be responsible for inpatient, day case and outpatient physiotherapy services as required and to liaise closely with all other members of the multi-disciplinary team.&lt;/p&gt;\n&lt;p&gt;The successful candidate should have:&lt;/p&gt;\n&lt;p&gt;•             Degree or equivalent in Physiotherapy&lt;/p&gt;\n&lt;p&gt;•             HCPC registration and Membership of the Chartered Society of Physiotherapy&lt;/p&gt;\n&lt;p&gt;•             Experience in inpatient/day-case orthopaedics and/or musculoskeletal outpatients&lt;/p&gt;\n&lt;p&gt;•             Ability to demonstrate good clinical reasoning processes&lt;/p&gt;\n&lt;p&gt;•             Excellent communication and interpersonal skills&lt;/p&gt;\n&lt;p&gt;•             Ability to organise and prioritise&lt;/p&gt;\n&lt;p&gt;•             Good understanding of CSP Standards of Physiotherapy Practice and Rules of Professional Conduct&lt;/p&gt;\n&lt;p&gt;•             Flexibility&lt;/p&gt;\n&lt;p&gt;Hours may vary and may include weekend work as required on a rotational basis with other team members.&lt;/p&gt;\n&lt;p&gt;The Horton Treatment Centre was purpose built in 2006 and has been designed to combine an exceptional standard of patient accommodation with the technical equipment and facilities that modern medicine demands.  It is a 40-bed inpatient unit and day-case facility predominantly specialising in Orthopaedic Surgery.  Horton NHS Treatment Centre is part of the Ramsay Health Care group and provides clinical care to private, insured and NHS patients.&lt;/p&gt;\n&lt;p&gt;Ramsay Health Care UK is one of the leading providers of NHS and private patient services in England, with a network of over 30 acute hospitals and Treatment Centres.&lt;/p&gt;\n&lt;p&gt;All offers of employment will be subject to satisfactory receipt of an Enhanced Disclosure certificate from the Criminal Records Bureau and suitable references.&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "Ramsay Health Care UK", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=131134"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Banbury", "postalCode": "OX16 9FG"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.0541", "longitude": "-1.33461"}}, "title": "Bank Physiotherapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916233538", "validThrough": "2020-11-27T23:59:59+0000"}