{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Competitive"}}, "datePosted": "2020-10-20T09:25:26+0100", "description": "&lt;p&gt;We are currently recruiting a Full Time Sonographer to join us at at CQC Outstanding rated Practice Plus Group Hospital, Southampton at the Royal South Hants Hospital for 4 days a week. The successful post holder will ideally from 8am to 6pm but alternative working hours could be considered as well as a job share. Whether you are local to the area or looking to relocate we would love to hear from you, you will however need extensive UK experience.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;As a key member of our diagnostic imaging team led by Paul, you will produce a high standard of ultrasonography practice. This will include undertaking a broad range of techniques while being flexible in adapting to the requirements of all patients and examination scenarios.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;You will be an HCPC registered Radiographer with a diploma in medical ultrasound and experience in a broad range of ultrasonography competencies. Your ability to work autonomously and experience of independent reporting is essential in this role. You will also need to be able to manage in a fast paced environment while maintaining the ability to produce high quality images and succinct and accurate reporting.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Our Sonographers enjoy a challenging yet balanced and steady workload with no Paediatric or Obstetric patients. The standard case mix covers Urology, Gynae, General Abdo and MSK&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Working at Practice Plus Group&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;When you’re part of the Practice Plus Group team, you don’t just have a job. You have a career. We work with you to help you grow in your role and take your career in the direction you want to go. If you want to move up the ladder, we’ll support you. If you just want to stay in your role, that’s fine too. We’ll help you be the best you can be.&lt;br /&gt;We want our team members to feel motivated and rewarded. So we offer a competitive package of pay and benefits. We also recognise the value of a healthy work-life balance – so we always try to be flexible, helping you fit your working life around your home life.&lt;br /&gt;&lt;br /&gt;We will contact all shortlisted candidates but please note Practice Plus Group retain the right to remove the advert prior to the closing date if a suitable candidate is appointed. Our employment offers are subject to receipt of satisfactory pre-employment checks. At Practice Plus Group, we actively promote diversity and equal opportunities. Applicants must have the right to work in the EU.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;strong&gt;We are one of the UK largest independent sector healthcare providers and work in close partnership with the NHS to deliver more than 50 services throughout the UK. We provide high quality specialist care and excellent results for more than 50,000 patients each year.&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Practice Plus Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130136"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southampton", "postalCode": "SO14 0YG"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.9124", "longitude": "-1.39707"}}, "title": "Sonographer - Southampton", "url": "https://www.jobs.nhs.uk/xi/vacancy/916233550", "validThrough": "2020-11-17T23:59:59+0000"}