{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "12603", "minValue": "12603", "unitText": "YEAR", "value": "£12,603.50 pa"}}, "datePosted": "2020-10-30T12:16:24+0000", "description": "&lt;p&gt;An opportunity has arisen in the Procurement department for an enthusiastic, self-motivated individual to join our team as a Business Administration apprentice. This department aims to support our clinical colleagues by having the correct products and equipment available to enable them to deliver safe and effective care to patients, and we work with many different departments and staff in the organisation in order to do this.&lt;/p&gt;\n&lt;p&gt;The successful candidate will receive training to perform a variety of duties including contacting suppliers, placing orders for goods, purchasing products, updating procurement information and general office activity. This training will enable skills development to provide a comprehensive and effective administrative service, and to support the smooth and efficient running of the Procurement Department.&lt;/p&gt;\n&lt;p&gt;This apprenticeship will provide the opportunity to gain valuable workplace experience and the support to achieve a business administration qualification.&lt;/p&gt;\n&lt;p&gt;Applicants will need a positive “can-do” attitude, PC and keyboard skills, together with a desire to provide excellent customer care. A good general education with GCSE’s (grades A-C) in Maths and English is also required.&lt;/p&gt;\n&lt;p&gt;You will be required to work as part of a team, communicating effectively and courteously with a wide range of internal and external personnel.&lt;/p&gt;\n&lt;p&gt;This is a fulltime post of 37.5 hours a week. A proportion of time will be spent at College studying towards a Level 2 Intermediate Business Administration Apprenticeship.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Sharon Smith via sharon.smith39@nhs.net or 07771 817055&lt;/p&gt;", "employmentType": "OTHER", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120920.jpg", "name": "Royal Cornwall Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120920"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Cornwall Hospital, Treliske, Truro", "postalCode": "TR1 3LJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.2667", "longitude": "-5.0915"}}, "title": "Procurement Business Administration Apprentice", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250114", "validThrough": "2020-11-15T23:59:59+0000"}