{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "18491", "minValue": "18491", "unitText": "YEAR", "value": "£11 an hour"}}, "datePosted": "2020-10-30T15:01:52+0000", "description": "&lt;p&gt;Our Pharmacy team at Nuffield Health Derby Hospital currently have an opportunity for a Bank Pharmacy Technician.&lt;/p&gt;\n\n\n\n&lt;p&gt;&lt;br /&gt;As a Bank Pharmacy Technician you will work closely with our Pharmacists and have defined responsibilities including providing pharmacy services over the counter, procurement, distribution, stock taking and evaluation. Cover will be required for staff holidays, weekends and sickness.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You must have NVQ3 in Pharmaceutical sciences or equivalent.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This is an excellent chance for you to develop your career and gain a wide range of skills. Excellent people skills are essential, as you will be working closely both with patients and the hospital team.&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;The opportunity&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;We are looking for an enthusiastic individual to support the delivery of the Pharmacy service through effective co-ordination of day-to-day activities, including dispensing of medicines from clinically approved prescriptions.&lt;/p&gt;\n&lt;p&gt;As our Pharmacy technician you will:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Support our Dispensary and Patient Services, working in the main pharmacy department and in our chemotherapy pharmacy as appropriate&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Coordinate and monitor the procurement of pharmaceutical stock and distribution to all clinical departments&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Provide day to day support and guidance to Pharmacy staff as appropriate&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Co-ordinate and undertake activities to support the efficient working of the pharmacy service&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;If suitably accredited, you may have the opportunity to carry out ward based medicines management activities&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The person&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;To succeed as a Pharmacy technician, you will need:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Level 3 Diploma in Pharmacy Service Skills/equivalent GPhC recognised qualification&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Registered as a Pharmacy Technician with the General Pharmaceutical Council&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Experience within a pharmacy (hospital and/or oncology experience would be an advantage)&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Good IT Skills, literacy and numeracy and communication skills&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;To be flexible and adaptable, and be confident working both unsupervised and within a team.&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Benefits&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Holiday in line with the Working Time Directive.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Access to our Pension Scheme.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Discounted gym membership at £15.00 a month.&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Be your best and join us in building a healthier nation.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Nuffield Health, Derby Hospital&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Nuffield Heath is Britain’s largest and most pioneering healthcare charity, integrating fitness and well-being, prevention and cure. We’ve brought together our hospitals, clinics, fitness &amp; wellbeing centres as well as our diagnostic units into one holistic healthcare service provided from over 200 locations. A not-for-profit organisation, we reinvest every penny we make into helping the people of Britain to lead healthier, happier lives. In today’s healthcare market, we’re in an enviably strong position.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Situated in Littleover The Nuffield Health Derby Hospital has 39 beds, three operating theatres, an Oncology unit and a growing range of clinical services. We are continually developing our services, consolidating our position as a centre of excellence in the East Midlands.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We’ll give you the opportunity to make full use of your skills as part of an organisation that values and respects you. At Nuffield Health, your role is equally about empathy and expertise. It’s not only about making correct assessments in accordance with protocols, but also about giving patients reassurance and support.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You’ll be part of a close-knit team with matron-led care and consultant-led service. This role will give you opportunities to work with leading practitioners and to experience new practices, equipment and facilities.&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;Hourly rate - £11&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing date – 27/11/2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location – Derby&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Contract Type – Bank&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Applications will be considered as they are received and interviews will be arranged accordingly. We reserve the right to close adverts early, for example, where we have received an unprecedented high volume of applications. Therefore, please apply early to ensure you are considered for the post.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We have a duty to apply to the Disclosure and Barring Service (DBS) for disclosure on successful candidates.&lt;/p&gt;\n\n\n", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/132134.jpg", "name": "Nuffield Health", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132134"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Derby", "postalCode": "DE23 4SN"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.8936", "longitude": "-1.5302"}}, "title": "Bank Pharmacy Technician", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250684", "validThrough": "2020-11-27T23:59:59+0000"}