{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 per annum, pro rata"}}, "datePosted": "2020-10-23T13:30:49+0100", "description": "&lt;p&gt;We are seeking a highly motivated and experienced Float Clinical Secretary for the Secretarial Department working directly to the Consultants and their multi-disciplinary teams at the Conquest Hospital. Clinical secretaries are responsible for the provision of a proactive, responsive and professional secretarial service to the Consultant team. Highly self motivated, you will possess the ability to work with minimal supervision and to deliver high quality work to tight deadlines. You will have proven experience of managing competing priorities and planning and prioritising your work effectively. You will thrive on working in a busy unit and as part of a team. A flexible and proactive approach is essential.&lt;/p&gt;\n&lt;p&gt;You will need to deal with patients, clinicians and other staff members, ensuring high levels of customer service. You will have regular interaction with the medical secretarial management team and the departmental service manager. It is essential that you are able to demonstrate good interpersonal, verbal and written skills.&lt;/p&gt;\n&lt;p&gt;You will have a proven track record of recent secretarial and office experience in a fast paced environment with a good level of IT literacy and Microsoft Office skills.&lt;/p&gt;\n&lt;p&gt;This dynamic role will keep you both challenged and busy as you work closely with colleagues to support the clinical team of consultants, junior doctors and specialist nurses.&lt;/p&gt;\n&lt;p&gt;Experience of working in a NHS hospital environment and knowledge of medical terminology is advantageous.&lt;/p&gt;\n&lt;p&gt;This is a challenging yet rewarding position. Potential applicants should ensure they meet the minimum criteria on the person specification before applying for this role.&lt;/p&gt;\n&lt;p&gt;This is a part-time post of 24 hours per week to be worked across 4 days, must include a Friday. Final working pattern to be agreed with successful candidate.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Danny Pulleyn&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Clinical Secretarial Team Manager&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;daniel.pulleyn@nhs.net&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120634.jpg", "name": "East Sussex Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120634"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Conquest Hospital, Hastings", "postalCode": "TN37 7RD"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8854", "longitude": ".567737"}}, "title": "Float Clinical Secretary", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240715", "validThrough": "2020-11-06T23:59:59+0000"}