{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "16944", "minValue": "15129", "unitText": "YEAR", "value": "£9.00 per hour upto £10.08 per hour"}}, "datePosted": "2020-10-16T11:29:06+0100", "description": "&lt;p&gt;If you care for others without a second thought and are looking for a rewarding career where you can make a difference and changes lives for the better, then Elysium Healthcare could be the right choice for you. Whether you are looking for a new career or are already work in healthcare, you’ll receive training to join the team as a Bank Healthcare Assistant. You will be valued and supported, with career development opportunities available. It’s a career that you can take pride in while enjoying the satisfaction of helping people and seeing them improve. It’s what delivering great healthcare should feel like.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What you will be doing&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will join a team that works well together to provide care to patients with a range of complex mental health conditions; supporting people to lead a valued and fulfilled life. It can be quite a challenging environment at times, so a positive attitude, compassion, resilience and vigilance are important. But it is hugely rewarding to see people improve; being able to do something today that they couldn’t do last week because of you. The Elysium Wellbeing team is on hand to keep you feeling great; be it a chat, massage or group activities. Who doesn’t like a free massage at work? There are also career development opportunities in abundance. With a huge range of courses that will see you grow and succeed. If you have the aspiration, capability and dedication, we can give you the support and opportunities to help you achieve your career goals.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Where you will be working&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location&lt;/strong&gt;: Furness Road, Workington, Cumbria, CA14 3PD&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will be working at Gregory House, a 24 bed service for adults with mild and moderate-to-severe learning disability/autism with mental health needs, providing care and support to allow people to be as independent as possible with the long-term aim of people moving onto a more independent living setting. Working as part of a team, you will provide an enhanced level of support to allow people with continuing challenging behaviour and high support needs to be cared for in the least restrictive setting possible, but within a service which is robust and structured enough to meet their ongoing needs and risks. You will help people lead good and meaningful everyday lives, where they have choice and control, accessing mainstream services and facilities, engaging in work and training, in leisure opportunities, hobbies and areas of personal interest.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What you will get&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Hourly rate of £9.00 up to £10.08&lt;/li&gt;\n&lt;li&gt;Free meals and parking&lt;/li&gt;\n&lt;li&gt;Mandatory training&lt;/li&gt;\n&lt;li&gt;Wellbeing support and Activities&lt;/li&gt;\n&lt;li&gt;Flexible working&lt;/li&gt;\n&lt;li&gt;Paid induction&lt;/li&gt;\n&lt;li&gt;Pension&lt;/li&gt;\n&lt;li&gt;Transfer to perm in the future (optional)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About your next employer&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will be working for an established, stable and agile company with a unique approach to the delivery of care.  Each and every employee is valued and supported, as everyone has an important role to play in the success of Elysium. It is only with the dedication, passion and hard work from staff that excellent care programs that truly benefit the service users can be delivered. With a network of over 70 services across England and Wales, providing four services including: Mental Health, Neurological, Learning Disabilities &amp; Autism, Children &amp; Education, there is opportunity for you to grow and move with Elysium. &lt;em&gt;Elysium Healthcare follows safer recruitment of staff for all appointments. &lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt; &lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;It is a requirement that all staff understand it is each person’s individual responsibility and are committed to promoting and safeguarding the welfare of service users. Candidates will be subject to an Enhanced DBS disclosure.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Elysium Healthcare", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133794"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Workington", "postalCode": "CA14 3PD"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.6296", "longitude": "-3.54919"}}, "title": "Bank Healthcare Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916229884", "validThrough": "2020-11-30T23:59:59+0000"}