{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "74661", "minValue": "40037", "unitText": "YEAR", "value": "£40,037-£74,661"}}, "datePosted": "2020-11-05T10:16:25+0000", "description": "&lt;p&gt;&lt;span&gt;&lt;strong&gt;UNIVERSITY HOSPITAL OF NORTH MIDLANDS NHS TRUST, STOKE ON TRENT&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;span&gt;&lt;strong&gt;MEDICINE DIVISION&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;strong&gt;Specialty Doctor Elderly Care&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Applications are invited for Specialty Doctor to support our Medical Division in Older Adults. This post is available with immediate effect for 12-months in the first instance with a view to extend and will specifically support our inpatient wards and Frail Elderly Assessment Unit (FEAU).&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;The Trust is a University Teaching Hospital with its own Medical School and has a newly built Academic Complex. You must have experience in General (Internal) Medicine and Geriatric Medicine; be comfortable in the initial assessment and on-going treatment of acutely ill, adult medical patients with a wide variety of pathology. You will work under consultant supervision and within a dedicated team at all times. As a University hospital and a major tertiary centre, we offer a large variety of sub-specialty services providing an excellent learning environment. There will be requirement to work weekends and bank holidays on a rotational basis. While these posts do not have educational approval, they provide excellent experience and access to the same educational resources as our Trust approved training posts and many previous post-holders have gone on to accept GP or Specialist Registrar posts.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;In order to be considered applicants must have FULL GMC Registration, Basic Life Support and have previous experience of working in the NHS.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameGeorgy JacobJob titleConsultant in Geriatric MedicineEmail addressGeorgy.Jacob@uhnm.nhs.ukTelephone number01782 675094&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University Hospitals of North Midlands NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122653"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "UHNM, Stoke on Trent", "postalCode": "ST4 6QG"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.004", "longitude": "-2.21487"}}, "title": "Specialty Doctor in Elderly Care", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257190", "validThrough": "2020-11-29T23:59:59+0000"}