{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-11-02T09:46:10+0000", "description": "&lt;p&gt;&lt;span&gt;&lt;span&gt;Acute care group&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We specialise in the assessment and treatment of adults who are acutely unwell.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This ranges from our support and signposting service, offering 24 hours of respite for someone away from their difficult circumstances, to working with the police on supporting people who arrive on section.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are helping people with a wide range of complex conditions that come into our cross-county safe admission wards, cared for by a multidisciplinary team who bring all degrees of experience and expertise to the workplace.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This is working alongside extensive countywide crisis resolution and home treatment teams and liaison psychiatry services (based with colleagues in acute trust sites).&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We pride ourselves on our brilliant people, with everyone from the consultant to the house keeping staff bringing something to the caring role, ensuring the patient and their loved ones are the centre of everything.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We have a state-of-the-art 10-bed psychiatric intensive care unit (PICU) in Dartford and we have a rolling programme of improvement projects, collaborations with friends of the trust with lived experience who are guiding on the design for new and refurbished spaces.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Working within the inpatient setting is area challenging area of work, however, the rewards are great. Mental ill health is a human experience with one in four of us experiencing it at some point in our lives. You will be that person who offers compassion and hope, making the difference.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are looking for dedicated Staff Nurses to join us and be part of our forward thinking, progressive team that invests in staff through continuous development and career progression. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You might be a newly qualified RMN/RNLD nurse, a RMN looking to return to work or an experienced nurse looking for a new challenge. In addition, we are always happy to talk to you about your flexible working needs.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We would consider offering opportunities for rotational posts in our inpatient services, health based place of safety and liaison teams. You will fit well within our team if you are enthusiastic, motivated, flexible and dedicated to providing high quality, person-centred care and support to patients in an in-patient environment.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Raju Bunker, Recruitment Officer&lt;/p&gt;\n&lt;p&gt;Telephone: 01227 812349&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121464.jpg", "name": "Kent and Medway NHS and Social Care Partnership Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121464"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Kent &amp; Medway NHS &amp; Social Care Partnership Trust, Various", "postalCode": "CT1 1AZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2778", "longitude": "1.11098"}}, "title": "Qualified Mental Health Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251465", "validThrough": "2020-11-22T23:59:59+0000"}