{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum"}}, "datePosted": "2020-10-29T09:15:41+0000", "description": "&lt;p&gt;The Norfolk and Norwich University Hospital NHS Foundation Trust is seeking to recruit an experienced Care Group Operational Manager who will work within the Medicine Division. The role will be part of the Medicine Divisional Management structure, and as a Care Group Operations Manager you will be managing a wide and varied portfolio of clinical services at all points of delivery.&lt;/p&gt;\n&lt;p&gt;The Division has a budget in excess of £200 million, employs a workforce of over 2,500 staff and is committed to continuous improvement of services to provide great care for patients and their families. The Medicine Division provides services in both an inpatient and outpatient setting across a variety of specialties and manages a number of patient pathways which cover diagnostic, treatment, therapeutic and cancer.&lt;/p&gt;\n&lt;p&gt;This new post forms part of a re-structure that has recently taken place within the Medicine Divisional Management team, and will be line managed and supported by a Tactical Operational Manager, as well as working closely with a dedicated Business team within the Division to ensure effective delivery of care pathways for our patients.&lt;/p&gt;\n&lt;p&gt;This is a truly exciting time of change to support us in the delivery of world class care for our patients. The Trust has recently moved out of special measures and one aspect of Medicine, our Palliative cares services, has recently been awarded Outstanding and that is our ambition for the rest of the Division.&lt;/p&gt;\n&lt;p&gt;The post holder will be in a unique position to respond to the needs of the Health Group, offering support and direction to ensure delivery of the key challenges, and ultimately, be accountable for operational success.&lt;/p&gt;\n&lt;p&gt;It is a really exciting time to join the Medicine division; if you’re driven, ambitious and looking for a new challenge, apply today!&lt;/p&gt;\n&lt;p&gt;Applicants will require exceptional leadership qualities, good relationship management skills and a strong understanding of operational standards. You will be passionate about improvement and influencing change, you will be a natural leader who will facilitate and support collaborative working both internally and externally to the Trust, to ensure the delivery of high quality patient care.&lt;/p&gt;\n&lt;p&gt;You will be able to demonstrate excellent understanding of the acute hospital system, performance and quality standards as well as being a motivated individual who has a track record of successfully managing services and improving patient outcomes.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Full time:&lt;/strong&gt; 37.5 hours per week&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview date:&lt;/strong&gt; 16th November 2020&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Open for applications:&lt;/strong&gt; 29th October 2020&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Close for applications:&lt;/strong&gt; 10th November 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Sarah Walker - Tactical Operations Manager&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Tel: &lt;/strong&gt;01603 288717&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Email:&lt;/strong&gt; sarah.walker@nnuh.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122492.jpg", "name": "Norfolk and Norwich University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122492"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Norfolk and Norwich University Hospital, Norwich", "postalCode": "NR4 7UY"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6181", "longitude": "1.22109"}}, "title": "Care Group Operational Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247700", "validThrough": "2020-11-10T23:59:59+0000"}