{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 pro rata per annum"}}, "datePosted": "2020-10-26T13:01:20+0000", "description": "&lt;p&gt;&lt;strong&gt;Medical Secretary (Community Paediatrics - Hyde)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Part time: 22.5 per week&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Are you currently working in the NHS or similar environment and have fantastic typing and secretarial skills? A great multitasker? A good eye for detail?&lt;/p&gt;\n&lt;p&gt;Would you like to be part of a supportive team who work together to help our patients?&lt;/p&gt;\n&lt;p&gt;We have an exciting opportunity for a highly motivated, enthusiastic Medical Secretary to join our secretarial and admin team. The post holder will provide a confidential medical secretary service to the Consultants and other members of the Clinical Team enabling the delivery of an effective, efficient and timely service to children and families.&lt;/p&gt;\n&lt;p&gt;You will be passionate about our business, creating a culture of continuous improvement, where patient welfare is at the heart of all you do.&lt;/p&gt;\n&lt;p&gt;If you enjoy communicating with people, are a good team player with excellent oral and written communication skills, and have a willingness to contribute to positive team working, we would love to hear from you!&lt;/p&gt;\n&lt;p&gt;You will be expected to liaise with staff and colleagues at all levels. You will have proven administrative skills with the ability to prioritise and manage your own workload to tight deadlines. You will need to demonstrate initiative and flexibility in your approach and be able to work to tight deadlines. It is essential that all work is of a consistently high standard and dealt with in a confidential manner. You must have RSA level 2 and AMSPAR or equivalent qualification with relevant experience of working in an office within the NHS or similar environment. Experience of using Lorenzo (or similar PAS system), Microsoft office and using digital dictation systems is desirable.&lt;/p&gt;\n&lt;p&gt;Interview date: 25th November 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameMarta Wisniewska on 0161 922 5663 or Carol Fryer on 0161 922 5503.Job titleADMIN MANAGER BSAEmail addresscarol.fryer@tgh.nhs.ukTelephone number0161 922 5663 or 0161 922 5503Additional contact information&lt;/p&gt;\n&lt;p&gt;Booking, Scheduling and Admin Manager Marta Wisniewska on 0161 922 5663 or Carol Fryer on 0161 922 5503.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Tameside and Glossop Integrated Care NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121286"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hyde Community Team, Ashton Under Lyne", "postalCode": "OL6 9RW"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4919", "longitude": "-2.07155"}}, "title": "Medical Secretary - Community Paediatrics", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242562", "validThrough": "2020-11-09T23:59:59+0000"}