{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "31199", "minValue": "31199", "unitText": "YEAR", "value": "£18.56 PH + Benefits"}}, "datePosted": "2020-10-01T09:15:53+0100", "description": "&lt;p&gt;&lt;span&gt;Are you a Registered Staff Nurse looking for a new opportunity to work in an organisation that will help you to develop and achieve your goals to become the best you can be?&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;As an experienced Nursefrom the NHS or private care, you&#39;ll join the team as a Bank Staff Nurse where you&#39;llreceiveyour perfect work/lifebalance, 12.07% hourly pay upliftand book your shifts through the Temployer App.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Your career within Elysium will be enjoyable and rewarding as you develop specialist skills and make a real difference for some of the most vulnerable people in society.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;It’s a career that you can take pride in and enjoy. It’s what delivering great healthcare should feel like.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What you will be doing&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As a qualified&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;RMN//RNLD/RGN&lt;/span&gt;&lt;/strong&gt;nurseyou will ensure young people with mental health conditions receive high-quality care, while also supporting your colleagues and promote good teamwork.&lt;/p&gt;\n&lt;p&gt;No two days are the same, with plenty to keep you engaged and motivated, but also a good amount of routine.&lt;/p&gt;\n&lt;p&gt;You will have access to the Elysium Wellbeing team, which is on hand to keep you feeling great; be it a chat, massage or group activities. Who doesn’t like a free massage at work?&lt;/p&gt;\n&lt;p&gt;There are also career development opportunities, with a huge range of courses that will help you grow and succeed. If you have the aspiration, capability and dedication, we can give you the support and opportunities to help you achieve your career goals.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Things that you will have:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A relevant nursing qualification and registration&lt;/li&gt;\n&lt;li&gt;Strong team-working skills&lt;/li&gt;\n&lt;li&gt;A high level of self-motivation and a flexible approach&lt;/li&gt;\n&lt;li&gt;A positive attitude and be naturally caring and compassionate&lt;/li&gt;\n&lt;li&gt;A commitment to high-quality care and to values and evidence-based practice&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We can offer you flexible working - you will work 12.5 hour days, on a 0 hour contract.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Where you will be working&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location&lt;/strong&gt;:&lt;span&gt;Badby Road West,&lt;/span&gt;&lt;span&gt;Daventry,&lt;/span&gt;&lt;span&gt;Northamptonshire,&lt;/span&gt;&lt;span&gt;NN11 4NH&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;You will be workingalongside the clinical teamsat Badby Park to care for people with neurological illnesses, acquired brain and spinal cord injuries.&lt;/p&gt;\n&lt;p&gt;You will deliver truly person-centred care where each individual is at the heart of everythingyou do, at this specialist inpatient neurological rehabilitation and complex care service which boasts extensive facilities that cater for specific needs of the residents.&lt;/p&gt;\n&lt;p&gt;Set in acres of stunning countryside on the outskirts of Daventry, Badby Park is a grand manor house steeped in history with stunning views, excellent facilities and a tranquil setting. Good road links makes it easily commutable from Daventry, Rugby, Northampton and Banbury.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What you will get&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Hourly rate of up to £18.56(including the 12.07% holiday allowance uplift)&lt;/li&gt;\n&lt;li&gt;Free meals and parking&lt;/li&gt;\n&lt;li&gt;Mandatory training&lt;/li&gt;\n&lt;li&gt;Wellbeing support and Activities&lt;/li&gt;\n&lt;li&gt;Flexible working&lt;/li&gt;\n&lt;li&gt;Paid induction&lt;/li&gt;\n&lt;li&gt;Transfer to perm in the future (optional)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;About your next employer&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will be working for an established, stable and agile company with a unique approach to the delivery of care.&lt;/p&gt;\n&lt;p&gt;Each and every employee is valued and supported, as everyone has an important role to play in the success of Elysium. It is only with the dedication, passion and hard work from staff that excellent care programs that truly benefit the service users can be delivered.&lt;/p&gt;\n&lt;p&gt;With a network of over 70 services across England and Wales, providing four services including: Mental Health, Neurological, Learning Disabilities &amp; Autism, Children &amp; Education, there is opportunity for you to grow and move with Elysium.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Elysium Healthcare follows safer recruitment of staff for all appointments. It is a requirement that all staff understand it is each person’s individual responsibility and are committed to promoting and safeguarding the welfare of service users. Candidates will be subject to an Enhanced DBS disclosure.&lt;/em&gt;&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "Elysium Healthcare", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133794"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Daventry", "postalCode": "NN11 4NH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.2467", "longitude": "-1.17536"}}, "title": "Bank Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916207627", "validThrough": "2020-12-31T23:59:59+0000"}