{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum"}}, "datePosted": "2020-11-04T10:31:20+0000", "description": "&lt;p&gt;Great healthcare from great people: New opportunities for consultant respiratory physicians in East Kent Castles, Doomsday villages, Oyster festivals, A Cathedral city, Blue Flag Beaches, Outstanding natural beauty, White Cliffs and Coastal walks, A house in the country, Grammar Schools, High Speed Rail - London in 38minutes, Championship links Golf, Eurotunnel and France a breath away . . The Garden of England. . . Voted the top destination in Europe for families by Lonely Planet.&lt;/p&gt;\n&lt;p&gt;Applications are invited for Consultant in Respiratory medicine post at East Kent Hospitals University NHS Foundation Trust as part of a major expansion of Respiratory services.&lt;/p&gt;\n&lt;p&gt;You will be joining a team of 11 consultants, 1 Respiratory Nurse Consultant, 5 Nurse specialists and a dynamic, rapidly evolving department, reconfiguring to allow targeted sub-specialty work and 7 day respiratory service across the region.&lt;/p&gt;\n&lt;p&gt;Applicants will have extensive General Respiratory experience with expertise in Pleural, ILD or Lung cancer. Applicants who have other sub-speciality interests are welcome and will be accommodated.&lt;/p&gt;\n&lt;p&gt;East Kent Hospitals University NHS Foundation Trust is one of the largest acute Trusts in England. We provide regional circulation services for 1.8 million Kent residents. This includes a programme of vascular surgery, renal services primary PCI (PPCI) and acute stroke intervention.&lt;/p&gt;\n&lt;p&gt;We provide a full range of acute services to our local population of around 800,000. Major changes have been made to patient pathways with significant investment in acute medical consultants looking after the acute medical unit and ambulatory care with specialist in reach from specialities.&lt;/p&gt;\n&lt;p&gt;We have 2 EBUS lists per week and weekly Pleural list (including IPC insertion). There has been a recent substantial increase in the number of respiratory nurses to support both inpatient and outpatient respiratory service. The sleep service which is one of the largest in the country will have an increase in the staff soon in line with the growth of the service.&lt;/p&gt;\n&lt;p&gt;The Trust encourages and supports all consultants to be involved in education and research and enjoys strong links with our two local Universities (Christ Church and Kent), with joint and professorial appointments at these institutions.&lt;/p&gt;\n&lt;p&gt;A significant number of joint positions with the medical school, for lecturers and clinical teaching are expected in the future if this is realised. It was also recently announced that a new medical school, the first in the county, will be opening in two years. The school, which will offer 100 medical school places per year, is a game-changing opportunity and one which the two universities and Kent and Medway trusts have been working towards and hoping for over several years.&lt;/p&gt;\n&lt;p&gt;Please review the job description for more details. Applicants must have full GMC Registration and must be on the Specialist Register or within six months of their CCT from the date of the interview.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Clinical Lead Brett Pereira on brett.pereira@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "East Kent Hospitals University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121462"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "William Harvey Hospital, Ashford", "postalCode": "TN24 0LZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.1415", "longitude": ".91624"}}, "title": "Consultant in Respiratory Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255374", "validThrough": "2020-12-01T23:59:59+0000"}