{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "32107", "minValue": "32107", "unitText": "YEAR", "value": "£19.10 per hour"}}, "datePosted": "2020-11-03T16:08:54+0000", "description": "&lt;p&gt;&lt;strong&gt;Are you looking to further your career within a prison healthcare environment? If so, this role could be for you!&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you looking for a challenging and rewarding nursing role and want to develop your clinical skills in an environment where staff feel “safe” and “supported” then this could be new job for you!&lt;/p&gt;\n&lt;p&gt;We offer a salary of up to £19.10 per hour.&lt;/p&gt;\n&lt;p&gt;HMP YOI Portland is based on the isle of Portland off the coast of Weymouth. It is approximately 7 miles from the centre of Weymouth. The prison is a category C adult /young offender’s prison and houses up to 530 prisoners, all with varying sentence lengths.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What do we need from you so you can do the job?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As a Bank Mental Health Nurse (RMN), you will be a qualified Registered Nurse (Mental Health) with a real passion for developing your clinical skills in an environment that is ever changing. You’ll have a flexible approach working within a team that encourage new ideas and opinions on how to improve the service.&lt;/p&gt;\n&lt;p&gt;You should possess a good working knowledge of conducting risk assessments and care planning as well as someone who is creative and forward thinking to work through the issues that may arise in this challenging but exciting environment. Knowledge in therapeutic interventions such as CBT or Steps to Wellbeing are desirable but transferable clinical skills will be considered with appropriate training provided.&lt;/p&gt;\n&lt;p&gt;If you are self-motivated and able to work autonomously as well as showing plenty of initiative when it comes to handling a wide range of situations, then this could be the right role for you!&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;In return for your hard work you will receive...&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;At Practice Plus Group, we are proud to support our employees with continued professional development opportunities and further education (subject to service needs). Staff are encouraged to develop skills and learning to contribute to the dynamic care needs of our specific client groups. Other benefits include cycle to work scheme, on-site gym facilities and free onsite parking at some locations.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Next steps&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you are shortlisted, you will be contacted by the Internal Recruiter for this role. The recruiter will submit your CV to the hiring manager and in turn will arrange an interview for you to attend the site if the hiring manager feels that you are suitable for the job.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;However we understand due the situation with coronavirus this may not be possible and will arrange either a telephone or video conferencing interview instead.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;More information&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is a bank vacancy, with variable hours decided with site with a maximum rate of £19.10 per hour.&lt;/p&gt;\n&lt;p&gt;The healthcare services at HMP Portland are open between 07:30 to 18:00, seven days a week.&lt;/p&gt;\n&lt;p&gt;Please note that offers of employment are subject to Practice Plus Group Terms &amp; Conditions and receipt of satisfactory references, an enhanced DBS check and prison vetting.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;At Practice Plus Group, we actively promote diversity and equal opportunities.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "Practice Plus Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130136"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Portland", "postalCode": "DT5 1DL"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.5499", "longitude": "-2.42177"}}, "title": "Bank Mental Health Nurse - HMP Portland", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254723", "validThrough": "2020-11-17T23:59:59+0000"}