{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44780", "minValue": "37638", "unitText": "YEAR", "value": "£37,638 - £44,780 Pa Inc"}}, "datePosted": "2020-11-06T16:01:09+0000", "description": "&lt;p&gt;An opportunity has arisen for a radiographer to progress to a senior role within the radiotherapy department at Imperial College Healthcare NHS Trust. We are looking for an enthusiastic, motivated and dynamic individual who is willing to help us continually develop our practice and move the department forward through research and quality improvement. If you are someone who can bring fresh ideas and a passion for team working, then we would love to hear from you.&lt;/p&gt;\n&lt;p&gt;We are supporting the service to develop new systems of work and foster collaborative working with a strong focus on integrated governance. We are currently transitioning our treatment planning practice to the Raystation system and are progressing well on our journey to implement paperless patient pathways as well as introducing Q-Pulse to support the management of our CHKS accredited quality system.&lt;/p&gt;\n&lt;p&gt;We actively support professional development and encourage radiographer led research and QI projects. We support leadership development with excellent leadership development programmes delivered by the Trust. We were the first London radiotherapy service to adopt all of its clinical and physics workforce as Macmillan professionals. We also support flexible working arrangements with many of our team already working 4 day weeks or 9 day fortnights. All applicants would be expected to be able to support the working hours of the service including participation in the on-call rota and work across sites.&lt;/p&gt;\n&lt;p&gt;Operating mainly from our Charing Cross site, our equipment portfolio includes four TrueBeam Linacs two of which have the ExacTrac system, Philips Brilliance CT scanner and Xstrahl unit. Our Elekta Flexitron Brachytherapy unit is based at Hammersmith Hospital in a dedicated brachytherapy suite and have expanded this service to include the delivery of Oesophageal Brachytherapy. We treat a wide portfolio of techniques including TBI, TLNI and SRS and will commence Lung SABR in early 2021 and Oligomets SABR from March 2021.&lt;/p&gt;\n&lt;p&gt;We offer a flexible approach to working hours to meet the needs of the individual and the service. Please talk to us at interview about the flexibility you may need.&lt;/p&gt;\n&lt;p&gt;For further information and to arrange an informal visit please contact Deborah Thornberry, Macmillan Treatment &amp; Imaging Lead (deborah.thornberry@nhs.net) or call the team on Tel: 02033117647&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123032.jpg", "name": "Imperial College Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123032"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Charing Cross Hospital, London", "postalCode": "W6 8RF"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4871", "longitude": "-.219912"}}, "title": "Band 6 Senior Therapy Radiographer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916260512", "validThrough": "2020-11-20T23:59:59+0000"}