{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "48600", "minValue": "48600", "unitText": "YEAR", "value": "£48,600 pro rata"}}, "datePosted": "2020-10-30T10:16:50+0000", "description": "&lt;p&gt;&lt;strong&gt;Practice Based Clinical Pharmacists – Healthsense Primary Care Network, Harrow.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking to recruit a motivated and enthusiastic Clinical Pharmacist to work alongside our clinical teams.&lt;/p&gt;\n&lt;p&gt;We have 3 roles available&lt;/p&gt;\n&lt;p&gt;1 Full time permanent positon - immediate start (subject to successful candidates notice period)&lt;/p&gt;\n&lt;p&gt;1 Part time 18 hour position- immediate start (subject to successful candidates notice period)&lt;/p&gt;\n&lt;p&gt;1 Full time 12 month maternity cover position, starting in January 2021&lt;/p&gt;\n&lt;p&gt;Please specify on your application which of the above 3 roles you are can fully commit to.&lt;/p&gt;\n&lt;p&gt;Full-time candidates will be expected to work 5 days a week.&lt;/p&gt;\n&lt;p&gt;You join our team of established PCN pharmacists.&lt;/p&gt;\n&lt;p&gt;The main duties and responsibilities will include performing face-to-face and remote medication reviews, support management of patients with long-term conditions, undertake medicines reconciliation, provide telephone consultations, repeat prescription standardization, implementation and management, drug monitoring management, and clinical audits.&lt;/p&gt;\n&lt;p&gt;Our network is an innovative, enthusiastic and forward looking collaboration of GP practices looking after the health and wellbeing of around 82,000 patients in Harrow. Our ultimate aim is to be a fully merged entity providing seamless, high quality care across our Practices. The organisation currently consists of 7 practices with a broad spectrum of clinical roles which include: GPs, Nurses, Pharmacists, Health Care Assistants and a wide array of allied health professionals.&lt;/p&gt;\n&lt;p&gt;The successful applicant will be an independent prescriber, have good clinical background and possess change management principles required to support safe, evidence based, clinically and cost-effective prescribing.&lt;/p&gt;\n&lt;p&gt;Experience in general practice is desirable.&lt;/p&gt;\n&lt;p&gt;Applicants must be a pharmacist registered with the General Pharmaceutical Council (GPhC), educated to degree level and have clear evidence of continuing professional development. You should also have significant experience within a range of clinical areas including Primary Care settings, hospital or community pharmacy and also ideally have a clinical pharmacy diploma or equivalent experiential learning. Qualification as an independent prescriber is essential.&lt;/p&gt;\n&lt;p&gt;Please see the Job Description for further details.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be employed and based at a specific practice within the network but will be involved in both PCN wide activities and practice-based work as per the requirements of the PCN.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central Advertising - General Practitioners", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130654"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Harrow", "postalCode": "HA2 7DU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.581", "longitude": "-.365079"}}, "title": "Practice Based Clinical Pharmacist, full time or part time", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249681", "validThrough": "2020-11-13T23:59:59+0000"}