{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "20440", "minValue": "18137", "unitText": "YEAR", "value": "£10.79 to £12.16 per hour"}}, "datePosted": "2020-11-04T16:50:13+0000", "description": "&lt;p&gt;The Adam Practice is seeking a Surgery Team Leader at our Hamworthy Surgery to lead its non-clinical Reception and Administration teams. You will be joining a CQC Outstanding-rated Practice and work within a team of four Team Leaders, supporting our Surgery Team Manager to lead operations across our four sites.&lt;/p&gt;\n&lt;p&gt;The primary focus of the role is to lead the Reception teams and ensure excellent service is delivered to our patients and the wider community. This vacancy will be primarily based at our Hamworthy surgery site; however you will be required to travel between and cover any of our four sites as required.&lt;/p&gt;\n&lt;p&gt;The successful candidate will have excellent communication and leadership skills, 2 years outstanding customer service experience and a demonstrable ability to lead by example in a dynamic environment.&lt;/p&gt;\n&lt;p&gt;Flexibility and adaptability are important as the role requires you to deal with a variety of operational challenges, whilst always seeking continuous improvement in yourself and the organisation. Knowledge of front-line General Practice operations would be a clear advantage, but we welcome applications from anyone with transferable skills from a similar environment.&lt;/p&gt;\n&lt;p&gt;In return The Adam Practice will provide a development pathway and opportunity for salary progression to recognise existing skills and develop management capability.&lt;/p&gt;\n&lt;p&gt;You may already be working at Team Leader/Supervisor level or have demonstrated the potential to do so and be seeking the next step in your career. The Adam Practice offers you a progressive environment to enhance your skills and experience, with the opportunity for further growth and progression in the future.&lt;/p&gt;\n&lt;p&gt;Travel will be involved between our 4 sites; Hamworthy, Poole, Upton and Lytchett Matravers.&lt;/p&gt;\n&lt;p&gt;Salary for the role is £10.79 to £12.16 per hour, (comparable with NHS Agenda for Change Band 4).&lt;/p&gt;\n&lt;p&gt;Working hours 35 per week, working pattern -&lt;/p&gt;\n&lt;p&gt;Monday 08:00-16:00 - 7.5hrs&lt;/p&gt;\n&lt;p&gt;Tuesday 08:00-16:00 - 7.5hrs&lt;/p&gt;\n&lt;p&gt;Wednesday 08:00-13:00 - 5hrs&lt;/p&gt;\n&lt;p&gt;Thursday 08:00-16:00 - 7.5hrs&lt;/p&gt;\n&lt;p&gt;Friday 08:00-16:00 - 7.5hrs&lt;/p&gt;\n&lt;p&gt;Additional benefits include access to NHS Pension Scheme and NHS discounts, 5 weeks’ annual leave (inclusive of bank/public holidays that fall in the holiday year).&lt;/p&gt;\n&lt;p&gt;For more information or to book an informal visit please call Laura Evans 01202 673159. &lt;/p&gt;\n&lt;p&gt;Interview date: Week commencing Monday 23rd November 2020 &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "The Adam Practice", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130115"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Poole", "postalCode": "BH15 4JQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7209", "longitude": "-2.01054"}}, "title": "Surgery Team Leader", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256733", "validThrough": "2020-11-18T23:59:59+0000"}