{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 per annum, pro rata"}}, "datePosted": "2020-10-21T16:30:51+0100", "description": "&lt;p&gt;Exciting Opportunity for Registered Pharmacy Technicians to join the team!&lt;/p&gt;\n&lt;p&gt;Hello! My name is Alice Smilie, I am the Operational Manager of the John Radcliffe Pharmacy. I am privileged to lead our very hardworking Dispensary team in providing a dispensary service, supplying in-patient, outpatient and discharge medication to Patients of the John Radcliffe Hospital in Oxford.&lt;/p&gt;\n&lt;p&gt;Due to internal promotions we are looking for Registered Pharmacy Technicians to join our Pharmacy Team on the JR site. This post would be ideal for a recently qualified Pharmacy Technician or a Pharmacy Technician who has worked in community pharmacy and would like the opportunity to gain hospital pharmacy experience. You must have an NVQ level 3 in Pharmacy services or equivalent. The post is full time, however flexible working options would also be considered.&lt;/p&gt;\n&lt;p&gt;The John Radcliffe Dispensary Team are supported by technology and the robot directly labels medicines before they are released. The duties of a band 4 Technician include dispensing, MDS dispensing, patient counselling and extemporaneous medicine dispensing as well as providing the final check of medicines following successful completion of our Accredited Checking scheme.&lt;/p&gt;\n&lt;p&gt;The dispensary team is a team of 28 staff ranging from band 2 Assistants through to band 7 Technicians. Many of our band 4 Technicians later go on to become ward based band 5 Technicians or take other roles within the wider Pharmacy team and this role is ideal for gaining that experience to progress further in your career.&lt;/p&gt;\n&lt;p&gt;The candidates will be dispensary based, and be required to participate in weekend working on a 1:6 rota basis, early, late duty and bank holiday rotas.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing date: 29th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;For further information or to arrange an informal visit please contact Alice Smilie, Operational Manager, Charlotte Paddick, Sue Peden, Steve Orton, Senior Technicians, on 01865 221502.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Oxford University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120889"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "John Radcliffe Hospital, Oxford", "postalCode": "OX3 9DU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7639", "longitude": "-1.21979"}}, "title": "Registered Pharmacy Technician", "url": "https://www.jobs.nhs.uk/xi/vacancy/916237290", "validThrough": "2020-11-29T23:59:59+0000"}