{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum (pro rata for part-tim"}}, "datePosted": "2020-11-04T11:31:34+0000", "description": "&lt;p&gt;We are looking for Band 6 Senior Community Occupational Therapists to join our dedicated teams. We are committed &amp; passionate about promoting health, well-being and independence. We are a values-based Trust and are looking for a dedicated and enthusiastic clinician who believes in the provision of patient-centred care.&lt;/p&gt;\n&lt;p&gt;The positions will be based in Nottingham North and East and the successful candidate/s will work within the Integrated Community Team and provide services in Complex Community Rehabilitation, Short Term rehabilitation, Crisis management and Long-term conditions management.&lt;/p&gt;\n&lt;p&gt;Our Adult Integrated Teams are enthusiastic with a breadth of experience and a shared goal to offer the highest standard of care to our patients. It is expected that you will offer your own knowledge and experience in rehabilitation, attend regular therapy meetings and undertake joint therapy assessments and treatment sessions with members of the MDT, where appropriate. Rehabilitation will be delivered to patients in the community which a focus on improving health and well-being and preventing hospital admission.&lt;/p&gt;\n&lt;p&gt;The integrated team closely with Community Geriatricians, health and social care professionals across primary &amp; secondary care. It strives to empower patients, families and carers in both a home and care home environment. You will offer bespoke rehabilitation to the frail and elderly including complex fallers, patients with neurological conditions, complex co-morbidities and orthopaedics.&lt;/p&gt;\n&lt;p&gt;It is anticipated that as a Senior Community Practitioner you will be supporting Locality Managers with strategic development and operational delivery of the service. Supervision of staff will also be required.&lt;/p&gt;\n&lt;p&gt;Applicants should hold BSc/Diploma in Occupational Therapy, HCPC Registration . You should have post qualification experience and recent specialist experience of working with clients with long term conditions, falls, neurology and health care of the elderly conditions.&lt;/p&gt;\n&lt;p&gt;A full UK driving licence and vehicle for business use is required for this post; however reasonable adjustments will be made for disabled individuals in line with the Equality Act 2010.&lt;/p&gt;\n&lt;p&gt;Allied Health Professionals within Nottinghamshire Healthcare Foundation Trust are at the forefront of a range of multi-disciplinary, specialist services for people with complex needs, using their expertise around promoting recovery, enablement and positive risk taking, to add life to years, prevent relapse and reduce risks.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact Ilona Cannon, Clinical Lead - Arrow Health Community Team on ilona.cannon@nottshc.nhs.uk or 078160063390&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Additional contact information&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Victoria Harding, Clinical Lead Synergy Health Community Team - 07964974988&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120975.jpg", "name": "Nottinghamshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120975"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Nottingham North and East Community Therapy Services, Nottingham", "postalCode": "NG4 3DQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9678", "longitude": "-1.08473"}}, "title": "Senior Community Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255631", "validThrough": "2020-11-15T23:59:59+0000"}