{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "43772", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £43,772 pro rata per annum"}}, "datePosted": "2020-10-27T14:23:44+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;span&gt;Specialist Nurse for Looked after Children&lt;br /&gt;BAND 7&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Part-time 22.5hrs&lt;br /&gt;Colchester&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Are you a motivated and ambitious nurse looking to take the next step in your career? Are you looking to move into an innovative team who are rolling out new projects in order to improve outcomes to children and families in North Essex? Our team in Colchester are looking for a part-time Looked After Children’s Nurse to join our small and friendly team.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Since 2017, Virgin Care in partnership with Barnardos working together as The Essex Child and Family Wellbeing service have delivered innovative and refreshing health and social care pre-birth to 19 years services to Essex Families. We have developed our own unique approach where our families are at the centre of everything we do and right now, we’re looking for a Looked After Children’s Nurse to join our team.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Feel Proud&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We&#39;re looking for a Band 7 Looked After Children’s Nurse to continue to lead the way with your ideas and join a dedicated team who are continually reviewing the way they deliver local services in order to have an impact on the development and wellbeing of Looked after children in North Essex.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will have an NMC registration and be a Registered Nurse / Childrens Nurse / &lt;/span&gt;&lt;span&gt;Mental health nurse&lt;/span&gt;&lt;span&gt;/Health Visitor or School Nurse with experience in and a particular passion for working with Looked After Children. Moreover, you will have a caring nature and a ‘can-do’ attitude, with the ability to communicate effectively.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will work directly with the Named Nurse for Looked After Children and the wider LAC team to support all activities necessary to ensure the LAC service meets its responsibilities to promote the health and well-being of LAC so they may be enabled to reach their full potential.  You will need to be able to demonstrate previous leadership skills and experience of working with vulnerable children and young people.  The post holder will hold a caseload of complex looked after children and young people predominately of school age up to 19 years and will therefore need to be able to demonstrate a high standard of clinical skills, excellent communication skills and a flexible approach to working with young people.   We also offer a service to care leavers up to the age of 25 years. It is expected the post holder will autonomously undertake direct clinical work including the completion of statutory health assessments. &lt;/span&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We’ll provide you with access to a committed Learning and Development team, and we work closely with Universities and Health Education England to further your potential and support your progression. You will be supported to complete a LAC competency document to support your learning and development.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will be based primarily Lanswood Business Park however the service covers Colchester, Clacton and Harwich.   You may also be required to travel across Essex at times.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Feel Inspired&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;One of the LAC team members recently received a shout out in the monthly newsletter –&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;“&lt;em&gt;Sarah Southgate&lt;/em&gt;&lt;/strong&gt;&lt;em&gt;, Specialist LAC Nurse is always supportive to not only the young people and foster carers she works with but also to her colleagues. Sarah recently gave a great deal of help to a young person, her partner and baby. The baby needed to be admitted to Hospital in Norwich for pre op tests. Unfortunately the young person had no funds to pay for transport to the hospital, and this would have resulted in the baby’s procedure being cancelled. No one involved with the family was able to provide the money to pay for this, but Sarah spent all day trying to find a solution. She managed to find funding in the end resulting in a good outcome for the baby and the family&lt;/em&gt;.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;em&gt;Thank you Sarah &lt;/em&gt;from us all.”&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Feel the Difference&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We partner with the NHS to make a real difference to people in North Essex and we’re building a working environment where colleagues too can really feel the difference.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;It’s the kind of place where nothing’s too much trouble. Where you’ll feel empowered, listened to, valued and where we’ll support you to bring your best self to work every single day and to deliver high quality care&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Virgin Care is committed to safeguarding and protecting the children and young people that we work with. As such, all posts are subject to a safer recruitment process, including the disclosure of criminal records and vetting checks. We ensure that we have a range of policies and procedures in place which promote safeguarding and safer working practice across our services. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;As a Disability Confident Committed company, we work in partnership with the Department of Work and Pensions (DWP) to provide facilities, work environment adjustments and technical solutions to make our business an inclusive place for all.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We’re committed to equal opportunities and welcome a broad diversity of talent to apply. We reserve the right to cease any advertising prior to the published closing date for a role that receives a high number of applications. Virgin Care Limited, its subsidiary companies and the Virgin Care LLPs are part of the Virgin Group and provide NHS and social care services. If you would like to know a little more about how we use your information, please see our website’s privacy policy.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;If you’d like to discuss the role further, please contact Lisa Gooding on email: lisa.gooding@virgincare.co.uk.&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Virgin Care", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127354"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Colchester", "postalCode": "CO7 7FD"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.8695", "longitude": ".980365"}}, "title": "Specialist Nurse for Looked After Children", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244936", "validThrough": "2020-11-06T23:59:59+0000"}