{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "15129", "minValue": "15129", "unitText": "YEAR", "value": "£9.00 per hour"}}, "datePosted": "2020-11-06T10:20:00+0000", "description": "&lt;p&gt;Health Care Assistant&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Working as part of a team working alongside our Nurses &amp; Consultants to deliver the best patient care. Our ideal candidate will have a genuine compassion and care for individuals and are keen to develop their skills. Previous experience in care is desirable however not essential as full support and training will be offered. An NVQ level 2 or 3 in care would be advantageous however at this time we can support you with your training needs. Attention to detail is key with the ability to stay calm and be practical in challenging situations.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What you’ll bring with you &lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A Passion to deliver excellent patient centred care&lt;/li&gt;\n&lt;li&gt;Excellent communication skills&lt;/li&gt;\n&lt;li&gt;A caring nature&lt;/li&gt;\n&lt;li&gt;Able work as part of a team but also initiative to work independently&lt;/li&gt;\n&lt;li&gt;The ability to make decisions and use your initiative&lt;/li&gt;\n&lt;li&gt;A flexible and positive attitude&lt;/li&gt;\n&lt;li&gt;NVQ level 2 or 3 would be an advantage&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Benefits &lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Competitive Rates of pay&lt;/li&gt;\n&lt;li&gt;Free  parking&lt;/li&gt;\n&lt;li&gt;Subsidised staff restaurant&lt;/li&gt;\n&lt;li&gt;Free uniform&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;About us &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Horton Treatment Centre, located in Banbury, Oxfordshire was purpose built in 2006 and has been designed to combine an exceptional standard of patient accommodation with the technical equipment and facilities that modern medicine demands.&lt;/p&gt;\n&lt;p&gt;This Treatment Centre has a 40-bed inpatient unit, consisting of single or twin rooms and a day case facility. All rooms which have twin beds are single sex units ensuring privacy and dignity at all times. The Treatment Centre is equipped to undertake a large range of procedures, treatments and investigations.&lt;/p&gt;\n&lt;p&gt;Ramsay Health Care UK is a well-established global hospital group with over 50 years’ experience. It is well respected within the healthcare industry and is one of the leading providers of independent hospital services in England.&lt;/p&gt;\n&lt;p&gt;We love people with a positive, “can do” attitude who want to make a difference in their work. &quot;Our employees are Ramsay.&quot; The skills and commitment of our employees forms the basis for our success.&lt;/p&gt;\n&lt;p&gt;“&lt;strong&gt;The Ramsay Way&lt;/strong&gt;” culture recognises that people – staff and doctors – are Ramsay Health Care’s most important asset and this has been key to our ongoing success. Click here to find out more.&lt;/p&gt;\n&lt;p&gt;We are committed to equality of opportunity for all. This position is subject to an Enhanced DBS check.&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "Ramsay Health Care UK", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=131134"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Banbury", "postalCode": "OX16 9FG"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.0541", "longitude": "-1.33461"}}, "title": "Health Care Assistant - Theatre", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259193", "validThrough": "2020-11-20T23:59:59+0000"}