{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 pa"}}, "datePosted": "2020-10-26T16:16:21+0000", "description": "&lt;p&gt;Working at the heart of the NHS, our communications really matter. We make sure our 6,000 staff have the information they need to do their job and care for patients, and we keep the public and community updated on how to access our services.&lt;/p&gt;\n&lt;p&gt;And good communications has never been more vital than during the coronavirus pandemic.&lt;/p&gt;\n&lt;p&gt;We’re looking for a confident and curious communications manager to join our small, talented and busy team.&lt;/p&gt;\n&lt;p&gt;While this role will have a focus on internal communications, you will be working across a broad portfolio of work, and will need the skills and motivation to work across all the communications disciplines, with support from the wider team.&lt;/p&gt;\n&lt;p&gt;You’ll know how to write compelling copy, with the ability to turn complex information into clear, accessible and helpful messages for our staff and publics.&lt;/p&gt;\n&lt;p&gt;You’ll understand the communications planning process, from setting measurable communications objectives, planning tactics and actions, and evaluating outcomes.&lt;/p&gt;\n&lt;p&gt;You’ll be comfortable in the digital environment, with experience of managing an intranet, document management, and keeping up to date with technology to help deliver campaigns, messages and channels.&lt;/p&gt;\n&lt;p&gt;You’ll be able to work with staff across the trust – in varied roles and levels – creating and delivering campaigns to support the trust’s objectives and priorities.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Eilidh Murray, Assistant Director - Communications and Engagament&lt;/p&gt;\n&lt;p&gt;Email address : eilidh.murray2@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120840.jpg", "name": "East and North Hertfordshire NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120840"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Lister Hospital, Stevenage", "postalCode": "SG1 4AB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.9242", "longitude": "-.211889"}}, "title": "Communications and Engagement Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243355", "validThrough": "2020-11-09T23:59:59+0000"}