{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 pa"}}, "datePosted": "2020-11-05T14:46:22+0000", "description": "&lt;p&gt;Hampshire Hospitals NHS Foundation Trust now has an opportunity for a Biomedical Scientist within the field of Biochemistry. Our diagnostic services are on two sites, with our main automated laboratory and specialist assays based at Basingstoke and North Hampshire Hospital, Basingstoke and our essential service laboratory at Royal Hampshire County Hospital, Winchester. In addition we support 2 community hospitals and 3 independent hospitals, providing care to over 500,000 patients. The Trust also provides treatment for complex conditions including liver cancer, colorectal cancer and is a national surgical service for a rare cancer Pseudomyxoma Peritonei.&lt;/p&gt;\n&lt;p&gt;Staff will be able to work on both sites on a rotational basis to enable their career development. Staff will be encouraged to develop expertise in their areas of interest for example automation and robotics, Immunology or manual Biochemistry. The Hampshire Hospital Laboratories were accredited to ISO15189:2012 standards in 2014; and have maintained that accreditation to date.&lt;br /&gt;&lt;br /&gt;Our opportunity:&lt;br /&gt;&lt;br /&gt;Within Biochemistry we now have permanent vacancy for:&lt;br /&gt;Specialist Biomedical Scientist (Band 6) – candidates must be qualified to BSc level and have IBMS Specialist Diploma in Biochemistry applying for this band 6 position. &lt;br /&gt;We are committed to the training and development of our staff, and actively encourage staff to develop their careers , IBMS Certificate and Diplomas, external courses and management qualifications. The department is accredited as a training laboratory by the IBMS for both registration and specialist portfolios.&lt;br /&gt;&lt;br /&gt;We provide a 24/7 diagnostic service and candidates will be required to work on a shift roster covering day, evening, night, weekends and bank holiday shift.&lt;br /&gt;If you have the qualifications and experience and wish to develop your knowledge and skills in Biochemistry, we are waiting to hear from you.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameKaren HarrisonJob titleOperational Manager BNHHEmail addressKaren.Harrison@hhft.nhs.ukTelephone number01256 312119&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121094.JPG", "name": "Hampshire Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121094"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Basingstoke and North Hampshire Hospital, Basingstoke", "postalCode": "RG24 9NA"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2806", "longitude": "-1.10986"}}, "title": "Specialist BioMedical Scientist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258166", "validThrough": "2020-11-19T23:59:59+0000"}