{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 Pro rata"}}, "datePosted": "2020-10-26T14:16:10+0000", "description": "&lt;p&gt;&lt;strong&gt;Band 7 Psychologist – Development Post &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Do you have an interest in Autism and/or ADHD?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Do you want to be a valued member of a supportive team?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Do you want to continue to develop your skills and knowledge in this area?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If the answer to these is yes please read on&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We have an exciting opportunity for a Clinical Psychologist to join a dynamic service for children and young people with Neurodevelopmental disorders, providing specialist assessment and intervention in Coventry. We are seeking motivated individuals with a keen interest and experience in working with these children and young people. Your development will be supported through required training, CPD events and regular clinical supervision as well as informal support from colleagues within the team. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;You will be given the opportunity to work as part of a multidisciplinary team including Paediatricians, Speech and language Therapy, Psychiatry, Nursery Nursing and Occupational Therapy. This is a dynamic role where you may be working within community settings such as schools, clinics and family homes. The post involves assessment and intervention for children and young people with Autism, Attention Deficit Hyperactivity Disorder (ADHD) with their emotional and psychological needs and contributing to their diagnoses.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This is an exciting opportunity for you to be part of this development process in a service which has been rated as outstanding for being caring by the CQC. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This will be a development role with progression from a Band 7 to a band 8a role upon successful completion of a preceptorship programme. It is expected that this will be achievable within a period of up to two years and will be dependent on the experience of the successful candidate. In the event that elements of the preceptorship programme are not fully met the role will remain as a band 7. This will be further discussed as part of the interview process and with the preferred candidate as appropriate. Applications from newly qualified/soon to qualify clinicians would be welcomed&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;As travel is an integral part of this post, car owner/driver, or suitable alternative transport to enable you to undertake the job is essential (It is unlikely that public transport will meet this requirement). This post is subject to a Criminal Records Bureau Disclosure at ‘Enhanced’ level.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please note interviews are currently taking place through Microsoft Teams, this can be downloaded either through the App Store or Google Play for use on your phone/tablet.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further information, please contact:&lt;/p&gt;\n&lt;p&gt;Gemma Cartwright&lt;/p&gt;\n&lt;p&gt;Manager of Neurodevelopmental Services&lt;/p&gt;\n&lt;p&gt;Child and Family Services&lt;/p&gt;\n&lt;p&gt;Coventry and Warwickshire Partnership Trust&lt;/p&gt;\n&lt;p&gt;C/O The City of Coventry Health Centre&lt;/p&gt;\n&lt;p&gt;024 76961226 or gemma.cartwright@covwarkpt.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Coventry and Warwickshire Partnership Trust (CWPT)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121204"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Paybody, Coventry", "postalCode": "CV1 4FS"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4181", "longitude": "-1.49965"}}, "title": "Applied Psychologist - Band 7", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242856", "validThrough": "2020-11-15T23:59:59+0000"}