{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "73664", "minValue": "63751", "unitText": "YEAR", "value": "£63,751 - £73,664 per annum"}}, "datePosted": "2020-10-20T08:30:33+0100", "description": "&lt;p&gt;&lt;span&gt;The Blood Sciences Department of the Pathology Joint Venture in Somerset (Southwest Pathology Services) is seeking a enthusiastic candidate to take the place of a recently retired Consultant. The Chemical Pathology section within the department, in common with haematology operates a cross county service out of two acute Essential Services Laboratories in the acute hospitals at Taunton and Yeovil, and an off-site Hub laboratory in Taunton, providing a broad range of testing to the local community&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Serving a catchment population of just over 500 000, this represents .an opportunity to engage not only within the laboratory but the local health community with the Consultant Chemical Pathologist. Applications are invited from individuals who are State Registered as a ‘Clinical Scientist” with ‘Fellow of the Royal College of Pathologists’ or at least be close to being awarded this title.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;As a Consultant in Clinical Chemistry you will be offering the highest level of scientific skill and expertise over the full range of services, and advice and guidance to the laboratory staff and referring clinicians for the provision of the highest quality of service to patients. The role will be primarily based at Yeovil District Hospital, but both consultants operate from all three laboratory locations as necessary&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Participation in the out of hours Consultant on-call rota is required (telephone only).&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The post is being advertised as full-time hours but applications are invited from individuals wanting to work less hours. Please state clearly in the Supporting Information your preference regarding working hours.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Somerset is ideally located for those that enjoy a good standard of living and easy access to outdoor pursuits, with both Exmoor to the West, and access to the coast to the north and south. There are also good transport links to London and two regional airports within easy reach.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The post is being advertised by Somerset Foundation Trust who will be the employer, but the pathology service is a joint venture between Somerset Foundation Trust, Yeovil District Hospital Foundation Trust and Integrated Pathology Partnerships (part of SYNLAB UK &amp; Ireland). &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details:&lt;/p&gt;\n&lt;p&gt;for further information please contact David James - David.James@SomersetFT.nhs.uk&lt;/p&gt;\n&lt;p&gt;If you would like to discuss the application process for this role please contact Jordan Pollard, Medical Recruitment Consultant on 07765898212 or Jordan.Pollard@somersetft.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Somerset NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121360"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Yeovil District Hospital &amp; Musgrove Park Hospital, Yeovil / Taunton", "postalCode": "TA6 4RN"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.1479", "longitude": "-2.99453"}}, "title": "Consultant Clinical Biochemist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916233468", "validThrough": "2020-11-17T23:59:59+0000"}