{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "33176", "minValue": "31365", "unitText": "YEAR", "value": "£31,365/£33,176/£33,779/£37,890"}}, "datePosted": "2020-11-05T11:04:56+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;span&gt;Would you enjoy the challenge of being a Nurse for Complex Care?&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;North West Leicestershire Integrated Community Hub has 3 community nursing teams each led by a District Nurse and an opportunity has arisen for a Nurse for Complex Care. Responsible for assessment, care coordination and triage of complex patients. You will be required to support the management of complex patients who may have social or environmental issues, which complicate the ability to deliver nursing care effectively and successfully.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Evidence of clinical experience within a community setting is essential. The role will involve you working alongside the Senior Nurses for Complex Care and the District Nurses to deliver high quality care that meets the requirements of the commissioners.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will have responsibility for care quality performance and clinical activity by providing professional nursing leadership and guidance, clinical advice and management in relation to the key dimensions of health care quality:&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;• Patient safety&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;• The effectiveness of all health care interventions&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;• Patient experience and the personal qualities we are seeking.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Please note car owner and driver is essential. LPT operate 2 car schemes car leasing and car salary sacrific subject to meeting the acceptance criteria. If you currently have a lease car with another NHS organisation it may be possible to transfer the agreement to LPT.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You should have a flexible approach to ways of working and be IT literate. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We believe that by investing in our staff we deliver enhanced care to our patients. This position is pivotal in achieving this and as a consequence has considerable opportunities for innovation and job satisfaction. The teams are friendly and active, dedicated to promoting individualised care. We are highly focused not only upon the education of our team, but also on that of our patients, and their carers.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;If you require further information regarding this position please do not hesitate to contact Emma Camp, Community Services Matron 07771 772528.&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Leicestershire Partnership Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120650"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "North West Leicestershire - Coalville Health Centre", "postalCode": "LE67 3DX"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.7266", "longitude": "-1.37741"}}, "title": "Band 6 Nurse Complex Care", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257366", "validThrough": "2020-11-20T23:59:59+0000"}