{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "73664", "minValue": "63751", "unitText": "YEAR", "value": "£63,751 - £73,664"}}, "datePosted": "2020-10-27T14:47:13+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;span&gt;Consultant Clinical psychologist 8c 1.0wte UK wide, Fixed-term/NHS secondment, 18 months&lt;strong&gt;&lt;span&gt;&lt;br /&gt;&lt;/span&gt;&lt;/strong&gt;&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are pleased to advertise this unique and exciting opportunity for a Consultant Clinical Psychologist to lead a small team of psychologists in forming a bespoke Maternity Review Psychological Service (MRPS). This will be a team providing psychological input to support women and families who have come forward to the OckendenIndependentMaternity Review, which is investigating adverse maternity experiences in Shropshire and Telford and Wrekin Maternity Services.This Service is being commissioned by NHSE for an 18 month period (with review and possible extension of additional 3-6 months) and we are seeking to recruit nationally, on a fixed-term contract or through NHS secondment.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;These families’ experiences span a 40 yearperiod and so the families come in many configurations, including older adults, couples, intergenerationalgroupings, children, and also adolescents and adults with birth-related disabilities.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;The clinical model is trauma-informed and based on a psychological strength-based, consultation and intervention approach which seeks to normalise, validate and assist families in furthering their psychological understanding and enhancing their ways of coping and thriving despite these difficult and often traumatic experiences.&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;The team will work flexibly, though given the current pandemic this will be remotely where possible. &lt;/span&gt;&lt;span&gt;Several families have moved since their adverse maternity experience and so some clinical work will involve work across the UK. Hence our recruitment is on a national basis. This NHSE commissioned service is being hosted by MPFT, within the Shropshire, Telford and Wrekin Care Group and administrative, operational and professional support is built into the service specification. Although working largely remotely, you will be networked into Shropshire and Telford and Wrekin Mental Health Services, and you will be professionallysupported and have the availability of consultation space whereyour professional support is based.&lt;/span&gt;&lt;span&gt;You will also be supported and networked with psychology colleagues across the Care Group and wider Trust, which has Services across the UK.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;In stepping into this role, you will have a community focus, be trauma-informed and systemically skilled, with confidence in working flexibly across clinical specialisms and the full lifespan. You will bring outstanding leadership and understanding of the model, and the ability to skilfully support the team&#39;s formation, cohesion, shared purpose and sustenance.If this is an opportunity that excites you and you have the skills and qualities we are seeking, we warmly invite you to apply.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;We welcome NHS secondments for this opportunity and also offer as an 18 month fixed term contract. This would also provide an excellent development opportunity into Consultant working for someone with the appropriate skills and experience.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;If you would like to discuss this furtherplease contact,&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Dr Rachel Lucas (Director of Psychological Services), rachel.lucas@mpft.nhs.uk and/or &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Dr Gillian Roose (Consultant Clinical Psychologist, Lead for Psychological Practice, Shropshire, Telford and Wrekin Care Group), gillian.roose@mpft.nhs.uk&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;&lt;strong&gt;Closing date:&lt;/strong&gt; &lt;/span&gt;&lt;span&gt;18.11. 2020&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;&lt;strong&gt;Interview date:&lt;/strong&gt; &lt;/span&gt;&lt;span&gt;23.11.2020&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Midlands Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121040"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "UK wide, Shrewsbury", "postalCode": "SY1 4RQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.7275", "longitude": "-2.71977"}}, "title": "Consultant Clinical/Counselling Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245052", "validThrough": "2020-11-18T23:59:59+0000"}