{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683"}}, "datePosted": "2020-10-20T09:31:16+0100", "description": "&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Chesterfield Royal Hospital is a friendly District General Hospital with the beautiful Peak District on it’s doorstep. This post presents a great opportunity to live and work in some of the finest landscape this country has to offer.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Major cities such as Sheffield, Leeds, Nottingham and Derby are all within an hour’s train journey, and local airports include East Midlands, Manchester and Leeds Bradford, with London within a couple of hours drive.&lt;/p&gt;\n&lt;p&gt;There are excellent schools in the local area, only a few minutes from the hospital, as well as nursery childcare on-site.&lt;/p&gt;\n&lt;p&gt;Following recent investment in the team by the Trust Board our Emergency Department is looking to expand both consultant and middle grade numbers. Recruitment to these posts will support the department’s new rota which will be compliant with the latest RCEM recommended guidelines.&lt;/p&gt;\n&lt;p&gt;In the next few months Chesterfield Royal Hospital will begin an exciting re-development of it’s front door and Emergency medicine systems by building a new Urgent Care Village. An investment of over £19M doubles the geographical area of the existing ED and ncludes a new 6 bedded resuscitation room, dedicated Paediatric and Mental Health areas, improved Majors and minors facilities as well as new staff rest and education rooms. The Urgent Care Village also includes a new Paediatric Assessment Unit, improved Frailty Assessment unit and outpatient pharmacy .&lt;/p&gt;\n&lt;p&gt;With a good track record in terms of the 4 hour ED performance metric , other clinical standards and rated as Good by the CQC this is an exciting time to join our Consultant team as we grow our workforce and expand our services. This position provides a fantastic opportunity for you to help shape the future of emergency medicine in Chesterfield.&lt;/p&gt;\n&lt;p&gt;We are a close-knit, supportive and friendly organisation where each of our 4200 members of staff are valued. We strongly believe that our employees are our greatest asset and so through Listening into Action (LiA), QSIR (Quality Service Improvement and Re-design), Human Factors and our Leading the Chesterfield Way leadership framework we engage our teams and empower everyone at all levels to initiate and bring about real improvements in our care. The Emergency Department is strongly supported at trust executive level who really listen to the challenges Emergency Medicine face&lt;/p&gt;\n&lt;p&gt;As a first time or established consultant looking for a change you can be assured that Chesterfield Royal will encourage and help develop your future career. Applications will also be considered from candidates who have completed their FRCEM and are in the process of, or need to complete their QUIPP.&lt;/p&gt;\n&lt;p&gt;We can help support you in this process.&lt;/p&gt;\n&lt;p&gt;We offer flexible and part-time working opportunities and all of our staff can enjoy a range of staff benefits, including on-site parking, fitness activities, local discounts, on-site café &amp; Costa Coffee, Amazon delivery and an active health and wellbeing programme plus many more.&lt;/p&gt;\n&lt;p&gt;We value diversity and promote equality of opportunity.&lt;/p&gt;\n&lt;p&gt;Fixed term appointments can be considered.&lt;/p&gt;\n&lt;p&gt;The Trust offers generous relocation packages, and/or recruitment and retention premia for appropriate candidates. These would be discussed with successful candidates.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;If you are interested in knowing more about helping us shape the future of emergency care in Chesterfield and the surrounding areas please contact:&lt;/p&gt;\n&lt;p&gt;Dr Katherine Lendrum, ED Lead – (via ED admin officer) (01246) 516650&lt;/p&gt;\n&lt;p&gt;Mr Rashid Sohail, Acute Care Unit Clinical Director – (via ED admin officer) (01246) 516650&lt;/p&gt;\n&lt;p&gt;Dr Mansur Reza, Divisional Director - (via switchboard) (01246) 277271&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/124072.jpg", "name": "Chesterfield Royal Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=124072"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Chesterfield Royal Hospital, Calow, Chesterfield, S44 5BL, Chesterfield", "postalCode": "S44 5BL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.2362", "longitude": "-1.40008"}}, "title": "A&amp;E Consultant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916233580", "validThrough": "2020-11-17T23:59:59+0000"}