{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 £21,892 - £24,157 per annum pro"}}, "datePosted": "2020-11-06T11:30:55+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for a qualified Assistant Practitioner to join the Enhanced Primary Care team within the WREN neighbourhood based at Garstang. EPC Wyre is an integrated team of nurses, therapists, care coordinators and health and wellbeing workers providing holistic assessment, case management and support to enable patients to better manage their long term conditions.&lt;/p&gt;\n&lt;p&gt;The Assistant Practitioner role within the EPC team consists of working alongside the Community Matron undertaking duties in relation to patient care, within the community setting. Duties will be assigned by and carried out under the indirect supervision of a Registered Nurse, according to the individual patient care plan. Duties include discussion and reporting of any changes in the patient’s condition to the registered nurse on a daily basis.&lt;/p&gt;\n&lt;p&gt;Where additional skills training is identified as required by the job description, the post holder will not undertake those duties until training has been undertaken (except as part of the supervised learning experience). The Trust is committed to supporting staff to gain the necessary skills and qualifications to be able to fulfil their job role. Therefore, the post provides opportunities to develop through gaining further skills, knowledge and competencies.&lt;/p&gt;\n&lt;p&gt;You will be required to have Foundation Degree in Health and Social Care (Assistant Practitioner)&lt;/p&gt;\n&lt;p&gt;You must be a Car Driver with a car available for work.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameMonica HodgkinsonJob titleTeam LeaderEmail addressmonica.hodgkinson@nhs.netTelephone number01253 956206Additional contact information&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Blackpool Teaching Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120954"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "EPC Wyre, Garstang", "postalCode": "PR3 1PB"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8974", "longitude": "-2.78292"}}, "title": "Assistant Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259424", "validThrough": "2020-11-20T23:59:59+0000"}