{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "28988", "minValue": "26365", "unitText": "YEAR", "value": "£26,365 - £28,988 per annum incl"}}, "datePosted": "2020-11-02T11:31:58+0000", "description": "&lt;p&gt;Are you looking for a career in Pharmacy?&lt;/p&gt;\n&lt;p&gt;We are looking for enthusiastic, ambitious and motivated individuals who are keen to develop their skills to become a registered Pharmacy Technician.&lt;/p&gt;\n&lt;p&gt;Great Ormond Street Hospital offer a two year Pre-Registration Pharmacy Technician Apprentice programme. This involves practical work based learning as well as gaining underpinning knowledge through obtaining an apprenticeship. Support will be provided for development and training.&lt;/p&gt;\n&lt;p&gt;After successfully completing the two year course you will be eligible to register as a Pharmacy Technician with the General Pharmaceutical Council.&lt;/p&gt;\n&lt;p&gt;Candidates must have a &lt;strong&gt;minimum&lt;/strong&gt; of 4 GCSEs or equivalent at Grade C/Level 4 ( C ) or above and &lt;strong&gt;must&lt;/strong&gt; include Maths, English Language and Science (Double Science award or two individual Sciences e.g. biology, chemistry, physics). Certificates will need to be provided prior to interview stage in order to be verified.&lt;/p&gt;\n&lt;p&gt;Due to the funding rules of apprenticeships the hospital is able to fund an apprentice to undertake an apprenticeship at the same or lower level than a qualification they already hold, if the apprenticeship will allow the individual to acquire substantive new skills and you can show that the content of the training is materially different from any prior qualification or a previous apprenticeship.&lt;/p&gt;\n&lt;p&gt;As a Pre-registration Pharmacy Technician Apprentice you will rotate through various areas of Pharmacy including Dispensary, Medicines Management, Medicines Information, Pharmacy Manufacturing and Medicines Distribution. You will be offered a variety of experience and training across each of the four hospital sites:&lt;/p&gt;\n&lt;p&gt;Applicants should be committed, hardworking, have excellent communication skills and have a passion for pursuing a career as a Pharmacy Technician.&lt;/p&gt;\n&lt;p&gt;Interviews will take place via zoom in the first half of December.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Name Richard Goodwin Job title Principal Pharmacist for Education and Training&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Email address Richard.goodwin@gosh.nhs.uk &lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121180.png", "name": "Great Ormond Street Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121180"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Great Ormond Street Hospital, London", "postalCode": "WC1N 3JH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5222", "longitude": "-.119898"}}, "title": "Preregistration Pharmacy Technician", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251802", "validThrough": "2020-11-16T23:59:59+0000"}