{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum pro rata"}}, "datePosted": "2020-11-05T12:45:57+0000", "description": "&lt;p&gt;&lt;strong&gt;PREVIOUS APPLICANTS NEED NOT APPLY&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Oxford University Hospitals NHS Trust is one of the largest NHS teaching trusts in the country. It provides a wide range of general and specialist clinical services and is a base for medical education, training and research. &lt;br /&gt;&lt;br /&gt;The Trust comprises of four hospitals - the John Radcliffe Hospital, Churchill Hospital and Nuffield Orthopaedic Centre in Headington and the Horton Hospital in Banbury. As part of your role you will be expected to be able to go to all four sites as the service requires.&lt;/p&gt;\n&lt;p&gt;Bereavement Services are looking to appoint a Bereavement Officer to work in the Bereavement Office based in the John Radcliffe Hospital. The successful applicant will be a people person - caring, methodical , calm under pressure, IT literate, able to cope with change in demands and most importantly a team player. As part of your role you will be expected to be able to go to all four sites as the service requires.&lt;/p&gt;\n&lt;p&gt;Good interpersonal and telephone skills are essential as the job involves daily contact with anxious bereaved families, funeral directors, and the Coroner’s office.&lt;/p&gt;\n&lt;p&gt;The office is very busy, mentally taxing and sometimes emotionally demanding.&lt;/p&gt;\n&lt;p&gt;The successful candidate will need a good eye for detail and accurate record keeping. The successful applicant will work closely with the Medical Examiners Coroner’s and Registrar’s offices to ensure that statutory and mandatory paperwork is completed correctly , ensuring that bereaved families are given a service of compassionate excellence.&lt;/p&gt;\n&lt;p&gt;This is a role that may be of interest to persons with a diploma or degree in professional nursing studies.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;The duties include using a computerised system to book burials/cremations and the accurate completion of statutory records.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Good literacy, numeracy and keyboarding skills are essential. Applicants need to be well organised, logical and able to cope with and understand people’s emotions at one of the most stressful times I n a person’s life. You will need to be competent to work on your own as well as enjoy being part of a team&lt;/p&gt;\n&lt;p&gt;When working at the Horton Hospital in Banbury you will also be expected to release the deceased to the Funeral directors (after full training) and facilitate a viewing for the family if appropriate.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing Date: 26th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Planned Interview Date: tba&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Gaynor Parsons on 01865 (5)72688 or email gaynor.parsons@ouh.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Oxford University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120889"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Oxford University Hospitals NHS FT All sites, Oxford", "postalCode": "OX3 9DU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7639", "longitude": "-1.21979"}}, "title": "Bereavement Officer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257700", "validThrough": "2020-11-26T23:59:59+0000"}