{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum"}}, "datePosted": "2020-10-30T15:16:02+0000", "description": "&lt;p&gt;We require a dynamic and enthusiastic Consultant Radiologist with a special interest in symptomatic Breast and Cross Sectional Imaging to join our team of 23 Consultant Radiologists. The appointee will be based at either Eastbourne DGH or Conquest Hospital Hastings dependent on service need.&lt;/p&gt;\n&lt;p&gt;Applicants should demonstrate a high level of clinical experience and competence in Breast Radiology.&lt;/p&gt;\n&lt;p&gt;Our Department provides a symptomatic Breast service, family history screening service and supports the NHS BSP. The trust sees over 400 breast cancer cases per year. We are currently developing a dedicated breast unit at both hospitals to upgrade the One-Stop service. A new GE senographe Pristina has been installed at Eastbourne with a new Pristina due for installation at Conquest in the next 2 months.&lt;/p&gt;\n&lt;p&gt;We are developing a new stereotactic biopsy service and wish to introduce digital &lt;em&gt;breast&lt;/em&gt; tomosynthesis. Expertise in these techniques would therefore be favourable.&lt;/p&gt;\n&lt;p&gt;East Sussex Healthcare Trust has a high quality stock of imaging Equipment including a 320 slice Toshiba Aquilion One, GE Revolution and Evolution CT machines, 2x MRI Siemens Avanto 1.5T, Siemens Artis Interventional Suite, Siemens Symbiat 16 SPECT-CT and an ongoing rolling equipment replacement and expansion programme.&lt;/p&gt;\n&lt;p&gt;First line on call is provided by SpR or staff grade radiologists until 10pm weekdays and 5pm weekends with on call outsourced to a reporting company overnight. Our General Radiology consultant team is responsible for checking SpR scans the following day to ensure quality assurance and education on a 1 in 8 rota. This rota also covers Malignant cord compression MRI at weekends.&lt;/p&gt;\n&lt;p&gt;The Radiology Departments are actively involved in teaching with four radiology trainees on rotation from HEKSS deanery. Audit and other continuing professional developmental activities are positively encouraged.&lt;/p&gt;\n&lt;p&gt;This post will be offered on the Terms and Conditions in line with national pay scales. Applicants must have full GMC registration, be on the Specialist Register or be within six months of gaining CCT.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;AAC Panel date: TBC&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDr Justin HarrisJob titleDeputy Chief of Division (Diagnostics, Anesthetics and Surgery)Telephone number03001314843&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120634.jpg", "name": "East Sussex Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120634"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Conquest Hospital or Eastbourne DGH, Eastbourne/Hastings", "postalCode": "TN37 7RD"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8854", "longitude": ".567737"}}, "title": "Consultant Radiologist with a special interest in Breast Radiology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250705", "validThrough": "2020-11-17T23:59:59+0000"}