{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "112845", "minValue": "84258", "unitText": "YEAR", "value": "£84,258 - £112,845 per annum, inc London Weighting"}}, "datePosted": "2020-10-28T17:15:56+0000", "description": "&lt;p&gt;King’s College Hospital NHS Foundation Trust part of King&#39;s Health Partners Academic Health Sciences Centre (AHSC), is one of the UK’s largest and busiest teaching hospitals with a turnover of nearly £1 billion, 1.5 million patient contacts a year and more than 12,600 staff based across 5 main sites in South East London and Kent.&lt;/p&gt;\n&lt;p&gt;The Trust provides a full range of local hospital services across its different sites, and specialist services from King’s College Hospital (KCH) site in Camberwell and the Princess Royal University Hospital (PRUH) site in Bromley, Orpington Hospital, and some services at Beckenham Beacon and Queen Mary’s Sidcup.&lt;/p&gt;\n&lt;p&gt;The Trust is recognised internationally for its work in liver disease and transplantation, neurosciences, cardiac, haemato-oncology, fetal medicine, stroke, major trauma, and Emergency Department.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Applicants are invited for the post of Locum Consultant General Paediatrician at King’s College Hospital NHS Foundation Trust, London. This is a new 5 month fixed term post with an immediate start date of November 2020.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be expected to support the established team in continuing to provide a high quality service over the winter period. This includes maintaining the targets for Internal Professional Standards and reducing the breach performance. The remit of the post-holder will be to work within the multi–disciplinary team providing and further developing care for Children/Young People from the Child Health services.&lt;/p&gt;\n&lt;p&gt;There is a commitment to undertake routine job planned work on evenings and weekends as part of the total job planned PAs. There is also an overnight on call commitment.&lt;/p&gt;\n&lt;p&gt;In 2013-14 King’s College Hospital acquired new sites, namely Princess Royal University Hospital, Orpington Hospital and and associated services from South London Healthcare Trust. King’s College Hospital NHS Foundation Trust is part of the King’s Health Partners Health Science Centre (AHSC) which is a pioneering collaboration between King’s College London, Guy’s and St Thomas’, King’s College Hospital and South London and Maudsley NHS Foundation Trusts. This unique combination brings together one of the world’s leading research-led universities and three of London’s most successful NHS Foundation Trusts.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameHannah BaynesJob titleClinical Lead, General PaediatricsEmail addresshannahbaynes1@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "King's College Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120921"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Denmark Hill, London", "postalCode": "SE5 9RS"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4684", "longitude": "-.09228"}}, "title": "Locum General Paediatric Consultant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247483", "validThrough": "2020-11-11T23:59:59+0000"}