{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "39681", "minValue": "32933", "unitText": "YEAR", "value": "£32,933 - £39,681 per annum, incl HCAS"}}, "datePosted": "2020-10-24T08:14:12+0100", "description": "&lt;h2&gt;Junior Sister/Charge Nurse - Coronary Care Unit&lt;/h2&gt;\n&lt;p&gt;&lt;strong&gt;Band 6: £32,933 - £39,681 per annum, incl HCAS&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Full Time/Permanent (part time may be considered)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Are you passionate about cardiology?&lt;/p&gt;\n&lt;p&gt;Do you want to make a difference to your community?&lt;/p&gt;\n&lt;p&gt;Are you motivated and have the drive to be a band 6 Sister within Cardiology?&lt;/p&gt;\n&lt;p&gt;Do you want to learn new skills?&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Then we are looking for You!!!!!!&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Coronary Care Unit at the Royal Surrey is seeking to recruit a band 6 Junior Sister.&lt;/p&gt;\n&lt;p&gt;The successful candidate will provide clinical expertise to patients undergoing procedures carried out within CCU, Cardiac Angiography Suite and HASTE wing. The candidate will work within the Coronary care unit as well as diagnostics leading to great self-development of skills ready for your revalidation.&lt;/p&gt;\n&lt;p&gt;As a band 6 you will receive training in all of the diagnostics however previous experience is advantageous. A good understanding and demonstration of ECG knowledge will be required to undertake this position.&lt;/p&gt;\n&lt;p&gt;The Coronary care unit provides initial and ongoing specialist care for patients with acute and chronic cardiac conditions. We provide care for patients undergoing ultrafiltration, temporary pacing, cardioversions, dobutamine stress Echo’s, myocardial perfusion scans, cardiac catheterisation and a range of pacemakers to name but a few of our services.&lt;/p&gt;\n&lt;p&gt;Our dedicated cardiac speciality nurses and cardiology team are always available to support and offer advice with their wealth of experience and knowledge.&lt;/p&gt;\n&lt;p&gt;If you are seeking this exciting opportunity to work in a challenging and dynamic environment with an enthusiastic team, &lt;strong&gt;please contact Khelvin Jocson (Senior Charge Nurse) and Noemi FIndlay, Senior Sister for Coronary Care on Ext 4016 or Julia Titchen (Medical Matron) on Ext 6306.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you would like an informal visit please do not hesitate to call and arrange a time for a walk round all of our services.&lt;/p&gt;\n&lt;p&gt;We look forward to hearing from you&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120970.jpg", "name": "Royal Surrey NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120970"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Guildford, Surrey", "postalCode": "GU2 7XX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.241", "longitude": "-.607442"}}, "title": "Junior Sister/Charge Nurse - Band 6 - CCU", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241536", "validThrough": "2020-11-08T23:59:59+0000"}