{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "58558", "minValue": "52643", "unitText": "YEAR", "value": "£52,643 - £58,558 per annum inc HCAS"}}, "datePosted": "2020-10-27T17:01:08+0000", "description": "&lt;p&gt;&lt;span&gt;&lt;strong&gt;Innovation Manager&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;18 months Fixed-term due to funding &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We&#39;re looking for a passionate, values-driven Innovation Manager to work across a complex set of relationships, challenges, and innovations to contribute to service transformation at Imperial College Health Partners. You will be able to think laterally, build strong trusted relationships quickly, and work as a productive team member. You will bring an appetite for analytics, evidence, and learning in everything you do and have an ability to understand new subjects rapidly.&lt;/p&gt;\n&lt;p&gt;Imperial College Health Partners (ICHP) is seeking candidates with an interest in healthcare to join our growing Strategy directorate.&lt;/p&gt;\n&lt;p&gt;ICHP is a partnership organisation bringing together NHS providers of healthcare services, clinical commissioning groups and leading universities across North West London. We have been designated by NHS England as the Academic Health Science Network (AHSN) for North West London, and we are one of 15 AHSNs across England which make up The AHSN Network.&lt;/p&gt;\n&lt;p&gt;At ICHP we believe that innovation can be a powerful trigger to create new ways of working.&lt;/p&gt;\n&lt;p&gt;Through working with world leading hospitals, community providers, commissioners and universities, we match health challenges with new innovations. This helps our partners provide the best possible health and care outcomes for North West London’s 2.3 million residents.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Our strategic priorities are to:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Innovate and collaborate for a healthier population making a real measurable impact; and&lt;/li&gt;\n&lt;li&gt;Diversify our customer base in order to broaden our income sources and work where we can have the largest impact.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Our organisation has a range of talents and experiences, bringing knowledge, skills and experience to the way we connect with our stakeholders.&lt;/p&gt;\n&lt;p&gt;At a time where collaboration and innovation are crucial to help meet some of healthcare’s most pressing challenges, there has never been a better time to join us.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Innovation Managers work across a complex set of relationships, challenges, and innovations to contribute to service transformation at Imperial College Health Partners.&lt;/p&gt;\n&lt;p&gt;You will be able to think laterally, build strong trusted relationships quickly, and work as a productive team member. You will bring an appetite for analytics, evidence, and learning in everything you do and have an ability to understand new subjects rapidly.&lt;/p&gt;\n&lt;p&gt;You will be expected to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Role model behaviours&lt;/strong&gt; that live our organisational values of collaboration, courage, quality, and impact, and &lt;strong&gt;encourage similar behaviours in colleagues and line reports&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;Show a commitment to learning, self-reflection, appraisal, and development, including undertaking a Personal Development Plan annually; &lt;strong&gt;and support direct reports to undertake a similar process.&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;Operate in an environment of significant complexity and ambiguity, taking time to understand the context of the operating environment and demonstrating good judgement (including seeking counsel from other when needed); &lt;strong&gt;and offer support and guidance for others seeking advice&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;Exhibit a curiosity about the work going on across the organisation, and share with others, internally and externally, impactful work that ICHP supports to enable innovation and resolve complex problems&lt;/li&gt;\n&lt;li&gt;Actively seek to participate in available project opportunities, with an approximate expectation of being involved in project work for up to 70-75% of your time, and working on several projects at any one time (with a mix of longer-term and shorter-term projects).&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Key responsibilities include:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Leading on several external projects at one time&lt;/li&gt;\n&lt;li&gt;Being responsible for shaping and overseeing projects&lt;/li&gt;\n&lt;li&gt;Working to clarify the problem that our work is trying to solve&lt;/li&gt;\n&lt;li&gt;Applying recognised methods of issues analysis and problem definition&lt;/li&gt;\n&lt;li&gt;Play a lead role in the development of project plans&lt;/li&gt;\n&lt;li&gt;Determine the planning of appropriate tasks within the project&lt;/li&gt;\n&lt;li&gt;Selecting appropriate methods of research to address the defined problem&lt;/li&gt;\n&lt;li&gt;Ensuring that research approaches are appropriately rigorous and systematic&lt;/li&gt;\n&lt;li&gt;Keeping an overview of the project and ensuring that progress on your own tasks, and those of others&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Interviews will be held in the week commencing 23 November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Abeer Itrakjy, Innovation Lead&lt;/p&gt;\n&lt;p&gt;abeer.itrakjy@imperialcollegehealthpartners.com&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121244.png", "name": "Chelsea and Westminster Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121244"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Imperial College Health Partners, London", "postalCode": "NW1 2FB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5265", "longitude": "-.13467"}}, "title": "Innovation Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245524", "validThrough": "2020-11-10T23:59:59+0000"}