{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 pa"}}, "datePosted": "2020-10-26T16:30:42+0000", "description": "&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;To provide IT innovation to meet all immediate needs and providing a platform to facilitate the goals and aspirations of the ‘One Bridgewater’ vision.  Additionally 3rd line support, resolving escalated IM&amp;T incidents, across multiple platforms often interfacing directly with 3rd party vendors and key stakeholders to ensure the full operability of systems and services used by staff of the Bridgewater Community Healthcare NHS Trust. &lt;/p&gt;\n&lt;p&gt;Feasibility, cost advice; initiation and delivery of IT projects.  Ensuring good governance and that ITIL based practices are adhered to throughout culminating in the required document sets being produced to support the Trust’s auditing and Information Governance compliance requirements.&lt;/p&gt;\n&lt;p&gt;Planning through fully understanding the developing needs of the Trust and ensuring a commensurate technical roadmap is adopted and any investment such as hardware, infrastructure and/or licensing is procured accurately and at the best price point for the trust.  But, also be able to provide tactical solutions flexibly and cohesively adapting to the changing needs of the Trust providing innovative and dynamic solutions to meet emerging needs. &lt;/p&gt;\n&lt;p&gt;Supplying information and guidance particularly where Business Continuity recovery invocation is concerned.  Additionally configuring and maintaining the new private cloud hosting solution ensuring best possible Recovery Time/Recovery Point Objectives enabling ‘best of breed’ driven Service SLAs to be generated and committed to.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;strong&gt;What we offer&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We offer a great package with inclusion in the following benefits to name but a few:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;NHS Pension Scheme&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Up to 6 weeks annual leave with the opportunity to purchase an additional 4 weeks annual leave &lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Access to a Staff Health &amp; Wellbeing Hub which offers advice, support and schemes including Occupational Health services which include self-referral access to medical assessment facilities, Physiotherapy and a Counselling Helpline service which can be accessed 24 hours a day, 7 days a week &lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Staff Salary Sacrifice Scheme including a Childcare Vouchers Scheme&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;A to Z list of staff benefits and discounts &lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Opportunities to join our Staff Champions and Staff Engagement Group&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Optional Annual Health Checks, Flu Vaccines and Healthy Lifestyle Initiatives&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Special leave provisions, including some over and above statutory entitlements&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Flexible working options to help staff achieve a work/life balance&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please ensure that you read the Job Description which also includes the person specification before applying for this post.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For an informal chat or further information regarding this post please contact:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please note:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If the advertised post requires a DBS check the successful candidate will incur the cost of the DBS check which will be taken in three equal monthly instalments from salary.&lt;/p&gt;\n&lt;p&gt;We advise that you complete and submit your application form as soon as possible, because should we experience a high level of interest in the post it may be closed early.&lt;/p&gt;\n&lt;p&gt;Any applicant who applies for a position online will be contacted thereafter using the email address provided upon login. Please ensure that after application you check your emails often to ensure that you do not miss any communications from Bridgewater Community Healthcare NHS Foundation Trust.&lt;/p&gt;\n&lt;p&gt; &lt;strong&gt;Bridgewater is an equal opportunities employer: &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We value and respect the diversity of our employees and aim to recruit a workforce that reflects our local communities, we therefore welcome applications from everyone with the necessary attributes for the job, irrespective of age, disability, gender/gender identity, sexual orientation, ethnicity, religious belief or other personal circumstance. We are committed to improving the working lives of our employees and we have an active flexible working policy and welcome applications for job share and flexible working. An interview is guaranteed to any applicant with a disability who meets the essential criteria of the person specification. If you require any reasonable adjustments to the application process please contact the Recruiting Manager for this post.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Bridgewater Community Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121090"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Warrington", "postalCode": "WA3 7PG"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4141", "longitude": "-2.52651"}}, "title": "Infrastructure Engineer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243416", "validThrough": "2020-11-15T23:59:59+0000"}