{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 + 5% HCAS pa"}}, "datePosted": "2020-11-06T13:45:14+0000", "description": "&lt;p&gt;We are looking for a keen and motivated Occupational Therapist to join our thriving multidisciplinary team with a focus on helping people to ‘live well for longer’.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Do you want an exciting and new challenge? Do you want to work within our rehabilitation services based at the Caterham Dene Hospital&lt;/p&gt;\n&lt;p&gt;We provide specialist multidisciplinary services to patients following trauma, illness or injury to maximise function, prevent deterioration and ensure safe discharge. &lt;/p&gt;\n&lt;p&gt;All post holders will work across the rehabilitation services in hospital and the community beds to provide a 7 day service.&lt;/p&gt;\n&lt;p&gt;In joining our team you will be influential in supporting our patient’s rehabilitation with a strong focus on maximising function, prevention of deconditioning, education and prevention and lifestyle advice.&lt;/p&gt;\n&lt;p&gt;You will be required to deliver:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Expert clinical management for patients with complex health and rehabilitation needs, who are at risk of deteriorating quality of life.&lt;/li&gt;\n&lt;li&gt;Professional and accountable leadership ensuring positive outcomes and quality care for patients and staff.&lt;/li&gt;\n&lt;li&gt;Liaison with other health, social and community services to ensure continuity of care on discharge.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will be working with the multidisciplinary team in our bed based care settings, which include a community hospital and local private nursing homes. The team is made up of experienced Nurses, Therapists, Associate Practitioners and Rehabilitation and Care Assistants. You will be assisting in preventing unnecessary admissions to hospital and facilitating early discharges through comprehensive, effective and timely intervention.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will be able to assess for and deliver a range of Occupational Therapy treatment options for a variety of patients who may have complex, long-term conditions. You will be able to use your generic skills to clinically monitor the patient and promote holistic recovery and discharge planning.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will provide professional leadership for designated junior staff including Rehabilitation Assistants and Associate Practitioners and will have a role in the operational leadership of the wider Therapy / multidisciplinary team.&lt;/p&gt;\n&lt;p&gt;Regular clinical supervision and learning and development opportunities will be available.&lt;/p&gt;\n&lt;p&gt;Current HCPC registration and excellent Occupational Therapy and communication skills are essential, clear communication with patients, relatives and other health and social care professionals.&lt;/p&gt;\n&lt;p&gt;Please ring us for an informal discussion&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/126974.jpg", "name": "First Community Health and Care", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126974"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Caterham Dene Hospital", "postalCode": "CR3 5RA"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2841", "longitude": "-.085553"}}, "title": "Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259959", "validThrough": "2020-11-20T23:59:59+0000"}