{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 PA"}}, "datePosted": "2020-11-06T11:16:10+0000", "description": "&lt;p&gt;&lt;strong&gt;Senior Physiotherapist Temporary Respiratory Rotational Post &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Have you had good experience across a range of specialties at Band 5 level and want new challenges? Are you looking for a change of scene to widen your experience? Would you like to develop your leadership and teaching skills alongside growth of your clinical ability? If so, come and join the Therapies team at the University Hospital of North Midlands NHS Trust. We are looking for an enthusiastic therapist with strong clinical and team working skills, who has a positive and resilient outlook who is able to embrace the challenges and opportunities of working in a large acute trust.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Therapies Team at UHNM are looking for a Senior Physiotherapist to work within respiratory rotations over a 12 month temporary basis. This is a rotational experience in Critical Care, Paediatrics, Surgical Wards &amp; SSCU, Medicine including NIV, Emergency Therapy Team which includes Accident &amp; Emergency and Acute Assessment Unit, Frail Elderly, Cystic Fibrosis and Cardiothoracics.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Applicants will need to have on-call competencies and be experienced in working in a variety of respiratory areas within an NHS setting.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The post offers the opportunity to work in an exciting University Hospital. The hospital is a regional centre for Cystic Fibrosis, Non-Invasive Ventilation, Neurosurgery and Cardiothoracic Surgery. The University Hospital of North Midlands has a large Critical Care Unit and Paediatric Critical Care Unit.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This experience will give the post holder an excellent opportunity to develop their leadership and management skills as well as building clinical expertise that will enhance and broaden their clinical skills. Supervision will be provided by the Band 7 Therapists and Principle Therapists and continuous development is supported through appraisal, internal training and external learning.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The University Hospital of North Midlands is located on 2 hospital sites and the post works within a 7 day shift system which will include weekend, late shift, Bank Holiday and on call working.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameJane TeasdaleJob titleTherapies Divisional ManagerEmail addressJane.teasdale@uhnm.nhs.ukTelephone number01782675341Additional contact information&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University Hospitals of North Midlands NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122653"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Stoke", "postalCode": "ST4 6QG"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.004", "longitude": "-2.21487"}}, "title": "Senior Physiotherapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259381", "validThrough": "2020-11-22T23:59:59+0000"}