{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890"}}, "datePosted": "2020-10-23T08:16:36+0100", "description": "&lt;p&gt;&lt;strong&gt;Hours: 37.5 per week&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for an experienced DXA reporting radiographer to join the imaging team at Salford Care Organisation. We are looking for an enthusiastic, patient focused, progressive radiographer who is a good team player and is able to demonstrate excellent interpersonal, and communication skills.&lt;/p&gt;\n&lt;p&gt;Previous experience of DXA reporting is essential in addition to completion of either in-house training or a PgCert in Bone Densitometry Reporting.&lt;/p&gt;\n&lt;p&gt;We currently have one DXA scanner at Salford which is utilised for six lists a week. In the future, the NCA are hoping to further develop links between DXA services at both Pennine and SRFT sites and the postholder would be asked to contribute to these discussions.&lt;/p&gt;\n&lt;p&gt;As well as reporting commitments you would be required to carry out DXA scan lists and work within the wider radiology department. The postholder’s wider clinical rotation outside of the DXA service is flexible and would be discussed with the applicant upon application but the department would be able to accommodate radiographers with skills in single or multiple modalities. Participation with the on-call/nightshift service would also be required.&lt;/p&gt;\n&lt;p&gt;Radiology at Salford royal is entering an exciting time with new multiple scanner installations and expanding services. We have 3 new MR scanners being installed (3T Philips Elition, and two 1.5T Philips Ambition scanners) to add to our existing 1.5T Siemens and 1.5T GE scanner, plus a new GE Revolution Evo CT scanner (first in the UK with AI technology) to complement the 2 existing GE 64 Lightspeed and a Canon 64 Acquilion Prime SP scanner. Our Interventional Radiology suite has Canon (Toshiba) Biplane and single plane unit and is looking to expand with a second Bi-plane unit. Our IR suite provides cutting edge treatments, such as intra-arterial thrombectomy, neurovascular procedures and supports the Major Trauma Centre, acute stroke services and neurosciences. These services will be complemented by a brand new PACS due for installation late November 2020.&lt;/p&gt;\n&lt;p&gt;Salford Royal has been rated an Outstanding Trust once again! – Salford Royal is the first Acute and Community Trust to be rated ‘Outstanding’ in consecutive inspections by the CQC and we want you to help us continue to deliver this outstanding care for our patients. You will be joining a friendly and supportive team of radiographers and we would welcome your application.&lt;/p&gt;\n&lt;p&gt;In line with the Trust’s Single Equality Scheme we welcome applications from everyone irrespective of ethnic origin, disability, age, gender, gender identity, sexual orientation, disability, nationality, religion, marital status, social back ground or trade union membership.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Alex Wain&lt;br /&gt;Clinical Tutor&lt;br /&gt;alexandra.wain@srft.nhs.uk&lt;br /&gt;0161 2064905&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121715.jpg", "name": "Salford Royal NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121715"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Salford Care Organisation, Salford", "postalCode": "M6 8HD"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4876", "longitude": "-2.32342"}}, "title": "DXA Reporting Radiographer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916239652", "validThrough": "2020-11-06T23:59:59+0000"}