{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24907", "minValue": "24907", "unitText": "YEAR", "value": "From £24,907 per annum"}}, "datePosted": "2020-10-06T11:16:01+0100", "description": "&lt;p&gt;&lt;strong&gt;Amblescroft North&lt;/strong&gt; is a 20 bedded mixed gender older adult ward that cares for individuals experiencing mental illness of a functional nature. Working as an integral part of the multi-disciplinary team collaboratively with other professionals such as Occupational Therapy, Physiotherapy, and Medical staff, Social Care and community teams enables the service user to have a holistic journey to recovery.&lt;/p&gt;\n&lt;p&gt;You will need to have a demonstrable interest in caring for this complex and vulnerable service user group, supporting the recovery and future of older persons. An appropriate knowledge, skills set and commitment will underpin a strong interest in this work. Opportunities are available for both experienced and newly qualified Registered Mental Health Nurses – the ward is in a position to offer a comprehensive and robust Preceptorship programme where you will have the opportunity to develop skills and knowledge already established through your training qualification in both mental health and physical health care.&lt;/p&gt;\n&lt;p&gt;Support and supervision for all staff is a fundamental part of the culture of the ward and individuals are actively encouraged to seek out further learning opportunities alongside established training. All staff within Amblescroft North are part of a respectful, flexible, hard-working, welcoming and collaborative team; why wouldn’t you want to join us…..??&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact: Sarah Harding, Ward Manager on sarah.harding5@nhs.net or &lt;span&gt;01722 820198&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121159.jpg", "name": "Avon and Wiltshire Mental Health Partnership NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121159"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Fountain Way, Salisbury", "postalCode": "SP2 7FD"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.0717", "longitude": "-1.80907"}}, "title": "Band 5 Staff Nurse - Amblescroft North - Fountain Way, Salisbury", "url": "https://www.jobs.nhs.uk/xi/vacancy/916214406", "validThrough": "2020-11-19T23:59:59+0000"}