{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-11-04T10:16:10+0000", "description": "&lt;p&gt;An exciting opportunity has arisen within CWP NHS Foundation Trust to join the Liaison Psychiatry Team based at the Macclesfield District General Hospital.&lt;/p&gt;\n&lt;p&gt;The Liaison Psychiatry Service delivers comprehensive mental health assessments, brief intervention, care planning and signposting/referral for patients who present to the A&amp;E department or who have been admitted to hospital.&lt;/p&gt;\n&lt;p&gt;We work to address the mental health needs of people receiving physical health treatment in the acute setting for people aged 16 years and upwards. Common presentations include deliberate self-harm, depression, dementia, alcohol misuse and psychosis. We assess people in the Emergency Department (ED) and from any ward/medical specialty across the hospital. Due to the nature of acute care medicine, urgent care and ED pressures the work is diverse, fast paced and clinically rich.&lt;/p&gt;\n&lt;p&gt;Post holders will provide prompt response for assessments and assisting to treatment delivery within the ED 4-hour targets and NHS England response times. The liaison role is also to support the education and training of acute care staff around mental health issues, DOLS, Mental Capacity Act &amp; the Mental Health Act.&lt;/p&gt;\n&lt;p&gt;The service is 24 hours a day and seven days a week and the successful candidate will be expected to be able to work night shifts and weekends. Current shift patterns are 0800-1800/ 1100-2100 4 days a week. Night shifts are 2030-0900.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Lucy Taylor Clinical Lead Email address lucy.taylor24@nhs.net Telephone number 01625 712091&lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;Team Manager contact - Andrew Pulford, email a.pulford@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Cheshire and Wirral Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121132"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Joscelyn Solly House, Macclesfield", "postalCode": "SK10 3JE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.2638", "longitude": "-2.1525"}}, "title": "Liaison Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255336", "validThrough": "2020-11-18T23:59:59+0000"}