{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37500", "minValue": "37500", "unitText": "YEAR", "value": "up to £37,500 per annum DOE"}}, "datePosted": "2020-11-05T11:06:19+0000", "description": "&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;I help to make a difference!&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Are you collaborative, caring and compassionate?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Prisons are one of the most challenging, yet rewarding places for healthcare professionals to work - if you’re looking for a role where you can develop your existing skills and learn something new every day, then this is the place to be.&lt;br /&gt; &lt;br /&gt; Practice Plus Group are Health in Justice Market leader, providing healthcare services to offenders across the country. Our model of care is our Wellbeing Approach – an integrated, comprehensive approach in recognition of the fact prisoners are a socially-excluded group with healthcare needs which are complex and often associated with poor outcomes. It adopts the premise no single health/wellbeing factor can be taken in isolation of other motivational issues which might impact a person’s care.&lt;br /&gt; &lt;br /&gt; To ensure the continued quality of care at HMP Stocken, we’re looking for a Senior Mental Health Practitioner to support us and the existing team.&lt;br /&gt; &lt;br /&gt; &lt;br /&gt; &lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Interested in clinical development?&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We could give you the opportunity to develop in to a specialist role of your interest and benefit to the service i.e. CBT, ANP, BBV, sexual health, ILS (intermediate life support), health promotion, RCGP and long term condition.&lt;br /&gt; &lt;br /&gt; &lt;br /&gt; &lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;In return for your hard work you will...&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt; Receive an annual salary of up to £37,500 - depending on experience, pro rota. You&#39;ll also get a number of benefits including a company contributory pension scheme, 25 days annual leave plus 8 public bank holidays plus CPD and re-validation support. Other benefits include cycle to work scheme plus training and clinical development opportunities.&lt;br /&gt; &lt;br /&gt; &lt;br /&gt; &lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;What do we need from you so you can do the job?&lt;/span&gt;&lt;/strong&gt;&lt;br /&gt; &lt;br /&gt; You will either be a Registered Mental Health Nurse/ Social Worker/ Occupational Therapist, or hold membership with BABCP/BACP/ UKCP.You’ll have a flexible approach working within a team that encourage new ideas and opinions on how to improve the service.&lt;br /&gt; &lt;br /&gt; You should possess a good working knowledge of conducting risk assessments and care planning as well as someone who is creative and forward thinking to work through the issues that may arise in this challenging but exciting environment. Knowledge in therapeutic interventions such as CBT or Steps to Wellbeing are desirable but transferable clinical skills will be considered with appropriate training provided.&lt;br /&gt; &lt;br /&gt; As a Senior Practitioner you will work as part of an integrated healthcare team, utilising your clinical expertise, decision making and problem solving skills to provide skilled and evidence based nursing care for patients in the prison. You will work within your scope of practice, in accordance with Practice Plus Group and prison service policies.&lt;br /&gt; &lt;br /&gt; If you are self-motivated and able to work autonomously as well as showing plenty of initiative when it comes to handling a wide range of situations, then this could be the right role for you!&lt;br /&gt; &lt;br /&gt; &lt;br /&gt; &lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Next steps&lt;/span&gt;&lt;/strong&gt;&lt;em&gt;&lt;br /&gt; &lt;/em&gt;&lt;br /&gt; If you are shortlisted, you will be contacted by the Internal Recruiter for this role. The recruiter will submit your CV to the hiring manager and in turn Basanti will arrange an interview for you to attend if the hiring manager feels that you are suitable for the job.&lt;br /&gt; &lt;br /&gt; &lt;br /&gt; &lt;br /&gt; &lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;More information&lt;/span&gt;&lt;/strong&gt;&lt;em&gt;&lt;br /&gt; &lt;/em&gt;&lt;br /&gt;This is a permanent role working between 30 - 37.5 hours per week. The salary for this role is up to £37,500 - dependent on experience.&lt;br /&gt; &lt;br /&gt; Please note that offers of employment are subject to Practice Plus Group Terms &amp; Conditions and receipt of satisfactory references, an enhanced DBS check and prison vetting.&lt;br /&gt; &lt;br /&gt;&lt;strong&gt; At Practice Plus Group we actively promote diversity and equal opportunities.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Practice Plus Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130136"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Oakham", "postalCode": "LE15 7RD"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.7459", "longitude": "-.581807"}}, "title": "Senior Mental Health Practitioner- HMP Stocken", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257371", "validThrough": "2020-11-19T23:59:59+0000"}