{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 pa pr"}}, "datePosted": "2020-11-02T11:45:23+0000", "description": "&lt;p&gt;Project Support Officer Band 5 - 22.5 hours fixed term post for 6 months&lt;/p&gt;\n&lt;p&gt;Come and work with us! Are you interested in improvement, culture and promoting equality of opportunity and inclusion? This might be the job for you. We are recruiting to the role of Programme Support Officer to work within our Improvement &amp; Culture, and Equality, Diversity, Inclusion and Participation teams - it’s an exciting journey to be a part of!&lt;/p&gt;\n&lt;p&gt;We are looking for a passionate person who works well in a team environment, is highly motivated and committed and who can lead on delegated programmes of work from initiation, through planning and delivery, to evaluation and identified learning.&lt;/p&gt;\n&lt;p&gt;Our role is to support our staff, teams and the organisation as a whole to make meaningful changes that bring about improvements, ultimately for the benefit of our patients, staff and the organisation. Our team are strong advocates for empowering and supporting our staff and engagement is a key part of what we do. The team have a brilliant scope for creativity and unblocking the way to support people to make the changes that matter to everyone.&lt;/p&gt;\n&lt;p&gt;Our team has an exciting remit and incorporates Quality Improvement, Cultural Development (which is all about our people), Freedom to Speak Up and Equality, Diversity, Inclusion and Participation. We can offer variety as well as excellent opportunities for development; it is definitely an exciting time to come on board!&lt;/p&gt;\n&lt;p&gt;Your role would involve working as a Programme Support Officer within the Trust’s improvement portfolio, under the direction, leadership and management of the Head of Improvement and Culture and the Head of Equality, Diversity, Inclusion and Participation. The post holder will be responsible for delivery across the portfolio as directed for various strands of improvement and OD work. The different work programmes will range in size and scale and will be determined by the priorities of the organisation.&lt;/p&gt;\n&lt;p&gt;We reserve the right to close down this advert early should there be a high number of applicants.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further information please contact: &lt;/strong&gt;Virginia Golding – Head of Equality, Diversity, Inclusion and Participation - 07824543642&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview are scheduled to take place &lt;/strong&gt;26 &amp; 30 November 2020&lt;/p&gt;\n&lt;p&gt;We reserve the right to close down this advert early should there be a high number of applicants.&lt;/p&gt;\n&lt;p&gt;PLEASE NOTE WE WILL CONTACT YOU VIA EMAIL ABOUT YOUR APPLICATION THEREFORE PLEASE CHECK YOUR EMAIL ACCOUNT&lt;/p&gt;\n&lt;p&gt;It is important that you check your NHS jobs account regularly. To access emails from us, log into your account and view &#39;My Applications&#39; however some emails have been known to end up in &#39;JUNK MAIL/SPAM BOX&#39; so please ensure you check this folder as well as your INBOX so you don&#39;t miss any important communication regarding your application.&lt;/p&gt;\n&lt;p&gt;If you have not received confirmation of an interview date within 6-8 weeks of your application, please assume on this occasion that you have been unsuccessful.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Rotherham Doncaster and South Humber NHS Foundation Trust is committed to our responsibilities for safeguarding and promoting the welfare of children, young people and adults at risk as outlined in Working Together to Safeguard Children 2015 and Care Act 2014. &lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;We are committed to recruiting candidates who share the commitment to safeguarding, and therefore we apply robust recruitment and selection procedures to ensure that the people selected are right for the job, and that all candidates are appropriately screened prior to appointment and periodically during their employment&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;DBS disclosures are mandatory before commencement of employment within the Trust. Therefore, if you are in a position that is deemed a regulated adult and/or child care role, you will not be able to start your employment until we have received a satisfactory DBS clearance.&lt;/p&gt;\n&lt;p&gt;Safeguarding Policies for the Trust can be accessed via the document links.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Trust is committed to equal opportunities in employment and welcomes applications from all sections of the community in order to maintain a workforce as diverse as the population it serves.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The first 6 months of employment with the Trust will be a probationary period which may be extended by the Trust for a further 6 months.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121483.jpg", "name": "Rotherham Doncaster and South Humber NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121483"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Doncaster", "postalCode": "DN4 8QN"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4948", "longitude": "-1.14598"}}, "title": "Project Support Officer (Band 5)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251870", "validThrough": "2020-11-15T23:59:59+0000"}