{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "31,365.00 - 37,890.00"}}, "datePosted": "2020-11-03T12:09:59+0000", "description": "&lt;p&gt;&lt;strong&gt;Community Nurse&lt;br /&gt; Band 6&lt;br /&gt; North Kent Community Nursing Service. (Dartford, Gravesend, Swanley and Dartford Rural)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Are you a proactive and thoughtful Community Nurse? Are you looking to join an NHS Health and Social Care partner which is striving to make positive changes? Would you like to work for an organisation where more than 9 out of every ten 10 of the people who use services would recommend them?&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Feel Valued&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As a Band 6 Community Nurse, you’ll be working as part of the NHS system in North Kent where we deliver services across Gravesend and Dartford and local rural locations.&lt;/p&gt;\n&lt;p&gt;We‘ll offer you:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;AfC 20/21 salary and terms and conditions– including an NHS pension&lt;/li&gt;\n&lt;li&gt;Virgin Tribe - this grants you access to premier offers and discounts on Virgin Products such as holidays, experience days and much more!&lt;/li&gt;\n&lt;li&gt;Plus the benefits you’d expect from working with an NHS / Local Authority partner, NHS discount, on-site parking, rural attractive locations, as well as extras such as free hot and cold drinks&lt;/li&gt;\n&lt;li&gt;We’ll provide you with access to bespoke career pathways and opportunities to continue your professional development, working closely with universities and Health Education England to further your potential and support your progression via in house eLearning, workshops and courses. With access to dedicated practice development team to support new starters and newly qualified staff to ensure that you can practice as an autonomous community practitioner.&lt;/li&gt;\n&lt;li&gt;Access to our free Employee Assistance Programme, a service providing expert advice, 24/7/365 online and by telephone covering a wide range of support options such as; counsellors, post trauma incident support, legal, debt and practical life management helplines&lt;/li&gt;\n&lt;li&gt;Mobile working utilising iPads, so that you can complete your documentation on the go&lt;/li&gt;\n&lt;li&gt;Flexible working to provide you with that true work / life balance&lt;/li&gt;\n&lt;li&gt;Access to our Strive for Better networks, a national support and professional network made up of NHS professionals like you, giving you the chance to constantly develop industry-leading care and quality&lt;/li&gt;\n&lt;li&gt;In addition to the above we are also able to offer a golden hello handshake of up to £2000, linked to appointment and satisfactory performance&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Feel Proud&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Right now, we’re looking for Community Nurse’s to join our North Kent Community Nursing Service with a base either at Gravesend or Dartford to help us continue to change things for the better. The community nursing team works across 7 days per week 08.00 – 20.00.&lt;/p&gt;\n&lt;p&gt;Working closely with our Community Nurses, GP&#39;s and other Health care professionals you’ll  be responsible for contributing to the holistic assessment, planning delivery and evaluation of care to patients within their own homes. You will be expected to implement, monitor and maintain high standards of care delivery at all times. You’ll care for patients and their families in the way that you believe is best, delivering our high service standards, sharing best practice, and actively improving the way we work.&lt;/p&gt;\n&lt;p&gt;This is an opportunity to put your NMC/ 1st level registration to great use, you will have the ability to work both independently and also as part of a wider multidisciplinary team. It is expected that you should have strong communication and organisation skills and a flexible approach which will ensure you deliver positive experiences to patients at every stage of their healthcare journey. &lt;/p&gt;\n&lt;p&gt;You’ll care for patients and their families in the way that you believe is best, delivering our high service standards, sharing best practice, and actively improving the way we work to help us continue to change things for the better. We feel passionate that everyone should feel valued when they come into contact with our organisation, whether that&#39;s you, someone we care for or the wider community we operate in.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Feel the Difference&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you are a community nurse with  NMC/1ST level registration we’d love to talk to you about having you join the team.&lt;/p&gt;\n&lt;p&gt;If you’d like to discuss the role further, or request the full job description, please contact Abi Booth via email: abi.booth@virgincare.co.uk&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Virgin Care&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We’re committed to equal opportunities and welcome a broad diversity of talent to apply. We reserve the right to cease any advertising prior to the published closing date for a role that receives a high number of applications.&lt;/p&gt;\n&lt;p&gt;As a Disability Confident Committed company, we work in partnership with the Department of Work and Pensions (DWP) to provide facilities, work environment adjustments and technical solutions to make our business an inclusive place for all.&lt;/p&gt;\n&lt;p&gt;Virgin Care Limited, its subsidiary companies and the Virgin Care LLPs are part of the Virgin Group and provide publicly funded health and social care services. If you would like to know a little more about how we use your information, please see our website’s privacy policy&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Virgin Care", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127354"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Gravesham Community Hospital", "postalCode": "DA11 0DG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4432", "longitude": ".365561"}}, "title": "Band 6 Community Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253882", "validThrough": "2020-11-17T23:59:59+0000"}