{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-11-03T10:01:17+0000", "description": "&lt;p&gt;&lt;strong&gt;Employee Health and Wellbeing Clinical Adviser, Band 5 (up to Full time)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Our new MFT Employee Health and Wellbeing (EHW) Service provides specialist advice and support regarding employee health issues to MFT employees and managers as well as to a variety of external clients. The EHW Service delivery model ensures that an efficient, highly professional and cost effective service continues to be delivered across MFT.&lt;/p&gt;\n&lt;p&gt;The EHW Service is a multidisciplinary team comprising of Senior Managers, EHW Advisers, Clinical Advisers, Psychological Support Therapists and EHW Physiotherapists. Working with our Support Services team the main priority is to create a dynamic approach to maximise employee health, wellbeing and productivity.&lt;/p&gt;\n&lt;p&gt;We currently have a vacancy for an EHW Clinical Adviser to join our team working up to full time hours. You must be a Registered Nurse and will work alongside EHW colleagues to provide proactive EHW services to MFT employees as well as supporting external contracts. We are looking for a dynamic, enthusiastic and motivated individual, who is experienced or has the potential to be trained in the management and delivery of an EHW immunisation programme in line with Department of Health guidelines. You must be IT literate and able to learn systems and processes. The role will involve cross site working full time with some requirement for weekend working.&lt;/p&gt;\n&lt;p&gt;As a key member of the team this role provides a unique and exciting opportunity to assist in the delivery of a highly professional and customer focused EHW service, in return we will support your development and provide you with a unique opportunity to maximise your skills and experience.&lt;/p&gt;\n&lt;p&gt;If you are a dynamic and motivated individual looking for a new challenge and have any questions regarding the role, please contact Katie Swindells (Clinical Services Team Manager) by emailing katie.swindells@mft.nhs.uk&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameKatie SwindellsJob titleClinical Services Team ManagerEmail addresskatie.swindells@mft.nhs.ukTelephone number0161 276 4289Additional contact information&lt;/p&gt;\n&lt;p&gt;If you are a dynamic and motivated individual looking for a new challenge and have any questions regarding the role, please contact Katie Swindells (Clinical Services Team Manager) by emailing katie.swindells@mft.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Manchester University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121137"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wythenshawe/ORC, Manchester", "postalCode": "M13 9WJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4623", "longitude": "-2.23018"}}, "title": "EHW Clinical Adviser", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253367", "validThrough": "2020-11-09T23:59:59+0000"}