{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "40890", "minValue": "34024", "unitText": "YEAR", "value": "£34,024 - £40,890"}}, "datePosted": "2020-10-19T09:32:48+0100", "description": "&lt;p&gt;Established in 1932, The London Clinic is one of the UK’s largest independently owned non-profit hospital, with state-of-the-art facilities located on Harley Street. We have circa 1200 employees, a total of 8 premises, and we are dedicated to providing the best, personalised healthcare with a breadth of surgical and medical expertise.&lt;/p&gt;\n&lt;p&gt;Our main hospital spans 8 floors comprising of 234 beds and 10 theatres, including a Hybrid theatre and two minimally invasive and day surgery theatres. The Duchess of Devonshire Wing is our award-winning cancer centre, which includes state-of-the-art radiotherapy, chemotherapy suites and dedicated patient bedrooms&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job Description&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;To be responsible for the delivery of the highest standards of care and service to the patients within our Urology/Neurosciences or Oncology Inpatients Unit.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job Type&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is a full time, permanent position working 37.5 hours per week (days, nights and weekends.)&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The attractive salary range for this role is £34,024 - £40,890 (inclusive of London Weighting &amp; COLA) and will be dependent upon skills and experience.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Benefits package&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We offer our permanent staff a comprehensive package which includes a contribution pension scheme (total annual contribution up to 20%), Private Medical Healthcare, 25 day’s annual leave plus bank holidays, season ticket travel loan, and a wide range of discounts with a variety of retailers and services. We also offer excellent career development; with clear career pathways and access to further education.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Duties &amp; Responsibilities&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To maintain accountability for assessing, planning, implementing and evaluating programmes of care within the framework of nursing incorporating the nurse initiative.&lt;/li&gt;\n&lt;li&gt;To coordinate the patients discharge arrangements in accordance with the London Clinic discharge policy.&lt;/li&gt;\n&lt;li&gt;To promote a patient focused approach to care in collaboration with all relevant health professionals.&lt;/li&gt;\n&lt;li&gt;To educate patients and their carers as required where a need has been identified.&lt;/li&gt;\n&lt;li&gt;To provide information which enables patients to make choices about adopting a healthier lifestyle.&lt;/li&gt;\n&lt;li&gt;To complete patient documentation correctly.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;em&gt;This job description is intended as a general guide to the post, but it may change in line with the needs of the department or at the request of the line manager.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Skills &amp; Experience&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;NMC Registered general nurse&lt;/li&gt;\n&lt;li&gt;At least 12 months experience as a general nurse within a UK hospital, post registration&lt;/li&gt;\n&lt;li&gt;Ideally experience within Oncology or Urology/Neurosciences Unit&lt;/li&gt;\n&lt;li&gt;High levels of teamworking &amp; communication skills preferred&lt;/li&gt;\n&lt;li&gt;Proficient command of English preferred – written and spoken&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;em&gt;The successful applicant’s offer is subject to relevant DBS, Occupational Health and Reference Checks respectively, alongside standard Right To Work Checks.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are an organisation that has charitable status and this helps us to drive forward our mission of reinvesting our income to deliver better patient outcomes.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The London Clinic is proud of its diverse workforce and is committed to building a team that represents a variety of backgrounds, perspectives, and skills. We absolutely welcome applicants from underrepresented groups; if you think you have the skills and experience for the job, please apply - we would love to hear from you regardless of your background.&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "The London Clinic", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132294"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "London", "postalCode": "W1G 6BW"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.523", "longitude": "-.15005"}}, "title": "Band 5 Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916231633", "validThrough": "2020-11-29T23:59:59+0000"}