{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum plus HCA where applica"}}, "datePosted": "2020-10-29T15:30:58+0000", "description": "&lt;p&gt;We are currently recruiting for a Business Intelligence Analyst to join our Commissioning &amp; Contracting team.&lt;/p&gt;\n&lt;p&gt;As a member of the Commissioning &amp; Contract Management Support Team (BHR) this role is integral to ensuring the NEL and ELHCP operating models and new ways of working are successfully established and embedded into routine business delivery.&lt;/p&gt;\n&lt;p&gt;The Business Intelligence Analyst will play a key role in the BHR Business Intelligence team, who will work predominately within the BHR System working with CCG colleagues to deliver the commissioning priorities. There will however be an expectation the Business Intelligence Analyst work on programmes of work that cover ELHCP.&lt;/p&gt;\n&lt;p&gt;The Business Intelligence Analyst is responsible for helping to ensure the team help develop leading edge, innovative and creative solutions to support the delivery of the System commissioning plans and the delivery of integrated care services.&lt;/p&gt;\n&lt;p&gt;The post holder will play a role in developing the Business Intelligence team as part of an integrated commissioning and contract management support Team of multi-professionals. They will be responsible for the delivery of an agreed programme that will jointly be agreed with the BHR System leads.&lt;/p&gt;\n&lt;p&gt;The Business Intelligence Analyst will have good communication and problem solving skills and be able support the development of strategical solutions to BHR system commissioning priorities.&lt;/p&gt;\n&lt;p&gt;For further details on this role, please refer to the attached job description. Please ensure that you pay careful attention to the essentials and desirables of the person specification when completing your supporting statement.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NamePeter AllanJob titleDeputy Head of Business IntelligenceEmail addresspeterallen1@nhs.netTelephone number07432 525010&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NEL Commissioning Support Unit", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127694"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "North House, Romford", "postalCode": "RM1 3AE"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5799", "longitude": ".181978"}}, "title": "Business Intelligence Analyst", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248873", "validThrough": "2020-11-12T23:59:59+0000"}