{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753-£51,668 per annum"}}, "datePosted": "2020-11-05T16:45:51+0000", "description": "&lt;p&gt;We are looking for a highly enthusiastic, committed and self-motivated Clinical Pharmacist who wants to use their passion and competence in technology to make a difference to patient care. This is a brand new post created to ensure the provision of specialist clinical pharmacy input in to the implementation and functioning of Electronic Prescribing and Medicines Administration (EPMA) at the Trust. As a Senior Clinical Pharmacist – Digital, you will be a core member of the Medicines Management team, taking the lead on all matters relating to digital prescribing and administration, and contributing to both the operational and strategic development of EPMA.&lt;/p&gt;\n&lt;p&gt;You will use your specialist clinical experience and knowledge to contribute to the design of new ways of working with electronic systems and processes, ensuring maximum levels of safety and quality. You will report clinical risks and issues that could be generated by the transition from paper-based to electronic prescribing, whilst working closely with the EPMA project implementation team and within project governance structures.&lt;/p&gt;\n&lt;p&gt;To be considered for this exciting opportunity you will need to have excellent communication and interpersonal skills, along with proven team working abilities. You will need to be resourceful and able to make complex recommendations and decisions, whilst consistently prioritising patient safety and good practice in clinical pharmacy. Previous experience using EPMA is a significant advantage, though we welcome applications from pharmacists with experience in any sector of pharmacy practice where a passion for digital solutions to prescribing issues has been previously demonstrated.&lt;/p&gt;\n&lt;p&gt;You will need post-qualification experience relevant to the post: a Diploma in Pharmacy Practice/Clinical Pharmacy/equivalent CPD or experience is essential. The successful candidate will also need to be willing to enrol on the prescribing course, if they are not already a prescriber. There is an expectation that the post holder will maintain a clinical specialism, with flexibility according to post holder preference and service need; we strongly encourage staff to develop any special interests.&lt;/p&gt;\n&lt;p&gt;The post holder is required to participate in the pharmacy dispensary rota and may be required to work Saturdays, Sundays and Bank Holidays, and undertake on-call duties.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Lucy Simkins-Principal Clinical Pharmacist and Prescribing Lead&lt;/p&gt;\n&lt;p&gt;lucy.simkins@nhs.net&lt;/p&gt;\n&lt;p&gt;01273 696011 ext. 2829 or 07342 080829&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Sussex Community NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120877"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Brighton General Hospital, Brighton", "postalCode": "BN2 3EW"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8309", "longitude": "-.114138"}}, "title": "Senior Clinical Pharmacist - Digital", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258615", "validThrough": "2020-11-15T23:59:59+0000"}