{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 to £24,157 pa"}}, "datePosted": "2020-10-26T15:30:33+0000", "description": "&lt;p&gt;An opportunity has arisen at South Tyneside and Sunderland NHS Foundation Trust for an enthusiastic and dedicated individual to join our Financial Services team in the Treasury Department   We’re looking for someone who is reliable and flexible, and who demonstrates commitment to achieving both their own and the Trust’s goals, whilst fully contributing to the team spirit.&lt;/p&gt;\n&lt;p&gt;The successful candidate will play a significant part in the day to day running of the Treasury Department. We are looking for a motivated and enthusiastic individual to undertake various duties including daily cashbook, bank reconciliations, bank payments and treasury related queries.&lt;/p&gt;\n&lt;p&gt;Ideally but not essential is a good understanding of the NHS finance regime is required. You will have excellent verbal and written communication skills with the ability to deal with people at all levels and good organisational skills and a real commitment to excellent service delivery.  You should have experience of working in a busy finance office environment. . You must be capable of working to tight deadlines whilst ensuring consistency and accuracy, able to prioritise workloads and be able to work on your own initiative as well as under supervision.&lt;/p&gt;\n&lt;p&gt;An enthusiastic and energetic approach to work along with an acceptance of work flexibility and continuously changing working practices is essential.  Ideally the successful candidate will have some Excel skills and previous Treasury experience is essential, NHS or private sector would be an advantage (but not essential).&lt;/p&gt;\n&lt;p&gt;For further job related queries please contact Jennifer Colden – 0191 4041000 ext. 2119.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121061.jpg", "name": "South Tyneside and Sunderland NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121061"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "South Shields", "postalCode": "NE34 0PL"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.9719", "longitude": "-1.42994"}}, "title": "Treasury Officer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243144", "validThrough": "2020-11-09T23:59:59+0000"}