{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "25400", "minValue": "22730", "unitText": "YEAR", "value": "£22,730 - £25,400 (Depending upon experience)"}}, "datePosted": "2020-10-28T11:57:12+0000", "description": "&lt;p&gt;&lt;strong&gt;Admin Lead – Permanent&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;DMC Healthcare are looking to recruit an experienced, charismatic, and approachable Admin Lead to support our Practice manager and Assistant Practice Manager at our GP Surgery based in South East London (SE22).&lt;/p&gt;\n&lt;p&gt;Our practice is modern, bright and welcoming with on-site staff parking, meeting rooms, air-conditioned offices and staff kitchen/dining area.&lt;/p&gt;\n&lt;p&gt;The post holder will be required to provide senior administrative support and training to a range of staff, including the senior management team, assist with recruitment, procurement, health roster, line management of administrators and take operational responsibility for them, allocation of work and to deputise.&lt;/p&gt;\n&lt;p&gt;We are looking for a proactive candidate with strong administrative skills including strong IT and communication skills; previous experience of line management is essential. We have a large supportive team and require someone who has experience of working in a clinical setting. Knowledge of primary care environment would be an advantage.&lt;/p&gt;\n&lt;p&gt;The role is full time working &lt;strong&gt;37.5 hours&lt;/strong&gt; per week.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Main Duties and Responsibilities:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Organize duty rotas, leave requests approved by management, study leave&lt;/li&gt;\n&lt;li&gt;Co-ordinate clinician availability in conjunction with management&lt;/li&gt;\n&lt;li&gt;Update appointments systems for leave/duty changes&lt;/li&gt;\n&lt;li&gt;Provide induction training and ongoing review for administrative staff and as required&lt;/li&gt;\n&lt;li&gt;Ensure Practice policies are followed, and accurate records are kept with particular reference to appointments, messages, visits, post, patient registration, repeat prescriptions, filing systems, births and deaths, etc.&lt;/li&gt;\n&lt;li&gt;Alert other team members to issues of quality and risk&lt;/li&gt;\n&lt;li&gt;Apply Practice policies, standards and guidance and take active part in their development&lt;/li&gt;\n&lt;li&gt;Discuss with other members of the team how the policies, standards and guidelines will affect own work&lt;/li&gt;\n&lt;li&gt;Assist management in audits and reporting as where appropriate&lt;/li&gt;\n&lt;li&gt;Deal with complaints in accordance with Practice Complaints Procedure and evaluate suggestions; supported by practice management&lt;/li&gt;\n&lt;li&gt;Co-ordinate daily doctors/nurses’ requests&lt;/li&gt;\n&lt;li&gt;Maintenance of computerized appointment system&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;About us&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;DMC Healthcare Group is a provider of Primary Care Services operating GP surgeries, walk-in centres and mobile medical units. We offer patients a full range of NHS primary and urgent care services. At DMC we believe in working together to deliver healthier outcomes for our patients and our own teams and strive to continuously ensure our patients are safe, cared for and receive the care they need when they need it.&lt;/p&gt;\n&lt;p&gt;If you are interested in our vacancy then we would love to hear from you. In return, you will enjoy a challenging and diverse career with DMC.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;As part of our employment process, you will be required to complete the appropriate level DBS check.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Equality and Diversity Statement&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The company supports the principle of Equality and Diversity in employment wholeheartedly and opposes all forms of unlawful or unfair discrimination on the grounds of age, disability, sex, gender reassignment, sexual orientation, pregnancy and maternity, race, religion or belief and marriage and civil partnerships.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Disclosure and Barring Service Check&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This post is subject to the Rehabilitation of Offenders Act (Exceptions Order) 1975 and as such it will be necessary for a submission for Disclosure to be made to the Disclosure and Barring Service (formerly known as CRB) to check for any previous criminal convictions.&lt;/p&gt;\n&lt;p&gt;Your submitted application maybe imported into our preferred Third-party recruitment system. By applying for this post, you are agreeing to DMC Healthcare transferring the information within this application to its preferred applicant management system. If you are offered a job, information will also be transferred into the DMC Electronic Staff Records system.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central Advertising - Other", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130656"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "South East London", "postalCode": "SE22 9EP"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4555", "longitude": "-.072062"}}, "title": "Admin Lead - Crystal Place Road", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246441", "validThrough": "2020-11-11T23:59:59+0000"}