{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "58558", "minValue": "52643", "unitText": "YEAR", "value": "£52,643 - £58,558 per annum inclusive HCA"}}, "datePosted": "2020-11-04T11:54:57+0000", "description": "&lt;p&gt;Clinical / Counselling Psychologist Band 8a in the Tower Hamlets Early Intervention Service and Assessment and Recovery Teams (A&amp;RT), 1 wte post.&lt;/p&gt;\n&lt;p&gt;We are looking to recruit an experienced and highly motivated HCPC - registered clinical /counselling psychologist to work with the Tower Hamlets Early Intervention Service (THEIS) and Assessment and Recovery Teams (A&amp;RT).This post would be suitable for someone with experience or a strong interest in psychosis and Early Intervention.&lt;/p&gt;\n&lt;p&gt;The post is part of the Early Intervention Service model which has expanded in the past three years to now include first episode psychosis for ages 35-65 years using a Hub and Spoke model in Tower Hamlets.&lt;/p&gt;\n&lt;p&gt;The Tower Hamlets Early Intervention Service (THEIS) is an early intervention in psychosis service for adults from a range of religious, cultural and ethnic backgrounds, experiencing first onset of psychosis.&lt;/p&gt;\n&lt;p&gt;THEIS is an expanding multi-disciplinary team; we provide a range of psychosocial interventions working within the care programme approach framework in collaboration with service users, carers and other relevant agencies. The interventions are offered in individual, group and family contexts, and commonly require an assertive outreach approach.&lt;/p&gt;\n&lt;p&gt;Early intervention for psychosis services aim to reduce the prevalence and impact of schizophrenia by reducing the duration of untreated psychosis and engaging clients in training and work as well as offering support and psychological interventions.&lt;/p&gt;\n&lt;p&gt;The A&amp;RTs provide an integrated service to those individuals and their families/carers suffering from the consequences of mental illness, with priority given to those with serious mental illness, enabling them to live as fulfilled a life as possible within the community and promote recovery.&lt;/p&gt;\n&lt;p&gt;This means working with service users and carers, their families and the wider community to help them lead purposeful lives among people who accept them, breaking down the barriers of stigma that often accompany mental health problems and lead to social isolation.&lt;/p&gt;\n&lt;p&gt;The post holder will work across THEIS and the A&amp;RT to provide a psychology service to service users aged 35-65 with a first episode psychosis.&lt;/p&gt;\n&lt;p&gt;The purpose of the role is to:&lt;/p&gt;\n&lt;p&gt;Provide specialist assessment and formulation of service users.&lt;/p&gt;\n&lt;p&gt;Provide specialist evidence-based intervention to service users, including CBT for psychosis and Family Intervention.&lt;/p&gt;\n&lt;p&gt;Provide individual and group supervision to the identified Band 6 Care coordinators in the A&amp;RTs.&lt;/p&gt;\n&lt;p&gt;Coordinating and developing the psychology provision for first episode psychosis in over 35s across the teams in line with recent National guidance.&lt;/p&gt;\n&lt;p&gt;Offer psychotherapeutic insights, consultation, supervision and teaching to team members as appropriate.&lt;/p&gt;\n&lt;p&gt;Be involved in service development, evaluation and research.&lt;/p&gt;\n&lt;p&gt;The post holders will be required to the work closely with the identified Care Coordinators &amp; senior psychologists in the identified A&amp;RTs, and the THEIS Operational lead, Principal Psychologist and Clinical Leads across the teams. You will need to be self-motivated, clinically up to date with proven experience of undertaking assessments (including neuropsychological assessments) and interventions in both primary and secondary care settings. The role will require networking and close collaborative working with community and voluntary agencies, as well as primary and secondary care providers.&lt;/p&gt;\n&lt;p&gt;In addition to membership of the above team the successful candidate will be closely involved with the Department of Adult Mental Health Psychology, under whose governance you will experience continuing professional development, including regular specific psychological training. Within this lively and enthusiastic department a range of approaches is promoted, including CBT, CFT and psychodynamic, supported by strong peer and specialist supervision.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120781.jpg", "name": "East London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120781"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "LONDON", "postalCode": "E1 8DE"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5135", "longitude": "-.072681"}}, "title": "Clinical/ Counselling Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255691", "validThrough": "2020-11-18T23:59:59+0000"}