{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 pro rata"}}, "datePosted": "2020-10-26T14:46:14+0000", "description": "&lt;p&gt;An opportunity has arisen for a dedicated part-time Physiotherapist to co-lead the Respiratory Team as part of the Medical Therapy Team at the University Hospital of North Midlands, with this post being based at County Hospital. We are looking for an enthusiastic therapist ready to step into this Advanced role, who is able to embrace the challenges and opportunities of working in an acute trust environment.&lt;/p&gt;\n&lt;p&gt;This is an excellent opportunity for an experienced Respiratory Physiotherapist to deliver assessment and treatment across inpatient wards, as well as taking on an Advanced Therapist / Team Leader role on the County site.&lt;/p&gt;\n&lt;p&gt;This offers an excellent opportunity for the post holder to consolidate their leadership and management skills as well as building further clinical expertise that will enhance and broaden their rehabilitation skill and communication skills.&lt;/p&gt;\n&lt;p&gt;Supervision will be provided by Principal Therapists and continuous development is supported through appraisal, internal training and external learning. The Therapy team work within a 7 day shift system therefore the post holder will be required to work weekends and bank holidays.&lt;/p&gt;\n&lt;p&gt;For further information please contact Gaynor-Kay Travis, Head of Therapy Services or Denise Hanlon, Principal Therapist at County Hospital on 01785 230201  &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University Hospitals of North Midlands NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122653"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "County, County", "postalCode": "ST16 3SA"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.8113", "longitude": "-2.09774"}}, "title": "Advanced Physiotherapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242941", "validThrough": "2020-11-09T23:59:59+0000"}