{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum"}}, "datePosted": "2020-10-19T11:16:34+0100", "description": "&lt;p&gt;&lt;strong&gt;Consultant Psychiatrist – Assertive Outreach with a focus on Dual Diagnosis&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Somerset NHS Foundation Trust is looking to appoint a Consultant Psychiatrist – Assertive Outreach with a focus on Dual Diagnosis. This is a new post arising as a result of further investment in community services in Somerset NHS Foundation Trust.&lt;/p&gt;\n&lt;p&gt;Last year the Trust made the decision to begin providing additional dual diagnosis expertise within the Assertive Outreach Service due to the high percentage of assertive outreach clients with substance misuse issues.&lt;/p&gt;\n&lt;p&gt;If you are successful in securing this post you will cover all of the county liaising carefully with the Trust’s Assertive Outreach Service manager. You will be expected to support the assertive outreach manager to develop the clinical assertive outreach focus, whilst also supporting the dual diagnosis clinical lead in developing the mainstreaming of dual diagnosis treatment across the county and implementation of the Trust’s dual diagnosis strategy and continued integration of substance misuse.&lt;/p&gt;\n&lt;p&gt;A key aspect of this role will be to provide medical leadership within the assertive outreach service, including those dual diagnosis patients identified, and support the ongoing development of its continued integration. You will be a key member of the assertive outreach leadership team, but will only clinically work with those clients with a dual diagnosis. You will also support the dual diagnosis clinical lead in the implementation of the wider Trust dual diagnosis strategy and be a key member of the assertive outreach leadership team.&lt;/p&gt;\n&lt;p&gt;The total catchment area population is around 140,000 with current case load of 96 patients county wide. You will be expected to conduct assessments both at Trust premises as well as travelling to see patients at home. There is a requirement to travel across the county.&lt;/p&gt;\n&lt;p&gt;You are encouraged to apply to this post as 0.5 WTE role or as a full time post in conjugation with other currently advertised 0.5 WTE consultant psychiatric posts.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Key Responsibilities:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Work closely with the community teams to provide effective multidisciplinary collaborative care; this will include availability for consultation, case discussions, clear clinical leadership to the mental health service and advice at the request of assertive outreach and dual diagnosis leads and managers&lt;/li&gt;\n&lt;li&gt;Work collaboratively with the inpatient consultants to ensure smooth transition for patients admitted and discharged from the wards&lt;/li&gt;\n&lt;li&gt;Attend central AOT/DD service development and some team meetings, supervise the clinical work of senior AO/DD staff, giving clinical advice and oversight to the team caseload&lt;/li&gt;\n&lt;li&gt;Provide clinical leadership regarding the physical health assessments of dual diagnosis clients and provide clinical supervision to AO/DD non-medical prescribers&lt;/li&gt;\n&lt;li&gt;Assess patients and give advice about management plans&lt;/li&gt;\n&lt;li&gt;Carry a small caseload of complex dual diagnosis clients that will have previously screened by the clinical lead for dual diagnosis of approx. 10 patients&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;On Call:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The post holder can opt to join the senior out-of-hours on-call rota subject to availability.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Requirements:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;MB BS or equivalent medical qualification&lt;/li&gt;\n&lt;li&gt;Mental Health Act Approved Clinician / Section 12 approval&lt;/li&gt;\n&lt;li&gt;Entry on GMC Specialist Register, eligible for entry on Register or within 6 months of receipt of Certificate of Completion of Training (CCT) at time of interview or CESR&lt;/li&gt;\n&lt;li&gt;Clinical training and experience required for gaining UK CCT/CESR including widespread and detailed experience of assessment and management of patients in adult community psychiatry&lt;/li&gt;\n&lt;li&gt;Training or relevant experience in working in chronic, server and enduring cases and those who need Enhanced community treatment&lt;/li&gt;\n&lt;li&gt;Knowledge and experience in treating cases with dual diagnosis&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Additional Information:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is 0.5 WTE Consultant post, however you are welcome to apply the Consultant ADHD post and Consultant General Adult Psychiatrist for ADHD Service (0.5 WTE) post as 1.0 WTE.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Straddled between areas of outstanding natural beauty and the idyllic rolling hills of Exmoor, featuring national hotspots for cycling, surfing, and climbing such as Cheddar Gorge, there’s plenty to keep you occupied alongside the abundance of music festivals and local traditions. Somerset offers you the chance to live near some of the UK’s most desirable locations; from the beaches in North Devon and Cornwall, to the cosmopolitan centres of Bristol, Bath and Exeter, whilst also being less than 2 hours from London. The County town of Taunton has diverse shopping, restaurants, and regularly hosts international music and sporting fixtures.&lt;/p&gt;\n&lt;p&gt;The South West of England is a highly desirable place to live. Compared to other regions, house prices in the area are quite reasonable. Rural properties in many of the pretty villages in South Somerset and North Dorset are within easy commute to the hospital. Many properties have land or large gardens attached.&lt;/p&gt;\n&lt;p&gt;If you’ve got family commitments, or are looking to settle down, Somerset offers some of the best schools in the country ranging from Public institutions such as Millfield, Queens College, Taunton School, Kings College, Wellington, and Blundell’s, to award winning state schools such as Richard Huish College which has been ranked in the top 10 of A-level providers nationally for the last eight years, through to secondary’s ranking in the top 5% nationally such as The Castle school in Taunton.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Contact Details&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further information please contact Dr Fatin Hussein on fatin.hussein@somersetft.nhs.uk&lt;/p&gt;\n&lt;p&gt;If you would like to discuss the application process for this role please contact Jordan Pollard, Medical Recruitment Consultant on 07765898212 or Jordan.Pollard@somersetft.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Somerset NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121360"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Somerset", "postalCode": "TA6 4RN"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.1479", "longitude": "-2.99453"}}, "title": "Consultant Psychiatrist - Assertive Outreach with a focus on Dual Dia", "url": "https://www.jobs.nhs.uk/xi/vacancy/916232003", "validThrough": "2020-11-16T23:59:59+0000"}