{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "39691", "minValue": "32331", "unitText": "YEAR", "value": "£32,331 - £39,691 Per annum"}}, "datePosted": "2020-11-04T15:46:22+0000", "description": "&lt;p&gt;Want to be part of a team that inspires change?&lt;/p&gt;\n&lt;p&gt;The Digital and Data team in Public Health England Marketing are renowned for creating digital products that encourage healthy behavioural change and we’re looking for a digital analyst who can manage the delivery of exciting data tracking, measurement and analysis projects, working closely with the data and analytics lead and marketing teams. You’ll lead on enhancing and maintaining the processes for digital analytics across marketing’s products and services.&lt;/p&gt;\n&lt;p&gt;If you think you’ve got what it takes to lead on the delivery of digital analytics and are a motivated, self-starter with an enthusiasm for promoting and facilitating a data driven culture then apply today.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Option 3 – External&lt;/p&gt;\n&lt;p&gt;Open to all external applicants (anyone) from outside the Civil Service (including by definition internal applicants).&lt;/p&gt;\n&lt;p&gt;On 18 August 2020, the Secretary of State for Health and Social Care announced plans to establish the National Institute for Health Protection and consult on the best future options for strengthening health improvement and other public health functions in the wider system. Public Health England and many of its employees will be in scope for transition to new organisations in Spring 2021. Any new or current employees working for Public Health England during this time, will receive appropriate communications and consultation prior to any formal transfer taking place. Employees who compulsorily transfer to successor bodies will remain on their existing contractual terms and conditions and this applies both to current employees and those recruited during the transition. The recruitment, growth &amp; development of our workforce is vital for the continuing success of PHE and the future National Institute for Health Protection.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Jan Illes Email address Jan.Illes@phe.gov.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/127774.jpg", "name": "Public Health England", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127774"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wellington House / remote home working during COVID-19, London", "postalCode": "SE1 8UG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5018", "longitude": "-.10881"}}, "title": "Digital Analyst", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256494", "validThrough": "2020-11-18T23:59:59+0000"}