{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "32146", "minValue": "26152", "unitText": "YEAR", "value": "£26,152 - £32,146 per annum (incl of HCAS)"}}, "datePosted": "2020-10-22T11:16:00+0100", "description": "&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Mental Health Practitioner / Community Psychiatric Nurse&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What’s special about this opportunity?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Berkshire Healthcare NHS Foundation Trust can provide you with a dynamic, people-centred environment, where you will be empowered to support patients with complex conditions, adopting a personalised approach to patient care that maximises independence, choice and control, following our philosophy of enabling people to reach and maintain their optimum level of health and wellbeing.&lt;/p&gt;\n&lt;p&gt;We value our employees and put people first. As a Global Digital Exemplar, we will provide you with an excellent working environment that has just been recognised as having an ‘Outstanding’ rating overall. Being an ‘Outstanding’, well-led, organisation, and having an ‘Outstanding’ Older Adults Community Mental Health Team in our latest CQC inspection, which found that: ‘There was a clear vision, underpinned by a set of values that were well understood by staff across the trust.’&lt;/p&gt;\n&lt;p&gt;Working in a passionate team, you will have access to our Trust-wide Learning and Development programme and be supported in your career and personal growth, with opportunities to help you build your Continuing Professional Development portfolio, enabling you to extend your skills and ensure that you excel.&lt;/p&gt;\n&lt;p&gt;We are pioneers in compassionate leadership and Quality Improvement, which is about creating a culture where everyone has a voice and where service users and staff collaborate to have a direct impact on the things that matter most.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About you:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Slough CMHT has an exciting opportunity for a newly qualified or soon to graduate student who wishes to join a dynamic and multi-disciplinary team in Slough. For the right candidate there will be the opportunity to develop this role from a Band 5 to a Band 6 as part of the ongoing appraisal process.&lt;/p&gt;\n&lt;p&gt;The post holder will provide high quality treatments, care co-ordination, long term casework, and will be involved in recovery focused treatment interventions. This requires working collaboratively with other disciplines and other teams in the locality to ensure a comprehensive service is provided to the local and diverse population.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What’s next?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you share our passion for people and the dedication to excel, we’d love to hear from you.&lt;/p&gt;\n&lt;p&gt;We are happy to answer any questions that you may have. Please don’t hesitate to call Alan Buckley on 01753 690950 or email Alan.Buckley@Berkshire.nhs.uk who’ll be delighted to help.&lt;/p&gt;\n&lt;p&gt;In addition to a competitive salary, as a valued member of our team, you will receive generous annual leave, have access to a car salary sacrifice scheme (available to all permanent staff over the age of 21), and as a respected member of the NHS, discounts from high street retailers and restaurants.&lt;/p&gt;\n&lt;p&gt;We’d love to welcome you to our warm, friendly team, who want to help you to make your career reflect your ambitions.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Name: Alan Buckley&lt;/p&gt;\n&lt;p&gt;Job title: Service Manager&lt;/p&gt;\n&lt;p&gt;Email address: Alan.Buckley@Berkshire.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number: 01753 690950&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120886.PNG", "name": "Berkshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120886"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Slough", "postalCode": "SL2 5BX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5201", "longitude": "-.597697"}}, "title": "Mental Health Practitioner / Community Psychiatric Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916238096", "validThrough": "2020-11-08T23:59:59+0000"}