{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-10-02T15:41:24+0100", "description": "&lt;p&gt;Are you a qualified Pharmacy Technician looking to move into an exciting and rewarding role? If the answer is yes, you would be well-suited to the full time Band 5 Pharmacy Technician role we have available at Albermarle Barracks, Newcastle Upon Tyne.&lt;br /&gt; &lt;br /&gt; This unique opportunity offers the chance to not only work as part of a team providing healthcare but to develop new practices and procedures to ensure high quality service is established and refined. This will be an excellent opportunity to establishing good working links with a close-knit patient community&lt;br /&gt; &lt;br /&gt; You will work autonomously within a multidisciplinary team providing a dispensary and medicines management service. You will be part of a friendly team working to provide a first-class primary health care service for military and entitled personnel. The working environment is welcoming and supportive.&lt;br /&gt; &lt;br /&gt; The purpose of this role is to provide primary and occupational healthcare, ensuring the provision of a comprehensive and professional service for entitled personnel (military, civilian, dependents and children). This will be done by providing a positive caring environment, in which patients can expect a high-quality professional service.&lt;br /&gt; &lt;br /&gt; Pharmaceutical services contribute to the DPHC mission by the provision of a clinical and professional service at medical treatment facility (MTF) level. The post holder will work independently to manage the day to day running of the MTF dispensary.&lt;/p&gt;\n&lt;p&gt;Duties of this post include, but are not limited to;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Ensuring the provision of a safe and accurate dispensing service to patients under the care of the Senior Medical Officer (SMO) and DPHC.&lt;/li&gt;\n&lt;li&gt;Assisting in the delivery of an effective medicines management service under the care of the SMO and DPHC.&lt;/li&gt;\n&lt;li&gt;Communicating professionally with medical and non-medical prescribers regarding any prescription anomalies, ambiguities or supply issues.&lt;/li&gt;\n&lt;li&gt;Communicating information as needed to patients, parents and carers regarding prescribed medicines, further supplies and prescription payments.&lt;/li&gt;\n&lt;li&gt;Managing the medicinal products supplied by nurses under Patient Group Direction (PGD) and combat medical technicians under Medic Issue Protocols (MIPs) as authorised by the Senior Medical Officer.&lt;/li&gt;\n&lt;li&gt;Overseeing the procurement, receipt, safe custody and appropriate storage of all medicinal products including Controlled Drugs following current legislation and DPHC Policy.&lt;/li&gt;\n&lt;li&gt;Housekeeping of the dispensary including stock checks, stock rotation and monitoring of time expiry drugs to minimise wastage as per Standard Operating Procedures (SOPs).&lt;/li&gt;\n&lt;li&gt;Submitting reports, monthly returns, and pharmacy statistics, as required by the practice and DPHC.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Please note that this is a Full Time Only position.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Selection Process Details&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Applicants will be required to provide evidence of the following qualifications and memberships;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Registration with GPhC (achieved via NVQ Level 3/BTEC Pharmaceutical science qualification, or grand-parenting)&lt;/li&gt;\n&lt;li&gt;Plus other additional training for checking dispensed prescriptions without further reference. Practical experience to be able to operate in a singleton post&lt;/li&gt;\n&lt;li&gt;NVQ Level 3/BTEC Pharmaceutical science qualification, or grand-parenting&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The selection at sift stage will be CV based. At interview, you will be tested against the following Behaviours;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;NHSC1 – Communication&lt;/li&gt;\n&lt;li&gt;NHSC2 – Personal &amp; People Development&lt;/li&gt;\n&lt;li&gt;NHSC4 – Service Improvement&lt;/li&gt;\n&lt;li&gt;HWB1 – Promotion of Health &amp; Wellbeing&lt;/li&gt;\n&lt;li&gt;HWB1 – Product&lt;/li&gt;\n&lt;li&gt;NHS IK1 – Information Processing&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Please ensure you demonstrate that you have the required skills, qualifications and memberships in your CV and that you have saved it using your surname then first name prior to submitting your application.&lt;br /&gt; &lt;br /&gt; Interviews will be held remotely on a date to be confirmed.&lt;/p&gt;\n&lt;p&gt;Travel to interview costs will not be reimbursed.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt; &lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Further Information&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;There is no requirement to deploy as this is met by our uniformed personnel but you will form the continuity of care required by our patients when based at home.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Please be aware that if you are found successful you will be asked to provide evidence of your immunity to Hepatitis B.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Successful candidates must meet the security requirements before they can be appointed. The level of security needed is security check.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;All employees joining Ministry of Defence who are new to the Civil Service will be subject to a 6-month probation period (unless otherwise advised) effective from the employment start date.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please ensure you have read all the details in the important information link prior to applying.&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/132174.png", "name": "Ministry of Defence (Defence Medical Services)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132174"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Albermarle Barracks, Newcastle Upon Tyne, NE15 0RF", "postalCode": "NE15 0RF"}, "geo": {"@type": "GeoCoordinates", "latitude": "55.0173", "longitude": "-1.87177"}}, "title": "Band 5 Pharmacy Technician (Civilian)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916211329", "validThrough": "2020-11-10T23:59:59+0000"}