{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "40894", "minValue": "38890", "unitText": "YEAR", "value": "£38890 / £40,894 / £41,723 / £44503"}}, "datePosted": "2020-10-21T14:34:27+0100", "description": "&lt;p&gt;&lt;span&gt;Leicestershire Nutrition and Dietetic Service (Community) have a vacancy for a permanent team leader for 30 hours a week, in our innovative and successful dietetic prescribing team. You will be a member of our friendly and dynamic primary care team in Leicester, Leicestershire and Rutland (LLR) working for Leicestershire Partnership NHS Trust and working with GPs and Clinical Commissioning Groups across LLR.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Leicestershire Nutrition and Dietetic Service (Community) has a team of approximately 80 staff working in primary care, mental health, public health and home enteral nutrition and is made up of dietitians, community nutritionists, dietetic support workers and support team staff covering the population of LLR. This post holder will be a member of the Primary Care nutrition and dietetic team that works across the health care community and you will manage, lead and deliver the prescribing dietetic service. As well as a managing, developing and supporting the staff in your team you will have an educational role and undertake some clinical duties with patients.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;This post offers the opportunity for an enthusiastic, innovative and self-motivated band 6/7 dietitian to deliver and develop the prescribing dietetic service to our patients and commissioners across LLR. You will need excellent communication, organisational, management and leadership skills, be able to work within tight deadlines and with a range of health care professionals and teams to promote the value of the dietetic service and create opportunities for new ways of working. We are looking for someone who can develop our team and is effective at working independently&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Due to the nature of the work a car driver is essential. Applicants must hold a full UK driving licence and have access to a car during working hours.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The service is committed to CPD and personal development and we have good clinical supervision models and in-house CPD in place to support you. The service is involved in the pre-registration placements for student dietitians undertaking A, B and C placements, to which the post-holder will contribute.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;Base: &lt;/strong&gt;OSL House, Leicester LE19 1XU&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;Interested? &lt;/strong&gt;Contact Alison Scott for more information &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Alison.Scott@lnds.nhs.uk&lt;/span&gt;&lt;span&gt; or 0116 2227144 / 07585 991883&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Leicestershire Partnership Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120650"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Leicester", "postalCode": "LE19 1XU"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.605", "longitude": "-1.18882"}}, "title": "Band 7 Dietetic Prescribing Team Leader - (Subject to banding)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916236902", "validThrough": "2020-11-29T23:59:59+0000"}