{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "42269", "minValue": "35686", "unitText": "YEAR", "value": "£35,686 - £42,269 Per annum"}}, "datePosted": "2020-11-04T14:46:19+0000", "description": "&lt;p&gt;&lt;strong&gt;Previous applicants need not apply and will not be considered&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job Reference Number: 919-LB-19223744-EXT 2 &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job title: &lt;/strong&gt;Public Health Screening and Immunisation Coordinator&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Employer: &lt;/strong&gt;Public Health England South East embedded in NHS England South East region (Hampshire Thames Valley)&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Department:&lt;/strong&gt; SE Centre - Healthcare Public Health&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Locations:&lt;/strong&gt; NHS England (South East - HIOW), Southampton, SO16 4GX&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours:&lt;/strong&gt; 0,8 wte (one post)&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job Type&lt;/strong&gt; Permanent&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Public Health England (PHE) is an executive agency of the Department of Health providing; strategic leadership, research, advice and support for Government, local authorities and the NHS in protecting and improving the nation’s health.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The commissioning of Screening and Immunisation services and responsibility for effective delivery of Screening and Immunisation programmes is mandated to NHS England. NHS England’s role is to ensure that the NHS delivers better outcomes for patients within its available resources. It will play a vital role in providing national leadership for improving outcomes and driving up quality of care.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Employed by PHE, this post is embedded within the Local Office of NHS England and NHS Improvement South East. This post is home based or if the applicant prefers to be office based, a base can be negotiated. As part of the creation of the new South East NHS England and Improvement Region there is closer alignment and working with the Thames Valley Team. Therefore, occasional travel between the two teams, may be required as part of this new arrangement.&lt;/p&gt;\n&lt;p&gt;Currently the whole team is based at home due to the COVID19 pandemic.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job Purpose / Summary&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;PHE has a vacancy for a Public Health Screening and Immunisation Coordinator to work as part of the HIOW Screening and Immunisation Team. The post holder will support the commissioning of consistent, resilient and high quality national screening and immunisation programmes, providing leadership, support and challenge to service providers in order to achieve high coverage rates and maintain the quality of the programme pathwasy. They will support implementation of commissioning and delivery of the national screening and immunisation programmes.&lt;/p&gt;\n&lt;p&gt;We are seeking to appoint 2.58 wte (three posts) Screening and Immunisation Coordinators to the Hampshire and Isle of Wight Screening and Immunisation Team, covering Southampton, Hampshire, Portsmouth and the Isle of Wight. Working with the Screening and Immunisation Manager and Screening and Immunisation Lead, applicants will commission consistently resilient, high quality, national screening and immunisation programmes within the defined geography of NHS England (HIOW). The postholders will be employed by PHE and embedded within NHS England.&lt;/p&gt;\n&lt;p&gt;Programme responsibilities may change according to the needs of the service.&lt;/p&gt;\n&lt;p&gt;The post holder will ideally have a sound knowledge of screening and immunisation programmes and of commissioning population health programmes.&lt;/p&gt;\n&lt;p&gt;This post is being offered as a non-clinical role and a clinical role with corresponding job descriptions. Candidates’ applications will be tested against the person specification of both job descriptions to assess which is most suitable. To be eligible for the post on an Agenda for Change banding you will need to meet the person specification on the ‘clinical’ job description.&lt;/p&gt;\n&lt;p&gt;Option 3 – External&lt;/p&gt;\n&lt;p&gt;Open to all external applicants (anyone) from outside the Civil Service (including by definition internal applicants).&lt;/p&gt;\n&lt;p&gt;Applicants are strongly advised to use the criteria in the person specification part of the job description (available online) as sub-headings in their application to make it clear how they meet each of the selection criteria.&lt;/p&gt;\n&lt;p&gt;Public Health England promotes diversity in the workplace and is an equal opportunities employer.&lt;/p&gt;\n&lt;p&gt;On 18 August 2020, the Secretary of State for Health and Social Care announced plans to establish the National Institute for Health Protection and consult on the best future options for strengthening health improvement and other public health functions in the wider system. Public Health England and many of its employees will be in scope for transition to new organisations in Spring 2021. Any new or current employees working for Public Health England during this time, will receive appropriate communications and consultation prior to any formal transfer taking place. Employees who compulsorily transfer to successor bodies will remain on their existing contractual terms and conditions and this applies both to current employees and those recruited during the transition. The recruitment, growth &amp; development of our workforce is vital for the continuing success of PHE and the future National Institute for Health Protection.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;For further information or an informal discussion about the post, please contact Dave Harris, Screening and Immunisation Manager, david.harris15@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/127774.jpg", "name": "Public Health England", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127774"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Oakley Road, Southampton, Hampshire, Southampton", "postalCode": "SO16 4GX"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.9233", "longitude": "-1.44876"}}, "title": "Public Health Screening and Immunisation Co-ordinator 1 post", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256278", "validThrough": "2020-11-18T23:59:59+0000"}