{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pa"}}, "datePosted": "2020-10-22T14:16:21+0100", "description": "&lt;p&gt;&lt;strong&gt;Staffordshire and Stoke-on-Trent Clinical Commissioning Groups are seeking to recruit a Corporate Accountant &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About us&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Our headquarters are in Stafford town centre, and we have office bases in the heart of Hanley in Stoke-on-Trent, and a base in Burton-upon-Trent. We are responsible for commissioning high quality healthcare for the people of Staffordshire and Stoke-on-Trent.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Job title Corporate Accountant&lt;/p&gt;\n&lt;p&gt;Band Band 5&lt;/p&gt;\n&lt;p&gt;Hours Full time - Fixed Term / Secondment for 12 months.&lt;/p&gt;\n&lt;p&gt;Staffordshire and Stoke on Trent CCGs are a group of CCGs who work under a single leadership team. They are responsible for the commissioning of healthcare on behalf of the population of Staffordshire covering 1.16m patients with a total combined budget in excess of £1.7bn.&lt;/p&gt;\n&lt;p&gt;Due to the internal secondment of the current post holder, an exciting opportunity has arisen for a suitably experienced accountant to undertake the role of Corporate Accountant, on secondment/fixed term for 12 months.&lt;/p&gt;\n&lt;p&gt;The successful applicant must have experience at a similar level in a commissioning/ healthcare environment and must be able to commence in post promptly to ensure this key role is covered. The post holder will work to the Senior Financial Accountant within the Financial Accounting team led by the Financial Controller. The role will involve regular liaison with Corporate budget holders, payroll, Internal/External audit and providers of non-clinical services to the CCGs.&lt;/p&gt;\n&lt;p&gt;If you are interested in the post and can demonstrate the key skills and abilities outlined for the role we would love to hear from you.&lt;/p&gt;\n&lt;p&gt;In return we offer a full induction process, up to 33 days annual leave, NHS Pension Scheme, family friendly working patterns, Cycle to Work Scheme, access to training and development opportunities and in house Mental Health First Aiders.&lt;/p&gt;\n&lt;p&gt;In line with normal processes, internal candidates must seek support from their line manager before applying for a secondment opportunity.&lt;/p&gt;\n&lt;p&gt;All new staff joining the CCGs will be subject to a 6 month probation period.&lt;/p&gt;\n&lt;p&gt;Due to the CCGs incident response to COVID-19, this post will be home based until 31st March 2021.&lt;/p&gt;\n&lt;p&gt;For further information regarding this post please contact either David Skelton, Financial Controller on 07864 969920 email &lt;strong&gt;david.skelton1@staffsstokeccgs.nhs.uk&lt;/strong&gt; or Jo Wheat, Senior Financial Accountant j&lt;strong&gt;o.wheat@staffsstokeccgs.nhs.uk&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We promote a compassionate and inclusive environment and welcome applications from a diverse pool of talent and backgrounds. All individuals are valued and given every opportunity to succeed based on merit.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;strong&gt;The CCGs actively encourages applications from members of our Black, Asian and Minority Ethnic communities. These groups are under-represented in our organisation, and it’s important that our workforce reflects the diversity of our communities as much as possible.&lt;/strong&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;Interviews will take place via Microsoft Office Teams or another virtual means of contact&lt;/p&gt;\n&lt;p&gt;If we receive a high volume of applications, we reserve the right to close any vacancies from further applications. Please ensure you apply without delay if you wish to be considered for this role.&lt;/p&gt;\n&lt;p&gt;Deadline for applications: 8th November 2020&lt;/p&gt;\n&lt;p&gt;Interviews will be scheduled on 18th November 2020&lt;/p&gt;\n&lt;p&gt;For further information regarding this post please contact either David Skelton, Financial Controller on 07864 969920 email &lt;strong&gt;david.skelton1@staffsstokeccgs.nhs.uk&lt;/strong&gt; or Jo Wheat, Senior Financial Accountant j&lt;strong&gt;o.wheat@staffsstokeccgs.nhs.uk&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Staffordshire, Shropshire, Telford and Wrekin CCGs", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128455"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "SP2, Stafford", "postalCode": "ST16 2LP"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.8061", "longitude": "-2.11455"}}, "title": "Corporate Accountant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916238825", "validThrough": "2020-11-08T23:59:59+0000"}