{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "107668", "minValue": "79860", "unitText": "YEAR", "value": "£79,860 - £107,668 per annum"}}, "datePosted": "2020-10-09T10:27:46+0100", "description": "&lt;p&gt;This is a replacement post for a Consultant in Anaesthesia and Intensive Care. The RDH is a busy teaching hospital that offers both secondary and tertiary care. We will aim to accommodate specialist interests within Intensive Care and Anaesthesia.&lt;/p&gt;\n&lt;p&gt;This post is a 50:50 split between anaesthesia and ICU although candidates with other specialty interest could be accommodated. We are looking for a strong team player who will be able to build on the high quality service that has been developed in Derby. We would expect the successful applicant to bring something new to the unit and to help it progress in the years ahead. We have a strong team ethos and this individual will need to be able to thrive and inspire within this environment.&lt;/p&gt;\n&lt;p&gt;The Adult ICU is a new, customised PFI build with 20 beds rated Good in a recent CQC report. We admit over 1200 patients per year with a 60:40 split of medical to surgical admissions, 90 % of these being emergency admissions. The hospital provides a tertiary support service for hepatic and renal patients and in addition offers primary coronary angioplasty. We have a purpose built ICU with state of the art ultrasound, echo and imaging hardware and software. We are accredited for advanced training in Intensive Care medicine.&lt;/p&gt;\n&lt;p&gt;We have developed a comprehensive echocardiography service for our unit. We have two echo machines on the unit with TOE and TTE capability. In addition we have Echo PACS available on the unit to review all existing scans. We have a TTE and TOE high fidelity simulator that we use for staff training and to help deliver our nationally advertised ICU echocardiography course.&lt;/p&gt;\n&lt;p&gt;A 10PA job is available with 1.5 SPA. Additional sessions are available on request. Any candidate who wishes to work less than full time will be considered and supported, taking into account service needs.&lt;/p&gt;\n&lt;p&gt;On call is ICU only with a 1:10 frequency with 2 PAs allocated to on call. The unit is well supported by middle grade &amp; trainee cover both in and out of hours.&lt;/p&gt;\n&lt;p&gt;There is a generous relocation package available to successful candidates. There is an option for mentorship for Consultants.&lt;/p&gt;\n&lt;p&gt;All ICU consultants have office space on the unit and there is shared secretarial support available.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Dr Sujad Kiani&lt;/p&gt;\n&lt;p&gt;Job title Lead Consultant, Intensive Care Medicine&lt;/p&gt;\n&lt;p&gt;Email address sujad.kiani@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number 01332 788694&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120972.jpg", "name": "University Hospitals of Derby and Burton NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120972"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Derby Hospital, Derby", "postalCode": "DE22 3NE"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9104", "longitude": "-1.51382"}}, "title": "Consultant in Adult Intensive Care", "url": "https://www.jobs.nhs.uk/xi/vacancy/916219737", "validThrough": "2020-11-11T23:59:59+0000"}