{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157"}}, "datePosted": "2020-11-03T15:46:40+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for a motivated and compassionate Co-ordinator to join the Intermediate Care Allocation Team (ICAT).&lt;/p&gt;\n&lt;p&gt;The ICAT team is an integrated team of health and social care professionals providing a single point of access to a range of intermediate care services across East Lancashire from both hospital and community settings.&lt;/p&gt;\n&lt;p&gt;The ICAT coordinator role is required to support the ICAT team working under the right care, right place, right time agenda to ensure the efficient utilisation of our 24 Residential Rehabilitation beds is maximised as well as commissioning crisis care and reablement packages and making appropriate referrals to varying Community services.&lt;/p&gt;\n&lt;p&gt;The role will assist and support the ICAT team, as well as Intensive Home Support professionals, with front line duties as part of the multi-disciplinary decision making processes, assessment and intervention. The post is primarily office based manning a busy incoming phone line, therefore an excellent telephone manner if required. At times it may include undertaking face to face assessments of need which may be done within the service user’s own home or one of the residential rehab establishments. Following on from the assessment whether by phone or in person you will then effectively commission a plan of care and ensure the service user accesses the right professional/service required at that time. The ICAT coordinator will also receive the Trusted Assessments from the Integrated Discharge Team and plan and coordinate a range of intermediate care services as per recommendations. The ICAT team are responsible for taking all health referrals for the Intensive Home Support Service. You will generally carry a small but rapidly changing caseload of service users.&lt;/p&gt;\n&lt;p&gt;The ICAT service operate over 7 days and extended hours until 10pm and the candidate will be expected to be flexible to cover the necessary shifts.&lt;/p&gt;\n&lt;p&gt;We are seeking to recruit a highly motivated individual with significant experience in the health and social care sector. The ideal candidate will have experience of direct work with patients/service users in either a community or hospital setting providing holistic assessments of need and be able to confidently and sometimes independently make recommendations with regards to efficient resource allocation. ICAT coordinators need to be able to keep calm, yet responsive in emergency situations, be able to adapt to an unpredictable and demanding workload and possess excellent communication skills as you will be working with individuals and their family members in times of crisis.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameAlex TownsendJob titleICAT ManagerEmail addressalex.townsend@elht.nhs.ukTelephone number01282 805989&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "East Lancashire Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120742"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St Peter&#39;s Centre, Burnley", "postalCode": "BB11 2DL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7914", "longitude": "-2.23893"}}, "title": "ICAT Co-ordinator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254633", "validThrough": "2020-11-10T23:59:59+0000"}