{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-11-03T08:45:55+0000", "description": "&lt;p&gt;An exciting opportunity has arisen to work in our busy and expanding Respiratory Physiology department to provide cover for a 12 month secondment, providing Respiratory Physiology services for patients across East Kent.&lt;/p&gt;\n&lt;p&gt;The department provides services across the trust at several sites including Canterbury, Margate and Dover. We are looking for an individual who is able to work both independently and as part of a growing team to provide accurate respiratory diagnostic services to our patients. Services provided include the performance of full Pulmonary Function Tests, with lung volumes measured via body plethysmography and nitrogen washout, Reversibility studies, Respiratory Muscle Assessments, Six Minute Walk Tests and FeNO. Experience in performing capillary blood gases and Cardio-Pulmonary Exercise Testing would be advantageous as we look to expand these services.&lt;/p&gt;\n&lt;p&gt;The role will also include deputising for the Chief Respiratory Physiologist to manage and run the service on a daily basis, to participate in service develop and to assist with the training and development of junior staff.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Kirstie Rogers, Job title: Chief Respiratory Physiologist, Email address: kirstie.rogers1@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "East Kent Hospitals University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121462"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Kent and Canterbury Hospital, Canterbury", "postalCode": "CT1 3NG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2666", "longitude": "1.08711"}}, "title": "Senior Respiratory Physiologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253180", "validThrough": "2020-11-17T23:59:59+0000"}