{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "13448", "minValue": "13448", "unitText": "YEAR", "value": "Band 7-8a equivalent"}}, "datePosted": "2020-11-02T09:31:10+0000", "description": "&lt;p&gt;&lt;strong&gt;Greenbrook Healthcare - Together, we deliver the future of Urgent Care&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;br /&gt;&lt;/strong&gt;&lt;strong&gt;&lt;br /&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Emergency Practitioner - Ashford WIC and Woking WIC&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Permanent and Bank positions available&lt;/li&gt;\n&lt;li&gt;Full + Part time roles available&lt;/li&gt;\n&lt;li&gt;Location - Ashford WIC and or Woking WIC&lt;/li&gt;\n&lt;li&gt;Salary - Band 7 - Band 8a&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Benefits:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;6 weeks annual leave&lt;/li&gt;\n&lt;li&gt;NHS Pension&lt;/li&gt;\n&lt;li&gt;Opportunities for education, training and career development&lt;/li&gt;\n&lt;li&gt;Work as a part of a dynamic WIC team&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Are you an experienced Emergency Practitioner who is passionate about Primary Care?&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Do you want to develop your clinical skills&lt;/em&gt;&lt;em&gt;and have the opportunity to progress?&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Do you want to&lt;/em&gt;&lt;em&gt;help us to deliver an even better service to our patients?&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;em&gt;If you&#39;ve answered yes to the above, then we want to hear from you!&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Greenbrook Healthcare is an innovative primary care provider working in Partnership with CSH Surrey, a Community Healthcare provider. We are looking for ENPs and ECPs to join the nursing team located at the Ashford Hospital Walk in Centre and Woking Hospital Walk in Centrein Surrey. The WICs are an 8am to 8pm service, open 365 days a year. The services are staffed by a team of experienced ENPs and ECPsdelivering high quality care.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We’re flexible in how you chose to work for us. If you’re looking for a committed salaried position we can offer you a highly competitive salary along with access to our generous benefits scheme, including the NHS pension, six weeks annual leave and educational opportunities. Likewise, if you’re looking for ad-hoc sessional work you can join our bank of nurses and enjoy above market rates, picking up sessions as and when you’ve the time to carry them out.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;If you’re looking for diversity, as a Greenbrook Emergency Practitioner you’ll be offered the opportunity to work across all of our UTCs, and walk-in-centres; creating your own portfolio, built around your interests and availability.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Being clinically managed also means we can develop paths for nurses looking for career progression. We also regularly run educational events, peer to peer learning sessions and of course you’ll be supported by our network of over 800 staff.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;A full list of responsibilities and requirements can be downloaded.&lt;/p&gt;\n&lt;p&gt;ou will be qualified and an experienced Emergency Practitioner with skills in:&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Minor injury – incl. X-ray interpretation, suturing, plastering, management of complex wounds and injury skills (not essential for ANPs)&lt;/p&gt;\n&lt;p&gt;Minor illness – incl. common minor illness (training provided for suitable candidates)&lt;/p&gt;\n&lt;p&gt;Competent in autonomous assessment, examination, diagnosis and treatment Prescribing qualification desirable&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;It is expected that your application (likely on your CV) contains the following information:&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;An accurate account of your employment history including length of service in each appointed position.&lt;/p&gt;\n&lt;p&gt;Details of any qualifications you hold and professional registrations relevant to this position.&lt;/p&gt;\n&lt;p&gt;Contact details of at least two referees covering a minimum of the past three years of employment - where possible* *Referees will not be contacted without your consent.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Disclosure and Barring Service Check&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This post is subject to the Rehabilitation of Offenders Act (Exceptions Order) 1975 and as such it will be necessary for a submission for Disclosure to be made to the Disclosure and Barring Service (formerly known as CRB) to check for any previous criminal convictions.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/133614.jpg", "name": "Greenbrook Healthcare", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133614"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Ashford", "postalCode": "TW15 3FE"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4435", "longitude": "-.474047"}}, "title": "Emergency Nurse/Care Practitioner - Ashford and Woking WiC (Band 7-8a)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251412", "validThrough": "2021-01-31T23:59:59+0000"}