{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum pro rota"}}, "datePosted": "2020-11-06T14:16:37+0000", "description": "&lt;p&gt;Are you a Registered Children&#39;s Nurse who enjoys working in a fast past and demanding environment? Are you seeking a position where you can develop your skills in the assessment and care of children with a range of clinical conditions?&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This is an exciting time to join the Paediatric ED Team as we are looking to expand our Paediatric Nursing Team within the Emergency Department at Kettering General Hospital.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are seeking both full and part time Registered Children&#39;s Nurses to join our team.&lt;/p&gt;\n&lt;p&gt;The Emergency Department is an exciting and unpredictable place of work, the nature and the pace of the job can change dramatically. If you are dynamic, caring and a professional individual who enjoys a challenge then this could be the job for you!&lt;/p&gt;\n&lt;p&gt;The department offers a wide range of emergency services including minor injuries, adult, children’s and a level 2 trauma unit. You will work the majority of your shifts within the Paediatric area of the Emergency Department but at times you will support other areas within the Emergency Department and across the trusts Paediatric Services which will enable you to develop your specialist skill set and knowledge base.&lt;/p&gt;\n&lt;p&gt;Key aspects of the role include:&lt;br /&gt;&lt;br /&gt;• Being responsible for the delivery of high quality, compassionate patient centred care, by prioritising patients using your expert clinical knowledge. Skilled in assessment, planning, implementation and the re-evaluation of care, you will guide the patient through their journey in the department. &lt;br /&gt;&lt;br /&gt;• Being responsible for ensuring the environment and equipment is clean, maintained, tidy and well stocked, confirming the department is prepared for every eventuality. You will act at all times in accordance within the codes of your governing bodies (NMC) and local standards of care and policies.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;This post is challenging but will provide you with varied experience and opportunities for professional development within a friendly and supportive team. Training and opportunities to broaden your experience will be available as appropriate.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;Child Branch Student Nurses would be considered for this position if they are due to qualify in the next 3 - 6 months. Newly qualified Children&#39;s Nurses will also have the opportunity to commence the Trusts Rotational Programme for Children&#39;s Nurses.&lt;/p&gt;\n&lt;p&gt;We welcome applications from Nurse Associates and we would love to hear from you for a further discussion about your development.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Charlie Nunn&lt;/p&gt;\n&lt;p&gt;Job title Paediatric ED Sister&lt;/p&gt;\n&lt;p&gt;Email address charlotte.nunn@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number 01536 492440&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120843.png", "name": "Kettering General Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120843"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Kettering General Hospital, Kettering", "postalCode": "NN16 8UZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4028", "longitude": "-.741278"}}, "title": "Registered Paediatric Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916260103", "validThrough": "2020-11-22T23:59:59+0000"}