{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "35000", "minValue": "30000", "unitText": "YEAR", "value": "£30,000-£35,000 pa pro rata"}}, "datePosted": "2020-10-26T17:45:12+0000", "description": "&lt;p&gt;A new and exciting opportunity has arisen to join the People Services team at gtd healthcare as a People Business Partner.&lt;/p&gt;\n&lt;p&gt;This senior role will be a new addition to the People Services Team and with work alongside a second Business Partner to be responsible for providing strategic people/HR support to their designated service areas. This role has been added to the team as part of a review of the People Services function in order to help improve our current ways of working and encourage best practice in our service delivery.&lt;/p&gt;\n&lt;p&gt;Therefore, in order to support this period of growth the successful candidate will be someone who has strong HR generalist experience who can help shape the future of our team!&lt;/p&gt;\n&lt;p&gt;The People Business Partner will have the following key responsibilities (full role &amp; duties can be found in the job description):&lt;br /&gt;• Support business areas in the management of all employee relations issues, including disciplinary and grievance, performance management, absence management and restructure/TUPE processes. Provide advice and guidance in line with Company policies and procedures, employment law and best practice.&lt;br /&gt;• Provide day to day supervision and guidance to the People Services Officers and Administrators.&lt;br /&gt;• Support the Academy Manager in identifying scope for training and development of employees, linking with performance development plans and succession planning.&lt;br /&gt;• Liaise with the Academy Manager to develop bespoke training programmes as required, including delivery of training as appropriate.&lt;br /&gt;• Support the Head of People Services in reporting on people KPI’s, attending regular meetings and presenting this information to key business colleagues.&lt;br /&gt;• Drive employee engagement and wellbeing initiatives, e.g. through employee forums.&lt;br /&gt;• Support the Head of People Services to regularly review reward and benefits structures.&lt;br /&gt;• Proactively identify, develop and implement improvements to systems, policies and procedures to enhance service efficiency, and support the Head of People Services and wider business colleagues with a range of projects and initiatives as required.&lt;br /&gt;• Support the workforce planning of designated business areas, including assisting the Recruitment Officer with recruitment processes &amp; attending interviews as required.&lt;br /&gt;&lt;br /&gt;It is essential for the successful candidate to be CIPD qualified to level 5 or above, and to possess a good standard of written and oral communication skills, including GCSE English qualifications. It’s also required that applicants will have a driving license to support travel to various sites.&lt;br /&gt;&lt;br /&gt;The ideal candidate will have extensive experience in dealing with a range of complex and challenging employee relations issues, and will be able to reference and demonstrate positive outcomes reached from their management of these processes. This role will be a generalist role and therefore will also require experience and understanding of a range of people issues, from recruitment and onboarding, learning and development, succession planning, reporting &amp; use of HR systems, etc.&lt;br /&gt;&lt;br /&gt;This is a fast paced role and therefore individuals should be able to demonstrate that they are comfortable working under pressure and to tight deadlines, whilst being able to maintain a professional and friendly attitude.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/130019.png", "name": "gtd healthcare", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130019"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Manchester", "postalCode": "M34 2GP"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4503", "longitude": "-2.13308"}}, "title": "People Business Partner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243576", "validThrough": "2020-11-08T23:59:59+0000"}