{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 Per Annum"}}, "datePosted": "2020-11-02T16:01:05+0000", "description": "&lt;p&gt;&lt;strong&gt;An exciting opportunity has arisen for a enthusiastic and driven Band 5 Occupational Therapists to join the Therapy Team Bank at East Cheshire NHS Trust.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for dynamic Bank Occupational Therapists with good communication skills, enthusiasm and flexibility to join us to work with our patients in the Macclesfield area of East Cheshire.&lt;/p&gt;\n&lt;p&gt;With COVID-19 continuing to impact on health care provision, we are expanding our capacity over the winter period and need your support to continue to deliver excellent care to our patients.&lt;/p&gt;\n&lt;p&gt;We are looking for a group of bank Occupational Therapists with HCPC registration and a passion for rehabilitation, to join our temporary workers. You will have sound clinical skills in the assessment and rehabilitation of patients. As a flexible Bank worker, you are employed on an ‘as and when required’ basis or there may be an opportunity for a fixed term contract, whichever suits you.&lt;/p&gt;\n&lt;p&gt;You would join our band 5 rotation wherever there was a need. Areas covered include: Orthopaedics, Hand therapy Outpatients, Rheumatology, Surgery, Medicine, Community Rehabilitation, Intermediate care, and Paediatrics.&lt;/p&gt;\n&lt;p&gt;There is opportunity for CPD and in-service training and supervision from experienced senior Occupational Therapists.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the service:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The East Cheshire Occupational Therapy Service delivers care in a variety of settings, including acute hospitals, rehabilitation centres and community clinics.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This post is an excellent opportunity to start and progress your career and is suitable for both newly qualified and experienced Band 5 occupational therapists.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are a forward thinking and evolving Occupational Therapy service, offering a range of staff experiences from Therapy Assistants through to Advanced Clinical Specialists. Each discipline is supported by a professional lead, with strong links with GP’s, Consultants and local Universities.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What we are looking for:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;We are looking for an enthusiastic and well-rounded HCPC registered Occupational Therapist with experience of working in the NHS or having had extensive placements within the organisation.&lt;/li&gt;\n&lt;li&gt;The candidate should be self-motivated with excellent communication skills and the ability to work both autonomously and within the occupational therapy team and wider MDT. Organisation and time management is key to efficiently managing personal caseloads.&lt;/li&gt;\n&lt;li&gt;The candidate should provide a patient centred approach to care an under pinning sound clinical knowledge in evidence based assessment and management of a variety of conditions.&lt;/li&gt;\n&lt;li&gt;It will be essential for the post holder to work autonomously within trust policies and professional practice, in addition to maintaining accurate and comprehensive patient records.&lt;/li&gt;\n&lt;li&gt;Weekend working is available once competencies have been completed.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;A full UK driving licence and access to a vehicle, or be able to demonstrate means of meeting the travel requirements of the post.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What we offer in return:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;On commencing the role you will have a full induction. Our junior mentorship programme offers regular supervision from a named mentor, setting individual objectives, promoting self-analysis/reflection and development. The support provided will correlate directly with the hours and contract offered. All staff, irrespective of their post, will be given equal opportunity to undertake a full variety of CPD to support and develop them in their role.&lt;/li&gt;\n&lt;li&gt;All Occupational Therapists benefit from regular CPD with access to advice and support from our clinical specialist occupational therapists, receiving monthly Peer review sessions, and participating in monthly In-service training, working towards clinical competencies relevant to each rotation.&lt;/li&gt;\n&lt;li&gt;Service development and innovation is strongly encouraged alongside participation in audit and research. The service has strong links with the Arthritis Research UK Primary Care Centre at Keele University and regularly participates in research trials&lt;/li&gt;\n&lt;li&gt;Internal promotion and succession planning is integral to staffing within East Cheshire Trust and staff will be encouraged to apply for higher banded permanent opportunities as they arise, if deemed competent.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;If you are a motivated Occupational Therapist who likes to work within a supportive occupational therapy framework, developing independent working and wishes to gain experience in the wider health community we would like to hear from you.&lt;/p&gt;\n&lt;p&gt;This post is Bank&lt;/p&gt;\n&lt;p&gt;Hours per week: (zero) as and when required&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing date: 16th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Please be aware that this post requires an Enhanced Disclosure and Barring Service (DBS) check, the cost of which is payable by the successful candidate.&lt;/p&gt;\n&lt;p&gt;If you have lived or worked abroad for 6 months or more in the last 5 years you will need to obtain an overseas police clearance. Further information can be found on the additional information links at the bottom of the advert.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;To keep up to date with all of our latest Recruitment activity here at East Cheshire NHS Trust, take a look at our Careers website with lots of information on how to join our team and Facebook and Twitter pages, links to which can be found on the right hand side:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Visit our Facebook page: Careers at East Cheshire NHS Trust&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Follow us on Twitter: @CareersECT&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Ros Hope Job title Acute Therapies Team Manager Email address roshope@nhs.net Telephone number 01625661488&lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;Rachel Pepler&lt;/p&gt;\n&lt;p&gt;R.pepler@nhs.net&lt;/p&gt;\n&lt;p&gt;01625 661488&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121085.jpg", "name": "East Cheshire NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121085"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Macclesfield District General Hospital, Macclesfield", "postalCode": "SK10 3BL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.2623", "longitude": "-2.14158"}}, "title": "Bank Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252739", "validThrough": "2020-11-16T23:59:59+0000"}