{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 per annum"}}, "datePosted": "2020-10-26T03:31:31+0000", "description": "&lt;p&gt;&lt;strong&gt;Job Title – District Nurse / Senior Community Nurse&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Base – Cotswolds Integrated Community Teams&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary – &lt;/strong&gt;&lt;strong&gt;£31,365-£37,890&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours per week – 37.5 &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;1 x Fixed Term contract/secondment opportunity for up to 12 months &lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Internal applicants who wish to be considered for a secondment opportunity should discuss with their line manager the suitability of a possible secondment* &lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Are you an experienced Community Nurse ready for development or a District Nurse/Senior Community Nurse looking for your next role?&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Do you want to work for a unique, dynamic organisation that is transforming adult community services locally?&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;If this is you, we’d love to hear from you. We are looking for highly motivated professionals with a passion for improving patient care and patient experience, to join our team in providing high standards of quality care.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are a fully integrated service based in thestunning Cotswold’s, working with MDT colleagues in an Integrated Community Team. We are aligned to Primary Care Networks, to deliver care around the placed based model, fit for the future. This will be an exciting time to join Gloucestershire Health and Care NHS Foundation Trust as you will be assisting in the implementation of a New Model of Patient Care.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;To excel in this role you will require excellent communication skills, the courage to make decisions which will help shape future care and a willingness to develop your potential. You will require current NMC registration as a Registered Nurse, a sound knowledge of evidence based care and best practice and evidence of post-registration development with community nursing experience.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;You will work alongside our team of dedicated professionals including nurses, therapists, reablement workers and the administration teams. You will have a great professional support network which includes regular interaction and team meetings, allowing shared growth and learning and development. We operate a shift system which includes early and late shifts across 7 days including weekends and bank holidays.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are a modern trust, utilising mobile working with the use of laptop and smart phone devices, facilitating effective and efficient access to patient records to enable contemporaneous recording and up to date patient information.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If you are a Registered Nurse with a graduate qualification in a health related subject and significant post-registration community experience, or if you have achieved the Specialist Practitioner Qualification in District Nursing, this may be the job for you! &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For an informal discussion, please contact Jo Daniel – Team Manager on 07899064812 or Jo Curry – Professional Lead for Community Nursing on 07917516027 &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The qualification, training &amp; experience requirements for the role are defined in the Job Description/Person Specification.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Shortlisting date: 18&lt;/span&gt;&lt;span&gt;th&lt;/span&gt;&lt;span&gt; November 2020&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Closing date: 2&lt;/span&gt;&lt;span&gt;nd&lt;/span&gt;&lt;span&gt; December 2020&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;A valid UK driving licence plus the use of own transport for business purposes is essential. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;To ensure you fully understand how the Trust, as a Data Controller, will process and store your data please read the attached document ‘Applicant and Staff Privacy Notice’ prior to applying for the role.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Candidates for any staff appointment shall, when making application, disclose in writing to the Trust whether they are related to any governor. Failure to disclose such a relationship may disqualify a candidate and, if appointed, may render him/her liable to dismissal.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120776.png", "name": "Gloucestershire Health and Care NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120776"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Cirencester", "postalCode": "GL7 1EB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7149", "longitude": "-1.96396"}}, "title": "District Nurse - Band 6", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241649", "validThrough": "2020-11-17T23:59:59+0000"}