{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 to £24,157 pa"}}, "datePosted": "2020-11-05T17:45:10+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;em&gt;Senior Healthcare Technical Officer&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As a Senior Healthcare Technical Officer you will act as the first point of contact for hospitals requesting emergency deliveries, ensuring that their orders are entered and issued with the utmost efficiency. As well as performing a number of technical and scientific tasks - such as monitoring the temperature of storage units and undertaking maintenance duties we’ll rely on you to assist in the training and development of other support staff.&lt;/p&gt;\n&lt;p&gt;Plymouth are a combined Hospital Services and Transport department so you will be required to deliver orders, including under emergency conditions to Hospitals in Devon and Cornwall. Your duties will also include collecting products from donor sessions in the region.&lt;/p&gt;\n&lt;p&gt;We’re looking for a level 4 qualification e.g. BTEC or HNC in a relevant science subject, NHSBT Foundation Degree OR equivalent knowledge and experience of working in a manufacturing, logistics or supply chain environment requiring intermediate level theoretical knowledge acquired through formal training.&lt;/p&gt;\n&lt;p&gt;You’ll ideally have a working knowledge of basic IT packages and some experience of working unsupervised in a laboratory environment. A good team player, you’ll be capable of motivating both yourself and others as you tackle a wide variety of tasks.&lt;/p&gt;\n&lt;p&gt;This is a shift-based post covering day, evenings nights and bank holidays with some lone working. There is an 8-week shift pattern. The shifts will be an average of 7.5 hours between the hours of 8am and 1am.  There will also be a requirement to participate in an On call Rota.&lt;/p&gt;\n&lt;p&gt;NHS Blood and Transplant (NHSBT) offers a dynamic and friendly working environment where teamwork is highly valued. Personal development is also considered a priority and is supported through extensive training and development opportunities open to all employees.&lt;/p&gt;\n&lt;p&gt;Secondments will be considered for NHSBT staff wishing to apply for this role. Please check with your current line manager to see if you could take this role on a secondment basis, before applying. &lt;/p&gt;\n&lt;p&gt;This vacancy will close at 23:59 on Sunday 15th November 2020.&lt;/p&gt;\n&lt;p&gt;If you are invited to a selection day, we anticipate this will be taking place week commencing Monday 23rd November 2020.&lt;/p&gt;\n&lt;p&gt;If you have any enquiries regarding the vacancy, please contact kate.joynes@nhsbt.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NHS Blood and Transplant (NHSBT)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120628"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Plymouth", "postalCode": "PL6 8DH"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.4167", "longitude": "-4.11371"}}, "title": "Senior Healthcare Training Officer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258735", "validThrough": "2020-11-15T23:59:59+0000"}