{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 pa/pr"}}, "datePosted": "2020-11-05T12:34:35+0000", "description": "&lt;p&gt;We have an exciting opportunity for Registered Nurses (Band 5) both full time / part time to join the Hull and East riding Nursing and Conditions community teams. Applications are invited from registered nurses who wish to join a friendly, dynamic and progressive team based within City Health Care Partnership CIC Out of Hours Nursing team. The evening and overnight service operates across Hull and East Riding providing care for patients requiring nursing intervention in their own home. You must be flexible in your approach to practice, have excellent communication skills, be adaptable and be able to lead and drive forward change ensuring patient safety is maintained at all times.&lt;/p&gt;\n&lt;p&gt;CHCP CIC is committed to developing its clinical workforce and therefore offers the successful candidate opportunities for further study and career progression.You will be joining dynamic and proactive nursing teams which working in partnership with associated health and social care providers. This is an ideal opportunity for those who enjoy developing new ways of working and working under their own initiative.&lt;/p&gt;\n&lt;p&gt;The ability to commute within CHCP CIC&#39;s geographical areas with access to appropriate means of transport is essential.&lt;/p&gt;\n&lt;p&gt;Contact Sorelle Moore Clinical team lead on &lt;span style=&quot;text-decoration: underline;&quot;&gt;sorelle.moore@nhs.net&lt;/span&gt; or 07834319378.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/124994.jpg", "name": "City Health Care Partnership CIC", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=124994"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hull &amp; East Riding", "postalCode": "HU3 4AE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7302", "longitude": "-.374505"}}, "title": "Community Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257685", "validThrough": "2020-11-15T23:59:59+0000"}