{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-11-03T14:47:06+0000", "description": "&lt;p&gt;Do you want to help improve the quality and safety of healthcare services, and the experiences of patients and carers? The Patient Experience Team (PET) is looking for another outstanding individual to join our team of leads. You will be totally committed to the Trust’s values, and expected to demonstrate that those values underpin your work with patients and staff.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;We see every complaint is an opportunity for us to better understand and improve the quality of our services.&lt;/p&gt;\n&lt;p&gt;Dealing with complaints is a challenging and demanding role. When patients or carers contact the PET, they are already unhappy with the experience they have had, it is also difficult for our staff to hear that a patient has not had a good experience while under their care. You will have a thorough understanding of the NHS, sharp analytical skills and experience of providing a service focused on customer care. Your communication skills, both written and verbal, will be outstanding. You will be able to demonstrate well developed skills in negotiation, problem solving and drafting. You will need to be resilient and able to diffuse difficult situations, and you will continue to deliver work of a high standard even when under pressure to meet tight timescales.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Most importantly you will ensure that each complaint is listened to, understood, properly considered, appropriately responded to and learnt from.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;This vacancy will close before the advertised closing date if sufficient applications are received.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Kim Kirk - Head of Patient Experience&lt;/p&gt;\n&lt;p&gt;Email address: kim.kirk2@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number: 07710813582&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Sherwood Forest Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120977"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "King&#39;s Mill Hospital, Sutton-In-Ashfield", "postalCode": "NG17 4JL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.1345", "longitude": "-1.23627"}}, "title": "Divisional Patient Experience Lead", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254414", "validThrough": "2020-11-15T23:59:59+0000"}