{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pa pro rata"}}, "datePosted": "2020-11-05T16:31:09+0000", "description": "&lt;p&gt;We are pleased to advertise for 2 Senior Assistant Psychologists to join Northamptonshire Healthcare NHS Foundation Trust&#39;s (NHFT) role in supporting staff through the coronavirus pandemic. These posts will be supervised by, and support the work of qualified Clinical Psychologists, supporting the well-being of care home staff, developing psychoeducational materials for staff and contributing to the overall staff well-being programme. Successful candidates will maintain a database of the support being offered to care homes across the county, support managers with well-being surveys for their staff, liaise with individual staff members and link them in with the Changing Minds IAPT service and the third sector where appropriate.&lt;/p&gt;\n&lt;p&gt;Regular clinical supervision will be provided as are many opportunities to learn about a wide range of presentations and services due to the integrated nature of the Psychology Services within NHFT. Depending on the demands of the above role, clinical experience can be offered in a variety of areas, including neuropsychological assessment, in-patient and group work. It is essential that applicants have a recognised undergraduate degree in Psychology and have the Graduate Basis for Registration with the British Psychological Society. Experience of working within IAPT, counselling roles and staff support could be beneficial.&lt;/p&gt;\n&lt;p&gt;We request that applicants write a short piece (no more than 500 words) entitled:&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&quot;What are the psychological needs of care home staff during the coronavirus pandemic?”&lt;/em&gt; and include this in their supporting information.&lt;/p&gt;\n&lt;p&gt;Successful applicants will be invited for interview on the 24th November with a view to starting in post from mid January.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Dr Alexis Berry&lt;/p&gt;\n&lt;p&gt;Job title Consultant Clinical Psychologist&lt;/p&gt;\n&lt;p&gt;Email address alexis.berry@nhft.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number  077111 88334&lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;If you would like to discuss this opportunity, please contact Dr Alexis Berry, Consultant Clinical Psychologist (alexis.berry@nhft.nhs.uk) to arrange a time.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Northamptonshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121219"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Berrywood Hospital, Duston", "postalCode": "NN5 6UD"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.2475", "longitude": "-.960105"}}, "title": "Senior Assistant Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258573", "validThrough": "2020-11-15T23:59:59+0000"}