{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890"}}, "datePosted": "2020-10-30T14:00:39+0000", "description": "&lt;p&gt;The Community Paediatric Service are looking to recruit an enthusiastic, dynamic and passionate practitioner to work as part of the team, to provide clinical assessment, advice and intervention for children with neurodevelopmental needs.&lt;/p&gt;\n&lt;p&gt;The post holder will work closely with the consultant paediatricians, additional clinical and admin staff within the team, and colleagues from varied agencies across Oldham.&lt;/p&gt;\n&lt;p&gt;They will play a key role in contributing to the assessment processes, through direct clinical interventions across a range of community settings and to undertake the assessment planning, implementation and evaluation of a variety of therapeutic approaches, both independently and as a member of the MDT.&lt;/p&gt;\n&lt;p&gt;They will hold caseload management responsibilities for a defined cohort of children and young people, undertake case management responsibilities within the caseload in an autonomous manner, and ensure the highest quality assessment for children and families referred to the service using a range of evidence based assessment tools.&lt;/p&gt;\n&lt;p&gt;The applicant will need to have a sound knowledge of child development and SEND, and have the ability to challenge others in the best interest of the child and family. They will be required to communicate with parents and a range of professionals, and have the ability manage difficult and sometimes emotive situations.&lt;/p&gt;\n&lt;p&gt;The Community Paediatric Service is part of the children&#39;s integrated health teams and works closely with colleagues from therapies and nursing to support children with SEND. The team are continually working towards improvements to provide the best possible outcomes for children and families in Oldham. This provides the post holder with great opportunities to work jointly with colleagues and draw upon their specialist knowledge to provide quality care planning for children and their families.&lt;/p&gt;\n&lt;p&gt;In line with the Trust’s Single Equality Scheme we welcome applications from everyone irrespective of ethnic origin, disability, age, gender, gender identity, sexual orientation, disability, nationality, religion, marital status, social back ground or trade union membership. However, as members of ethnicity minority groups and individuals with disabilities are currently under-represented at this level of post, we would encourage applications from members of these groups. Appointment will be based on merit alone.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Alison Kippax Job title Advanced Nurse Practitioner&lt;/p&gt;\n&lt;p&gt;Email address alison.kippax@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number 01614841252&lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;If Alison Kippax is unavailable please ask for Catherine Fox, Assistant Directorate Manager.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121715.jpg", "name": "Salford Royal NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121715"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Werneth Primary Care Centre, Oldham", "postalCode": "OL9 7AY"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.533", "longitude": "-2.1329"}}, "title": "Neurodevelopmental Practitioner for Community Paediatric Service ASD/", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250450", "validThrough": "2020-11-15T23:59:59+0000"}