{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "41638", "minValue": "28257", "unitText": "YEAR", "value": "£16.81 - £24.77 p/h dependent on shift"}}, "datePosted": "2020-11-03T08:45:48+0000", "description": "&lt;p&gt;Bank Registered Mental Health Nurse&lt;/p&gt;\n&lt;p&gt;Directorate: Temporary Staffing Service&lt;/p&gt;\n&lt;p&gt;Band: 5&lt;/p&gt;\n&lt;p&gt;Rates of pay dependent on shift&lt;/p&gt;\n&lt;p&gt;Basic: £16.81&lt;/p&gt;\n&lt;p&gt;Night/Saturday: £19.33&lt;/p&gt;\n&lt;p&gt;Sunday/Bank Holiday: £21.85&lt;/p&gt;\n&lt;p&gt;We also offer enhanced rates for working within our more critical areas (e.g. A&amp;E, ICU):&lt;br /&gt;&lt;br /&gt;Basic: £19.05&lt;/p&gt;\n&lt;p&gt;Night/Saturday: £21.91&lt;/p&gt;\n&lt;p&gt;Sunday/Bank Holiday: £24.77&lt;/p&gt;\n&lt;p&gt;Here at Medway, we pride ourselves on working together as one to ensure that our shared vision of Better, Best, Brilliant is achieved. With strong leadership the day to day experience for our teams is a great one, staff are valued, excellent quality care is provided and the passion for continuous improvement is high.&lt;/p&gt;\n&lt;p&gt;Our Trust is a great choice for people who want to develop their career in an ambitious and dynamic environment; we also offer an excellent benefits package which includes onsite childcare facilities, various salary sacrifice schemes and a generous annual leave entitlement.&lt;/p&gt;\n&lt;p&gt;We are recruiting for a Registered Mental Health Nurse who shares our ambition and vision to deliver the &lt;strong&gt;&lt;em&gt;Best of Care by the Best People&lt;/em&gt;&lt;/strong&gt; and has the drive to take us forward, by ensuring that the Trust continues to be the first choice for patients and our staff.&lt;/p&gt;\n&lt;p&gt;The successful post holder will be expected to ensure that patients’ receive high quality clinical care and a good patient experience, having regard for their customs, religious beliefs and doctrines.&lt;/p&gt;\n&lt;p&gt;As a Registered Mental Health Nurse you will ensure that you carry out clinical practice within designated clinical areas, ensuring that high quality, current evidence-based nursing assessment, cares planning, implementation, interventions and evaluations for patients is provided from admission through to discharge.&lt;/p&gt;\n&lt;p&gt;In return for your hard work and dedication, The Temporary Staffing Service offers the following benefits:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Free mandatory training and daily rate for training provided&lt;/li&gt;\n&lt;li&gt;Cost of DBS and uniform is covered by the Trust&lt;/li&gt;\n&lt;li&gt;Priority shift booking over agency staff&lt;/li&gt;\n&lt;li&gt;Support for revalidation&lt;/li&gt;\n&lt;li&gt;Enrolment into excellent NHS Pension scheme&lt;/li&gt;\n&lt;li&gt;Opportunities to work in specialist areas and develop key skills and experience&lt;/li&gt;\n&lt;li&gt;Short-term, medium-term long-term “lines of work” available in a variety of areas (guaranteed shifts)&lt;/li&gt;\n&lt;li&gt;Weekly payroll&lt;/li&gt;\n&lt;li&gt;Online shift booking, allowing for shifts to be booked via smart phones and no need for paper timesheets&lt;/li&gt;\n&lt;li&gt;Dedicated team to ensure you are supported&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Our culture and values are what drives Medway NHS Foundation Trust and is the heartbeat of who we are as an organisation. It is important that you understand and to refer to our values when you are completing your application and always reflect our values throughout your employment with the Trust.&lt;/p&gt;\n&lt;p&gt;Our values are &lt;strong&gt;B&lt;/strong&gt;old, &lt;strong&gt;E&lt;/strong&gt;very Person Counts, &lt;strong&gt;S&lt;/strong&gt;haring and Open and &lt;strong&gt;T&lt;/strong&gt;ogether. We are inspiring and ambitious, respectful and supportive, open and we speak up, we are inclusive and responsible.&lt;/p&gt;\n&lt;p&gt;To contribute to our exciting future and become part of our team, apply today.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameIain TreadwayJob titleDeputy Clinical Nurse SpecialistEmail addressiain.tredway@nhs.net&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121062.png", "name": "Medway NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121062"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Gillingham, Kent", "postalCode": "ME7 5NY"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3783", "longitude": ".542246"}}, "title": "Bank Registered Mental Health Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253175", "validThrough": "2020-11-30T23:59:59+0000"}