{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "42865", "minValue": "26795", "unitText": "YEAR", "value": "£15.94  - £25.50"}}, "datePosted": "2020-11-04T15:53:37+0000", "description": "&lt;p&gt;An opportunity currently exists for experienced Registered Nurses to join the Urgent Public Health Research team based at the Queen Alexandra Hospital for an initial period of 3 to 6 months.&lt;/p&gt;\n&lt;p&gt;During this challenging time, Registered Nurses will be working as part of a team delivering high quality clinical research for the Trust.&lt;/p&gt;\n&lt;p&gt;We are seeking RN’s with diverse acute ward experience, ideally having worked within Respiratory High Care or ‘Covid’ wards. Phlebotomy experience is also desirable.&lt;/p&gt;\n&lt;p&gt;Key responsibilities include but are no means limited to:&lt;/p&gt;\n&lt;p&gt;-          Contributing to the coordination and delivery of Clinical Trial activities within Portsmouth Hospitals University NHS Trust&lt;/p&gt;\n&lt;p&gt;-          Assisting with the review of new Trial protocols and contribute to the assessment of their clinical and practical implications to local patients.&lt;/p&gt;\n&lt;p&gt;-          To assist in the management of the local requirements for a number of approved Clinical Trial protocols.&lt;/p&gt;\n&lt;p&gt;-          To assist in the identification, screening and assessment of the suitability of local patients to take part in Clinical Trials, in accordance with specified inclusion/exclusion criteria.&lt;/p&gt;\n&lt;p&gt;This post is initially for a 3-6 month period, with ongoing day shifts that could also include weekends.&lt;/p&gt;\n&lt;p&gt;To be considered for this critical post, please submit your most recent CV at your earliest convenience.&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/135154.jpg", "name": "Portsmouth Hospitals NHS Trust Staff Bank", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=135154"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Portsmouth", "postalCode": "PO6 3LY"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8502", "longitude": "-1.06936"}}, "title": "Bank Research Nurse – Urgent Public Health Research – Band 5", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256515", "validThrough": "2020-12-18T23:59:59+0000"}