{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Ad hoc"}}, "datePosted": "2020-11-03T16:16:23+0000", "description": "&lt;p&gt;Are you looking for a change in career? Do you want a role that allows you the flexibility to work around your personal commitments? Do you want to go home at the end of your shift knowing you helped make your local hospital a great place to be cared for?&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Someone once called our team the ‘Backbone of our Hospitals’ and it has certainly stuck!Quite simply, we couldn’t run our hospitals without you and the fantastic work you will do keeping our wards, departments and areas clean and tidy&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;We want you to be proud to wear your Domestic Assistant uniform, feeling what a strong and vital part of our hospital team you really are – knowing you are working side by side on the front-lines making a HUGE difference every single day.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;You will of course be a key team member of our Hospital team, showing care and compassion for our patients and their visitors, your effective communication skills will be particularly useful here as you pass the time of day, or help someone with directions whilst undertaking your vital cleaning duties.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;In a nutshell, your duties will include general cleaning of the wards, public and staff areas, on a rota with your colleagues as part of our Domestic Team. As you would expect, we do have set cleaning standards and NHS guidelines to work towards and these are even more detailed now as we fight this pandemic. So whilst there is no experience required, we will fully train you on all of this to ensure you will soon be at the top of your game.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;The work can be physically demanding and we don’t shy away from this. A lot of the things we have to intensively clean are below waist height as they are often areas which need the most attention. Pesky bits of dirt and grime would thrive there if our fab team members didn’t do such a great job cleaning them and keeping them spick and span.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Of course we want you to be friendly, reliable and conscientious as this role isn&#39;t just about vacuuming, mopping and cleaning, it’s about being part of a whole team of staff working together to ensure the best environment for our patients to receive their treatments.&lt;br /&gt;We offer you the flexibility to work around your personal commitments – going home at the end of your shift knowing you played your part in making our hospitals a great place to be cared for.&lt;/p&gt;\n&lt;p&gt;There are allsorts of training opportunities to ensure you have all the right knowledge to do the role and we actively encourage you to develop and support you to progress within the organisation if that’s what you are looking for.&lt;/p&gt;\n&lt;p&gt;There are various bank hours on days, evenings, weekends and the night shift.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameJason Jackson-BatesJob titleAssistant Domestic Services ManagerEmail addressjason.jackson-bates@lthtr.nhs.ukAdditional contact information&lt;/p&gt;\n&lt;p&gt;Name: Jason Jackson-Bates&lt;/p&gt;\n&lt;p&gt;Email: Jason.jackson-bates@lthtr.nhs.uk&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "Lancashire Teaching Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121125"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Preston Hospital, Preston", "postalCode": "PR2 9HT"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7909", "longitude": "-2.70449"}}, "title": "Bank Domestic Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254745", "validThrough": "2020-11-18T23:59:59+0000"}