{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-11-03T08:45:49+0000", "description": "&lt;p&gt;Community Psychiatric Nurse/ Care coordinator - Band 6 in the Central East CMHT.&lt;/p&gt;\n&lt;p&gt;We are looking for an enthusiastic RMN/CPN to join our friendly Multi-disciplinary team as a Care Co-ordinator. You will require experience of working in a mental health settings and awareness of delivery of community mental health care.&lt;/p&gt;\n&lt;p&gt;You will hold and manage a caseload of people and have Care Coordinating responsibilities under the Care Program Approach Guidelines. The team covers an ethnically and culturally diverse area, and you will have the opportunity to work with clients from a wide range of backgrounds, and with a wide range of psychosocial needs.&lt;/p&gt;\n&lt;p&gt;By assessing your clients and their carers needs you will be able to access and sign post to a wide range of community resources and provider services available in the local area.&lt;/p&gt;\n&lt;p&gt;You will work with clients to identify goals as part of overall care plans, and establish and evaluate appropriate treatment programs for service users within the team.&lt;/p&gt;\n&lt;p&gt;The post holder will be expected to participate in providing quality first line psychosocial assessments as part of GMMH’s Functional CMHT’s duty role and work proactively in forging professional working relationships with multi-agencies.&lt;/p&gt;\n&lt;p&gt;All of our service developments align to the best available evidence and GMMH is committed to delivering Royal College of Psychiatrists accredited services over the coming months. As the successful candidate, a wide range of opportunities to enhance and develop your clinical skills will be open to you.&lt;/p&gt;\n&lt;p&gt;Research and Innovation are championed in our services. We have a number of Trust-wide R&amp;I, professional and divisional forums were service development ideas are derived from our front-line teams. Staff are actively encouraged to participate in such opportunities.&lt;/p&gt;\n&lt;p&gt;As we recognise the importance of supporting our staff to achieve an effective work-life balance and also maintain positive wellbeing, we work with staff to develop ways of supporting flexible working for them. Our services describe themselves as mutually supportive and we recognise the challenges that can be associated with mental health care delivery. To further support our teams, we have internally run complex case discussion forums facilitated by our team psychologists and are committed to the delivery of robust supervision, to ensure that staff are supported in their clinical practice.&lt;/p&gt;\n&lt;p&gt;Finally, why should you come to work with us? Manchester is world renowned, versatile and it offers people the opportunity to experience a wide range of activities, cultures, educational opportunities, theatrical experiences, tastes, and social opportunities. It can adapt to be whatever you would want and has something for people of all ages, 24/7, 365 days a year.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Stewart Lee&lt;/p&gt;\n&lt;p&gt;Job Title: Team Manager&lt;/p&gt;\n&lt;p&gt;Email address: stewart.lee@gmmh.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number: 0161 271 0631&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;Senior Practitioners&lt;/p&gt;\n&lt;p&gt;Avril Taylor - Senior Practitioner for Personality Disorder Pathway&lt;/p&gt;\n&lt;p&gt;Ellen Druce - Senior Practitioner/Funding Panel specialist and Safeguarding lead&lt;/p&gt;\n&lt;p&gt;Tel: 0161 271 0631&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121714.jpg", "name": "Greater Manchester Mental Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121714"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Manchester", "postalCode": "M13 9WL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4625", "longitude": "-2.22771"}}, "title": "Care Coordinator - CPN", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253176", "validThrough": "2020-11-11T23:59:59+0000"}