{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "29583", "minValue": "26544", "unitText": "YEAR", "value": "£26,544 - £29,583 per annum"}}, "datePosted": "2020-11-06T09:59:25+0000", "description": "&lt;p&gt;Are you ready for a new challenge?&lt;/p&gt;\n&lt;p&gt;We are seeking a skilled, enthusiastic, and self-motivated Reablement Practitioner to join our Adults’ Health&lt;/p&gt;\n&lt;p&gt;and Care Reablement Service in the West of Hampshire. Six months initially with potential to become&lt;/p&gt;\n&lt;p&gt;permanent from April 2021&lt;/p&gt;\n&lt;p&gt;As a Reablement Practitioner, you will be responsible for carrying out holistic assessments of Reablement&lt;/p&gt;\n&lt;p&gt;need and planning Reablement interventions to support across a multi-disciplinary team of Health and Social&lt;/p&gt;\n&lt;p&gt;Care professionals, within a Rapid Discharge Service supporting hospital discharge and prevention of&lt;/p&gt;\n&lt;p&gt;admission.&lt;/p&gt;\n&lt;p&gt;What we are looking for:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;You will be multi skilled in understanding and completing the care management process and delivering therapy-based interventions with support from professionally qualified staff.&lt;/li&gt;\n&lt;li&gt;You will be part of a progressive team, using an enabling, adaptive approach, supporting people to live in their own homes where possible, and in the least restrictive way.&lt;/li&gt;\n&lt;li&gt;You will be able to demonstrate effective assessment and treatment planning skills, goal setting and work in a fast paced, evolving environment.&lt;/li&gt;\n&lt;li&gt;You must be able to demonstrate strengths-based approach to provide advice and information to enable service users to problem solve their own needs and make informed decisions on their Reablement journey.&lt;/li&gt;\n&lt;li&gt;You will have excellent communication, inter-personal and team player skills.&lt;/li&gt;\n&lt;li&gt;There may also be opportunities to work across Hampshire as part of a county wide Reablement Service comprising Occupational Therapy, Sensory Services and CQC Registered Community Response Staff.&lt;/li&gt;\n&lt;li&gt;Previous experience in a Reablement, Rehabilitation, Health or Social Care setting is essential.&lt;/li&gt;\n&lt;li&gt;The role may include the supervision and management of staff.&lt;/li&gt;\n&lt;li&gt;Travel within Hampshire may be required, you will need to respond flexibly to these requirements.&lt;/li&gt;\n&lt;li&gt;This post may potentially require working over a 7-day pattern, so flexibility is needed&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We value our staff highly and offer full induction, supervision, and performance reviews, CPD opportunities and&lt;/p&gt;\n&lt;p&gt;professional, clinical, managerial and peer support. As you will need to travel around Hampshire, being able to drive and have access to a car is a necessity.&lt;/p&gt;\n&lt;p&gt;The Reablement Service:&lt;/p&gt;\n&lt;p&gt;Our Reablement Practitioners underpin our service and we are continually seeking opportunities to enhance delivery. We value our staff highly and offer full induction, supervision and performance reviews, CPD opportunities and professional, clinical, managerial and peer support.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Hampshire County Council", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=129457"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Totton", "postalCode": "SO40 9HL"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.917", "longitude": "-1.4833"}}, "title": "Reablement Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259120", "validThrough": "2020-11-22T23:59:59+0000"}