{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-10-29T10:15:39+0000", "description": "&lt;p&gt;&lt;strong&gt;Mental Health Liaison Practitioner &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Chichester and Midhurst Assessment &amp; Treatment Service&lt;/strong&gt; is a community mental health team supporting people living with severe and enduring mental illness. The MHLP team is part of the Chichester and Midhurst Assessment and Treatment Service and work as liaison between the ATS and GP Surgeries. The post holder will work within GP surgeries and will be the liaison and link between primary care and secondary care services.&lt;/p&gt;\n&lt;p&gt;We are looking for an experienced &lt;strong&gt;Band 6 Mental Health Practitioner (Nurse, Occupational Therapist, Social Worker and Psychological wellbeing Practitioner)&lt;/strong&gt; to work within GP Surgeries to provide 6- 8 sessions of CBT informed or psycho educational interventions to people with mild to moderate mental health problems. The successful applicant will also be responsible for completing initial assessments and liaising with GP&#39;s and local agencies, including signposting to third sector services.&lt;/p&gt;\n&lt;p&gt;Working as an MHLP includes:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Working autonomously to a defined caseload of clients diagnosed with mild to moderate mental health problems. This will include offering specific interventions such as psycho-education, CBT informed sessions and short term recovery focused interventions&lt;/li&gt;\n&lt;li&gt;You will complete initial assessments and work closely with our referrals coordinators, GP&#39;s and other agencies.&lt;/li&gt;\n&lt;li&gt;Your interventions will be a pre-defined offer of 6-8 sessions.&lt;/li&gt;\n&lt;li&gt;You are welcome to co-facilitate groups if you have an interest in this area.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;What you will receive from us:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;We are a friendly and supportive team that meets regularly to ensure you feel safe and supported.&lt;/li&gt;\n&lt;li&gt;We offer several MDT meetings per week to ensure support is available for complex case discussions.&lt;/li&gt;\n&lt;li&gt;You will receive regular managerial supervision and be offered the opportunity to supervise junior staff.&lt;/li&gt;\n&lt;li&gt;You will also have access to regular clinical supervision and support from our Community Leads&lt;/li&gt;\n&lt;li&gt;We actively encourage people to think about their development and career goals, and will support you to complete further training.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This post offers the Trust&#39;s £2000 Golden Hello for band 5 or 6 Nurses, or a relocation package up to a maximum of £2000 (subject to terms and conditions).&lt;/p&gt;\n&lt;p&gt;We regret that we are unable to advise candidates if they have not been shortlisted. If you have not heard from us within three weeks of the closing date please assume that you have been unsuccessful on this occasion.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameMarylinda GororoJob titleClinical Team LeaderEmail addressmarylinda.gororo@sussexpartnership.nhs.ukTelephone number0300 304 0400Additional contact information&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact: We would welcome visits and conversations about the post Please contact Marylinda Gororo Team Leader on 0300 304 0400 marylinda.gororo@sussexpartnership.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121074.jpg", "name": "Sussex Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121074"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Chapel Street, Chichester", "postalCode": "PO21 1BX"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7865", "longitude": "-.674725"}}, "title": "Mental Health Liaison Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247861", "validThrough": "2020-11-12T23:59:59+0000"}