{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum"}}, "datePosted": "2020-11-05T13:15:54+0000", "description": "&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Consultant in Rheumatology&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;BARKING, HAVERING &amp; REDBRIDGE HOSPITALS NHS TRUST&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Applications are invited for two substantive consultant posts in Rheumatology at Barking, Havering &amp; Redbridge University Hospitals NHS Trust. This exciting opportunity to recruit a new staff members to the department has arisen from recent expansion to the service and a change in staff numbers.&lt;br /&gt;&lt;br /&gt;BHRUT is one of the largest acute trusts in the UK, providing care for over 700,000 people. The Rheumatology department is a dynamic and forward thinking team comprising 6.2 WTE consultants, one associate specialist, four clinical fellows, one Rheumatology specialist registrar and a large team of specialist nurses and administrative support staff. &lt;br /&gt;&lt;br /&gt;The Rheumatology service is delivered predominantly from the Queen’s Hospital and King George Hospital sites. The successful applicants will have the opportunity to be involved in the delivery of the Early Arthritis service. There is also excellent opportunity to develop a subspecialty interest or utilise the departmental ultrasound machine to develop ultrasound clinics. The Rheumatology department has developed innovative Virtual clinics for biologic commencement and is in the process of expanding Virtual clinics to cover other areas of the service.&lt;/p&gt;\n&lt;p&gt;The department has a monthly Rheumatology Academic meetings and attendance is also encouraged at the monthly Essex Rheumatology Association meetings.&lt;br /&gt;&lt;br /&gt;These are full time 10 PA posts, however, we are happy to consider applications for less than full time work / flexible job plans. There is also the possibility to expand the job to more than 10 PAs and interested applicants should contact the Clinical Lead to discuss all possibilities to enhance the job plan.&lt;/p&gt;\n&lt;p&gt;There is no GIM or on call commitment. There is the opportunity to combine one of these posts with Acute Medicine providing a 50:50 shared job plan for applicants on request.&lt;/p&gt;\n&lt;p&gt;The trust will reimburse relocation expenses for successful applicants.&lt;br /&gt;&lt;br /&gt;Applicants must have full GMC Registration and be on the specialist register for Rheumatology or be within six months of their CCST date at interview.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDr Louise Daniels Job title Clinical Lead Email address Louise.Daniels2@nhs.net.Telephone numbe r01708 435000, extension 2722 Additional contact information&lt;/p&gt;\n&lt;p&gt;Informal visits are encouraged. To discuss the post please contact: Dr Louise Daniels, Clinical lead for Rheumatology on 01708 435000, extension 2722 email Louise.Daniels2@nhs.net.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Barking, Havering and Redbridge University Hospitals Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120782"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Barking Havering and Redbridge University Hospitals NHS Trust, Romford", "postalCode": "RM7 0AG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5686", "longitude": ".178941"}}, "title": "Consultant Rheumatologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257817", "validThrough": "2020-12-06T23:59:59+0000"}