{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum pro rata + RSU + 5% of"}}, "datePosted": "2020-10-26T10:16:52+0000", "description": "&lt;p&gt;Hertfordshire Partnership NHS Foundation Trust currently provides mental health and learning disability services in Hertfordshire and Norfolk. We are seeking to recruit band 5 Registered Mental Health Nurses (RMNs)to join our dynamic nursing team under the role of Staff Nurse.&lt;/p&gt;\n&lt;p&gt;Are you innovative, creative and looking for a positive experience? If this sounds like you, then we would like to hear from you to come and join our team on a Psychiatric Intensive Care Unit (PICU). We are passionate about delivering innovative and compassionate care to our service users, and our clinical practice has been accredited by Quality Network for Psychiatric Intensive Care Units (QNPICU).&lt;/p&gt;\n&lt;p&gt;The successful candidate will be working as part of a multidisciplinary team within our 12 bedded unit, providing care to male service users in need of a period of intensive care. Our service users have a wide range of mental health disorders and are in an acute phase of their mental illness. You will be working with experienced staff and junior staff, and there will be opportunities to develop and enhance your clinical skills through supervision, training and access to engage with the wider acute network.&lt;/p&gt;\n&lt;p&gt;The ward is located on a newly developed site with free parking and a spacious café onsite serving hot meals to NHS staff at a discounted rate.&lt;/p&gt;\n&lt;p&gt;There are opportunities to further widen your clinical expertise through coaching with senior managers. If you are from a BME background, we give you the opportunity to become part of the NHS Workforce Race Equality Standard (WRES).&lt;/p&gt;\n&lt;p&gt;We are looking for caring, committed, compassionate, creative, courageous staff to come and join us.&lt;/p&gt;\n&lt;p&gt;90% of our staff say that they feel motivated, in their jobs, and would recommend the Trust as a place to work.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameVaida JocieneJob titleTeam LeaderEmail addressvaida.jociene@nhs.netTelephone number01923 850 501&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120841.png", "name": "Hertfordshire Partnership University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120841"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Oak Ward, Kingfisher Court, Radlett, Hertfordshire, WD7 9HQ, Radlett", "postalCode": "WD7 9HQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7047", "longitude": "-.305165"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241991", "validThrough": "2020-11-09T23:59:59+0000"}