{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 pa"}}, "datePosted": "2020-11-06T12:30:23+0000", "description": "&lt;p&gt;An exciting opportunity has opened up for a permanent Project Support Officer to join North of England Commissioning Support (NECS) Programmes &amp; Projects team.  &lt;/p&gt;\n&lt;p&gt;The successful candidate will provide support to the Programme, working as part of a dynamic team.   The post offers a challenging and rewarding position for an experienced Project Support Officer.  &lt;/p&gt;\n&lt;p&gt;The successful candidate will be responsible for the effective collation and coordination of project documentation and progress reports, arranging and administering of project board(s) and project team meetings, organisation and facilitation of project workshops and events.   &lt;/p&gt;\n&lt;p&gt;The candidate must be able to apply and maintain effective change control management to project libraries, ensuring Programme Management Office (PMO) processes are applied to projects and provide a quality assurance function over project products and documentation.&lt;/p&gt;\n&lt;p&gt;You will have the ability to source, assimilate and analyse data and information relating to a wide range of services and be able to translate these into easily understood formats, covering report management for various stakeholder requirements.  The ability to provide detailed and complex reports for senior management is key.&lt;/p&gt;\n&lt;p&gt;The candidate must be experienced in an admin capacity with refined organisational skills that balance work, and team support.   In addition can action ad-hoc responsibilities and requests in a timely and professional manner.  &lt;/p&gt;\n&lt;p&gt;The post holder is required to be a team player and a pro-active individual with the ability to establish priorities, work independently and proceed with objectives.  You must be able to communicate effectively and interact with all levels of staff across the organisation.&lt;/p&gt;\n&lt;p&gt;Due to current Covid-19 restrictions, Interviews will take place via Video Conference.   For further information or to arrange an informal discussion please contact denise.connelly@nhs.net.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "North of England Commissioning Support", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128014"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "MIDDLESBROUGH", "postalCode": "TS2 1RH"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.5857", "longitude": "-1.25212"}}, "title": "Project Support Officer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259654", "validThrough": "2020-11-16T23:59:59+0000"}