{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 pro rata per annum"}}, "datePosted": "2020-10-26T12:30:57+0000", "description": "&lt;p&gt;The Airedale Medical Psychology Service is looking for a Highly Specialist Clinical Psychologist for a new 8a, working within Neuropsychology to provide a service to patients in Airedale NHS Foundation Trust. The work is varied across in- and out-patients from Neurology, Neuro-rehabilitation and other departments across the hospital trust. The post has been commissioned to enable the service to address the recent need for neuropsychological expertise in the post-acute care of patients who have experienced neurological symptoms as a result of COVID-19.&lt;/p&gt;\n&lt;p&gt;The successful applicant will deliver formal neuropsychological assessment and give rehabilitation advice, as well as carry out adapted evidence based psychological therapy for adjustment to neurological conditions. They will also be involved with consultation, teaching, supervision and support to colleagues within Medical Psychology as well as colleagues from other disciplines. This post has been created to be of interest to clinical psychologists who want to develop their skills and experience with a view to developing within the specialism of Neuropsychology, and are either part way through or thinking about taking the Postgraduate Diploma in Clinical Neuropsychology as part of next step in their career. This service is committed to the development of team members and as such the post holder will be supported with CPD time and flexibility whilst working towards their qualification.&lt;/p&gt;\n&lt;p&gt;Airedale Medical Psychology provides Clinical Health Psychology and Neuropsychology services to patients attending Airedale General Hospital teams, and specific commissioned services such as palliative care, pulmonary rehab, and community stroke rehab. There are currently 8 Clinical Psychologists (including 2 vacant posts) and one Assistant Psychologist in 4.7 full-time equivalent posts. Clinical Psychology services are provided to in-patients and out-patients in hospital and community settings.&lt;/p&gt;\n&lt;p&gt;As a small service the priorities of direct patient work are to focus on improved medical outcomes, through addressing treatable psychological problems. The service also is committed to supporting and enhancing the psychological skills of other professions through teaching, supervision, and consultancy, and to working collaboratively to support a culture of empowerment and self-care.&lt;/p&gt;\n&lt;p&gt;The service is based in Airedale General Hospital between Keighley and Skipton in the Yorkshire Dales, and enjoys excellent relationships with the Leeds D. Clin.Psych training course, neighbouring mental health trust, and clinical health psychology services in Bradford and Leeds.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameLaura RoweAdditional contact information&lt;/p&gt;\n&lt;p&gt;Dr Sue Field, Lead Clinician - Neuropsychology Service, 01535 292842.&lt;/p&gt;\n&lt;p&gt;Laura Rowe, Operational Manager (laura.rowe9@nhs.net)&lt;/p&gt;\n&lt;p&gt;Dr Rachael Brastock, Clinical and Professional Lead&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Airedale NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120636"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Airedale General Hospital, Steeton", "postalCode": "BD20 6TD"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.898", "longitude": "-1.9627"}}, "title": "Clinical Psychologist / Psychological Therapist (Band 8a)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242434", "validThrough": "2020-11-23T23:59:59+0000"}