{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum"}}, "datePosted": "2020-10-15T09:46:17+0100", "description": "&lt;p&gt;Clinical Psychologist&lt;/p&gt;\n&lt;p&gt;Band 8a&lt;/p&gt;\n&lt;p&gt;Full time substantive contract&lt;/p&gt;\n&lt;p&gt;We are looking for an experienced Clinical Psychologist to step into an established role within the Child and Adolescent Mental Health Services Team, part of the RISE service, within Coventry and Warwickshire Partnership Trust. This post will be with the Coventry Team.&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity to be part of our new and innovative pathway model of care for children, young people and their families across Coventry and Warwickshire within a service that has been highlighted as ‘Good’ by the CQC. We are an enthusiastic, multi-disciplinary team who are keen to provide a high quality, seamless service. We are looking for a dynamic individual who is passionate about helping young people and their families, interested in leading clinical developments with the team, supervising staff and supporting the manager to maintain and develop the highest standards of care and therapeutic support for the young people and their families who access our service.&lt;/p&gt;\n&lt;p&gt;The post holder will work within our evidence based pathways to deliver clinically effective, young person focussed services. Successful applicants will receive excellent support and regular, good quality supervision and opportunities for continuing professional development in line with service objectives.&lt;/p&gt;\n&lt;p&gt;There are exciting opportunities to contribute to the supervision and consultation processes within the service. We work closely with the Coventry and Warwick doctoral training programme and have trainees on placement within the service. Opportunities for supervision training as part of the CYP-IAPT collaborative will be available.&lt;/p&gt;\n&lt;p&gt;We welcome the development of leadership skills within Coventry and Warwickshire Partnership Trust. The post holder will have opportunities to attend leadership training as part of the CYP – IAPT collaborative. We would be keen to encourage application of these leadership skills to support and develop the team further.&lt;/p&gt;\n&lt;p&gt;The post holder will be an enthused individual with excellent communication skills to meet the challenge of delivering the best possible services for CAMHS. You will be a team player, passionate about the smooth running of the service. Please visit our CWRise website for further information regarding our new service model.&lt;/p&gt;\n&lt;p&gt;Applicants are encouraged to arrange informal visits with the CAMHS team and/or the senior management team. Please contact Dr Nisheela Baxter, Clinical Psychologist – nisheela.baxter@covwarkpt.nhs.uk.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Coventry and Warwickshire Partnership Trust (CWPT)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121204"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Paybody, Coventry", "postalCode": "CV1 4FS"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4181", "longitude": "-1.49965"}}, "title": "Clinical Psychologist - Band 8a", "url": "https://www.jobs.nhs.uk/xi/vacancy/916227565", "validThrough": "2020-11-08T23:59:59+0000"}