{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 per annum"}}, "datePosted": "2020-10-26T12:46:22+0000", "description": "&lt;p&gt;The General Pharmacy at the Royal Cornwall Hospital is looking to recruit a senior assistant technical officer who will specialise in controlled drugs as well as participating in the training of others in all areas of supply services. The successful candidate will dispense controlled drugs and ensure regulatory requirements for controlled drugs are met. This is an exciting opportunity for the right person you must hold the level 2 NVQ certificate in pharmacy service skills. GCSE grade C or above in Maths and English or equivalent and you must be willing to train to undertake final checking release of inpatient prescriptions.&lt;/p&gt;\n&lt;p&gt;You will have experience of working in a hospital or community pharmacy, and be able to work as part of a team. We are looking to appoint an enthusiastic, well-motivated, individual who has good organisational skills. Putting the patient first and delivering the best possible service.&lt;/p&gt;\n&lt;p&gt;We actively support the development and training of all our staff, to achieve and succeed&lt;/p&gt;\n&lt;p&gt;This is a fulltime post working 37.5 hours per week.&lt;/p&gt;\n&lt;p&gt;*You will work 1 weekend day every 5 weeks for which you will get a day back in the following week.&lt;/p&gt;\n&lt;p&gt;* You will work 4 days of the week 8.30 till 5 and 1 day of the week 10.30 till 7&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Laura Endean/Caroline Ansell, Lead Dispensary Technician, Supply Services, Pharmacy Department, Royal Cornwall Hospital, 01872 252045&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120920.jpg", "name": "Royal Cornwall Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120920"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Truro", "postalCode": "TR1 3LJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.2667", "longitude": "-5.0915"}}, "title": "Senior Pharmacy Assistant Supply Services", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242490", "validThrough": "2020-11-08T23:59:59+0000"}