{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Band 7"}}, "datePosted": "2020-10-21T12:00:18+0100", "description": "&lt;p&gt;Are you an experienced Pharmacist looking to join an energetic and vibrant organisation?&lt;/p&gt;\n&lt;p&gt;Whittington Health is an Integrated Care Organisation; this provides a huge range of exciting opportunities for Pharmacists wishing to develop their career and clinical skills. The Pharmacy Department is innovative and forward thinking; this is reflected in the huge range of roles that are already established and in development. The Department is hugely supportive and actively encourages creative thinking to improve services, patient experience and to develop new roles, drawing on strengths and experiences of the team. Whittington Health is extremely active in promoting the use of Pharmacists in developing new clinical services and placing them in prominent roles within these.  &lt;/p&gt;\n&lt;p&gt;We are looking for enthusiastic, resourceful Bank Pharmacists who enjoy working in a busy multidisciplinary environment, are great team players and can demonstrate excellent interpersonal and communication skills. We want all our staff to reach their full potential, to ensure this we provide a safe, open and non-restrictive platform to learn, develop and progress. &lt;/p&gt;\n&lt;p&gt;Successful post holders will join a team of dynamic, senior rotational pharmacists to gain experience in a number of rotations including; medical admissions, surgery, women and children’s, ambulatory care , anticoagulation &amp; stroke prevention, dispensary, clinical trials/formulary, integrated care of older people, and intensive care. As well as developing clinical skills, the post holder will be expected to enhance their managerial and leadership skills through:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Participation in multidisciplinary ward and board rounds delivering and promoting high quality, cost-effective, patient-focused prescribing and medicines use&lt;/li&gt;\n&lt;li&gt;Participation in practice and clinical research and audit&lt;/li&gt;\n&lt;li&gt;Contributing to the development and implementation of new pharmacy services, guidelines, policies and procedures&lt;/li&gt;\n&lt;li&gt;Supporting Lead Pharmacists and Divisions to effectively manage medication expenditure&lt;/li&gt;\n&lt;li&gt;Participation in the education, training and supervision of pharmacy, medical and nursing staff and other allied healthcare professionals&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;All the rotations have structured objectives designed to ensure that the post holder gains sufficient experience and skills while contributing to the department and Trust priorities.&lt;/p&gt;\n&lt;p&gt;Essential Requirements:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Current GPhC registration&lt;/li&gt;\n&lt;li&gt;6 months NHS experience in a similar role&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We operate a Temporary Staffing service and offer our Bank Staff excellent benefits including:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Competitive hourly rates and weekly pay;&lt;/li&gt;\n&lt;li&gt;Access to paid annual leave;&lt;/li&gt;\n&lt;li&gt;Flexibilities of hours&lt;/li&gt;\n&lt;li&gt;Opportunity to apply for permanent and fixed term posts&lt;/li&gt;\n&lt;/ul&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121035.JPG", "name": "Whittington Health", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121035"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Whittington", "postalCode": "N19 5NF"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5667", "longitude": "-.138149"}}, "title": "Bank Band 7 Clinical Rotational Pharmacist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916236236", "validThrough": "2020-11-30T23:59:59+0000"}