{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 Per annum"}}, "datePosted": "2020-11-06T13:01:22+0000", "description": "&lt;p&gt;Applications are invited from individuals who are dedicated, enthusiastic, energetic, skilled and confident in their technical abilities to apply for the post of Specialist Biomedical Scientist – band 6, within the bacteriology section of the Clinical Microbiology Laboratory based at Leicester Royal Infirmary.&lt;br /&gt;&lt;br /&gt;Applicants must be HCPC registered, hold an IBMS Specialist Portfolio and have extensive post registration experience in a UK routine diagnostic microbiology laboratory . &lt;br /&gt;The Clinical Microbiology laboratory at Leicester is a comprehensive medical microbiology service handling around 1.2 million microbiology and virology tests per year. We are active in supporting infection prevention, control &amp; diagnostics of a wide range of infections. The laboratory is UKAS accredited. Teaching, training, audit, research and development are actively encouraged and pursued within the department. The laboratory is approved by the IBMS and fully supports continuing professional development.&lt;/p&gt;\n&lt;p&gt;Additional qualities that the department seek are a strong understanding of UKAS and quality within a clinical laboratory, a drive and determination to improve laboratory processes, a strong team ethic as well as good performance as an individual BMS.&lt;/p&gt;\n&lt;p&gt;If you believe that this could be you and are looking for a new challenge, your application would be gratefully received.&lt;/p&gt;\n&lt;p&gt;Applicants that require training at the time of starting will not be considered for these posts at this time. But consideration may be given to applicants who are near to completing a relevant specialist portfolio.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Applicants without HCPC registration need not apply as you will not be considered for this role. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Simon Hewson Job title Deputy Service Manager Email addresss simon.hewson@uhl-tr.nhs Telephone number 0116 258 6535/6536 Additional contact information&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;An informal laboratory visit is highly recommended for shortlisted candidates.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120651.jpg", "name": "University Hospitals of Leicester", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120651"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Leicester Royal Infirmary, Leicester", "postalCode": "LE1 5WW"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6278", "longitude": "-1.13479"}}, "title": "Specialist Biomedical Scientist - Microbiology/Bacteriology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259799", "validThrough": "2020-11-22T23:59:59+0000"}