{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "31365", "minValue": "25907", "unitText": "YEAR", "value": "£25,907 - £31,365 pa pro rata Rate dependent on ex"}}, "datePosted": "2020-11-04T12:31:44+0000", "description": "&lt;p&gt;We are looking for a highly motivated radiographer to join our Breast Imaging Team. Ideally you will hold a Post Graduate Certificate in Breast Imaging (or equivalent) but we are also offering the opportunity to train and gain this qualification with us. If you are due to qualify as a radiographer this summer we would be happy to consider your application.&lt;/p&gt;\n&lt;p&gt;Our radiographers are fully involved in the patient pathway enabling us to provide continuous patient care. It also enables our staff to work closely with our radiologists providing a solid ground for future advanced practice.&lt;/p&gt;\n&lt;p&gt;You could be working on the screening van in the community, screening in the hospital setting, imaging patients who have concerns with their breast health (symptomatic service), imaging women called back from breast screening and supporting women undergoing biopsies. All in one week!&lt;/p&gt;\n&lt;p&gt;The Hologic Dimension equipment in the department is fully equipped with tomosynthesis, both of the machines are also able to support stereotaxis and tomo biopsy as well. This ensures we have maximum flexibility in the provision of our service. We have also been blessed with the Brevera biopsy system enabling us to image specimens for calcification as the procedure is undertaken. This enables us to complete the procedure more quickly and to inform pathology which samples have the calcifications in.&lt;/p&gt;\n&lt;p&gt;We undertake the majority of our localisations using Magseeds thereby reducing the length of time that our patients need to be at the hospital on the day of their surgery. As a consequence of this theatres are more efficient leading to a cost saving for the hospital as a whole.&lt;/p&gt;\n&lt;p&gt;The installation of 2 Phillips Epiq ultrasound systems ensures that we are a department equipped for the future.&lt;/p&gt;\n&lt;p&gt;We are committed to putting patient care first and are looking for a dedicated professional who shares our values and our passion for delivering quality care.&lt;/p&gt;\n&lt;p&gt;Situated on the east coast The James Paget University Hospital is close to sandy beaches, open countryside and the beautiful Norfolk Broads. We are able to walk to the sandy beaches of Gorleston, get an icecream and back all in a lunch hour! It is within easy access to the fine city of Norwich which has excellent shopping, night life, and good road and rail links to London. The local area provides a wide range of affordable accommodation making this an attractive place to live.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Flexible working will be considered.&lt;/p&gt;\n&lt;p&gt;There are plans in the future to move Radiology Services to 7 day working and extended days and the successful applicant would be required to participate in this working pattern.&lt;/p&gt;\n&lt;p&gt;Applicants must have recent NHS experience, be HCPC registered and have a degree in radiography.The role is exempt from the Sex Discrimination Act for genuine occupational reasons. Applications will be considered by those who are due to qualify this year. The pay band will be appropriate to the experience of the successful applicant.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;strong&gt;For further information or to arrange an informal visit to the department contact Sharon Pavitt (Deputy Head of Breast Imaging) or Deanna Minnis (Senior Radiographer) contact number 01493 452885 or email Deanna.Minnis@jpaget.nhs.uk&lt;/strong&gt;&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121320.jpg", "name": "James Paget University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121320"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "James Paget University Hospital, Great Yarmouth", "postalCode": "NR31 6LA"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5617", "longitude": "1.718"}}, "title": "Trainee / Senior Radiographer, Breast Imaging", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255867", "validThrough": "2020-11-18T23:59:59+0000"}