{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62001", "minValue": "53168", "unitText": "YEAR", "value": "£53,168 - £62,001 p.a. plus HCAS"}}, "datePosted": "2020-11-02T15:01:40+0000", "description": "&lt;p&gt;&lt;strong&gt;Job Title &lt;/strong&gt;Matron for All Age Eating Disorders Clinical Pathway&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Grade&lt;/strong&gt; 8b&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;6 Month Secondment – open to SLP staff&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for a talented &amp; dedicated Matron for Eating Disorders Clinical Pathway&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Compassionate, Consistent, Respectful, Open, Collaborative.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;Are you interested in joining our Eating Disorders Clinical Pathway?&lt;/p&gt;\n&lt;p&gt;Our, Eating Disorders Services includes inpatient and community services:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Avalon (Adult inpatient facility) – 20 beds – currently 12.&lt;/li&gt;\n&lt;li&gt;Wisteria (CAMHS inpatient facility) – 12 beds – currently 5.&lt;/li&gt;\n&lt;li&gt;Adult Day Services &amp; Community Team.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;This is an exciting time to join our Eating Disorder Clinical Pathway and we are looking at innovative ways to improve quality and increasing the specialist ethos and skills of clinicians working within our teams and wards. We are also part of the NHSE New Models of Care programme and working with our South London Partnership Trust to improve service delivery.&lt;/p&gt;\n&lt;p&gt;Our Trust is dynamic and innovative and always welcomes new ideas. We are currently rated as “Good” by the CQC but we are working hard to secure an “Outstanding” rating for the future. We are about to undergo an exciting and extensive Estates Modernisation Programme.&lt;/p&gt;\n&lt;p&gt;We are looking for a highly motivated, innovative person who will be responsible for leading and managing wards and community teams. We are keen to meet people with transferable skills. The successful candidate will be able to motivate teams, achieve outstanding quality and performance for all our patients, as well as deliver value for money.&lt;/p&gt;\n&lt;p&gt;The group of teams within the scope of the service line means the post holder will be capable of working flexibly, representing the Trust externally at a range of meetings, and have strong analytical and communication skills.&lt;/p&gt;\n&lt;p&gt;Interested applicants will have:-&lt;/p&gt;\n&lt;ol&gt;\n&lt;li&gt;Experience of successful service delivery that has achieved improved clinical outcomes and patients satisfaction&lt;/li&gt;\n&lt;li&gt;Be committed to supporting clinical teams achieving outstanding quality and performance.&lt;/li&gt;\n&lt;li&gt;Strong track record of working as part of a senior team, with colleagues from a range of professional backgrounds, where the ability to collaborate is valued.&lt;/li&gt;\n&lt;li&gt;Strong communication skills and relationship management with the ability to influence and reach consensus.&lt;/li&gt;\n&lt;li&gt;Ability to build upon partnerships across the South West London and engage Local Authority and CCG/ NHSE commissioners.&lt;/li&gt;\n&lt;li&gt;Ability to innovate and drive change to ensure services continues to develop and improve.&lt;/li&gt;\n&lt;/ol&gt;\n&lt;p&gt;To find out more about this role in details, please view the job description and person specification.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameFeizal MohuballyJob titleHead of Service DeliveryTelephone number07970102288Additional contact information&lt;/p&gt;\n&lt;p&gt;Dr Ewa Zadeh, &lt;em&gt;Clinical Director&lt;/em&gt;&lt;em&gt; (&lt;/em&gt;&lt;em&gt;07976622883)&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Kirsty Murray, Head of Nursing (07989717384)&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "South West London and St Georges Mental Health NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123034"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Springfield University Hospital, Tooting, London", "postalCode": "SW17 7DJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.436", "longitude": "-.167638"}}, "title": "Matron – All Age -  Eating Disorders- 8b", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252539", "validThrough": "2020-11-09T23:59:59+0000"}