{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "20795", "minValue": "18000", "unitText": "YEAR", "value": "18,000.00 - 20,795.00"}}, "datePosted": "2020-11-04T11:51:03+0000", "description": "Description - External\n\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Healthcare Assistant - Full Time or Part Time position available (FTC until March 21)&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;West Lancashire (Ormskirk)&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Are you a caring and dedicated Healthcare Assistant&lt;em&gt; &lt;/em&gt;based in the &lt;em&gt;West Lancashire&lt;/em&gt; area? Are you looking to join an NHS Health and Social Care partner which is striving to make positive changes? Would you like to work for an organisation where more than 9 out of every 10 of the people who use services would recommend them?&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Feel Valued&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will receive a competitive salary with group pension. We’ll provide you with access to a committed Learning and Development team, and we work closely with Universities and Health Education England to further your potential and support your progression.&lt;em&gt; &lt;/em&gt;We will offer a combination of in house eLearning, workshops and courses to support your development.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;span&gt;You will become part of the Virgin Tribe. This grants you access to premier offers on Virgin Products such as holidays.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;span&gt;You’ll access our central online health and lifestyle platform covering healthy recipes, activity challenges, and support information around mental health.&lt;/span&gt;&lt;/p&gt;\n&lt;h2&gt;&lt;span&gt;Feel Proud&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;span&gt;Working within the District Nursing Team Out of Hours team, you will  support the delivery of nursing care to a range of complex patients within the community setting. This will include meeting the clinical need of patients with life limiting conditions, supporting rapid discharge for those patients reaching end of life and helping prevent any unnecessary hospital admissions to a patient in crisis.&lt;span&gt; &lt;/span&gt;You will be based primarily in Ormskirk in our District Nursing Team.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;span&gt;The work is varied and interesting. Striving to successfully provide healthcare can be both challenging and rewarding and our services are developing to meet the needs of the local population&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Ideally candidates, will have successfully completed an NVQ level 2 in Care and be able to demonstrate experience within the community setting.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;Feel Inspired&lt;em&gt; &lt;/em&gt;&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;span&gt;Here at Virgin Care, colleague recognition is important to us and we know that across our services there are colleagues who deserve acknowledgment for their commitment for going above and beyond to ensure that their colleagues and service users feel the difference. Every year we hold Feel the Difference Awards where nominated colleagues get together for a celebration to receive their prize for their recognised hard work!&lt;/span&gt;&lt;/p&gt;\n&lt;h2&gt;&lt;span&gt;Feel the Difference&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;span&gt;If you’d like to discuss the role further, or request the full job description, please contact Nicola Doody via email: Nicola.Doody&lt;em&gt;@virgincare.co.uk&lt;/em&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;span&gt;We partner with the NHS to make a real difference to people in Lancashire and we’re building a working environment where colleagues too can really feel the difference. It’s the kind of place where nothing’s too much trouble. Where you’ll feel empowered, listened to, valued and where we’ll support you to bring your best self to work every single day and to deliver high quality care. And that’s just the beginning. Since 2006, we’ve delivered services to millions of people by developing our own unique approach where our patients are at the centre of everything we do.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;span&gt;As a Disability Confident Committed company, we work in partnership with the Department of Work and Pensions (DWP) to provide facilities, work environment adjustments and technical solutions to make our business an inclusive place for all.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;span&gt;We’re committed to equal opportunities and welcome a broad diversity of talent to apply. We reserve the right to cease any advertising prior to the published closing date for a role that receives a high number of applications. Virgin Care Limited, its subsidiary companies and the Virgin Care LLPs are part of the Virgin Group and provide NHS and social care services. If you would like to know a little more about how we use your information, please see our website’s privacy policy.&lt;/span&gt;&lt;/p&gt;\n", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Virgin Care", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127354"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "District Nursing Hants Lane", "postalCode": "L40 8JU"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.6004", "longitude": "-2.8657"}}, "title": "Healthcare Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255685", "validThrough": "2020-11-18T23:59:59+0000"}