{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 pro rata per annum"}}, "datePosted": "2020-10-26T08:17:00+0000", "description": "&lt;p&gt;Our community Midwifery service covers the towns of Mansfield, Sutton in Ashfield, Newark &amp; the more rural area of Sherwood, this service encompasses both traditional and continuity of carer teams. The community teams are also supported by our Lime Green Feeding Team who provide women additional support with infant feeding to enhance the experience and continuity for the women.&lt;/p&gt;\n&lt;p&gt;We are looking for an enthusiastic, passionate midwife who would like to be at the forefront of the National Change in how pregnant women receive maternity Care. We are looking for a midwife who is motivated to support the recommendations made by ‘Better Births’ in implementing further ‘Continuity of Carer’ Teams at the Trust whilst continuing to provide quality care and achieve our Trust Value’s. The post holder will work initially as the Team Leader of a traditional community team. Support will be given by the Senior Midwifery Team to then develop and manage further Continuity of Carer teams in line with National Maternity Transformation plans.&lt;/p&gt;\n&lt;p&gt;We are looking for an experienced midwife with leadership skills and the ability to engage teams and work in new ways. You will need to be a team player, have excellent organisational and communication skills and be able to demonstrate your continued professional development.&lt;/p&gt;\n&lt;p&gt;The Trust offers a comprehensive induction programme, complemented by our generous annual in service training programme.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Lisa Butler lisa.butler3@nhs.net 07970 920867&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Sherwood Forest Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120977"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "King&#39;s MIll Hospital, Sutton-In-Ashfield", "postalCode": "NG17 4JL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.1345", "longitude": "-1.23627"}}, "title": "Community / Continuity of Carer Team Leader", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241711", "validThrough": "2020-11-08T23:59:59+0000"}