{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum pro rata"}}, "datePosted": "2020-10-20T11:16:35+0100", "description": "&lt;p&gt;&lt;strong&gt;Adult Nursing – Flexible Working Contracts Available&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Are you a Registered Nurse looking for something different to fit in with your commitments outside of your working life?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Look no further we have a range of exciting opportunities in our nursing teams as a Registered Nurse – Flexible Working.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This exciting set of opportunities have been developed in line with our unique and exciting Clinical Futures Model, which would mean that you would be joining the Health Board at a truly once in a generation era.&lt;/p&gt;\n&lt;p&gt;Clinical Futures is extending Aneurin Bevan University Health Board’s successful implementation of its Care Closer to Home initiatives; strengthening and promoting its services in the community as well as centralising care of the most critically ill patients in the brand new, state-of-the art The Grange University Hospital in Cwmbran in 2021.&lt;/p&gt;\n&lt;p&gt;The Health Board can offer you a great place to live and work, as well as the opportunity to develop and progress your career.&lt;/p&gt;\n&lt;p&gt;Staff well-being is one of the Health Board’s priorities, with a comprehensive package of support and development opportunities available to all. It is the Health Board’s aim that it is an enjoyable and fulfilling place to work as feeling valued at work has a positive impact on both staff and patients.&lt;/p&gt;\n&lt;p&gt;The Health Board scores particularly well for its engagement activities, with dedicated programmes to ensure staff feel informed and included.&lt;/p&gt;\n&lt;p&gt;We are offering opportunities to work within a range of acute wards either in medicine, trauma &amp; orthopaedics or surgery at Royal Gwent Hospital and Nevill Hall Hospital&lt;/p&gt;\n&lt;p&gt;The role of Registered Nurse – Flexible Working offers permanent or fixed term employment status dependent on your requirements. You could have the autonomy to self-roster and choose the days and shifts worked in advance, within your agreed contracted hours on a pool or aligned to a specific area.&lt;/p&gt;\n&lt;p&gt;We welcome applicants who are a Band 5 registered nurse.&lt;/p&gt;\n&lt;p&gt;We are pleased to offer a variety of flexible working contracts, which include but are not exhaustive to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Fixed-term: &lt;/strong&gt;You are not looking to commit to a permanent post but would like to work in the Health Board to see what it is like either in a pool or based on one ward or across a variety of wards.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Part-time: &lt;/strong&gt;Any hours that are worked that are not considered full-time (less than 37.5 hours per week).&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Term-time: &lt;/strong&gt;A permanent or fixed term contract where paid/unpaid leave can be taken during school holidays or other defined periods.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Job-sharing: &lt;/strong&gt;Covering full-time hours with another member of staff (as an example - you prefer nights – they prefer days).&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Annualised Hours: &lt;/strong&gt;The number of hours worked is fixed over the year, but variation in hours worked per week is available. This could include working during the winter or summer period only; working every other week; working two weeks in 6 week roster; basically any variable to fit your life.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;School Friendly Flexible hours: &lt;/strong&gt;If you are unable to commit to traditional shift times and patterns - we could accommodate later start and/or an earlier finish times for example school hours 9.30am-2.30pm or 6pm-10pm, etc.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We welcome a conversation to explore any of these options or you may wish to propose something different.&lt;/p&gt;\n&lt;p&gt;Interested in finding out more, contact Paige Griffiths in our Resourcing team on 01495 745805 Option 3.&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; Welsh and/or English speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt;Closing Date: 15 November 2020&lt;/p&gt;\n&lt;p&gt;Interview date: 10 December 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Tracey Rich&lt;/p&gt;\n&lt;p&gt;Assistant Divisional Nurse&lt;/p&gt;\n&lt;p&gt;tracey.rich@wales.nhs.uk&lt;/p&gt;\n&lt;p&gt;01633 238268&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123197.jpg", "name": "Aneurin Bevan University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123197"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Gwent Hospital or Nevill Hall Hospital, Various sites within the Health Board", "postalCode": "NP44 8YN"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6463", "longitude": "-2.99634"}}, "title": "Registered Nurse - Flexible Working", "url": "https://www.jobs.nhs.uk/xi/vacancy/916234096", "validThrough": "2020-11-15T23:59:59+0000"}