{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "Band 6 - £31,365 - £37,890 per annum"}}, "datePosted": "2020-10-26T11:30:59+0000", "description": "&lt;p&gt;&lt;strong&gt;West Sussex Dementia and Older People&#39;s Mental Health Services&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Mental Health Nurse - Band 6 Full Time - Dementia Intensive Support Interventions&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for five experienced Mental Health Nurses to join our West Sussex Dementia and Older People&#39;s Mental Health Team in Horsham and Crawley. West Sussex Dementia Services are currently in an exciting period of re-modelling. As part of this work we have actively reviewed all of our existing teams in consultation with our staff, service users and carers.&lt;/p&gt;\n&lt;p&gt;These posts will offer intensive support interventions specifically to those with dementia who are experiencing high levels of distress and displaying significant risk behaviours. The intensive support nurses and community support workers operate a 10 hour shift system which operates 8am – 7pm Monday to Fridays and 9-5 at weekends/Bank Holidays. The successful applicants will actively and creatively engage with those requiring an increased level of support by providing interventions with the aim of keeping people within their own environment, maintaining well being/ independence as far as possible and avoid hospital admission. The posts sit within the wider Dementia and Older People&#39;s Community Mental Health Team and therefore is supported by the full multidisciplinary team. Daily zoning takes place with the whole team in order to support and guide clinical activity and hold risk.&lt;/p&gt;\n&lt;p&gt;This post offers a Golden Hello, or a Relocation package up to a maximum of £2000. (pro rata applies and subject to terms and conditions. Please see attached Protocol document).&lt;/p&gt;\n&lt;p&gt;The base for this post will be New Park House in Horsham.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further information please contact Carrie George on 07808632021 or carrie.george@sussexpartnership.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;contact Carrie George, Service Manager on 07808632021&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121074.jpg", "name": "Sussex Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121074"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Horsham, Horsham", "postalCode": "RH12 1RJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.0643", "longitude": "-.324102"}}, "title": "Community Mental Health Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242211", "validThrough": "2020-11-09T23:59:59+0000"}