{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "107668", "minValue": "79860", "unitText": "YEAR", "value": "£79,860-£107,668"}}, "datePosted": "2020-10-20T12:34:20+0100", "description": "&lt;h1&gt;&lt;strong&gt;&lt;span&gt;CLINCIAL DIRECTOR FOR PLANNED CARE&lt;br /&gt;&lt;/span&gt;&lt;/strong&gt;&lt;/h1&gt;\n&lt;h1&gt;&lt;strong&gt;&lt;span&gt;Working together, aiming for outstanding. &lt;br /&gt;&lt;/span&gt;&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;We started our Getting to Good journey in 2017 and together we have come a very long way, our progress has been clear for all to see. We are seeking a new Clinical Director to provide clinical leadership for our next phase of our getting to good journey within our Planned Care Acute Division Care Group.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;As Clinical Director you will report to the Chief Operating Officer and be a key member of the Planned Care Senior Management Team. This role ensures the effective management and oversight of clinical services within Planned Care, Care Group. Working in a team with the Director of Operations and Associate Director of Nursing, the post holder will be responsible for the effective delivery of quality, financial and operational performance of this care group. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Key responsibilities will include;&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Providing the professional and compassionate leadership and oversight to clinical staff Planned Care&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;In collaboration with the Chief Operating Officer, Director of Operations and other colleagues develop and implement the overall strategy, objectives and goals of the care group aligned to the overall Trust Clinical Strategy.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Working collaboratively with colleagues and our partners you will assist the Executive Medical Director in the delivery of quality, clinical performance for Planned Care.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Financial responsibility to develop strategic plans to deliver sustainable services for our patients.&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;We welcome applicants working in any secondary care speciality as this role will enable you to balance both your clinical commitments with the leadership role as Clinical Director. &lt;br /&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;As an organisation where we share a total commitment in improving what we do, investing to improve how people experience health and care, know that our people make a positive difference every day and a belief that our partnerships make us stronger. The people who use our services are often our colleagues, our neighbours and our friends. Our close knit community makes being part of the Island’s NHS a unique privilege. &lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;If this opportunity excites you please get in contact for an informal discussion with Vicky Lauchlan, Director of Operations and/or Mr Steve Parker, Medical Director. &lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Isle of Wight NHS Trust - Medical Recruitment", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=135474"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Isle of Wight", "postalCode": "PO30 5TG"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7111", "longitude": "-1.30088"}}, "title": "Clinical Director For Planned Care", "url": "https://www.jobs.nhs.uk/xi/vacancy/916234419", "validThrough": "2020-11-22T23:59:59+0000"}