{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 pa"}}, "datePosted": "2020-11-02T12:00:32+0000", "description": "&lt;p&gt;&lt;strong&gt;TRUST WIDE STAFF NURSE VACANCIES&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Choose a nursing career that’s right for you! &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;£24,907 – £30,615 per annum (AfC band 5)&lt;/p&gt;\n&lt;p&gt;(Including rotations and flexible part time opportunities)&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;PLEASE NOTE WE CURRENTLY HAVE NO VACANCIES FOR PAEDIATRICS&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;We are seeking enthusiastic registered nurses to join our friendly highly energised performing Trust, a place where each and every one of us is proud to care and be part of the Trust, choosing a career at Barnsley Hospital NHS Foundation Trust means joining:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Dynamic teams that thrive on challenges in patient care&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;A Trust that embraces innovation and improvement&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;An organisation committed to supporting your career pathway and improvement&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;An organisation recently rated ‘Good’ by the CQC&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;An organisation where you have the opportunity to develop your career in a supportive environment&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Please note that if you are a newly qualified staff nurse please take your time completing your application form, paying particular attention to the values questions, if successfully shortlisted you will be offered a permanent contract in your area of choice without a formal face to face assessment. &lt;/p&gt;\n&lt;p&gt;We offer high levels of support and development which includes a preceptorship programme for Newly Qualified and Registered Nurses new into the NHS.  There is also the opportunity for career development through our internal Aspiring Talent Management Programme.&lt;/p&gt;\n&lt;p&gt;You will work in a clinical environment of no more than 28 patient beds where our nurse per bed ratio is 1 to 7.&lt;/p&gt;\n&lt;p&gt;We enjoy working within an environment that demonstrates the corporate vision that people want to work for us – we invite you to join in working here.&lt;/p&gt;\n&lt;p&gt;Vacancies are currently available across the Trust and we are open to working flexibly with you to find the right career for you!&lt;/p&gt;\n&lt;p&gt;Why not give us a call to see if we can meet your needs, or simply submit an application. &lt;/p&gt;\n&lt;p&gt;For further details or an informal chat our Associate Directors of Nursing would love to hear from you:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Paula Crosby – Associate Director for Emergency Medical Care and Medicine, Mobile 07792587528&lt;/li&gt;\n&lt;li&gt;Helen Green –Associate Director for Critical Care and Surgery, 01226 431558&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;For application enquiries please contact sarahparkinson@nhs.net, alternatively telephone 07821 808097.&lt;/p&gt;\n&lt;p&gt;Barnsley Hospital NHS Foundation Trust is committed to promoting equality of opportunity and fair treatment to all applicants regardless of race, nationality, ethnic origin, gender, marital status, mental or physical disability, religion or belief, sexual orientation, age or offending history.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120802.png", "name": "Barnsley Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120802"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Barnsley", "postalCode": "S75 2EP"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5583", "longitude": "-1.49958"}}, "title": "Staff Nurses", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251925", "validThrough": "2020-11-30T23:59:59+0000"}