{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-11-06T12:31:29+0000", "description": "&lt;p&gt;Ward 6X within the Royal Liverpool Hospital site is looking for Band 5 registered nurses to deliver high quality care for the respiratory patient.&lt;br /&gt;&lt;br /&gt;Ward 6X is an acute, fast paced environment. The Respiratory Service consists of 2 Respiratory Wards, a respiratory enhanced care unit, a respiratory Clinic and a clinical / procedure room. The wards provide acute respiratory medical care for patients with a wide variety of Respiratory conditions.&lt;br /&gt;&lt;br /&gt;Ward 6x comprises of 24 ward beds, with a 6 bedded Respiratory Support Unit for high dependency patients requiring acute intervention and management.&lt;br /&gt;&lt;br /&gt;If you join our team you will have the opportunity to gain experience in acute respiratory nursing and develop skills in NIV (non-invasive ventilation), tracheostomy management and care, chest drains and more.&lt;br /&gt;&lt;br /&gt;We provide holistic car, to the very acutely unwell and those with chronic respiratory illnesses who require frequent treatment. The wards treat a wide range of thoracic conditions. We care for patients admitted with lung cancer, asthma, COPD, TB, type 1 and type 2 respiratory failure, pleural effusions, pneumothorax, Tracheostomies and PE’S. &lt;br /&gt;&lt;br /&gt;We work closely with our allied health professionals to provide excellent, safe care. Our aim is to provide a high quality service whilst making our patients feel empowered and included in their care, to ensure we achieve the best in everything we do - now and in the future.&lt;br /&gt;&lt;br /&gt;The ward team has excellent support from the Consultant Respiratory physicians; provides a Non-Invasive Ventilation service to patients and has a close working relationship with the Respiratory Nurse Specialists and palliative specialist nurses, to deliver high quality patient care.&lt;br /&gt;In return, the Trust is committed to supporting and developing its’ staff so opportunities for training and other development activities will be provided. &lt;br /&gt;&lt;br /&gt;We can offer you: &lt;br /&gt;• Mentorship from our dynamic supportive team&lt;br /&gt;• Preceptorship&lt;br /&gt;• Development of Non-invasive ventilation skills&lt;br /&gt;• Tracheostomy care skills&lt;br /&gt;&lt;br /&gt;The Respiratory directorate is a speciality that is an excellent area for newly qualified nurses to begin their career pathway. It offers a huge variety of opportunities that is not readily available within other specialities.&lt;br /&gt;&lt;br /&gt;Respiratory nursing gives you acute dynamic skills which are transferable.&lt;/p&gt;\n&lt;p&gt;Liverpool University Hospital NHS Trust is a great place to work with on-going learning and is a top rated organisation for the delivery of excellent patient care. There is an reputation of excellent team work In an extremely friendly working environment.&lt;/p&gt;\n&lt;p&gt;New starters attend a Trust Induction, where they learn about the Trust, start developing their mandatory skills and begin to understand what will be expected of them in their new role. Staff will then progress onto Preceptorship , an excellent programme designed to facilitate efficient development of competence ,confidence and expertise. Support will be given at a clinical level by a preceptor, and from a wider organisational structure including the preceporship lead, clinical skills team , clinical practice development nurse and learning and development.There will be evidence based competencies for staff to complete, which will cover all aspects of nursing within a respiratory environment. This will enable staff to obtain the knowledge and skills required to rotate into the respiratory enhanced care unit.&lt;br /&gt;&lt;br /&gt;Our Respiratory Directorate is an excellent environment for experienced nurses. They may not have previous experience within respiratory, but they would be able to bring other knowledge and skills from other specialities. As described above, the same opportunities are available to experienced nurses. Nurses who may have previous experience within respiratory, would have the opportunity to consolidate their knowledge and skills. They would be able to gain experience and develop within certain aspects of respiratory care that may not have been available to them in their previous role. This includes caring for patients in our high dependent units, where our patients may require non-invasive ventilation therapy.&lt;br /&gt;&lt;br /&gt;We are looking for candidates who are keen to develop professionally in this exciting domain of Respiratory medicine. The respiratory unit offers a supportive and learning environment which endeavours to constantly develop the service, in order that our patients can receive the highest quality and most up to date care. The Unit welcomes and will support both newly qualified and experienced Registered Nurses. You must possess a caring, compassionate and positive manner and have excellent communication skills. &lt;br /&gt;&lt;br /&gt;The successful candidate will be expected to rotate from day to night duty.&lt;br /&gt;&lt;br /&gt;We will be in a position to provide a quick recruitment process with an offer of invite to interview and assessment within 48 hours of closing date. With outcome of interview and assessment within 24 hours. Our recruitment team ensures excellent service and support to ensure employment checks are achieved within a timely fashion.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameRandy TingJob titleWard ManagerEmail addressRandy.Ting@liverpoolft.nhs.ukAdditional contact information&lt;/p&gt;\n&lt;p&gt;Randy Ting Ward Manager 6X&lt;/p&gt;\n&lt;p&gt;Randy.Ting@liverpoolft.nhs.uk&lt;/p&gt;\n&lt;p&gt;0151 706 2463&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121281.png", "name": "Liverpool University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121281"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "RLBUHT, Liverpool", "postalCode": "L7 8XP"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4095", "longitude": "-2.96481"}}, "title": "Staff Nurse - Respiratory Ward 6X", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259671", "validThrough": "2020-11-19T23:59:59+0000"}