{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "49056", "minValue": "38649", "unitText": "YEAR", "value": "£38,649 - £49,056"}}, "datePosted": "2020-10-20T11:35:37+0100", "description": "&lt;p&gt;&lt;span&gt;Dental Academic Clinical Fellowship (ACF recruitment) – Health Education England in conjunction with the University of Manchester.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Health Education England (North West) in partnership with the University of Manchester and Manchester University Foundation NHS Trusth as developed an exciting pathway for clinical academic training.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Applications are now invited for an Academic Clinical Fellowship in Dental Core Training at DCT1/2/3 level.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are seeking applicants who wish to undertake an academic training as well as continuing to develop their clinical skills. This new post has been created as part of the Health Education England (HEE))/National Institution for Health Research Trainee Coordinating Centre (NIHRTCC) programme of Integrated Academic Training and offers candidates a comprehensive experience of clinical academic dentistry working alongside internationally renowned clinicians and researchers.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This job description should be read in conjunction with NIHR Academic Clinical Fellowships (Dental) Guidance For Recruitment and Appointment.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; Applicants will have to already have undertaken clinical benchmarking in 2020 (or have a NTN) to be eligible to apply for this post. For any clarification regarding clinical benchmarking requirements for appointment to ACF posts, queries should be directed to the Postgraduate Dental Dean.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "North Western Deanery", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=129754"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Manchester", "postalCode": "M1 3BN"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4777", "longitude": "-2.23275"}}, "title": "Dental Academic Clinical Fellowship – DCT at University of Manchester.", "url": "https://www.jobs.nhs.uk/xi/vacancy/916234198", "validThrough": "2020-11-17T23:59:59+0000"}