{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum"}}, "datePosted": "2020-10-23T09:45:50+0100", "description": "&lt;p&gt;We are proud to announce that the Trust in conjunction with our local Dorset Clinical Commissioning Group have recently completed a review of our Rehabilitation Services in Dorset and secured significant additional funding to redevelop and expand the services that we provide.&lt;/p&gt;\n&lt;p&gt;This includes a brand new dedicated pan Dorset Community based Rehabilitation Team (CRT). The CRT will support people who have chronic and disabling mental health problems that may be treatment resistant and who have previously spent long periods in hospital.&lt;/p&gt;\n&lt;p&gt;Our vision is to provide a community team in the east and a community team in the west of the county. This will be a flagship service enabling Dorset HealthCare to become one of the best rehabilitation services across the country.&lt;/p&gt;\n&lt;p&gt;We are looking for a full-time (10PA) Consultant Psychiatrist who is reliable, committed and dedicated with excellent communication and organisational skills and the ability to prioritise their work.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be responsible for the The Glendinning Unit, in the Town of Dorchester. This is a mixed sex unit providing a service for a total of 9 patients, requiring specialist care to meet a range of complex mental health issues along with additional co-morbidities often experienced by this client group. They would also be responsible for providing medical leadership into the newly formed community rehab team, also to be based in the West of the county that covers a large expanse of Dorset.&lt;/p&gt;\n&lt;p&gt;The postholder must ensure the relevant professional registration is maintained, including Section 12, Approved Clinician, and Responsible Clinician status and will be incorporated into the senior On-Call rota which is currently 1 in 25 for Dorset week days and 1 in 8 on call for West Dorset week-ends.&lt;/p&gt;\n&lt;p&gt;If you want to be part of this newly established dynamic, forward thinking service, we would be keen to hear from you.&lt;/p&gt;\n&lt;p&gt;For further information regarding this vacancy or the Trust Dr Sudipto Das, Deputy Medical Director on tel 01202 277011 or Dr Domenico Scala Clinical Lead for inpatient and Specialty Services on tel 07584 531691 (mon-thurs), who will be happy to discuss anything with you.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Employment in this post requires an Enhanced Disclosure and Barring Service (DBS) check. The DBS levies a charge of £40 and the Trust will recover this cost in instalments from your first 3 salary payments. &lt;/em&gt;&lt;em&gt;This will only apply to candidates who are new to the Trust and not internal staff. Applicants who subscribe to the DBS update service will not incur a charge.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121022.png", "name": "Dorset HealthCare University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121022"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Mid/West Dorset", "postalCode": "DT2 9TB"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7543", "longitude": "-2.4534"}}, "title": "Consultant General Adult Psychiatrist - Rehabilitation Team West", "url": "https://www.jobs.nhs.uk/xi/vacancy/916239887", "validThrough": "2020-11-22T23:59:59+0000"}