{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum excl HCAS"}}, "datePosted": "2020-11-03T12:46:06+0000", "description": "&lt;p&gt;&lt;strong&gt;Specialist Occupational Therapist and Case Manager- Bed Based Intermediate Care (BBIC) TEAM band 6&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please note band 5 occupational therapists will be considered for the above post where they can work towards competencies. This will enable them to transition to the band 6 role once they have achieved the competencies within a given time frame. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for an enthusiastic clinician to join one of our integrated community-based team. You will be expected to have a broad experience of Occupational Therapy settings and bring into your clinical work all the holistic core skills of occupational therapy. The post holder will be expected to draw upon both physical and mental health training and interventions to achieve the best outcomes for the clients.&lt;/p&gt;\n&lt;p&gt;The team works with adults of all ages and is based on achieving customer-centred goals so experience in assessing and developing treatment plans for older people and for people with physical disabilities is essential.&lt;/p&gt;\n&lt;p&gt;You will be involved in the supervision of junior staff and students. You will be joining a supportive group of colleagues, with regular in-service and professional forums, individual supervision and a personal development plan that is regularly updated.&lt;/p&gt;\n&lt;p&gt;You will be responsible for providing clinical and therapeutic guidance to colleagues working with people with complex needs, to enable the team to undertake service development, changes of service, practice and ways of working to enable effective inter-discipline working. You will be asked to continue to develop and promote the role of Occupational Therapy within an integrated team. You will also take responsibility for identifying and flagging service gaps to improve service delivery.&lt;/p&gt;\n&lt;p&gt;Your role is to work in a Bed based service and will also include undertaking some community visits. You will work closely with other members of the MDT including Physiotherapists, Psychologists, Nurse as well as Speech and Language Therapists.&lt;/p&gt;\n&lt;p&gt;The role of the Occupational Therapist is to contribute to the reablement/rehabilitation of customers completing thorough assessments, appropriate interventions, onward referrals, comprehensive documentation, ordering equipment, completing home access and discharge visits and contributing to discharge reports.&lt;/p&gt;\n&lt;p&gt;As the Occupational Therapist you will need to liaise via phone or email with other parties involved in the rehabilitation of the customer, this may be hospital staff, family members, supervisors or other professionals.&lt;/p&gt;\n&lt;p&gt;As an integral member for the MDT you will be required to contribute and attend weekly MDT meetings, complete presentations to external agencies. You may also represent the REACH team in a wider context.&lt;/p&gt;\n&lt;p&gt;We expect the post holder to have a can do attitude and be willing to work in a flexible manner within the MDT to work together to achieve the best outcomes for the service user.&lt;/p&gt;\n&lt;p&gt;The post holder will receive a thorough induction and regular operational supervision.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please note band 5 occupational therapists will be considered for the above post where they can work towards competencies. This will enable them to transition to the band 6 role once they have achieved the competencies within a given time frame.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If you would like to discuss the above post further, please contact Keisha Soans REACH Team lead at &lt;/strong&gt;&lt;strong&gt;keisha.soans@nhs.net&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121035.JPG", "name": "Whittington Health", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121035"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Whittington Health NHS Trust, London", "postalCode": "N7 7EP"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.562", "longitude": "-.114029"}}, "title": "Senior Occupational Therapist and Case Manager - Community", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254014", "validThrough": "2020-11-17T23:59:59+0000"}