{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-10-23T12:10:49+0100", "description": "&lt;p&gt;Are you looking for an exciting opportunity that offers a great work/life balance?&lt;/p&gt;\n&lt;p&gt;Would you like to work within a supportive team and yet have the confidence to lone work?&lt;/p&gt;\n&lt;p&gt;Would you like the opportunity to care for people in their own home? Keeping patients out of hospital and working alongside GPs and Advanced Clinical Practitioners to ensure every step can be taken to avoid a hospital admission.&lt;/p&gt;\n&lt;p&gt;Adult Community Services at The Mid Yorkshire Hospitals NHS Trust are looking for Community Staff Nurses to join the Integrated Care team that covers 24/7-365 days per year. Supporting patients with rehabilitation in their own home, out of hour’s district nursing visits, palliative care at home for end of life patients and Intravenous antibiotics at home.&lt;/p&gt;\n&lt;p&gt;We pride ourselves on being a truly flexible employer, whether you require a position to enable you to work closer to home or you require flexible working patterns due to child care or carer responsibilities, we treat our staff as individuals and work with them to ensure a harmonious work life balance.&lt;/p&gt;\n&lt;p&gt;The Integrated Care team are able to offer flexible working through a number of different shift patterns. The service covers early, late and night shifts.&lt;/p&gt;\n&lt;p&gt;Working as part of our team, you will have the opportunities to: develop or extend your clinical knowledge and experience by working across a range of clinical settings; develop extensive clinical assessment and case management skills in areas, such as hospital avoidance, managing long term conditions, wound management and end of life care; and to plan and deliver complex care plans.&lt;/p&gt;\n&lt;p&gt;We will support you to develop through our comprehensive preceptorship and mentorship programs. We have excellent electronic facilities to support your learning and development and have recently developed an online portfolio to support your revalidation.&lt;/p&gt;\n&lt;p&gt;At Mid Yorkshire Hospitals Trust we encourage lifelong learning so you will be expected to support pre-registration students in your role; and we have an extensive range of professional development programs, with dedicated nursing education provision.&lt;/p&gt;\n&lt;p&gt;Adult Community Services are proud to have been rated ‘Good’ following their most recent CQC inspection.&lt;/p&gt;\n&lt;p&gt;To register your interest, and tell us more about yourself and your career ambitions, please submit an application. You are very welcome to contact us prior with any questions you may have, or to arrange an informal visit, by contacting Carla Shaw – Team Leader on Carla.shaw4@nhs.net or via mobile on 07849305761.&lt;/p&gt;\n&lt;p&gt;Please note that this job role is intended for people who have already qualified. If you are due to qualify within the next 12months, you are welcome to register your interest but we will invite you to one of our bespoke graduate nurse open days.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120735.png", "name": "Mid Yorkshire Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120735"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wakefield", "postalCode": "WF10 5QS"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7118", "longitude": "-1.41066"}}, "title": "Community Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240451", "validThrough": "2020-11-06T23:59:59+0000"}