{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 pa, pro rata"}}, "datePosted": "2020-11-05T08:30:46+0000", "description": "&lt;p&gt;The newly formed Forensic Community Mental Health Team (FCMHT) in Derbyshire is expanding and now looking for an experienced, dynamic and innovative Occupational Therapist to join us.&lt;/p&gt;\n&lt;p&gt;You will join our supportive team of psychologists, psychiatrists, nurses and enablement workers in delivering care that makes a difference to people’s lives in the community.&lt;/p&gt;\n&lt;p&gt;You will lead the clinical delivery of the service alongside holding a responsible clinician case load and delivering expert psychological assessment, intervention and consultation.&lt;/p&gt;\n&lt;p&gt;The role requires expertise in the engagement of and working with people across all adult vulnerabilities facing complex mental health challenges, within the context of the Criminal Justice System or with forensic background.&lt;/p&gt;\n&lt;p&gt;Service user presentations are varied and include a trauma background, substance misuse issues, learning or developmental difficulties, self-harm or other behaviours that challenge.&lt;/p&gt;\n&lt;p&gt;The FCMHT helps reduce reoffending and increases ability to cope with mental health difficulties in those persons who are moving into the community from secure services.&lt;/p&gt;\n&lt;p&gt;The individual may or may not be subject to MHA or Criminal Justice sanctions.&lt;/p&gt;\n&lt;p&gt;The multi-disciplinary team delivers a range of risk and mental health assessments and provides support and psychiatric and psychological interventions to enable the individual to stay safe, manage their mental health and therefore offending.&lt;/p&gt;\n&lt;p&gt;The successful candidate will work alongside and liaise with other partner agencies such as police, probation, CMHT and inpatient units.&lt;/p&gt;\n&lt;p&gt;The post holder will have experience of delivering complex occupational therapy assessments and interventions, group work and supervising others.&lt;/p&gt;\n&lt;p&gt;The ability to draw on a wealth of expertise and experience to deliver individually tailored occupational therapy intervention and risk assessment according to need is paramount.&lt;/p&gt;\n&lt;p&gt;The post holder must have significant experience of working within an occupational therapy role; as well as being keen to further develop service delivery in innovative ways.&lt;/p&gt;\n&lt;p&gt;This is a rare and exciting opportunity for someone to help shape and develop occupational therapy services in the community.&lt;/p&gt;\n&lt;p&gt;If you aspire to offer clinical excellence; have the experience and skills to develop services and are looking to take the next step in your leadership journey within a supportive and cohesive service, then we would love to hear from you.&lt;/p&gt;\n&lt;p&gt;Please feel free to contact us for an informal discussion.&lt;/p&gt;\n&lt;p&gt;As an employee of Derbyshire Healthcare NHS Foundation Trust you will be required to adhere to the Trust’s overriding value of putting “patients at the heart of everything we do”.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Vanessa Pollard&lt;/p&gt;\n&lt;p&gt;Senior Forensic Community Psychiatric Nurse&lt;/p&gt;\n&lt;p&gt;vanessa.pollard@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number 01332 623793&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121834.jpg", "name": "Derbyshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121834"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Derbyshire Probation Service, Derby", "postalCode": "DE1 2EQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9247", "longitude": "-1.47441"}}, "title": "Senior Forensic Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256934", "validThrough": "2020-11-18T23:59:59+0000"}