{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 gross per annum"}}, "datePosted": "2020-10-28T14:46:03+0000", "description": "&lt;p&gt;We are seeking to recruit a Band 7 Clinical Team Manager to join the Central Norfolk Early Intervention in Psychosis team. We are looking for a highly motivated and forward thinking individual to lead the continuing development of an EIP service rated as a ‘Top Performing’ in recent NCAP Audit. You will need to have well established leadership and management ability, as well as excellent communication and liaison skills in order to engage and collaborate with colleagues and stakeholders. The successful candidate will have a strong focus on quality, safety and be able to demonstrate experience of service improvement.&lt;/p&gt;\n&lt;p&gt;The Early Intervention services across Norfolk has undergone significant expansion over the last four years following funding from NHS England for the Access and Waiting Time Standards and the Central team has expanded accordingly. Recent developments, including a move to a new clinical base and an opportunity to review team configuration, mean the role is presented to shape this opportunity for service improvement and to lead a group of dedicated clinicians who hold the service user and their network at the centre of all they do. You will also support the team to deliver timely, evidenced based interventions and the delivery of National EIP standards.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Benefits &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Benefits included with this role are:-&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;NHS pension&lt;/li&gt;\n&lt;li&gt;a comprehensive in house &amp; external training programmes&lt;/li&gt;\n&lt;li&gt;career progression&lt;/li&gt;\n&lt;li&gt;starting annual leave of 27 days per annum increasing to 33 days pa based on length of service (plus paid bank holidays)&lt;/li&gt;\n&lt;li&gt;staff physio service&lt;/li&gt;\n&lt;li&gt;NHS discounts and many more.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We are working hard to maintain usual recruitment process however please be aware that we may ask you to be interviewed via MS Teams rather than in person. Please also bear with us as we endeavour to recruit as many people as we can in unprecedented times.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Please find attached our Job Description and Person Specification for more detail on your Key Accountabilities, then if you feel you have what it takes to make a difference in your local communities, click APPLY!&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Interviews are to be confirmed, candidates may only be given a minimum of 3 days’ notice, please note this date is provisional and may be subject to change. You will be contacted via email and invited to book a time. These emails may go to your SPAM, so please keep checking all your emails if applying.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Please visit our Facebook and Twitter page @NSFTjobs&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameNeil RobertsonJob titleOperational ManagerEmail addressneil.robertson@nsft.nhs.ukTelephone number07827820007Additional contact information&lt;/p&gt;\n&lt;p&gt;Or Tony Reilly on 01603 671901&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121326.png", "name": "Norfolk and Suffolk NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121326"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "No 7 Unthank Road, Norwich, Norwich", "postalCode": "NR2 2PA"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.628", "longitude": "1.2821"}}, "title": "Clinical Team Manager- Central Early Intervention in Psychosis", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247041", "validThrough": "2020-11-15T23:59:59+0000"}