{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 Per annum"}}, "datePosted": "2020-11-05T13:16:26+0000", "description": "&lt;p&gt;Do you want a new exciting career move? Wanting something different, new and exciting?&lt;br /&gt;Due to staff progression this exciting opportunity has arisen for an enthusiastic, dynamic Technician to join our friendly team. This post is ideal for a motivated and driven person. The post holder will find this rewarding in providing patient care , with great development opportunities and will give you the opportunity to develop leadership and mentoring skills, being an important link in developing service within the integrated care system.&lt;/p&gt;\n&lt;p&gt;You will be integral to the delivery of a focused, patient-centred service with an opportunity to make a real difference to patient care, as the successful candidate you will be given opportunities to be a part of team who are already excelling in shaping the way trust interacts with our patients and the success of the developing services including Electronic prescribing and developing excellent medicine management pathways. You will be part of an established team who will provide all of the training and support required to meet the demands of this role. You will work closely with the Dispensary, Clinical and Technical rotational teams.&lt;/p&gt;\n&lt;p&gt;You should be a registered pharmacy technician with the GPhC, ideally it is desirable to already have one of the following A) A nationally recognised Medicines Management qualification which includes POD checking, one-stop dispensing and Medicines Reconciliation B) A nationally recognised ACPT qualification.&lt;br /&gt;However if you’re the right candidate with a great work ethic and attitude this training will be provided.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Sheila O’Callaghan Team Leader Dispensary 01296 316168/Millie Edwards MMT Lead 07866171229&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Buckinghamshire Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120887"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Stoke Mandeville Hospital / Wycombe Hospital, Cross site (Aylesbury/Wycombe)", "postalCode": "HP21 8AL"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7983", "longitude": "-.802734"}}, "title": "Pharmacy Technician Dispensary and Ward", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257839", "validThrough": "2020-11-19T23:59:59+0000"}