{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Negotiable"}}, "datePosted": "2020-11-03T12:58:58+0000", "description": "&lt;p&gt;This is an exciting opportunity for a Clinical Pharmacist to join a diverse and motivated Primary Care Network (PCN) in North Norfolk. NN4, made up of six practices, are looking for an experienced, motivated and reliable Clinical Pharmacist to join and work closely with the practice teams, providing and maintaining high standards of care for patients. The post holder will be employed by North Norfolk Primary Care (NNPC), who are one of the fastest growing health organisations in Norfolk and can offer a fully established organisation that can provide many opportunities for progress.&lt;/p&gt;\n&lt;p&gt;Main duties of the job&lt;/p&gt;\n&lt;p&gt;We are looking to recruit a Clinical Pharmacist who will be an integral part of the General Practice team, working in each practice and across the Primary Care Network, as well as part of a wider pharmacist network and multidisciplinary team. They will improve patient’s health outcomes and the efficiency of the Primary Care team by providing direct, accessible and timely medicines expertise including face to face contact with patients. They will work to optimise medication issues to improve patient care, safety and support clinical staff in the management of patients.They will need to have the ability to influence and communicate effectively with clinical colleagues, patients and support staff.&lt;/p&gt;\n&lt;p&gt;As part of their employment, the post holder will achieve qualification from an accredited training pathway, including independent prescribing, equipping the clinical pharmacist to be able to practice and prescribe safely and effectively in a primary care setting. The supervision and mentorship network will be provided to support the Clinical Pharmacist.&lt;/p&gt;\n&lt;p&gt;About us&lt;/p&gt;\n&lt;p&gt;North Norfolk Primary Care (NNPC) is a Primary Care provider based in North Norfolk, owned by 19 general practices. We have a very cohesive working relationship with our 19 practices and are one of the fastest growing health organisations in Norfolk. We are keen to add to our clinical workforces and have a fantastic opportunity for a Clinical Pharmacist to work within one of our Primary Care Networks (PCN’s), NN4.&lt;/p&gt;\n&lt;p&gt;NN4 is a PCN of six practice based in North Norfolk; Acle Medical Partnership, Blofield Surgery, Brundall Medical Centre, Hoveton &amp; Wroxham Medical Centre, Ludham &amp; Stalham Green Surgery, Staithe Surgery. All of these practices have diverse clinical teams and a strong motivation to provide the highest quality patient care.&lt;/p&gt;\n&lt;p&gt;Should you want any further information, please contact simon.parkes@northnorfolkprimarycare.com&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central Advertising - Social Enterprises", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130655"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Norwich", "postalCode": "NR6 6BF"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6675", "longitude": "1.27475"}}, "title": "Primary Care Network Clinical Pharmacist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254061", "validThrough": "2020-11-17T23:59:59+0000"}