{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 to £51,668 per annum"}}, "datePosted": "2020-11-05T14:46:54+0000", "description": "&lt;p&gt;CWP is an existing provider of Mental Health Support Teams (MHSTs) for wave 1 and wave 2 of MHST delivery.&lt;/p&gt;\n&lt;p&gt;In Cheshire we are fortunate to have been selected as a site for hosting further wave 3 and wave 4 Mental Health Support Teams (MHSTs) as part of a national drive to increase the mental health provision within schools.&lt;/p&gt;\n&lt;p&gt;In line with the government’s priority to increase access and availability of mental health and wellbeing support for children and young people, the new Clinical Lead role is an exciting opportunity to deliver evidence-based early interventions for children and young people and will be responsible for operational leadership of the day to day running of a busy team.&lt;/p&gt;\n&lt;p&gt;The successful candidate will work across two Cheshire Mental Health Support Teams and will be committed to help develop and drive the service forward.&lt;/p&gt;\n&lt;p&gt;You will be an experienced clinician who has worked extensively within children and young people’s mental health settings.&lt;/p&gt;\n&lt;p&gt;This post is for 24 months secondment or fixed term due to funding.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further information or informal visits please contact Anne Casey, Head of Clinical Services anne.casey1@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Cheshire and Wirral Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121132"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "To be confirmed upon appointment, Chester", "postalCode": "CH2 1BQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.2118", "longitude": "-2.89903"}}, "title": "Clinical Lead Mental Health Support Teams in Schools", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258186", "validThrough": "2020-12-03T23:59:59+0000"}