{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "39332", "minValue": "39332", "unitText": "YEAR", "value": "from £39,332"}}, "datePosted": "2020-11-02T15:47:05+0000", "description": "&lt;p&gt;Do you share our passion for great patient care and making a difference? Do you want career opportunities and great CPD? DHC Talking Therapies is a successful, dynamic and growing service and we are looking for talented individuals to join our team.&lt;/p&gt;\n&lt;p&gt;We have an excellent reputation for a quality and well run service with great recovery rates as well as great Clinical supervision, CPD and career opportunities.&lt;/p&gt;\n&lt;p&gt;We are looking to recruit good quality High Intensity CBT Therapists to work as part of our expanding IAPT service across Surrey. Our therapists generally work within a small geographical area and we are particularly keen to recruit to the following locations: Surrey Downs (Dorking, Epsom, Leatherhead), and East Surrey (Redhill, Oxted). Our therapists all have the opportunity to request working part of their week from home, delivering virtual appointments.&lt;/p&gt;\n&lt;p&gt;You will be enthusiastic, hard-working and have a genuine interest in helping clients.&lt;/p&gt;\n&lt;p&gt;We anticipate a number of training opportunities this year including:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Long Term Conditions&lt;/li&gt;\n&lt;li&gt;EMDR&lt;/li&gt;\n&lt;li&gt;Trauma focused CBT&lt;/li&gt;\n&lt;li&gt;Supervisors training&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The post-holder will work within the IAPT service providing high intensity interventions. The post-holder will provide cognitive behavioural therapy (CBT) to clients with a range of moderate to complex problems for which CBT is demonstrated to be clinically effective.&lt;/p&gt;\n&lt;p&gt;DHC is a patient focused and pro-active community based provider and have strong links with both GP&#39;s and our colleagues in DHC&#39;s physical health services. We have a strong commitment to delivering high quality community oriented services, and to working in partnership with service users, carers, health and social care agencies and voluntary agencies.&lt;/p&gt;\n&lt;p&gt;We are a dynamic, supportive and creative service, who provide a high level of training and supervision to clinical practitioners at all levels.&lt;/p&gt;\n&lt;p&gt;We would like to hear from you if you are able to demonstrate the following:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;BABCP accreditation. We would also be keen to hear from you if you are working towards Provisional Accreditation as we are able to provide interim posts to support the transition from training to Provisional Accreditation&lt;/li&gt;\n&lt;li&gt;Evidence of working with people who have presented with mental health difficulties, preferably in primary care.&lt;/li&gt;\n&lt;li&gt;Excellent communication skills with the ability to work collaboratively.&lt;/li&gt;\n&lt;li&gt;Able to work to deliver required performance indicators&lt;/li&gt;\n&lt;li&gt;A positive attitude to working for DHC.&lt;/li&gt;\n&lt;li&gt;Committed to supporting the mental health and wellbeing of Surrey residents in our catchment areas.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The successful candidates will join an established, experienced and well supported team working to maintain DHC IAPT Service&#39;s excellent reputation within our local Surrey catchment areas.&lt;/p&gt;\n&lt;p&gt;We provide regular clinical supervision as well as excellent CPD opportunities. We understand that work life balance is important, therefore there is opportunity for an agreed flexible working pattern.&lt;/p&gt;\n&lt;p&gt;We appreciate that the right person might have their own requirements for the role and are therefore, happy to accept applications that are full-time or part-time or require a particular geographical area.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/130554.jpg", "name": "Dorking Healthcare Limited ", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130554"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Surrey Downs", "postalCode": "KT18 7EG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.325", "longitude": "-.273383"}}, "title": "IAPT CBT Therapist (High Intensity)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252711", "validThrough": "2020-11-16T23:59:59+0000"}