{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "22199", "minValue": "20771", "unitText": "YEAR", "value": "£20,771 - £22,199 inc. Fringe HCAS"}}, "datePosted": "2020-10-10T15:44:08+0100", "description": "&lt;p&gt;An exciting opportunity within the Surrey and Borders NHS Foundation Trust Home Treatment teams for individuals who have had lived experiences of mental illness to join our team of peer wokers.There is scope for these posts to be available as job share for the right candidates.&lt;/p&gt;\n&lt;p&gt;You will be responsible for working with service users to support personal recovery goals using an agreed structuredrecovery manaul. You will be willing to positively share your personal experiences with others to support others with their jounrey of recovery. Experience of working in a care setting is not essential for this role as life experience and knowlegde is of most importance.&lt;/p&gt;\n&lt;p&gt;We are looking for individuals who can bring their invaluable insights in mental health which would assist others as as well as the continued development of the service. We are looking to recruit 2 part time peer support workers to work in each of our 4 home treatment teams based in Frimley, Guildford, Cherstey and Redhill. We are therefore looking to recruit a total of 8 peers working 16 hours each a week.&lt;/p&gt;\n&lt;p&gt;Evidence of of achieving personal goals and level of stability is also importnat as is an interest in a career working to support others going through a crisis.&lt;/p&gt;\n&lt;p&gt;You will have good communication, flexibility and basic computer skills along with a desire to learn and develop new skills.&lt;/p&gt;\n&lt;p&gt;You will also develop good working relationships with both voluntary and statutory servces within the area supporting others in accessing these services. All applicant will share a commitment to meet with other peers and peer support supervisor once a week for support.&lt;/p&gt;\n&lt;p&gt;All successful applicants will receive 8 full days of specific peer support training in addition to your induction. You will also have access to Care Certificate.&lt;/p&gt;\n&lt;p&gt;All peers will be fully supported in their personal and professional development through regualr 1:1 clinical supervsion within the line managment structure, along with peer supervsion and invoilvement in trust wide peer develoment training and events.&lt;/p&gt;\n&lt;p&gt;As this is a comminuty role you will need access to your own car or be willing to use local transport&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121260.jpg", "name": "Surrey and Borders Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121260"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Frimley, Guildford, Chertsey, Redhill", "postalCode": "KT22 7AD"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2976", "longitude": "-.335577"}}, "title": "Peer Support Workers", "url": "https://www.jobs.nhs.uk/xi/vacancy/916221392", "validThrough": "2020-11-16T23:59:59+0000"}