{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "15448", "minValue": "15448", "unitText": "YEAR", "value": "£9.19"}}, "datePosted": "2020-10-28T13:26:15+0000", "description": "&lt;p&gt;&lt;strong&gt;Healthcare Assistants&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Do you like working with people and want to make a difference? This is an exciting opportunity for those that would like to be more involved in patient care and start with or gain on their health care experience, with the chance to learn new skills and be part of a recognised and successful organisation.&lt;/p&gt;\n&lt;p&gt;This role requires you to possess exceptional organisational and problem solving skills with the ability to work under pressure in a busy clinical environment independently and as part of a team, along with having excellent communication and interpersonal skills and be able to liaise with a variety of people at various levels. Flexibility is key to meet the demands of the company.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interested?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will provide general support to GP Care’s team delivering a range of outpatient services, from our clinic in Swindon and also various clinic locations in the Gloucestershire areas. Travel to Bristol, North Somerset, South Gloucestershire and our Head Office will be required occasion. As travel to our multiple clinic locations will be required, you will need a current driving licence and access to a car.&lt;/p&gt;\n&lt;p&gt;Clinics typically run between 8am - 6pm, Monday - Friday.&lt;/p&gt;\n&lt;p&gt;Benefits includes: 25 days holiday plus public holidays pro rata, together with a 4% non-contributory employers pension contribution.&lt;/p&gt;\n&lt;p&gt;Shortlisted candidates will be contacted to attend an interview and if sucessful will then be asked to attend one of our clinics.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About Us&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are a CQC accredited healthcare provider of community based healthcare services including diagnostics, outpatient and ancillary services to NHS and private patients, currently within Bristol, North Somerset, South Gloucestershire, Gloucestershire and Swindon but looking to branch out further to new CCG areas across England. In addition we offer a variety of support services to our shareholder base of 100 practices which comprise over 650 GPs who look after approximately 1,000,000 patients. Our services are clinically led, developed to meet patient needs and provide cost and efficiency savings to the NHS.&lt;/p&gt;\n&lt;p&gt;GP Care&#39;s key patient values are:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Services are always designed around the patient&lt;/strong&gt;- services that are well managed, efficient, convenient and accessible for patients are generally cost effective for commissioners;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;We treat patients with kindness, dignity and respect&lt;/strong&gt;- as if we were talking to a friend or relative about an important matter;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;We always talk to patients&lt;/strong&gt;- we don&#39;t make appointments without direct verbal contact and patients are provided with a telephone contact number for each service, all of which are answered personally and promptly. We don&#39;t like automated voice systems and we don&#39;t use them;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Keeping referring GPs informed&lt;/strong&gt;- all of our services provide GPs with discharge reports within 24 hours of an appointment as we believe this is critical to ensuring they are fully informed should a patient refer to them for continuing advice or support.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;GP Care is committed to a policy of equality in all our employment practices and it is essential that all staff are willing to make a positive contribution to the promotion and implementation of this. Recruitment is done in line with safe recruitment practices.&lt;/p&gt;\n&lt;p&gt;This post is subject to a Disclosure and Barring Service check (formerly known as CRB) to check for any previous criminal convictions.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "GP Care Uk Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130255"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Swindon &amp; Gloucestershire", "postalCode": "SN1 1TN"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5621", "longitude": "-1.7822"}}, "title": "Healthcare Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246762", "validThrough": "2020-11-15T23:59:59+0000"}