{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 pa"}}, "datePosted": "2020-11-03T11:46:42+0000", "description": "&lt;p&gt;We have a great opportunity to a recruit three Band 6 acute Occupational Therapists to work within the acute teams at Bedford hospital. Working as part of a newly developed band 6 rotation which includes Acute Frailty, speciality medicine, acute dementia care; respiratory, endocrinology, cardiology, and A&amp;E front door work, it may also include in the future community beds and rehab beds.&lt;/p&gt;\n&lt;p&gt;You will be providing care to a diverse community providing quality OT assessments and OT recommendations of function based on individual needs.&lt;/p&gt;\n&lt;p&gt;Provision of early assessment in order to facilitate a safe discharge. Signposting onto other agencies liaising with families. Using your coaching and counselling skills to negotiate ways of engagement for patients who are reluctant.&lt;/p&gt;\n&lt;p&gt;You will be working with multiple disciplines and be able to gain a vast knowledge base from the skill that is present here at Bedford. You will be providing a quality educational environment for OT students and supervising some junior staff. You will be using the structure KSF and probation competency pack in order to ensure all staff are providing safe and efficient ways of working.&lt;/p&gt;\n&lt;p&gt;What about the department I will Join?&lt;/p&gt;\n&lt;p&gt;The department is a cohesive group of hardworking OT’s all striving to make a difference to the lives of the people who have to come into hospital.&lt;/p&gt;\n&lt;p&gt;There is a strong band 5 support and band 6 peer groups. It has a family feel and has many social gatherings. (Covid allowing)&lt;/p&gt;\n&lt;p&gt;The department prides itself on its supervision support preceptorship program and structure.&lt;/p&gt;\n&lt;p&gt;We are committed to student placements.&lt;/p&gt;\n&lt;p&gt;There is a huge level of skill knowledge and expertise within the teams which is shared in the form of in-service training.&lt;/p&gt;\n&lt;p&gt;The department is evolving with the ‘modern District general’ and we have been successful in putting OT at the forefront of A&amp;E for assessment. We have merged with the Luton and Dunstable which will give us even more opportunity for enrichment and growth.&lt;/p&gt;\n&lt;p&gt;So if you are interested and have the skills we are looking for to join our supportive and forward thinking dynamic team, but the advertised hours don’t work for you, then please do not hesitate to contact the OT Manager Lorna Courtney 01234 792120 to discuss possible options, you just never know, you may have missed out on your perfect job because you didn’t ask..&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Lorna CourtneyJob title Occupational Therapy manager Email address lorna.courtney@bedfordhospital.nhs.uk Telephone number 01234 355122 ext 2037&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120819.jpg", "name": "Bedfordshire Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120819"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bedford Hospital South Wing, Bedford", "postalCode": "MK42 9DJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1289", "longitude": "-.471708"}}, "title": "Band 6 Senior Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253808", "validThrough": "2020-11-13T23:59:59+0000"}