{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 £82,096.00- £110,683.00 pa"}}, "datePosted": "2020-10-30T08:16:04+0000", "description": "&lt;p&gt;&lt;strong&gt;The James Paget University Hospitals NHS Foundation Trust (JPUH) is seeking to appoint a Consultant in Dermatology. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The post holder will have responsibility for providing a Dermatology service in conjunction with consultant colleagues. This is a permanent post 1.0 WTE covering 10 PA’s based at the James Paget University Hospital covering 5 days per week Monday to Friday. There will be no on-call commitments. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The James Paget University Hospitals NHS Foundation Trust (JPUH) provides medical services for a population of approximately 230,000 living in South East Norfolk and North East Suffolk, plus a large number of visitors to the coast and Broads National Park during the summer months. In addition, it provides approximately a third of the secondary care teaching for the new UEA Medical School. The Trust has foundation status and is highly regarded within the region.&lt;/p&gt;\n&lt;p&gt;The JPUH have been given an overall rating of “Good,” following the Care Quality Commission (CQC) inspection which took place in August 2019. This places us in the top 30% of acute trusts in the country. The Trust came out top in the East of England region on the 2016 GMC trainees’ survey results, reflecting our commitment to providing a high quality training environment and looking after our trainees as valued colleagues.&lt;/p&gt;\n&lt;p&gt;The Hospital is situated in a mainly rural area in one of the most open, picturesque, safe and unspoilt parts of the country, offering a range of inexpensive properties, good schools, easy access to the coast and an abundance of outdoor, sporting and recreational activities. The post will appeal to candidates who seek a high quality of life combined with a practical clinical role within a secure and well-run hospital distinguished by its supportive and friendly culture.&lt;/p&gt;\n&lt;p&gt;The position provides an excellent opportunity for a suitably qualified specialist to actively contribute to the further development of a modern Dermatology service within this highly regarded Trust with its wide range of acute and community services, which will afford high professional visibility.&lt;/p&gt;\n&lt;p&gt;The Department of Dermatology is an integrated out patient, day-patient, unit with specialist dermatology nursing staff. It serves residents across Great Yarmouth, Lowestoft and Waveney, as well as the many visitors who come to this part of East Anglia. The new department opened in January 2003. Our department consists of 4 consultation/examination rooms, 3 minor surgery rooms, and 2 nurse treatment rooms. A light treatment Unit and facilities for patch and skin prick testing.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Services provided:&lt;/p&gt;\n&lt;p&gt;Minor surgery&lt;/p&gt;\n&lt;p&gt;PUVA, TLO1 Therapy, Photodynamic Therapy&lt;/p&gt;\n&lt;p&gt;Patch and prick testing&lt;/p&gt;\n&lt;p&gt;Paediatric Clinics&lt;/p&gt;\n&lt;p&gt;General Dermatology clinics&lt;/p&gt;\n&lt;p&gt;Nurse led specialist clinics:&lt;/p&gt;\n&lt;p&gt;Roaccutane&lt;/p&gt;\n&lt;p&gt;Leg ulcer&lt;/p&gt;\n&lt;p&gt;Cryotherapy&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We have close links with other hospital specialities including Plastic surgery, Ophthalmology and Oculo-plastics, Paediatrics, Rheumatology and Genito-urinary medicine.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;General dermatology outreach outpatient clinics are also held at Beccles Hospital.&lt;/p&gt;\n&lt;p&gt;We work closely with The NNUH in the management of Skin cancer via a weekly&lt;/p&gt;\n&lt;p&gt;SSMDT meeting.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are supported by a small but very efficient Medical/Clinical photography team.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For an informal discussion or visit please contact: Dr Ingrid Salvary, Clinical Lead Consultant Dermatologist, 01493 452313 (direct line to secretary). For further information about the James Paget University Hospitals NHS Foundation Trust please view our web site - work for us.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Candidates wishing for further information may contact Dr I Salvary, Lead Clinician, Dermatology on 01493 452613 (PA, direct line).&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121320.jpg", "name": "James Paget University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121320"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "James Paget Hospital, Great Yarmouth", "postalCode": "NR31 6LA"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5617", "longitude": "1.718"}}, "title": "177-MDEMER-Consultant Dermatologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249330", "validThrough": "2020-11-26T23:59:59+0000"}