{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "28495", "minValue": "26519", "unitText": "YEAR", "value": "£26519.35 to £28495.66 + 0LW per annum pro rata"}}, "datePosted": "2020-11-04T11:04:52+0000", "description": "&lt;p&gt;Why should you join Change Grow Live? ….Because you can help make a difference! At Change Grow Live we have an underpinning ethos that both celebrates success in harm reduction &amp; engagement along with the passionate belief that recovery from addiction can be self-defined and contagious. We believe that a drug &amp; alcohol free lifestyle can be within the reaches of any individual, irrespective of their circumstances.&lt;/p&gt;\n&lt;p&gt;We are looking for an enthusiastic and motivated Advanced Nurse Practitioner, who is able to independently prescribe, to join our existing friendly and hardworking clinical team of Doctors, Nurses and HCA’s. We currently practice with over 3000 patients per year, and have been rated as ‘Excellent’ overall by the CQC, with Excellent in ‘Well Led’ and ‘Caring’.&lt;/p&gt;\n&lt;p&gt;The ANP post is an innovative role which utilises advanced physical assessment alongside mental health nursing skills and prescribing to address the complex needs of this patient group.&lt;/p&gt;\n&lt;p&gt;The successful applicant will be required to lead a clinical team, make clinical decisions, prescribe independently, assess, diagnose and treat patients, many of whom with acute and long term conditions, and have an appropriate current NMC registration.&lt;/p&gt;\n&lt;p&gt;We promote learning and development to actively support your progression, with a combination of workshops, specialist courses, and e-learning.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/132514.png", "name": "change, grow, live (CGL)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132514"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Edgware (London)", "postalCode": "HA8 0AD"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6058", "longitude": "-.271851"}}, "title": "Senior Practitioner (GP Shared Care &amp; Pharmacy Lead)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255536", "validThrough": "2020-11-29T23:59:59+0000"}