{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51393", "minValue": "45780", "unitText": "YEAR", "value": "£45,780 - £51,393 pa inc"}}, "datePosted": "2020-10-23T08:16:46+0100", "description": "&lt;p&gt;The Royal Marsden Hospital NHS Foundation Trust is a tertiary centre for cancer treatment and together with the Institute of Cancer Research forms the largest comprehensive cancer centre in Europe. The Department of Physics provides clinical services to the Trust and undertakes extensive basic and translational research.&lt;/p&gt;\n&lt;p&gt;We are seeking an enthusiastic and versatile physicist for this band 7 post in the Diagnostic Radiology Physics Group. The Group consists of seven scientists and is based at the Chelsea site, enjoying a pleasant working environment and good facilities. It provides medical physics expert and radiation protection services to The Royal Marsden and other Trusts.&lt;/p&gt;\n&lt;p&gt;The post holder will provide specialist radiological imaging knowledge to clinical researchers and support local radiation experts in the approval of clinical research studies. The post holder will also support scientific and clinical research and development of x-ray imaging techniques. We welcome applications from physicists who are state registered or are working towards state registration, have appropriate experience in diagnostic radiology physics and are conversant with radiological imaging techniques using ionising radiation. We will support physicists who are not state-registered in completing their clinical training.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Elly Castellano, Head of Radiological Physics Group, elly.castellano@rmh.nhs.uk,020 7811 8083&lt;/p&gt;\n&lt;p&gt;Ed McDonagh, Head of Scientific Computing, 020 7808 2512 or ed.mcdonagh@rmh.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "The Royal Marsden NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123033"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Royal Marsden Hospital, Cheslea", "postalCode": "SW3 6JJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4909", "longitude": "-.172788"}}, "title": "Research Imaging Physicist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916239659", "validThrough": "2020-11-23T23:59:59+0000"}