{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "24,907 - 30,615"}}, "datePosted": "2020-10-23T12:31:02+0100", "description": "&lt;p&gt;Due to continued expansion of our company, an exciting opportunity has arisen for Junior Musculoskeletal Physiotherapists in the Suffolk area who is keen develop their career in musculoskeletal physiotherapy. We are looking for permanent, full time staff. Students graduating are welcome to apply.&lt;/p&gt;\n&lt;p&gt;Why should you apply?&lt;/p&gt;\n&lt;p&gt;• Enrolment onto our band 5 development programme&lt;/p&gt;\n&lt;p&gt;• Structured and advanced In-service training program for Band 5 staff and inclusion into our general In-service programme also.&lt;/p&gt;\n&lt;p&gt;• Regular formal/Informal one to ones to help you achieve your goals and aspirations within Physiotherapy.&lt;/p&gt;\n&lt;p&gt;• We run a ‘Clinical Monthly’ (monthly education and research review), journal club and daily problem solving sessions with Lead physiotherapists, Clinical specialists and Spinal ESP’s to name just a few.&lt;/p&gt;\n&lt;p&gt;• Regular and often prestigious courses run by world leading professionals are commissioned and subsidised by AHP Suffolk for our staff to attend.&lt;/p&gt;\n&lt;p&gt;• Opportunities for further education with regional Universities including UEA, Essex and Hertfordshire.&lt;/p&gt;\n&lt;p&gt;• To provide Physiotherapy assessment and treatments in Clinics, Health Centres, GP Surgeries and Community Hospitals&lt;/p&gt;\n&lt;p&gt;• To assess, plan, implement and evaluate physiotherapeutic interventions and maintain own records as an autonomous practitioner&lt;/p&gt;\n&lt;p&gt;• To be responsible for organising and managing a defined caseload of patients using evidence-based, patient-centred principles&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Allied Health Professionals (AHP) Suffolk CIC", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126114"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Riverside, Ipswich", "postalCode": "IP3 0AZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.0446", "longitude": "1.16513"}}, "title": "Junior Physiotherapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240534", "validThrough": "2020-11-06T23:59:59+0000"}