{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "31608", "minValue": "5000", "unitText": "YEAR", "value": "£31,608 PLUS £5,000 Welcome Bonus"}}, "datePosted": "2020-10-14T10:25:07+0100", "description": "&lt;p&gt;WE ARE LOOKING FOR TALENTED PEOPLE LIKE YOU!!&lt;/p&gt;\n&lt;p&gt;Knowing that you’re making a difference to people’s lives is rewarding in itself. But our many roles offer much more than that. As well as helping you grow and develop your talent, we want you to feel proud of where you work and what you do.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Job Advert Location Description&lt;/p&gt;\n&lt;p&gt;Mildmay Oaks is a low secure and locked rehabilitation service for men with learning disability and autism spectrum disorder, and for women with learning disability.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Job Advert Role Description&lt;/p&gt;\n&lt;p&gt;We are currently looking for enthusiastic staff to join our growing team, you will be required to;&lt;/p&gt;\n&lt;p&gt;• Provide a high standard of care to people with mental illness and personality disorder&lt;/p&gt;\n&lt;p&gt;• Develop therapeutic relationships to optimise patient engagement&lt;/p&gt;\n&lt;p&gt;• Follow all codes of conduct, standards and legislation, respecting the rights of others and promoting ethical practice&lt;/p&gt;\n&lt;p&gt;• Contribute to patient assessments, compiling a plan of care alongside the individual, and monitoring patient progress&lt;/p&gt;\n&lt;p&gt;• At a more senior level, you’ll also need to lead shifts as well as mentoring and supporting student nurses and other members of the team&lt;/p&gt;\n&lt;p&gt;Qualifications/Experience:&lt;/p&gt;\n&lt;p&gt;• A relevant nursing qualification and registration – RMN&lt;/p&gt;\n&lt;p&gt;• Excellent team working skills, a high level of self-motivation and a flexible approach - our units operate 24 hours 7 days a week, and our nursing staff work shift patterns including weekends, bank holidays and nights.&lt;/p&gt;\n&lt;p&gt;• A commitment to patient-centred care and to values-based and evidence-based practice&lt;/p&gt;\n&lt;p&gt;• The drive to continually push your own personal learning and development.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;In return for your expertise and hard work, we offer a wide range of benefits including:&lt;/p&gt;\n&lt;p&gt;• Competitive salary&lt;/p&gt;\n&lt;p&gt;• 25 days’ annual leave plus 8 bank holidays increasing to 30 days plus bank holidays with length of service&lt;/p&gt;\n&lt;p&gt;• Extra Service Annual leave awards&lt;/p&gt;\n&lt;p&gt;• Career development – progress across the Staff Nurse grading is via a distinct career path&lt;/p&gt;\n&lt;p&gt;• A contributory pension scheme&lt;/p&gt;\n&lt;p&gt;• An employee assistance programme&lt;/p&gt;\n&lt;p&gt;• Free meals/refreshments when on duty&lt;/p&gt;\n&lt;p&gt;• Free car parking&lt;/p&gt;\n&lt;p&gt;• Sign on bonus&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;£1000 on joining&lt;/p&gt;\n&lt;p&gt;£1000 after 6m probation&lt;/p&gt;\n&lt;p&gt;£1000 after 1 year service&lt;/p&gt;\n&lt;p&gt;£1000 after 2 years’ service&lt;/p&gt;\n&lt;p&gt;£1000 after 3 years’ service&lt;/p&gt;\n&lt;p&gt;Total = £5000 over 3 years&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;• £1,500 e-voucher code for The Priory Benefits portal to be redeemed on various items including discounted shopping, red letter days, gym membership etc&lt;/p&gt;\n&lt;p&gt;• Relocation support (including payment for accommodation or moving costs), paid as a lump sum&lt;/p&gt;\n&lt;p&gt;• Moving less than 100 miles up to £2,000&lt;/p&gt;\n&lt;p&gt;• If more than 100 miles up to £4,000&lt;/p&gt;\n&lt;p&gt;• To be repaid if individual does not complete probation &amp; leaves&lt;/p&gt;\n&lt;p&gt;• Payment into the pension scheme&lt;/p&gt;\n&lt;p&gt;• CPD top up&lt;/p&gt;\n&lt;p&gt;• Donation to a charity of their choice&lt;/p&gt;\n&lt;p&gt;Division DBS info&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About us&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;From education to hospitals, care homes and secure facilities, the Priory Group of Companies offers individually tailored, multidisciplinary treatment programmes for those with complex educational needs or requiring acute, long-term and respite mental healthcare.&lt;/p&gt;\n&lt;p&gt;The integrated strength of each service provides a seamless transition for the individual as they progress between higher and lower dependency care and across services. This unique approach ensures that every individual has the opportunity to achieve the best possible outcomes and quality of life with the Priory Group.&lt;/p&gt;\n&lt;p&gt;As 85% of our services are publicly funded and delivered in partnership with commissioners, our teams work with commissioning bodies across the country to provide transparent pricing models and evidence-based care programmes.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Disclosure&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;All roles will be subject to a successful disclosure at an appropriate level from the Disclosure and Barring Service (DBS), Access NI or Disclosure Scotland. We are an equal opportunities employer.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Priory Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133434"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hook, Hampshire", "postalCode": "RG27 8BS"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2921", "longitude": "-.912542"}}, "title": "Registered Mental Health Nurse (RMN) WITH £5k Welcome Bonus", "url": "https://www.jobs.nhs.uk/xi/vacancy/916225702", "validThrough": "2020-11-13T23:59:59+0000"}