{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62001", "minValue": "53168", "unitText": "YEAR", "value": "£53,168 - £62,001 pa pro rata"}}, "datePosted": "2020-11-06T14:01:00+0000", "description": "&lt;p&gt;An exciting opportunity for a 12-month fixed term contract, has arisen for an exceptional and enthusiastic Band 8b Principle Clinical Psychologist, to play a lead clinical role in the delivery of the National Strengthening Families, Protecting Children project, across Peterborough City Council and Cambridgeshire County Council. The successful candidate will be working either with the team in Peterborough or in the Cambridgeshire area.&lt;/p&gt;\n&lt;p&gt;The Family Safeguarding Model of delivery is a national project transforming the way in which families are worked with holistically by services. You will form an essential part of this project and work with the adults providing care to children in the home, specifically around their mental health needs. This is a national project as part of the Department for Education Innovation fund expected to be delivered to 10% of all Local Authority services by 2024. This is an exciting time to be part of the national transformation of services.&lt;/p&gt;\n&lt;p&gt;The Strengthening Families, Protecting Children - Family Safeguarding approach improves outcomes for vulnerable children and young people. Initially developed in Hertfordshire, the model has resulted in significantly better outcomes for some of the most vulnerable and at-risk children. Under the Family Safeguarding approach, teams are expanded to include adult practitioners who are experts at supporting parents to address these challenges.&lt;/p&gt;\n&lt;p&gt;We are looking for two experienced Clinical Psychologists to join the multidisciplinary team to provide highly specialist clinical (psychological) supervision, consultation, guidance and advice on evidence-based approaches for parents/adult care givers at point of case allocation and thereafter during treatment and discharge. The role also involves some direct clinical work with parents, although this is not the primary focus of the post.&lt;/p&gt;\n&lt;p&gt;You will work alongside existing services such as the Drug and Alcohol Services, Probation services and Social workers. The team will provide support to partners aligned to the project to establish and maintain effective partnership working to manage risk and improve outcomes in parental mental health and thus for children.&lt;/p&gt;\n&lt;p&gt;As a psychologist within CPFT you will be part of a supportive professional peer group offering a full programme of CPD events and peer supervision opportunities. You will receive peer support also from the Psychologists already based within the other seven local authorities operating within this model of delivery, and work closely across Peterborough and Cambridgeshire authority with the Practice lead around joint service delivery. CPFT Psychologists are actively involved in teaching and examining as part of the Doctoral Programme in Clinical Psychology based at University of East Anglia. CPFT psychologists are actively involved in research with bodies including CLAHRC and Cambridge University.&lt;/p&gt;\n&lt;p&gt;Are you ready to take on the challenge of an exciting new team and help to make a real difference to people’s lives, and want to work in a dynamic and exciting environment? We would welcome applications from Band 8 A &amp; B Psychologists who are excited about delivering services to clients in a model that supports the whole family approach and effects change for those most in need.&lt;/p&gt;\n&lt;p&gt;For further details/informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Louise Brakes -Practice Lead CCC Family safeguarding Mob: 07760474941&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Deborah Hunt- Consultant clinical &amp; Forensic Psychiatrist and Directorate lead for Psychology CPFT Mob: 07538449514&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Louise Brakes -Practice Lead CCC Family safeguarding Mob: 07760474941&lt;/p&gt;\n&lt;p&gt;Deborah Hunt- Consultant clinical &amp; Forensic Psychiatrist and Directorate lead for Psychology CPFT Mob: 07538449514&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121760.JPG", "name": "Cambridgeshire and Peterborough NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121760"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Cambridge and Peterborough", "postalCode": "CB3 0AT"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.2141", "longitude": ".111191"}}, "title": "Principle Clinical Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916260020", "validThrough": "2020-11-22T23:59:59+0000"}