{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44780", "minValue": "37638", "unitText": "YEAR", "value": "£37,638 - £44,780 per annum inc. HCAS"}}, "datePosted": "2020-11-03T10:16:49+0000", "description": "&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Claims and Inquests Manager&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;An opportunity has arisen for a highly motivated, competent and dependable Claims and Inquest Manager to join our busy Legal Services Department at Chelsea and Westminster Hospital NHS Foundation Trust.&lt;/p&gt;\n&lt;p&gt;We are looking for an individual who works to high personal and professional standards, paying attention to detail. Ideally you will be someone who responds well to a fast-paced environment and who can readily adapt to changing work priorities with the ability to multi-task, whilst at the same time remaining calm and professional.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be responsible for their own caseload including clinical negligence claims, employer and public liability claims, Coronial matters and Police and Local Authorities&#39; requests, performing a variety of investigative and reporting duties.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;JOB SUMMARY:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Claims and Inquest Manager will work within the Legal Services Department and be responsible for the day-to-day management of claims against the Trust. Based predominately at the Chelsea and Westminster Hospital, the post holder will be occasionally required to work at the West Middlesex University Hospital and travel to Court and external stakeholders’ offices. The Trust provides a staff shuttle bus to travel between the two sites as needed.&lt;/p&gt;\n&lt;p&gt;The post holder will be required to manage Coronial matters that are allocated by the Head of Legal Services, by liaising with the Trust clinicians, the Coroner’s Officers, other Interested Persons and external solicitors if instructed. The Claims and Inquest Manager will responsible for complying with disclosure requests and obtaining witness statements.&lt;/p&gt;\n&lt;p&gt;The Claims and Inquest Manager will work closely with NHS Resolution, panel firms, patients or their representatives and Trust employees of all levels.&lt;/p&gt;\n&lt;p&gt;The successful candidate will:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Have sound demonstrable experience in working in a busy legal office;&lt;/li&gt;\n&lt;li&gt;Be computer literate (including Word, Excel and PowerPoint) and have experience of working with and maintaining detailed databases;&lt;/li&gt;\n&lt;li&gt;Have strong organisational and time-management skills;&lt;/li&gt;\n&lt;li&gt;Display a can-do attitude;&lt;/li&gt;\n&lt;li&gt;Have excellent communication skills.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The post holder will be expected to work as part of a team and be able to use their own initiative. Some degree of flexibility will be required in order to meet deadlines and provide cross-cover.&lt;/p&gt;\n&lt;p&gt;If you would like to have an informal discussion about the role, please contact:&lt;/p&gt;\n&lt;p&gt;Marianna Kutyreva&lt;/p&gt;\n&lt;p&gt;Head of Legal (Trust Solicitor)&lt;/p&gt;\n&lt;p&gt;Marianna.Kutyreva@chelwest.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121244.png", "name": "Chelsea and Westminster Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121244"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Chelsea and Westminster Hospital, SW10 0XD", "postalCode": "SW10 9NH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4843", "longitude": "-.181435"}}, "title": "Claims and Inquests Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253405", "validThrough": "2020-11-16T23:59:59+0000"}