{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum, pro rata"}}, "datePosted": "2020-10-29T17:15:29+0000", "description": "&lt;p&gt;&lt;strong&gt;Podiatrist - Band 6 &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Could you be the right person for our Band 6 Podiatry post?&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for an experienced Podiatrist to join the Somerset Partnership Podiatry Team. We are looking for a Band 6 Podiatrist with at least two years post grad experience.&lt;/p&gt;\n&lt;p&gt;The post requires a degree in Podiatry and for you to be registered with the Health Professions Council, alongside experience in Diabetes and Wound Care and a keen interest in Biomechanics. You will be part of a highly motivated and compassionate countywide team, working independently in both community and acute settings. The post is based Countywide.&lt;/p&gt;\n&lt;p&gt;We are looking for an experienced, enthusiastic and dedicated professional, with excellent leadership skills. You will join a friendly, highly experienced team, delivering quality patient centred care to the population of Somerset. This includes the assessment, development, implementation and review/discharge of treatment plans and health education. You will need to demonstrate an in-depth knowledge of Diabetes, Wound Care and Biomechanics.&lt;/p&gt;\n&lt;p&gt;You will need to demonstrate an understanding of the changes that the NHS is undergoing and have a clear understanding of the role of the Podiatry service within this.&lt;/p&gt;\n&lt;p&gt;Somerset NHS Foundation Trust offers a great benefits package including 27 days annual leave (pro rata) and a competitive pension scheme. The Podiatry service is a forward thinking dynamic service with a number of active on-going projects such as clinical pathway auditing and the development of a robust clinical support programme.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be supported by a team of dedicated professionals, with access to CPD time, regular supervision, development and support and regular team meetings.&lt;/p&gt;\n&lt;p&gt;Positions available:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Fixed term (12 months Maternity Cover) - 2x 22.5 hours and 1x18.75 hours&lt;/li&gt;\n&lt;li&gt;Permanent - 1x 20 hours and 1x 30 hours&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We look forward to receiving your application. Previous applicants need not apply.&lt;/p&gt;\n&lt;p&gt;For further details contact:&lt;/p&gt;\n&lt;p&gt;Joe Quinn, Clinical Specialist Podiatrist&lt;/p&gt;\n&lt;p&gt;joseph.quinn@somersetft.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Somerset NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121360"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "TA6 4GU", "postalCode": "TA6 4RN"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.1479", "longitude": "-2.99453"}}, "title": "Podiatrist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249220", "validThrough": "2020-11-15T23:59:59+0000"}