{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365-£37,890"}}, "datePosted": "2020-11-05T10:16:44+0000", "description": "&lt;p&gt;We are looking for a driven and enthusiastic Band 6 Specialised Musculoskeletal (MSK) Physiotherapist to join our team and take advantage of the fantastic developmental opportunities on offer.&lt;/p&gt;\n&lt;p&gt;The successful candidate will work in an outpatient physiotherapy clinic assessing, diagnosing and treating a variety of MSKl disorders from a range of sources including GP, orthopaedic and self-referrals.&lt;/p&gt;\n&lt;p&gt;The post holder will have the opportunity to be based at either St. Richard’s Hospital in Chichester or Bognor Regis War Memorial Hospital, with the addition of working at various satellite clinics throughout the area.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This position offers:&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Development&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Daily opportunities for peer leaning working alongside Band 8as, 7s and experienced Band 6s in clinic&lt;/li&gt;\n&lt;li&gt;Monthly one-to-one supervision sessions to guide personal and professional development&lt;/li&gt;\n&lt;li&gt;Monthly departmental teaching sessions and journal clubs&lt;/li&gt;\n&lt;li&gt;Opportunities for development in specialised rotations including Hand Therapy and Rheumatology&lt;/li&gt;\n&lt;li&gt;Capacity to participate in service-wide development projects&lt;/li&gt;\n&lt;li&gt;Scope to frequently work alongside Advanced Physiotherapy Practitioners from the neighbouring Musculoskeletal Assessment and Triage Team (MATT) - this presents a rare opportunity for outpatient physiotherapists to directly access a wealth of knowledge and experience on a regular basis and provides a fantastic platform for clinical development&lt;/li&gt;\n&lt;li&gt;Collaboration with consultant-led Chronic Pain and Rheumatology services&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Variety and flexibility&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Opportunity to rotate between multiple geographical sites including GP practices, satellite clinics and outpatient departments within both St. Richard’s Hospital and Bognor Regis War Memorial Hospital&lt;/li&gt;\n&lt;li&gt;Access to excellent gym and hydrotherapy pool-based exercise rehabilitation facilities&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;West Sussex is an area of natural beauty surrounded by the South Downs National Park and bordered by the beautiful south coastline, highlighted by the Witterings beach. This location is perfect for someone who enjoys the outdoors, and it also has strong transport links to Brighton, London, Southampton and Portsmouth.&lt;/p&gt;\n&lt;p&gt;Who we are looking for:&lt;/p&gt;\n&lt;p&gt;A team member who has the ambition to develop their clinical skills and a desire to deliver compassionate care to the patients within our community.&lt;/p&gt;\n&lt;p&gt;0.5 WTE of this role will be recruited on a permanent basis and there is an additional 0.5 WTE available for a one year fixed term contract.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Joanna Lawrence-Physiotherapy Operational Lead&lt;/p&gt;\n&lt;p&gt;Joanna.lawrence1@nhs.net&lt;/p&gt;\n&lt;p&gt;01243 623548&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Sussex Community NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120877"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St. Richard&#39;s Hospital, Chichester", "postalCode": "PO19 6SE"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8436", "longitude": "-.768008"}}, "title": "Specialised Musculoskeletal Physiotherapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257202", "validThrough": "2020-11-15T23:59:59+0000"}