{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pa pro rata"}}, "datePosted": "2020-10-23T10:01:50+0100", "description": "&lt;p&gt;&lt;strong&gt;Community Nursing online information event&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Thursday 12 November 3-4pm, MS Teams&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Interviews for the Community Registered Nurse role will take place at a later date&lt;/p&gt;\n&lt;p&gt;If you have wondered whether Community Nursing was right for you then apply to join our Community Nursing information event. Find answers to all your questions, whether you are a &lt;strong&gt;Registered Nurse, Student Nurse (qualifying in 2020 or 2021) or Nurse&lt;/strong&gt; &lt;strong&gt;returning to practice&lt;/strong&gt;. You can:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Hear from our team about the role of a Community Registered Nurse in both an urban and rural setting;&lt;/li&gt;\n&lt;li&gt;learn about the support and training we offer including our 2-year Preceptorship programme and clinical skills educators;&lt;/li&gt;\n&lt;li&gt;find out how your career will develop as part of the Community Nursing Team.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The event will take place on Thursday 12 November from 3-4pm via MS Teams. You can ask questions and we will answer them live.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;How to book&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you would like to attend the &lt;strong&gt;event and apply&lt;/strong&gt; for a Community Registered Nurse role, please click the green ‘Apply for this job’ button.&lt;/p&gt;\n&lt;p&gt;If you would prefer to attend the&lt;strong&gt; online event&lt;/strong&gt; first and apply later, then please book your place in advance via email&lt;strong&gt;, Emily.reid11@nhs.net&lt;/strong&gt; or telephone, &lt;strong&gt;01423 554429&lt;/strong&gt;.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;More about the role of a Community Registered Nurse&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As part of our Adult Community Service you will be working within one of our Community Teams. We collaborate with a range of professionals as part of the exciting and newly formed Harrogate and Rural Alliance. Our service runs every day of the year and we are able to offer flexible shift patterns which accommodate working both day and evenings.&lt;/p&gt;\n&lt;p&gt;Reported as ‘outstanding’ in our last CQC inspection we are proud to be able to offer high quality and innovative care to the people of Harrogate and Rural area, in the comfort of their own homes. This is a role where no too days are the same and we provide this service in the stunning surroundings of Harrogate and the North Yorkshire countryside. We have a supportive and dynamic management team who truly value staff wellbeing and development.&lt;/p&gt;\n&lt;p&gt;We are proud to offer our Community Nurses:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A full induction and training package&lt;/li&gt;\n&lt;li&gt;Access to our fantastic 2-year Preceptorship Programme for Nurses in their first two years post qualification.&lt;/li&gt;\n&lt;li&gt;A supportive learning environment with access to our community based Clinical Skills Educators&lt;/li&gt;\n&lt;li&gt;First Line Leaders programme to help develop your leadership skills&lt;/li&gt;\n&lt;li&gt;Support and guidance with revalidation&lt;/li&gt;\n&lt;li&gt;The technology required to support with agile working&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;At Harrogate and District NHS Foundation Trust we provide ‘outstanding’ care to both our patients and our staff. We support staff through benefits, health and wellbeing initiatives and opportunities for personal and professional development.&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;An inclusive and supportive culture – our Trust encourages staff to bring their whole selves to work and active Staff Networks identify areas for improvement.&lt;/li&gt;\n&lt;li&gt;Staff Recognition - as well as regular appraisals, we recognise staff with our Making a Difference and Team of the Month Awards plus the Christmas Oscars.&lt;/li&gt;\n&lt;li&gt;Employee Support and wellbeing - we have a comprehensive Employee Assistance Programme, counselling service and fast track physiotherapy service for employees.&lt;/li&gt;\n&lt;li&gt;Staff Benefits - We have a range of staff benefits and schemes to support staff health, engagement, wellbeing and inclusion.&lt;/li&gt;\n&lt;li&gt;Harrogate is consistently voted the happiest place to live in the UK, with a vibrant local music, arts and foodie scene. Beautiful natural spaces, sports facilities, great shopping and high performing schools make this a great location to settle down in.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;To keep up to date with all of our latest Recruitment activity here at Harrogate and District NHS Foundation Trust follow us on Facebook: ‘Team HDFT jobs – Harrogate and District NHS Foundation Trust’ and Twitter: @HDFT_Careers.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We welcome enquiries about this role before or during your application process. If you would like to find out more then please feel free to contact Kaye Atkinson- Tench 07919493231 kaye.atkinson-tench@nhs.net or Gail Beaumont 07919493271 Gail.beaumont@nhs.net&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Community Staff Nurse Harrogate&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours: &lt;/strong&gt;full and part time positions &lt;strong&gt;Band: &lt;/strong&gt;5 &lt;strong&gt;Salary: &lt;/strong&gt;£24,907 to £30,615 pa&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Essential Requirements: NMC Registration&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Gail Beaumont Email address: Gail.beaumont@nhs.net Telephone number: 07919493271&lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;Email: Emily Reid emily.reid11@nhs.net Number: 01423 554429&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Harrogate and District NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120853"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Harrogate District Hospital, Harrogate", "postalCode": "HG2 7SX"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.993", "longitude": "-1.51812"}}, "title": "Community Registered Nurse - Online Information Event", "url": "https://www.jobs.nhs.uk/xi/vacancy/916239940", "validThrough": "2020-11-26T23:59:59+0000"}