{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pa"}}, "datePosted": "2020-10-28T11:31:03+0000", "description": "&lt;p&gt;&lt;span&gt;Year 3 Student Radiographers hoping to qualify summer 2021 are welcome and encouraged to apply for this post.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;The Royal Cornwall Hospital NHS Trust (RCHT) is the main acute healthcare provider for the population of Cornwall and the Isles of Scilly, providing a full range of services accessed by more than 600,000 people a year. The Clinical Imaging Service is county wide, offering patients high quality diagnostics in their local community hospital or specialist services at the Royal Cornwall Hospital, St Michaels Hospital and West Cornwall Hospital.&lt;/p&gt;\n&lt;p&gt;Please take a moment to view this link and see the opportunities in Clinical Imaging: youtube.com/watch?v=9idN9cvivdk&lt;/p&gt;\n&lt;p&gt;We are looking for a motivated and dynamic Radiographer with good communication skills and a highly developed sense of patient care to join our award winning, friendly and progressive Trauma Acute &amp; General X Ray Team. It is an exciting opportunity to join us here at RCHT as the X-ray rooms within the Royal Cornwall Hospital have recently been replaced with new state of the art digital DR equipment.&lt;/p&gt;\n&lt;p&gt;You will have the opportunity to undertake a wide range and variety of examinations and to develop existing skills within a friendly supportive and fully staffed multidisciplinary team. The department offers a good rotation through general radiography, trauma radiography, mobile &amp; theatre imaging and fluoroscopy.&lt;/p&gt;\n&lt;p&gt;The imaging department currently takes student radiographers from both Plymouth and Exeter Universities, and is a training site for Radiologists. We also have Apprentice Radiographers, Assistant Practitioners, Advanced Practitioners (including Reporting Radiographers), and Consultant Radiographers in post and are committed to developing the knowledge and skills of our workforce.&lt;/p&gt;\n&lt;p&gt;Since the department provides a 24 hour service, there will be a requirement to participate in the weekend, extended working day and out of hours work rotas.&lt;/p&gt;\n&lt;p&gt;This is a full-time post working 37.5 hours per week, however part time requests will be considered.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Patrick McDermott, Team Lead Trauma, Acute and General radiography&lt;/p&gt;\n&lt;p&gt;01872 253178 - email address patrickmcdermott@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120920.jpg", "name": "Royal Cornwall Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120920"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Truro", "postalCode": "TR1 3LJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.2667", "longitude": "-5.0915"}}, "title": "Practitioner Radiographer - TAG", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246341", "validThrough": "2020-11-10T23:59:59+0000"}