{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 - £19,337 £18,005-£19,337 PA Pro Rata"}}, "datePosted": "2020-11-04T10:01:19+0000", "description": "&lt;p&gt;Dermatology/Plastic Surgery Job Advert&lt;/p&gt;\n&lt;p&gt;The Dermatology department at the University Hospital of North Midlands provides a dedicated service to Dermatology and Plastic surgery patients both at Royal Stoke and County Hospital. An exciting opportunity has arisen for a part time Nursing Assistant to join our team.&lt;/p&gt;\n&lt;p&gt;The Dermatology Department moved into a new state of the art facility in 2012 at the Royal Stoke University Hospital and provides out-patient care to the people of North Staffordshire and surrounding areas.&lt;/p&gt;\n&lt;p&gt;In 2017 we built a new state of the art Skin unit at County Hospital to provide out-patient care to both Dermatology and Plastic surgery patients within the same regional areas.&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity to join our current team to support County Hospital however you may be required to cover both sites.&lt;/p&gt;\n&lt;p&gt;The University Hospital of North Midlands NHS Trust is one of the largest Hospital Trusts in the country. Its 10,000 workforce provide a full range of emergency treatment, planned operations and medical care from the two hospitals in Stafford and Stoke on Trent.&lt;/p&gt;\n&lt;p&gt;Both the Royal Stoke University Hospital in Stoke and the County Hospital in Stafford are going through exciting positive development and change, at the moment.&lt;/p&gt;\n&lt;p&gt;The surgical division prides itself on having dedicated, enthusiastic, highly skilled and quality driven staff; we believe all our wards and departments are welcoming, clean, organised and happy places to work. We have a dedicated education nurse who will support you as you become a member of the team, helping you to complete any competences and will provide you with access to any education sessions and a bespoke surgical division induction programme.&lt;/p&gt;\n&lt;p&gt;Patient safety is our priority and we strive to provide safe and high quality patient care. If you are dynamic and have the passion and drive to achieve excellence in patient care the division look forward to welcoming you.&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Are you interested in becoming a Nursing Assistant and deliver first class patient care?&lt;/li&gt;\n&lt;li&gt;Are you compassionate, reliable, motivated and ready for a challenge?&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;If so, we are looking to recruit a motivated and enthusiastic Nursing Assistant to join our dynamic and friendly team and provide safe and supportive care to patients, relatives and their loved ones. In this post you would be responsible for providing fundamental elements of patient care as directed by the qualified nursing team to ensure our patients receive the highest standard of dignified and respectful care, in accordance with their care plans. We are looking for people who are compassionate and feel passionately about providing a level of care they would wish for their family and friends.&lt;/p&gt;\n&lt;p&gt;These posts are linked to the Career Development Pathway.&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Successful applicants who fulfil the essential qualifications/skills on the person specification/job description will be offered a Band 2 Nursing Assistant substantive post.&lt;/li&gt;\n&lt;li&gt;Successful applicants who do not fulfil the essential qualifications/skills on the person specification will be offered a role as a Nursing Assistant on the Apprentice Pathway (On successful completion of training you will move to Band 2). Both posts will be subject to terms and conditions.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The successful applicant will either be based at Royal Stoke University Hospital or County Hospital, Staffordshire (maybe required to work at either Hospital).&lt;/p&gt;\n&lt;p&gt;The successful candidates on the Apprentice Pathway will be required to complete a training competency package, which involves completion of the Care Certificate and enrolment onto the CQF/NVQ Level 2 qualification in care, of which you will receive 1 day/week study leave and peer mentorship during this period, all whilst being paid a competitive salary. Pay increase to Band 2 is subject to completion of Care Certificate, specific competencies and subject to satisfactory sign off from the Ward manager.&lt;/p&gt;\n&lt;p&gt;Appointments to the post will commence at the lowest salary point, respectively, unless confirmed otherwise by HR Employment Services.&lt;/p&gt;\n&lt;p&gt;Please note that the application process for these posts will close when sufficient applications are received.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;For further details/informal visit contact&lt;/p&gt;\n&lt;p&gt;Senior Sister Alison Crichton 01782 676273.&lt;/p&gt;\n&lt;p&gt;Junior Sister Rachel Sayfritz 01785 257731 Ext 2995.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University Hospitals of North Midlands NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122653"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Both, Staffordshire", "postalCode": "ST4 6QG"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.004", "longitude": "-2.21487"}}, "title": "Nursing Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255284", "validThrough": "2020-11-08T23:59:59+0000"}