{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30815", "minValue": "27416", "unitText": "YEAR", "value": "£27,416 - £30,815"}}, "datePosted": "2020-11-02T12:21:22+0000", "description": "&lt;p&gt;&lt;strong&gt;Senior Staff Nurse – Part Time, 25 hrs&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary: £27,416 - £30,815 per annum, dependant on experience&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;St. Michael’s Hospice, located in Basingstoke, has been providing palliative care services to the local community across North Hampshire since 1992. We are a registered charity dedicated to providing care to people throughout North Hampshire who are affected by life limiting illness to attain the highest possible quality of life by providing a choice of specialist care and support.&lt;/p&gt;\n&lt;p&gt;We have an exciting opportunity for a Senior Staff Nurse to join our Inpatient Unit. To apply, you must be, enthusiastic, flexible, and have a passion for palliative and end of life care, have excellent communication skills and work well as part of a multi-disciplinary team. You will have access to a range of training and development opportunities and be welcomed as a valued member of an experienced and supportive team. Experience of a Senior Staff Nurse role is essential and knowledge of palliative and end of life care is desirable.&lt;/p&gt;\n&lt;p&gt;The successful applicant will be part of a multi-disciplinary team, providing expert and highly specialised palliative and end of life care to patients and families accessing our Inpatient Unit. As an Inpatient Senior Staff Nurse, you will also be part of the wider St. Michael’s Hospice organization, serving and representing the charity and supporting the local community across North Hampshire. For additional information and responsibilities, please refer to the job description.&lt;/p&gt;\n&lt;p&gt;We offer a competitive salary with attractive benefits, including, free parking, life assurance, 27 days annual leave plus bank holidays, and an extensive health and wellbeing plan.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central Advertising - Social Enterprises", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130655"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Basingstoke", "postalCode": "RG24 9NB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.283", "longitude": "-1.11725"}}, "title": "Senior Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252024", "validThrough": "2020-11-30T23:59:59+0000"}