{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "56490", "minValue": "50575", "unitText": "YEAR", "value": "£50,575 - £56,490"}}, "datePosted": "2020-10-30T08:45:23+0000", "description": "&lt;p&gt;&lt;strong&gt;Croydon Health Services NHS Trust&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Children’s Occupational Therapy Service&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Band 8a Children’s Occupational Therapy Clinical Specialist Team Manager&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Social Care Children’s OT Lead: Housing, Home Adaptations &amp; Equipment Lead&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Part time 22.5 hours (0.6 WTE)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen to join the Croydon Children’s Occupational Therapy Service. Our fully integrated Children’s OT team is dynamic, friendly and supportive and consists of 17 Occupational Therapists and Occupational Therapy Technical Instructors who have a wide range of skills and expertise. We have relocated to a modern purpose built Children’s Development Centre (CDC) promoting MDT working and shared working spaces. The service provides an integrated service including Health and Social Services Children’s OT input.&lt;/p&gt;\n&lt;p&gt;The team works closely with colleagues across a wide range of services, including Health, CAMHS, Education, Social Services and voluntary sectors. There is administrative support within the team, support with Continuing Professional Development, peer and management support and regular clinical supervision provided by experienced therapists.&lt;/p&gt;\n&lt;p&gt;We are looking for a dynamic and highly motivated Occupational Therapist who is enthusiastic and forward-thinking to co-manage our well established and innovative Children’s Occupational Therapy Service. In particular, this post will look to manage the Social Care part of the service, leading on Children’s OT input for housing, home adaptations and specialist equipment input, work collaboratively with the other Children’s OT Service lead who manages the Health aspect of the service.&lt;/p&gt;\n&lt;p&gt;The successful candidate will have a strong clinical specialist background in Children’s Occupational Therapy Social Care OT input and proven leadership skills in developing staff and building effective teams. You will have a demonstrable track record of service improvement and organising a service to facilitate the meeting of service targets. You will also have the ability to lead and inspire a team of Children’s Occupational Therapists who work across a variety of clinical settings. The successful candidate will demonstrate excellent communication skills and demonstrate the ability to be creative and flexible, especially during times of change. You will work closely with the Children’s therapy managers for Speech and Language therapy and Physiotherapy to create integrated pathways and protocols as part of an integrated team.&lt;/p&gt;\n&lt;p&gt;The successful candidate will have at least 5 years post graduate Occupational Therapy experience, with a minimum of 2 years at a Band 7 or equivalent level. Postgraduate training in home adaptations and specialist equipment is essential along with significant experience of working with children with complex physical disabilities.&lt;/p&gt;\n&lt;p&gt;The Service has a strong commitment to continuing professional development and evidence based practice, with regular in service training and clinical forums. Support is provided through regular supervision, reflective practice and personal development reviews. Management support will be provided by the Children’s Therapies Lead.&lt;/p&gt;\n&lt;p&gt;Our integrated Health and Social Care Children’s Occupational Therapy team will provide you with an excellent opportunity to broaden your skills and enjoy providing a comprehensive Occupational Therapy service to the children of Croydon, their parents/carers and other professionals.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;ESSENTIAL REQUIREMENTS:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A Diploma/Degree in Occupational Therapy&lt;/li&gt;\n&lt;li&gt;State registration with the Health and Care Professions Council (HCPC)&lt;/li&gt;\n&lt;li&gt;Registration with the Royal College of OTs (RCOT)&lt;/li&gt;\n&lt;li&gt;Experience of working with children in a Social Care Children’s OT role&lt;/li&gt;\n&lt;li&gt;Ability to work and travel around the borough&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Interviews will be held on the 30th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameFaith BrooksJob titleLead for Children&#39;s TherapiesEmail addressfaith.brooks1@nhs.netTelephone number0208 714 2594Additional contact information&lt;/p&gt;\n&lt;p&gt;For further information, please contact Caireen McGlashan, Jo Kavanagh (Children’s OT Clinical Specialist Team Managers) on 0208 274 6854 / 07812 061 381 / 07812 061 621 or Faith Brooks – Children’s Therapies Lead on 0208 714 2594.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120967.PNG", "name": "Croydon Health Services NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120967"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Crystal Children&#39;s Development Centre, Croydon", "postalCode": "CR0 7YD"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.389", "longitude": "-.059824"}}, "title": "Children&#39;s Occupational Therapy Team Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249373", "validThrough": "2020-11-18T23:59:59+0000"}