{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-10-27T13:31:12+0000", "description": "&lt;p&gt;This post is fixed term for 12 months&lt;/p&gt;\n&lt;p&gt;The reason this post is fixed term is due to a temporary response to service needs which are temporarily over and above the service’s permanent establishment&lt;/p&gt;\n&lt;p&gt;INTERNAL APPLICANTS MUST HAVE THEIR CURRENT LINE MANAGER’S APPROVAL TO APPLY FOR THIS POST AS AN INTERNAL SECONDMENT PRIOR TO APPLYING&lt;/p&gt;\n&lt;p&gt;We are looking for an Occupational Therapist to join the St Helens and Knowsley Community Learning Disabilities Team based at Willis House. The team currently consists of two Band 6 Occupational Therapists, one Band 5 OT and one full time Therapy Assistant, and is part of a wider Learning Disabilities Multi Disciplinary Team (LD MDT).&lt;/p&gt;\n&lt;p&gt;Working as part of a busy multidisciplinary team, this role involves:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Managing a clinical caseload of adults with Learning Disabilities and / or complex needs&lt;/li&gt;\n&lt;li&gt;Overseeing all aspects of OT process including assessment, intervention, evaluation and safe discharge from the service&lt;/li&gt;\n&lt;li&gt;Conducting functional assessments and providing therapy programmes / recommendations to maximise occupational performance&lt;/li&gt;\n&lt;li&gt;Assessment for aids / adaptations including specialist seating, posture management, bathing equipment amongst others&lt;/li&gt;\n&lt;li&gt;Environmental assessments&lt;/li&gt;\n&lt;li&gt;Supporting a therapy assistant to complete OT interventions&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;As part of your Occupational Therapy role, in addition to service user contact, you will have CPD opportunities.&lt;/p&gt;\n&lt;p&gt;At North West Boroughs Healthcare NHS Foundation Trust, candidates must be committed to delivering our Trust Values. You must have an interest in working with people with Learning Disabilities and their support networks. It would be useful to have knowledge and understanding of Transforming Care for People with Learning Disabilities- NHS England, The Mental Capacity Act (2005) and of reasonable adjustments.&lt;/p&gt;\n&lt;p&gt;This post is subject to an enhanced check with adults barred list Disclosure and Barring Service (DBS) Check. Successful candidates will either have a valid DBS check with the Trust or will be required to pay for the cost of the DBS Disclosure which is £47.50, the cost of which will be deducted from first salary.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameMichelle McLeodJob titleClinical Team ManagerEmail addressmichelle.mcleod@nwbh.nhs.ukTelephone number0151 426 5885Additional contact information&lt;/p&gt;\n&lt;p&gt;Jo Biddle or Sophie Peet&lt;/p&gt;\n&lt;p&gt;joanne.biddle@nwbh.nhs.uk or sophie.peet@nwbh.nhs.uk&lt;/p&gt;\n&lt;p&gt;0151 426 5885&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120746.jpg", "name": "North West Boroughs Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120746"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Willis House, Prescot", "postalCode": "L35 2YZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4175", "longitude": "-2.78554"}}, "title": "Specialist Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244741", "validThrough": "2020-11-10T23:59:59+0000"}