{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "78486", "minValue": "68573", "unitText": "YEAR", "value": "£68,573 -78,486 - p.a inclusive of HCAS"}}, "datePosted": "2020-11-03T20:15:16+0000", "description": "&lt;p&gt;&lt;strong&gt;*** Previous applicants need not apply’**&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;General Manager Facilities - Band 8c&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Croydon Health Services requires an experienced, innovative and creative General Manager of Facilities to join an ambitious and professional Senior Management Team led by the Director of Estates &amp; Facilities.The post-holder will be a key member of the Estates &amp; Facilities Senior Management Team with responsibility for managing portering and domestic services, catering, security, car parking, waste, linen and laundry and switchboard services.&lt;/p&gt;\n&lt;p&gt;Through a commitment to Croydon Health Services vision the successful candidate will use their own leadership experience in change management and facilities transformation to support the provision of high quality patient care and develop strong relationships with partners across the private, public and third sectors.&lt;/p&gt;\n&lt;p&gt;The post-holder will create the right climate to develop and sell the vision for future development of soft FM services across the Estate.&lt;/p&gt;\n&lt;p&gt;To be successful in this role you will need to have proven experience of delivering at a strategic and operational level in either the public or private sector, ideally connected to healthcare provision.&lt;/p&gt;\n&lt;p&gt;You will need to demonstrate a broad range of skills and competencies, working flexibly to provide leadership within the organisation during a challenging period of continuing change.&lt;/p&gt;\n&lt;p&gt;The post-holder will provide a single point of contact on day-to-day Facilities Management matters in these areas of responsibility. The post-holder will be responsible for the operational management of a wide range of both in-house and out-sourced contracts that are critical to safe and effective patient care. The post-holder will act as the Trust’s expert and adviser in these areas, providing highly specialist and professional facilities expertise to directors, clinicians, senior managers and other staff throughout the Trust.&lt;/p&gt;\n&lt;p&gt;At a corporate level the post-holder will contribute to the formulation and delivery of strategic and operational objectives whilst ensuring the provision of a comprehensive and efficient service working on behalf of patients, visitors and staff. The post-holder will be expected to embrace the changes in the delivery of health care and to identify and implement innovative solutions that support the Trust’s objectives.&lt;/p&gt;\n&lt;p&gt;The post-holder is required to deputise for the Director of Estates &amp; Facilities when required with regard to all matters concerning the Estates &amp; Facilities Directorate.&lt;/p&gt;\n&lt;p&gt;Croydon Health Services NHS Trust is an integrated acute and community trust, and so the successful candidate will have access to the facilities at Croydon University Hospital which include a library, staff gym and the Research &amp; Development Department.&lt;/p&gt;\n&lt;p&gt;The London Borough of Croydon is a vibrant and ethnically diverse area with excellent transport links and lots of character.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interviews will be held on the 16th December 2020.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further information, please contact&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Allan Morley, Director of Estates &amp; Facilities on 020 8401 3000 ext. 5052 or email allan.morley@nhs.net.&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120967.PNG", "name": "Croydon Health Services NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120967"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Croydon University Hospital, Croydon", "postalCode": "CR7 7YE"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3891", "longitude": "-.108758"}}, "title": "General Manager Facilities", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255008", "validThrough": "2020-11-25T23:59:59+0000"}