{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 pa pro rata"}}, "datePosted": "2020-11-02T09:46:05+0000", "description": "&lt;p&gt;An exciting opportunity has arisen in the critical care for a permanent full time Band 6 Post.&lt;/p&gt;\n&lt;p&gt;The successful applicant for the permanent Band 6 post will have previous Critical care experience, completed an Intensive Care or equivalent module, currently be an assessor and be willing to, or undertaking/completed the degree pathway, they should also be flexible and willing to undertake the extended roles that come with the Band 6 post as outlined in the Job description and below.&lt;/p&gt;\n&lt;p&gt;The Band 6’s role will be fully supported, with opportunities available to develop skills, to include being Team Leader, undertaking Staff Appraisals, holding the surgical division staff/admin bleep, and supporting staff development.&lt;/p&gt;\n&lt;p&gt;Included in this post would be opportunities to attend Band 6/7 meetings, and a variety of other meetings, which would give you the opportunity to gain a greater understanding of the Strategic management and vision of the Trust. You would also be given the opportunity to gain an insight into the PDN, Senior Nurse and the Lead Nurse role. We would also expect that you embrace the teaching aspect of the Band 6 role and lead other in their link nurse roles.&lt;/p&gt;\n&lt;p&gt;The Critical Care Unit has 13 beds plus a further 3 beds for when patient admission exceed 13, We provide care for emergencies, trauma, general elective surgery, paediatrics and medical patients. It is a “paperless” unit; with an up-to-date computerised system for nursing and medical records.&lt;/p&gt;\n&lt;p&gt;The unit is very well equipped with state of the art technical equipment, with training programs provided by a dedicated Practice Development Nurse (PDN).&lt;/p&gt;\n&lt;p&gt;We are very pro-active in Research/Audit and undertake many studies. These are coordinated and led by designated members of the research team, together with input from the registered nurses at the bedside delivering the care.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Natalie English- Senior Sister/Ward Manager&lt;/p&gt;\n&lt;p&gt;natalie.english@qehkl.nhs.uk 01553 613877&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "The Queen Elizabeth Hospital King's Lynn NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120938"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "King&#39;s Lynn, King&#39;s Lynn", "postalCode": "PE30 4ET"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.7568", "longitude": ".447015"}}, "title": "Junior Sister - Critical Care", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251461", "validThrough": "2020-11-16T23:59:59+0000"}