{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "76751", "minValue": "41158", "unitText": "YEAR", "value": "£41,158 - £76,751 Plus opportunity for additional"}}, "datePosted": "2020-10-20T15:16:46+0100", "description": "&lt;p&gt;Candidates are invited to join our outstanding team in the Oncology department of Northampton General Hospital NHS Trust. NGH is a designated Cancer Centre providing Specialist Services for patients living with cancer. The hospital provides a fully integrated and comprehensive service for the treatment, care and support of cancer patients. Approximately 2,800 new patients are seen per annum from Northamptonshire and North Buckinghamshire. The Trust strives to be at the forefront of developing cancer services, pioneering new techniques and treatments to improve the patient experience and individual outcomes. The Oncology Centre contains an outpatient department with nine consulting suites with attached examination rooms, two additional clinical rooms and a counselling room. There is a full team of supporting staff including nurses, radiographers, administration, clerical and secretarial staff. The Trust uses the Chemocare electronic chemotherapy prescribing system. Day case chemotherapy is administered in the outpatient setting by trained chemotherapy nurses in the brand new 24 bedded Chemotherapy Suite. This is anticipating the increase of systemic therapies for patients over the coming years. Ambulatory home chemotherapy is available and there is a nurse-led PICC line service. Further clinics and treatments are given at Kettering General Hospital’s Centenary Wing.&lt;/p&gt;\n&lt;p&gt;The Radiotherapy Department provides all routine forms of radiotherapy including CT planning, external beam radiotherapy and high dose rate remote after loading brachytherapy. There are three Varian Linear Accelerators with ExacTrac which utilise the Eclipse Planning System. A business case for radiotherapy equipment has enabled a full replacement programme of the existing Linear Accelerators and associated equipment. IMRT, IGRT, VMAT, SABR/SBRT and SRT are well developed at Northampton.&lt;/p&gt;\n&lt;p&gt;Northampton General Hospital is a specialist centre for prostate brachytherapy in the East Midlands Cancer Network. There is a HDR Micro Selectron which currently treats gynaecological and prostate patients. Prostate Seed Brachytherapy is well developed and has been implemented since 2002, and treats patients from the local network and surrounding networks.&lt;/p&gt;\n&lt;p&gt;Medical Physics includes Radiotherapy Physics, Electronics, Radiation Protection, Nuclear Medicine and Supra regional Mammography Quality Assurance. The radiotherapy services within the Centre are BSI ISO9000:2001 accredited in line with national required standards. Work is in progress to include the chemotherapy services within the scope of the accreditation.&lt;/p&gt;\n&lt;p&gt;There is a dedicated Macmillan Cancer Information and Support Centre, providing tailored information for patients and carers to meet their individual needs. The Trust was in wave one of implementing information prescriptions and this is being driven forward by the Macmillan Information and Support Lead.&lt;/p&gt;\n&lt;p&gt;Inpatients are accommodated in the dedicated Oncology/Haematology ward (Talbot Butler).There are 24 beds (plus six additional beds for winter escalation); two four bedded bays and 16 single rooms (including a dedicated suite for radioactive Iodine treatment). There is an Emergency Assessment Bay (EAB) for patients who develop complications with oncological/haematological treatment.&lt;/p&gt;\n&lt;p&gt;Candidates are highly recommended to call the department to discuss their application and are invited to contact Dr Tahir Mehmood, Consultant, email; Tahir.Mehmood@NGH.NHS.UK&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameTahir MehmoodJob titleConsultantEmail addressTahir.Mehmood@NGH.NHS.UK&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121063.jpg", "name": "Northampton General Hospital NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121063"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Oncology, Northampton", "postalCode": "NN1 5BD"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.2371", "longitude": "-.886673"}}, "title": "Specialty Doctor in Oncology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916234981", "validThrough": "2020-11-17T23:59:59+0000"}