{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 to £21,142 pa"}}, "datePosted": "2020-10-28T12:30:29+0000", "description": "&lt;p&gt;&lt;strong&gt;Generic Worker – Band 3 – Sudbury Community Health Team – 18.75 hours per week – Permanent&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Could you h&lt;/strong&gt;&lt;strong&gt;elp West Suffolk Hospital to deliver the best quality and safest care to our local community?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity for a Generic Worker has arisen in the Sudbury Community Health Team. The team are based in the Health Centre in Sudbury which is a historic market town surrounded by picturesque villages. The Sudbury Health Centre is the base for a wide range of other health professionals and agencies including Adult Social Care and a GP practice so we are able to work together in a fully integrated way. The successful applicant will join a self-motivated, friendly team of community nurses and therapists.&lt;/p&gt;\n&lt;p&gt;Following training, as required, to use skills from the professional areas of Nursing, Occupational Therapy and Physiotherapy you will be providing support to patients in the community.&lt;/p&gt;\n&lt;p&gt;The successful applicant’s role will be primarily assisting the therapists in carrying out rehabilitation programmes. The successful applicant will also be providing therapy support and advice to patients in the nearby 12 bedded rehabilitation unit in Sudbury, where they will be carrying out some assessments of daily living skills, exercise and mobility practice and accompanying the therapists on home visits to help in planning for a safe and effective discharge. The successful applicant will also be visiting the patients in the community, carrying out home visits and implementing the patient’s individualised care plan designed by the therapists.  Some of your duties may include monitoring basic physical observations for good health and supporting nursing care.&lt;/p&gt;\n&lt;p&gt;Experience of working in the health and social care field will be an advantage. The successful applicant will have the chance to be fully involved in working with the MDT and integrating with ACS staff and will need to be committed to ongoing learning and development in the team.&lt;/p&gt;\n&lt;p&gt;Our service operates between the core hours of 8am to 6pm, 7 days per week.&lt;/p&gt;\n&lt;p&gt;If you have the necessary skills, experience and qualities to help us to put patients first, please contact Jennie McCrory, Clinical Team Lead. 07961603129 Jennifer.mccrory@suffolkch.nhs.uk. for an informal discussion.&lt;/p&gt;\n&lt;h1&gt;&lt;strong&gt;**In order to improve efficiency, all correspondence relating to this vacancy, &lt;span style=&quot;text-decoration: underline;&quot;&gt;including invitations to interview will be by email only&lt;/span&gt;, via NHS Jobs. Would you therefore please ensure you check your emails on a regular basis**&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;In submitting an application form, you authorise West Suffolk NHS FT to confirm any previous NHS service details via the Inter Authority Transfer (IAT) process, should you be appointed to the post. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;To view the Job Description and Person Specification for this position, please click on the Job Description link (below). You should use the Additional Information section of your application to state how you meet the requirements of the Person Specification.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The successful candidate for this post will be required to apply for a Disclosure &amp; Barring Service (DBS) Disclosure at &lt;strong&gt;Enhanced&lt;/strong&gt; level.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt; For Band 1 and Band 2 posts, the cost of the DBS Disclosure will be met by the Trust. However, any employees at Band 1 and Band 2 who leave the Trust within six months of commencing their post will have a £10 administration fee deducted from their final salary. For posts at Band 3 and above, the cost of the Disclosure will be met by the appointed employee and deducted in instalments from their salary over a period of three months. If the employee leaves the Trust within three months of commencing their post, any outstanding payments will be deducted from their final pay.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;All applicants should click on the link entitled “How will my application be processed?” prior to submitting their application form.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The closing date for this vacancy may change if we receive a strong response. Please ensure that you apply for any post you are interested in as soon as possible.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "West Suffolk NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120941"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bury St. Edmunds", "postalCode": "IP33 2QZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.2317", "longitude": ".709205"}}, "title": "Generic Worker - Band 3 - Sudbury Community Health Team", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246590", "validThrough": "2020-11-11T23:59:59+0000"}