{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "35612", "minValue": "28588", "unitText": "YEAR", "value": "£28,588 - £35,612 per annum"}}, "datePosted": "2020-10-29T14:30:41+0000", "description": "&lt;p&gt;&lt;strong&gt;Please note there is the possibility of two posts available&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Biological Services Group within National Infection Service (Porton) provides services and performs &lt;em&gt;in-vivo&lt;/em&gt; research and development with the primary aim of protecting the UK public from a range of health risks. Ongoing programs of work include vaccine release testing, meningitis, influenza and TB vaccine development studies. The group conducts investigations employing novel and dangerous pathogens under biological containment, up to and including ACDP Containment Level 4. The group also maintains breeding units to the highest of welfare standards.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job Purpose / Summary&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This role is to provide scientific support, husbandry and technical expertise in a team responsible for delivering the highest levels of animal welfare and husbandry in a breeding facility.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Key requirements of this role are:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To supervise a team responsible for the delivery of activities within a unit&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;To co-ordinate day to day planning, prioritisation and delivery of services&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Assist in ensuring that the team maintains the highest standards of care and welfare of all animals.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Successful applicants will be able to demonstrate skills in staff supervision and organisation; have a keen interest in animal care and welfare issues; a safety-conscious attitude; and a good understanding of why animals are used for research purposes. You will also need to feel at home in a close-knit team environment.&lt;/p&gt;\n&lt;p&gt;Appropriate further training and personal professional development will be provided and are positively encouraged.&lt;/p&gt;\n&lt;p&gt;The hours of work are 37.5 hours per week, Monday to Friday (hours between 07.00 and 16.00) and you will be prepared to work flexibly (including weekends and Bank Holidays) when the need arises.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This role requires the applicant to apply for and obtain Security Clearance.&lt;/strong&gt;&lt;strong&gt; Applicants are encouraged to contact BIG@phe.gov.uk if they have any questions.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Open to all external applicants (anyone) from outside the Civil Service (including by definition internal applicants).&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:      BIG@phe.gov.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/127774.jpg", "name": "Public Health England", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127774"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "PHE Porton Down, Salisbury", "postalCode": "SP4 0JG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.1325", "longitude": "-1.7031"}}, "title": "BIG Senior Technician", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248692", "validThrough": "2020-11-12T23:59:59+0000"}