{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "35612", "minValue": "28588", "unitText": "YEAR", "value": "£28,588 - £35,612 HEO national band"}}, "datePosted": "2020-10-29T14:46:15+0000", "description": "&lt;p&gt;&lt;strong&gt;JOB SUMMARY&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This post is within the PHE workforce planning team (part of the workforce development division of People Directorate). The role will be focussed on bringing together and investigating existing workforce planning datasets, shaping current and future workforce plans, and investigating people issues to inform decision-making.&lt;/p&gt;\n&lt;p&gt;The key objective for this role is to help deliver high quality workforce plans by leveraging the organisation’s existing people data sources, using experience and analytical insight to ensure that plans are robust and can be measured and tracked effectively. In addition, you will run reports and analysis to highlight areas of risk and opportunity, especially in relation to PHE’s transition to the National institute for Health Protection.&lt;/p&gt;\n&lt;p&gt;The role presents a great opportunity to make an immediate impact in informing PHE’s workforce planning activities and is equally suited to both data analysts and workforce planners looking to broaden their experience in a dynamic, inclusive and supportive team.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;MAIN DUTIES AND RESPONSIBILITIES&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;em&gt;Establishing relationships with key stakeholders including wider People Directorate, finance, strategy, workforce and business planning colleagues to understand the current sources of workforce data and information available, and how these can be effectively combined.&lt;/em&gt;&lt;/li&gt;\n&lt;li&gt;&lt;em&gt;Shaping and informing workforce plans and strategies particularly by using analysis and insight. &lt;/em&gt;&lt;/li&gt;\n&lt;li&gt;&lt;em&gt;Bringing together multiple data sources (including a mixture of quantitative and qualitative data) to reveal patterns and correlations. &lt;/em&gt;&lt;/li&gt;\n&lt;li&gt;&lt;em&gt;Using a range of analytical tools (predominantly within Excel) to investigate workforce issues, trends and opportunities.&lt;/em&gt;&lt;/li&gt;\n&lt;li&gt;&lt;em&gt;Producing clear presentations of workforce insights generated.&lt;/em&gt;&lt;/li&gt;\n&lt;li&gt;&lt;em&gt;Other relevant duties as required by the line manager, as appropriate to existing skills and ongoing development.&lt;/em&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;PROFESSIONAL DEVELOPMENT&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Keep up to date with organisation, Civil Service and wider pubic health workforce planning approaches.&lt;/li&gt;\n&lt;li&gt;Keep up to date with new techniques and approaches to manipulation and presentation of people datasets.&lt;/li&gt;\n&lt;li&gt;Identify, discuss and action own professional performance and training / development needs with your line manager through appraisal / individual development plan. Attending internal / external training events&lt;/li&gt;\n&lt;li&gt;To participate in all mandatory training as required, i.e. fire safety, information governance and all other mandatory training.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;KEY WORKING RELATIONSHIPS &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The post holder will develop working relationships and communicate regularly with a wide range of individuals, clinical and non-clinical, internal and external to PHE. These will include:&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Internal&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Workforce planning and wider workforce development colleagues&lt;/li&gt;\n&lt;li&gt;Harlow Project Team&lt;/li&gt;\n&lt;li&gt;People Directorate colleagues, especially within resourcing, reward and HRBP teams&lt;/li&gt;\n&lt;li&gt;Finance, business planning and strategy colleagues&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;External&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Wider workforce planning and people analytics professional networks across the civil service and health sector.&lt;/li&gt;\n&lt;li&gt;Strategy and people planning colleagues in DHSC and its other executive agencies.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Option 3 – External&lt;/p&gt;\n&lt;p&gt;Open to all external applicants (anyone) from outside the Civil Service (including by definition internal applicants).&lt;/p&gt;\n&lt;p&gt;On 18 August 2020, the Secretary of State for Health and Social Care announced plans to establish the National Institute for Health Protection and consult on the best future options for strengthening health improvement and other public health functions in the wider system. Public Health England and many of its employees will be in scope for transition to new organisations in Spring 2021. Any new or current employees working for Public Health England during this time, will receive appropriate communications and consultation prior to any formal transfer taking place. Employees who compulsorily transfer to successor bodies will remain on their existing contractual terms and conditions and this applies both to current employees and those recruited during the transition. The recruitment, growth &amp; development of our workforce is vital for the continuing success of PHE and the future National Institute for Health Protection.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Joel Pullan Job title Head of Workforce Planning and Talent Email address Joel.Pullan@phe.gov.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/127774.jpg", "name": "Public Health England", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127774"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Home based, Home based", "postalCode": "SE1 8UG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5018", "longitude": "-.10881"}}, "title": "Workforce Planning Analyst", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248745", "validThrough": "2020-11-09T23:59:59+0000"}