{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "38920", "minValue": "30393", "unitText": "YEAR", "value": "£30,393 - £38,920 per annum pro rata"}}, "datePosted": "2020-10-28T09:15:42+0000", "description": "&lt;p&gt;Applications are invited for Clinical Fellows in Ambulatory Medicine. This post is at Homerton University Hospital, based in Hackney, East London; an exciting and challenging place with a diverse and richly multicultural population.&lt;br /&gt;&lt;br /&gt;Homerton University hospital is a Foundation Trust and teaching hospital in East London. We are in the middle of Hackney – a diverse and interesting inner city area. It is a Trauma Unit within the North East London trauma Network and was the designated hospital for the 2012 Olympic Games. It is within walking distance to Homerton and Hackney Central Overground stations, with easy access to major transport links.&lt;br /&gt;&lt;br /&gt;Following a successful pilot, Homerton University Hospital is launching an expansion to the current innovative Ambulatory Care Unit; known as HAMU (Homerton Ambulatory Care Unit). &lt;br /&gt;&lt;br /&gt;Ambulatory care is the delivery of emergency hospital care without admission to an acute inpatient bed. The HAMU manages patients requiring ongoing treatment or investigation that would otherwise have required admission is delivered either by scheduling return visits to the ambulatory service or by management on the same day. We are expanding the service to see stable GP and ED referrals where admission is not indicated. &lt;br /&gt;&lt;br /&gt;This role provides an exciting opportunity to work closely with highly skilled and knowledgeable consultants with opportunities to work in a service where quality improvement and iterative change are happening in a real-time but supported way. A wide range of pathology will be seen in the day to day working in the unit, providing experiences both challenging and varied. &lt;br /&gt;&lt;br /&gt;Homerton Hospital is proud of the training opportunities on offer and we have an excellent record of getting doctors in non-training posts into training. We will support and arrange training opportunities for the post holder’s specific interests.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Dr David Wilson - Consultant in Emergency Medicine and Ambulatory Care&lt;br /&gt;david.wilson15@nhs.net&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Dr Will Niven, Consultant in Emergency Medicine and Ambulatory Care&lt;br /&gt;william.niven@nhs.net&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Dr Carlo Prina, Clinical Lead Acute Care, Consultant in Ambulatory Care &lt;br /&gt;carlo.prina@nhs.net&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Dr Mohamed Soliman, Consultant in Ambulatory Care&lt;br /&gt;mohamed.soliman1@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120604.jpg", "name": "Homerton University Hospital NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120604"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Homerton Unviersity Hospital NHS Foundation Trust, Hackney", "postalCode": "E9 6SR"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5506", "longitude": "-.046072"}}, "title": "Clinical Fellow in Ambulatory Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245793", "validThrough": "2020-11-11T23:59:59+0000"}