{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-11-02T13:45:48+0000", "description": "&lt;p&gt;Do you want to make a difference to patients’ lives?&lt;/p&gt;\n&lt;p&gt;If your answer is yes, then we want you to come and join our strong, cohesive team on the Acute Stroke Unit.&lt;/p&gt;\n&lt;p&gt;Our nursing care is based on the most up to date research to ensure that what we do every day can change a patient’s life for ever.&lt;/p&gt;\n&lt;p&gt;We no longer send all our patients to nursing homes, but by working intensively with our therapists and doctors we now are sending most of our patients home.&lt;/p&gt;\n&lt;p&gt;We provide hyperacute care for those patients that need monitoring in a Level 2 critical care area, similar to high dependency units. All our hyperacute beds use cardiac monitoring and have 7 day a week Consultant Ward rounds. Because of the nature of these patients there is always a Band 6 or Band 7 nurse on the ward 24 hours a day to provide any additional support you might need.&lt;/p&gt;\n&lt;p&gt;Patients are also treated for a wide range of medical conditions, so you will have a wealth of opportunity to challenge your nursing knowledge and provide you with a constantly changing environment.&lt;/p&gt;\n&lt;p&gt;If you would like to see what we do and how we work as a team then please do arrange a visit to the unit where we can show you around, meet your future colleagues and have an informal chat about the unit.&lt;/p&gt;\n&lt;p&gt;If you like what you see, we can interview you on the same day as your visit.&lt;/p&gt;\n&lt;p&gt;So if you are a student nurse who is thinking about their future career or a qualified nurse looking for a supportive, hardworking, enthusiastic team to be part of, then please submit an application form.&lt;/p&gt;\n&lt;p&gt;PLEASE NOTE - SKYPE INTERVIEWS AVAILABLE FOR EXCEPTIONAL CIRCUMSTANCES&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Sister Shiv Panchalingam on 0118 322 8944 or shivanthi.panchalingam@royalberkshire.nhs.uk&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122060.jpg", "name": "Royal Berkshire NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122060"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Berkshire NHS Foundation Trust, Reading", "postalCode": "RG1 5AN"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4514", "longitude": "-.958624"}}, "title": "Staff Nurse - Acute Stroke Unit", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252275", "validThrough": "2020-11-16T23:59:59+0000"}