{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-11-05T09:47:43+0000", "description": "&lt;p&gt;&lt;strong&gt;Band 5 Theatre Practitioner &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Full Time- 37.5 hours&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Permanent&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This post is suitable for a Registered Nurse or Operating Department Practitioner, the primary role is surgical scrub and associated duties working within the surgical theatres at Blackpool Teaching Hospitals. The role includes on call duties and this requires that the post holder be able to attend theatres within 30 minutes of a call. &lt;br /&gt;&lt;br /&gt;Our surgical theatres cover a wide range of specialities including General Surgery, Orthopaedic Surgery elective and Trauma, Gynaecology, Urology, Ear Nose and Throat, Vascular, Dental including Inpatient and day surgery admissions. Successful applicants will have the opportunity to develop a wide range of surgical skills whilst rotating through multiple surgical specialities. Our Theatres also provides 24 hour emergency cover for the Fylde Coast and beyond.&lt;/p&gt;\n&lt;p&gt;We are a forward thinking modern Foundation Trust and are looking to recruit a Staff Nurse who is highly motivated, open to change and demonstrates excellent communication skills. As an integral member of the team the post holder will assist and participate in the smooth running of the theatre.&lt;/p&gt;\n&lt;p&gt;We have ten surgical theatres, three of which are dedicated day surgery. We have a fantastic team of staff and they would support any new member of the team. There would be a period of teaching and training for the successful candidate and we have a dedicated Practice Development team who would facilitate induction and training. There is also the opportunity for rotation between in patient and day case theatres.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDarren HoweJob titleSenior Lead Theatre PractitionersEmail addressdarren.howe1@nhs.netTelephone number01253 9553841Additional contact information&lt;/p&gt;\n&lt;p&gt;Gemma Holden&lt;/p&gt;\n&lt;p&gt;Senior Lead Theatre Practitioner&lt;/p&gt;\n&lt;p&gt;01253 553016&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Blackpool Teaching Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120954"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Blackpool Teaching Hospitals NHS Trust, Blackpool", "postalCode": "FY3 8NR"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8207", "longitude": "-3.01626"}}, "title": "Theatre Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257116", "validThrough": "2020-11-19T23:59:59+0000"}