{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per anum"}}, "datePosted": "2020-10-20T12:16:52+0100", "description": "&lt;p&gt;Are you an experienced Dietitian looking for a new challenge?&lt;/p&gt;\n&lt;p&gt;Are you passionate about the nutritional management of patients within the acute setting?&lt;/p&gt;\n&lt;p&gt;If so this post could be for you!&lt;/p&gt;\n&lt;p&gt;We are looking to appoint a 2.0wte Band 6 Dietitians based at Blackpool Teaching Hospitals NHS Trust. The post is part of a wider dietetic team covering acute and community services and including specialties such as ENT, diabetes, haematology, cystic fibrosis and home enteral feeding.&lt;/p&gt;\n&lt;p&gt;These newly funded posts will provide the successful applicants with the opportunity to develop dietetic services within the hospital. You will promote the role of Dietetics within the Trust working alongside other Allied Health Care Professionals.&lt;/p&gt;\n&lt;p&gt;Ideally the post holders will have clinical experience working within a variety of specialities and settings, they will use their expertise to maximise patient outcomes and patient experience .&lt;/p&gt;\n&lt;p&gt;Experience of working in an Acute setting is of benefit for this post. You will also be responsible for the mentoring of junior staff and participation in the band 5 rotation with community dietetic colleagues so experience of supervising others would be advantageous.&lt;/p&gt;\n&lt;p&gt;This is a fantastic opportunity to develop your skills within dietetics and join our friendly and supportive team.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDebbie WalkerJob titleAcute team Lead DieteticsEmail addresscatherine.walker4@nhs.netTelephone number01253 956777&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Blackpool Teaching Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120954"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Blackpool Teaching Hospitals, Blackpool", "postalCode": "FY3 8NR"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8207", "longitude": "-3.01626"}}, "title": "Specialist Dietitian", "url": "https://www.jobs.nhs.uk/xi/vacancy/916234346", "validThrough": "2020-11-16T23:59:59+0000"}