{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 to £24,157 pa"}}, "datePosted": "2020-11-03T16:32:54+0000", "description": "&lt;p&gt;&lt;strong&gt;Claims Assistant (Leeds)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary: &lt;/strong&gt;£21,892 to £24,157 pa&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Job Summary&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;NHS Resolution is a not-for-profit part of the NHS working for health care providers to resolve claims fairly and to share learning across the NHS and beyond. We provide a supportive environment for our staff with specialist training and the opportunity for personal development.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;NHS Resolution operates a number of indemnity schemes, on behalf of the Secretary of State for Health and Social Care, primarily for the handling of liability claims against English NHS Trusts and other commissioners and/or providers of NHS care.&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The claims teams manage claims emanating from former PCTs and Strategic Health Authorities, which transferred to the Secretary of State. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Claims teams work in an interesting and dynamic climate, allcontributing to a continually improving claims service. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Claims Assistant will work alongside a team of Case managers and the Team Leader, providing administrative support for the handling of claims as well as supporting other departments as required and providing general administrative support as needed. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Claims Assistant will also demonstrate the following competencies:&lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Excellent oral and written communication skills&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Confidence in making enquiries via phone and email&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Ability to work collaboratively in a team&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Ability to work in an environment exposed to sensitive information and maintain confidentiality&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Intermediate IT proficiency in a range of Microsoft products and experience of using bespoke databases&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Excellent &lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;attention to detail&lt;/span&gt;&lt;/strong&gt;.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Ability to manage and take responsibility for tasks, not simply complete them&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;span&gt;In response to the Government advice relating to the Covid-19 pandemic our staff and teams in all business areas are fully supported in working remotely. All new employees will also be provided with the necessary training and equipment to work from home and we have put in place additional measures to support new employees during this period.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;Closing date:&lt;/strong&gt; 15/11/2020 &lt;strong&gt;(If sufficient response is received this post will be closed earlier than the specified closing date)&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;A &lt;strong&gt;written assessment&lt;/strong&gt; will form part of the selection process and may be used for further shortlisting. The written assessment will be undertaken in &lt;strong&gt;the week commencing 23/11/2020.&lt;/strong&gt;&lt;br /&gt; &lt;strong&gt;Interviews and further assessments will be held via conference call or video based interaction rather than face to face meetings The interview date will be in the week commencing 30/11/2020&lt;/strong&gt; and will be used to assess knowledge, skills and competency.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Please note that the closing and interview dates for roles may be subject to change to take into account any Government advice relating to Covid-19. &lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NHS Resolution", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121692"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Leeds", "postalCode": "LS2 8PA"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8024", "longitude": "-1.54207"}}, "title": "Claims Assistant (GPI)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254806", "validThrough": "2020-11-15T23:59:59+0000"}