{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51393", "minValue": "45780", "unitText": "YEAR", "value": "£45,780 - £51,393 per annum inclusive"}}, "datePosted": "2020-10-27T12:32:25+0000", "description": "&lt;p&gt;&lt;strong&gt;Vacancy for a Senior Practitioner within the Social work department&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Great Ormond Street is a tertiary specialist children&#39;s hospital that has a strong commitment to supporting children and their families. &lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;The GOSH Social Work and Family Support Service is comprised of Head of Social Work, Senior Practitioners, Social Workers and Family Support Officers.&lt;/p&gt;\n&lt;p&gt;We have a vacancy for a Senior Practitioner (Band 7) with substantial post qualification experience and a minimum of one year supervisory experience.&lt;/p&gt;\n&lt;p&gt;The Senior Practitioner is 50% management and 50% case holding. As a manager, you will act as Duty Manager overseeing the work of the duty social worker and duty family support officer to respond in a timely manner to all new referrals.&lt;/p&gt;\n&lt;p&gt;The Senior Practitioner forms part of the management team and supports the Head of Social work on various projects such as audits, training, improving service delivery and planning.&lt;/p&gt;\n&lt;p&gt;GOSH Social work practice involves supporting patients on a range of statutory plans through extensive liaison with Local Authorities and outside agencies. Senior Practitioners give expert advice to colleagues on complex safeguarding issues and offer consultations about statutory thresholds and when to refer.&lt;/p&gt;\n&lt;p&gt;Each Senior Practitioner is allocated to one or two specialisms and will form a close working relationship with their clinical Multidisciplinary teams. You will need sound social work supervision skills, supervision is provided every three weeks to staff, and you must have well developed skills in assessing children and family’s needs holistically and be able to assist others to work in a child centred and reflective manner.&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;If you have experience of working with children and families with additional health needs or disabilities, excellent written and verbal communication skills, experience of managing social workers, and a strong commitment to providing excellent support to patients and their families, then we would like to hear from you.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;strong&gt;For this post you must be registered with Social Work England and will be subject to enhanced DBS check.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameElleni RossJob titleHead of Social WorkEmail addresselleni.ross@gosh.nhs.ukTelephone number0207 829 8896&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121180.png", "name": "Great Ormond Street Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121180"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Great Ormond Street Hospital, London", "postalCode": "WC1N 3JH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5222", "longitude": "-.119898"}}, "title": "Senior Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244534", "validThrough": "2020-11-09T23:59:59+0000"}