{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-11-02T12:02:10+0000", "description": "&lt;p&gt;Our successful ACORNS team are looking for a colleague who will join this great little team. Our Acute Children’s Acute Children’s Outreach Nurse Service started in August 2017 in response to increasing admissions of acutely unwell infants and children who could be managed safely in their own homes with the correct support and on-going assessment. Our targets have already been exceeded and the team continues to develop. Our team links very closely with the Children’s Emergency Department (CED) to facilitate acute assessment contact in the department and visits shortly after a child leaves the CED. The nurse’s clinical competence development and nursing expertise involves working with the CED team on a regular basis. The ACORNS team consists of Consultant Paediatricians, a Senior Nurse, dedicated Band 6 nursing team and an administrator based in the Children’s Emergency Dept (CED) at The Royal Alexandra Children’s Hospital, Brighton. &lt;br /&gt;&lt;br /&gt;The ACORNS Sisters also take their acute clinical skills and expertise into the child and family’s home, and support and empower the family to care for the child in their own home shortly after leaving CED. This is done by providing a structured telephone assessment and when necessary home visits. We know that this is beneficial for the emotional wellbeing and quality of life for children and their families and we have received fabulous feedback. The ACORNS deliver and provides clinically safe, effective and efficient care that is consistent with NHS clinical standards, national and local policy, and applicable service guidelines and we are exploring other ways to develop the service further to avoid or shorten unnecessary admissions, as well as supporting them in their own home.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;So we are looking for an enthusiastic, dynamic, caring children’s nurse who is experienced in emergency/acute skills and who is able to work alone and make sound clinical decisions. Supporting the family whilst they care for their acutely ill child at home is central to the service as is the clinical expertise to recognise if the child requires urgent or emergency reassessment at the Emergency department. This is now your opportunity to work with the team leader and continue to develop the ACORNS and look towards developing the Urgent Care service within the Royal Alex. You will communicate and work closely with the CED staff and maintain your acute nursing skills and you will be provided with development opportunities to support you in the role. Support is available from the team leader, practice development nurse and senior nursing team who will assist in further developing your skills within this unique role.&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;The Royal Alexandra Children’s Hospital is located on the Royal Sussex County Hospital site in Brighton. The hospital opened a specialist Children’s Emergency Department based in the children’s hospital in Jan 2012 The Children’s Emergency Department offers 24 hours emergency care and currently sees approximately 28,000 children and young people a year with ever increasing numbers of children attending and an expanding service. There is an experienced and well established paediatric nursing team ,Emergency Nurse Practitioner service, full facilities for resuscitation, minor/majors treatments and six bedded observation unit.&lt;br /&gt;&lt;br /&gt;Given the focus of this post, it is essential that you are a Registered Children’s Nurse, and have a recognised qualification in Children’s nursing, ideally including Paediatric Physical Assessment, or equivalent experience, and an APLS/PILS provider. Recent experience in children emergency care is also essential. You will also require highly effective communication skills with families with families in their own homes and some community nursing experience is an advantage.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameStephen HomerJob titleACORNS Team LeaderEmail addressstephen.homer@nhs.netTelephone number01273 696955 ext 62430Additional contact information&lt;/p&gt;\n&lt;p&gt;Lorraine Tinker, Head of Nursing Lorraine.tinker1@nhs.net 01273696955 Ex 62313&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Brighton and Sussex University Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120968"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Alexandra Children&#39;s Hospital, Brighton", "postalCode": "BN2 5BE"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8195", "longitude": "-.118149"}}, "title": "Acute Children&#39;s Outreach Sister / Charge Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251960", "validThrough": "2020-11-15T23:59:59+0000"}