{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 to £44,503 pa based on full time hours"}}, "datePosted": "2020-10-22T13:15:27+0100", "description": "&lt;p&gt;&lt;strong&gt;Specialist Nurse Safeguarding Nurse- Hampshire MASH&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Looking for a new challenge to showcase your clinical skills in different environment?&lt;/p&gt;\n&lt;p&gt;We are looking to recruit a registered nurse with adult experience to join the Multi-Agency Safeguarding Hub (MASH) located in central Fareham.&lt;/p&gt;\n&lt;p&gt;You will be joining a dynamic, highly motivated team of safeguarding professionals drawn from Southern Health NHS Foundation Trust (SHFT), Hampshire County Council and Hampshire Police who work collaboratively to ensure adults with care and support needs are protected from abuse and neglect and have safe outcomes.&lt;/p&gt;\n&lt;p&gt;MASH is very much the frontline of safeguarding adults and provides a critical role in ensuring that vulnerable adults get a timely, appropriate and proportionate response to safeguarding risks.&lt;/p&gt;\n&lt;p&gt;The work involves using your clinical and safeguarding knowledge to help triage safeguarding referrals, contribute your specialist healthcare knowledge to decision making, and work with a range of organisations to help improve practice and keep service-users safe, contribute to High Risk Domestic Abuse (HRDA) assessments.&lt;/p&gt;\n&lt;p&gt;You will need sound Safeguarding Adults knowledge and expertise, effective communication skills and highly developed listening skills. The post holder will be required to demonstrate critical thinking to enhance decision making in relation to the protection of vulnerable adults within our Trust. As a team player, you’ll be able to prioritise your work in order to meet deadlines.&lt;/p&gt;\n&lt;p&gt;The Safeguarding Team has a proactive approach towards Family Approach safeguarding. If you are keen to drive Southern Health NHS Foundation Trust Safeguarding Agenda forward in a supportive environment, then this is an exciting opportunity to work with your health and other colleagues in MASH and in the wider SHFT Safeguarding Team.&lt;/p&gt;\n&lt;p&gt;This post is not suitable for newly qualified staff.&lt;/p&gt;\n&lt;p&gt;Car driver essential.&lt;/p&gt;\n&lt;p&gt;Closing Date for Applications: 8th November 2020&lt;/p&gt;\n&lt;p&gt;Interview Date: Tuesday 24th November 2020 – Interviews will be held via MS Teams meeting.&lt;/p&gt;\n&lt;p&gt;Please be aware there is no public parking available at The Parkway – contact the lead in MASH in advance of your application for further details. Thank you.&lt;/p&gt;\n&lt;p&gt;Happy to Talk Flexible Working - all requests for flexible working will be considered.&lt;/p&gt;\n&lt;p&gt;Follow us on Facebook and on Twitter: facebook.com/SouthernHealthNHS@Southern_NHSFT&lt;/p&gt;\n&lt;p&gt;Please contact Harvey Campbell on 075841 55951 or Sue Corley on 07880 005070 for an informal discussion.&lt;/p&gt;\n&lt;p&gt;Unfortunately due the ongoing Covid-19 pandemic, visits to MASH are not possible.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Southern Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120646"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Parkway, Fareham, Hants", "postalCode": "PO16 7JL"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8631", "longitude": "-1.17955"}}, "title": "Nurse Safeguarding Adults - Multi Agency Safeguarding Hub", "url": "https://www.jobs.nhs.uk/xi/vacancy/916238616", "validThrough": "2020-11-08T23:59:59+0000"}