{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "40890", "minValue": "36479", "unitText": "YEAR", "value": "£36,479 - £40,890"}}, "datePosted": "2020-10-16T06:04:56+0100", "description": "&lt;p&gt;&lt;strong&gt;We have an exciting opportunity for a Recovery Theatre Practitioner to join our Theatres department based at The London Clinic main hospital in Central London, W1G 6BW (close to Regents Park &amp; Baker Street tube stations).&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Our main hospital spans 8 floors comprising of 234 beds and 10 theatres,including a Hybrid theatre and two minimally invasive and day surgery theatres. We have a total of 11 Recovery bays &amp; 5 Discharge rooms. Specialist areas include, General surgery; ENT; Gynaecology; Hepatobiliary; Neuro-spinal; Ophthalmic; Orthopaedic; Plastic and reconstructive; Robotic; Urology; Vascular &amp; Weight loss surgery (bariatric surgery).&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Job Description&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As part of the multidisciplinary team the post holder is responsible for the assessment, evaluation and implementation of care given to patients within the recovery room without supervision.&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Job Type: This is a full-time, permanent position, working 37.5 hours per week.&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Shifts: Early &amp; late shifts, plus on-call roata on weekends&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Salary: The salary range for this role is £36,479 - £40,890, and will be dependent upon skills and experience.&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Benefits package: We offer a comprehensive package which includes a contribution pension scheme (total annual contribution up to 20%), Private Medical Healthcare, 33 day’s annual leave (inclusive of bank holidays), season ticket travel loan, and a wide range of discounts with a variety of retailers and services. We also offer excellent career development; with clear career pathways and access to further education.&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Duties &amp; Responsibilities&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Work as a skilled member of the recovery team,providing the highest standard of patient care.&lt;/li&gt;\n&lt;li&gt;Carry out nursing duties within the recovery area according to policies and procedures under the control of the person in charge, reporting any difficulties or concerns.&lt;/li&gt;\n&lt;li&gt;Communicate effectively and responsibly at all times with colleagues, senior staff and within the multi-disciplinary setting.&lt;/li&gt;\n&lt;li&gt;Develop and maintain clinical skills and knowledge necessary to provide holistic, evidence based nursing care, following PREP/CPD requirements.&lt;/li&gt;\n&lt;li&gt;Participate in the monitoring and maintenance of standards, and maintain custody and checking of controlled drugs daily.&lt;/li&gt;\n&lt;li&gt;Maintain accurate and legible written and electronic records of care, ensuring that the safety, privacy and dignity of the patient is maintained at all times.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Skills &amp; Experience&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;NMC or HCPC registration (RGN or ODP).&lt;/li&gt;\n&lt;li&gt;Proven experience in recovery and/or intensive care setting.&lt;/li&gt;\n&lt;li&gt;Understanding of the post-operative needs of patients and customers.&lt;/li&gt;\n&lt;li&gt;Good communication and interpersonal skills with the ability to work under pressure and flexibly as part of a team.&lt;/li&gt;\n&lt;li&gt;Highly motivated individual who is Punctual, adaptable and continually maintains a professional image.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Established in 1932, The London Clinic is one of the UK’s largest independently owned non-profit hospital, with state-of-the-art facilities located on Harley Street. We have circa 1200 employees, a total of 8 premises, and we are dedicated to providing the best, personalised healthcare with a breadth of surgical and medical expertise.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are an organisation that has charitable status and this helps us to drive forward our mission of reinvesting our income to deliver better patient outcomes.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Join a supportive and warm working culture, where your contribution is valued,and you can help us deliver our three core values: Caring, Inspiring and Pioneering, which summarise our belief in integrity, compassion and high quality service.&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "The London Clinic", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132294"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "London", "postalCode": "W1G 6BW"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.523", "longitude": "-.15005"}}, "title": "Theatre Practitioner - Recovery", "url": "https://www.jobs.nhs.uk/xi/vacancy/916229278", "validThrough": "2020-11-30T23:59:59+0000"}