{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 to £51,668 pa"}}, "datePosted": "2020-11-02T09:23:01+0000", "description": "&lt;p&gt;The Women and Children’s Division is looking to appoint an exceptional talent to the role of Specialty Manager.&lt;/p&gt;\n&lt;p&gt;This is a chance for you to build upon your NHS experience in a fast paced and high profile service that represents a key performance area for the Trust.&lt;/p&gt;\n&lt;p&gt;You will take the lead and be responsible for the effective operational and budgetary delivery of a number of specialty areas within the Division and will have a varied and extensive role, working cloesly with clincial colleagues to deliver speciality business plans. You will also take on the lead role for the Divisions People Agenda, working closely with the Divisions HR Business Partnering team.&lt;/p&gt;\n&lt;p&gt;We are looking to appoint an organised and adaptable individual with a proven track record of service delivery, excellent people management skills and experience of collaborative working. This is a demanding position, but one which will offer excellent opportunities for career development and progression.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Helen Back, Interim Divisional Director for Operations for Women and Children’s Division on 01225 826216 or Ed Nicolle, Interim Deputy Divisional Director for Operations for Women and Children&#39;s Division on 01225 824042.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121339.png", "name": "Royal United Hospitals Bath NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121339"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bath", "postalCode": "BA1 3NG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3917", "longitude": "-2.3912"}}, "title": "Specialty Manager **Internal Applications Only**", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251393", "validThrough": "2020-11-08T23:59:59+0000"}