{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum"}}, "datePosted": "2020-11-05T12:46:08+0000", "description": "&lt;p&gt;&lt;strong&gt;CONSULTANTS IN PAEDIATRIC ANAESTHESIA: &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Applications are invited for a number of consultant posts in the Department of Anaesthesia at Birmingham Children’s Hospital. The post holders may be required to work on other Hospital sites where Birmingham Children’s Hospital has a Service Level Agreement to provide anaesthesia. The post holder may be required to undertake one evening theatre session per week. The posts will not involve any duties on the PICU. There may, in the future, be the possibility of an adult Gynaecology list at Birmingham Women’s Hospital. These are replacement posts.&lt;/p&gt;\n&lt;p&gt;The posts will consist of a 10 PA contract involving 7.5 PA for 6 clinical sessions per week, 1.5 PA for supporting professional activity and 1 PA for on call commitments.&lt;/p&gt;\n&lt;p&gt;Birmingham Children’s Hospital is a large, multidisciplinary, dedicated children’s hospital. The Department of Anaesthesia has 39 whole time equivalent consultants. There are 12 specialist registrars in 3 month or 6 month attachments and 4 clinical fellows on a year-long attachment. The Department currently provides general anaesthetic services for over 22,000 procedures per annum. As well as paediatric surgery, urology, cardiology and cardiac surgery, ENT surgery with cochlear implantation, neurosurgery, oncology and haematology, ophthalmology, orthopaedic and trauma services, spinal surgery, paediatric dentistry, plastic surgery including cleft lip and palate work and thoracic surgery, the hospital is also a designated regional and supra regional centre for paediatric burns, craniofacial surgery, complex liver disease and liver transplantation and is the national centre for paediatric small bowel transplantation.&lt;/p&gt;\n&lt;p&gt;Interested applicants should have full GMC registration, have completed Specialist Training, including at least 12 months of paediatric anaesthesia, and be entered on the Specialist Register, or be within 6 months of doing so, at the time of interview.&lt;/p&gt;\n&lt;p&gt;For further information regarding these posts, or to arrange an informal visit to the department please contact Dr Ed Carver, email: edcarver@nhs.net or Dr Ritchie Marcus email: Ritchie.marcus@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120831.png", "name": "Birmingham Women's and Children's NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120831"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Birmingham", "postalCode": "B4 6NH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4852", "longitude": "-1.89446"}}, "title": "Consultant in Paediatric Anaesthesia", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257705", "validThrough": "2020-12-03T23:59:59+0000"}