{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-11-02T10:31:36+0000", "description": "&lt;p&gt;&lt;strong&gt;Corporate Planning Manager&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Strategy and Planning team is recruiting to the position of Corporate Planning Manager.&lt;/p&gt;\n&lt;p&gt;The role will support the Assistant Director - Corporate Planning in the development of the Health Board’s internal planning framework and the development of the Annual Corporate plan and 3 year integrated service, workforce and financial plan. This planning process brings together plans from Clinical Divisions &amp; Corporate Departments together with the Health Boards response to the Welsh Governments planning framework.&lt;/p&gt;\n&lt;p&gt;This is an exciting time to join the team as we build upon our key deliverables in 2020/21 and develop our plans for 2021/22 and beyond. We are therefore seeking an individual who has sound project management and planning skills and interested in developing their skills further in this area.&lt;/p&gt;\n&lt;p&gt;The role will co-ordinate the development of plans that support a comprehensive system of care including primary, community, secondary and tertiary services and impact upon the total health expenditure of North Wales of approximately £1.4bn.&lt;/p&gt;\n&lt;p&gt;This is a senior professional role within the organisation and a key member of the Planning Team, providing direct support, including deputising in their absence, to the Assistant Director – Corporate Planning.&lt;/p&gt;\n&lt;p&gt;The role will work closely as part of the wider department of Planning and Performance, along with staff within Corporate, Area and Divisional Teams, to ensure an integrated approach to the development and the embedding of planning arrangements across the organization.&lt;/p&gt;\n&lt;p&gt;The role will specifically: lead the co-ordination of specific plans to meet local need and national priorities; develop an annual local planning schedule to ensure plans are integrated across operational and corporate teams to deliver sustainable service delivery over the longer term; Work closely with Operational and programme leads who have overall responsibility for the development and implementation of these plans including adopting a consistent local plan format and approach across all planning areas.&lt;/p&gt;\n&lt;p&gt;In turn we can offer a strong team work ethos, commitment to support and develop staff, and commitment to improving outcomes for the population we serve. The team base is flexible for the right candidate but the individual may need to be prepared to travel frequently to work with the team.&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; Welsh and/or English speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt;Closing date: 16th November 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;John Darlington, Assistant Director, Corporate Planning by emailing john.darlington@wales.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123196.JPG", "name": "Betsi Cadwaladr University Local Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123196"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "TBC, TBC", "postalCode": "LL57 2PW"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.209", "longitude": "-4.15983"}}, "title": "Corporate Planning Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251573", "validThrough": "2020-11-16T23:59:59+0000"}