{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "31,365.00 to 37,890.00"}}, "datePosted": "2020-11-03T15:00:46+0000", "description": "&lt;p&gt;&lt;strong&gt;Health Visitor Band 6&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salisbury and surrounding area&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Part Time- 22.5 hours per week&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Are you a thoughtful and dedicated Health Visitor&lt;em&gt; &lt;/em&gt;based in the Wiltshire area? Are you a retired Health Visitor looking to get back to work? Are you looking to join an NHS Health and Social Care partner which is striving to make positive changes?&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Feel Valued &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As a Health Visitor, you’ll be working as part of the NHS system in Salisbury where we deliver services across Wiltshire.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We‘ll offer you:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Flexible working to provide you with that true work / life balance&lt;/li&gt;\n&lt;li&gt;Access to our Strive for Better networks, a national support and professional network made up of NHS professionals like you, giving you the chance to constantly develop industry-leading care and quality&lt;/li&gt;\n&lt;li&gt; We’ll provide you with access to bespoke career pathways and opportunities to continue your professional development, working closely with universities and Health Education England to further your potential and support your progression via in house eLearning, workshops and courses&lt;/li&gt;\n&lt;li&gt;Access to our free Employee Assistance Programme, a service providing expert advice, 24/7/365 online and by telephone covering a wide range of support options such as; counsellors, post trauma incident support, legal, debt and practical life management helplines&lt;/li&gt;\n&lt;li&gt; Virgin Tribe - this grants you access to premier offers as well as discounts on Virgin Products such as holidays&lt;/li&gt;\n&lt;li&gt;Plus the benefits you’d expect from working with and NHS partner, NHS discount, on-site parking, rural attractive locations, easy access to transport links, free fruit, as well as extras such as free hot and cold drinks.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Feel Proud&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Working within the Highpost South team, you will work collaboratively with all agencies supporting children, by delivering high quality assessment, early intervention and advice to provide positive outcomes. You will be based in the South Wiltshire area, covering central Salisbury and surrounding areas from Amesbury to White Parish.&lt;/p&gt;\n&lt;p&gt;As a Health Visitor you will&lt;em&gt;:&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;NMC registration, with a Specialist Community Public Health Nurse, Health Visiting qualification.&lt;/li&gt;\n&lt;li&gt;You will&lt;em&gt; &lt;/em&gt;offer child centred support to children and their families in line with the and Healthy Child Programme 4-5-6 model. &lt;/li&gt;\n&lt;li&gt;Working with our skilled Community Nursery Nurses and wider Public Health Team you will reduce the impact of health inequalities to allow children to participate in daily life and inspire them to reach their full potential.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Feel the Difference &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If you’d like to discuss the role further, or request the full job description, please contact Roanna Ellis via email: Lucy.Binney&lt;em&gt;@&lt;/em&gt;virgincare.co.uk&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Virgin Care&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We’re committed to equal opportunities and welcome a broad diversity of talent to apply. We reserve the right to cease any advertising prior to the published closing date for a role that receives a high number of applications.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;As a Disability Confident Committed company, we work in partnership with the Department of Work and Pensions (DWP) to provide facilities, work environment adjustments and technical solutions to make our business an inclusive place for all.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Virgin Care Limited, its subsidiary companies and the Virgin Care LLPs are part of the Virgin Group and provide publicly funded health and social care services. If you would like to know a little more about how we use your information, please see our website’s privacy policy.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Virgin Care", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127354"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Salisbury", "postalCode": "SP2 8BJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.0439", "longitude": "-1.78981"}}, "title": "Health Visitor", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254450", "validThrough": "2020-11-17T23:59:59+0000"}