{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24907", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,907 per annum pro rata"}}, "datePosted": "2020-11-04T14:46:16+0000", "description": "&lt;p&gt;We are a progressive department in a Trust that encourages and supports quality improvement to deliver the best services we can for our patients. We are actively using skill mix and role development to enhance job content and quality across all levels of the department.&lt;/p&gt;\n&lt;p&gt;Our team of technical and non-technical staff have a high profile within the Trust and we have an opportunity for you to join our friendly and supportive Clinical Pharmacy team at Scunthorpe General Hospital. We are looking to fill 2 x full time posts (37.5 hours) with enthusiastic and forward-thinking Pharmacy Technicians and are happy to consider applicants seeking part time or job-share opportunities.&lt;/p&gt;\n&lt;p&gt;You should be highly motivated with good communication skills, a genuine interest in quality improvement and able to work in a busy and demanding working environment.&lt;/p&gt;\n&lt;p&gt;The successful candidate will perform a range of activities; the core being to work as part of the ward based clinical Pharmacy team, completing medicines reconciliation for our patients and all associated tasks, in addition you will work in the dispensary to undertake some dispensing and final accuracy checking of prescriptions. Training for all areas of work will be provided.&lt;/p&gt;\n&lt;p&gt;We are currently in the process of implementing Electronic Prescribing and Medicines Administration (EPMA) so this is an exciting time to join us as we use this opportunity to review the way we work and develop other services going forward.&lt;/p&gt;\n&lt;p&gt;It is essential that you have a BTEC National Certificate in Applied Sciences (Pharmaceutical) and NVQ level 3 in Pharmacy Services Skills or equivalent and are registered with the General Pharmaceutical Council as a Pharmacy Technician.&lt;/p&gt;\n&lt;p&gt;The post is advertised as a Band 4 or Band 5 Pharmacy Technician depending on experience.&lt;/p&gt;\n&lt;p&gt;We offer a career progression pathway from Band 4 to Band 5 with the following criteria:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;a minimum of 2 years post qualification in hospital pharmacy experience&lt;/li&gt;\n&lt;li&gt;and the completion of a development programme such as CPPE modules relevant to the role or equivalent which demonstrates your ability and competence to works as a Band 5 Pharmacy Technician&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;If you are a registered Pharmacy Technician and want to make the move to hospital and don’t meet the above criteria we can provide the opportunity for applicants to train in the hospital environment, gain the required skills and achieve completion of the required development programme.&lt;/p&gt;\n&lt;p&gt;So if you are interested please contact Vicky Slack –Specialist Pharmacy Technician-Medicines Optimisation for more details by email vicky.slack@nhs.net&lt;/p&gt;\n&lt;p&gt;or telephone 03033 302124&lt;/p&gt;\n&lt;p&gt;The successful candidate will be required to work flexibly in supporting the Trust’s directive of 7 day working, participating in rotas and / or shift working as necessary including weekend and bank holiday working, earlies and late night working.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Vicky Slack, Specialist Pharmacy Technician&lt;/p&gt;\n&lt;p&gt;vicky.slack@nhs.net&lt;/p&gt;\n&lt;p&gt;03033 302124&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121065.png", "name": "Northern Lincolnshire and Goole NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121065"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Scunthorpe", "postalCode": "DN15 7BH"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5875", "longitude": "-.666943"}}, "title": "Pharmacy Technician (Band 4 to 5 depending on experience)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256276", "validThrough": "2020-11-18T23:59:59+0000"}