{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "25000", "minValue": "3300", "unitText": "YEAR", "value": "£25,000 - £33,00 dependent on experience"}}, "datePosted": "2020-10-30T09:47:57+0000", "description": "&lt;p&gt;&lt;strong&gt;Job Summary&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen to join our multidisciplinary expert and professional team within an Outstanding rated Hospital. Do you put your patients at the heart of everything you do and constantly strive to do things better? Then we want to hear from you. We are looking for a Recovery Practitioner to join our Theatre team on a fixed term contract for 12 months.&lt;/p&gt;\n&lt;p&gt;We offer high quality treatment in a wide range of specialities, in clean, modern and comfortable surroundings, and are dedicated to delivering the highest standards of quality and safety, ensuring our patients feel better, faster.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As an NMC registered Nurse or an HCPC registered Operating Department Practitioner you will be expected to provide the highest standard of care and safety for patients in recovery. You will be competent in all aspects of clinical practice within recovery which will include maintaining clinical observation of patients, interpreting the significance of data to the patient’s status and effectively communicating the data within the team.&lt;/p&gt;\n&lt;p&gt;You will have recent clinical experience gained in a recovery environment and have sound infection prevention and control knowledge. Just as important is your desire to develop and learn in the role, your communication skills and your ability to support junior staff.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Working at Practice Plus Group&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;In turn we will support you to help you grow in your role and take your career in the direction you want to go. We’ll help you be the best you can be. When you’re part of the Practice Plus Group team, you don’t just have a job. You have a career.&lt;/p&gt;\n&lt;p&gt;Everything we do is focused on providing a high standard of safe and effective patient care. As a CQC Outstanding rated hospital we believe in developing and nurturing our people.&lt;/p&gt;\n&lt;p&gt;We want our team members to feel motivated and rewarded. So we offer a competitive package of pay and benefits. We also recognise the value of a healthy work-life balance – so we always try to be flexible, helping you fit your working life around your home life.&lt;/p&gt;\n&lt;p&gt;To apply for the role click on the link below. If you have any questions contact Sonia Sanghviin our friendly resourcing team.&lt;/p&gt;\n&lt;p&gt;We will contact all shortlisted candidates but please note Practice Plus Group retain the right to remove the advert prior to the closing date if a suitable candidate is appointed. Our employment offers are subject to receipt of satisfactory pre-employment checks. At Practice Plus Group, we actively promote diversity and equal opportunities. Applicants must have the right to work in the EU.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Practice Plus Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130136"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Shepton Mallet", "postalCode": "BA4 4LP"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.1897", "longitude": "-2.56288"}}, "title": "Recovery Practitioner - Fixed Term", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249550", "validThrough": "2020-11-27T23:59:59+0000"}