{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "38838", "minValue": "33624", "unitText": "YEAR", "value": "£33,624 - £38,838 per annum"}}, "datePosted": "2020-10-26T20:03:19+0000", "description": "&lt;p&gt;&lt;strong&gt;Fundraising &amp; Product Development Manager&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;37.5 hours per week&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;£33,624 - £38,838 per annum&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are recruiting for a Fundraising &amp; Product Development Manager. Through the strategic and operational delivery of the overarching Fundraising Framework you will work to attain agreed community based targets and budgets, leading your team to achieve all KPIs and to promote the work of Keech Hospice Care&lt;/p&gt;\n&lt;p&gt;Working to review, analyse and develop current and new appeals, events, products and messaging you will use innovative methods to secure long-term sustainable income growth.&lt;/p&gt;\n&lt;p&gt;As the lead in fundraising development within the team you have responsibility to identify and provide opportunities for secure and sustainable income across all funding streams. In addition, you will identify and exploit Intellectual Property opportunities for Keech Hospice Care to build and secure future income.&lt;/p&gt;\n&lt;p&gt;With a supporter centric appeals driven approach to prospecting and fundraising you will work with key corporates, individuals, groups, partners, and organisations to ensure we reach all business sectors for donor acquisition. Identify, develop and maximising fundraising opportunities and income from all sectors, particularly high-level corporates. You will create strategic opportunities for giving and long-term partnerships.&lt;/p&gt;\n&lt;p&gt;You will play a key role in securing and developing new partnerships for Keech Hospice Care. Alongside this you will need to ensure our existing donors receive the support they require to fulfil a mutually beneficial relationship through proactive account management.&lt;/p&gt;\n&lt;p&gt;You will also be required to contribute to the development, overall performance, and financial achievements of the whole fundraising team. &lt;/p&gt;\n&lt;p&gt;Along with an ongoing commitment to education and training, other benefits include a work place pension or the option to continue with an NHS pensions if already contributing, on-site free parking, cycle to work scheme, access to Simply Health (health cash plan), access to EAP (Employee Assist Programme), subsidised meals in our restaurant, and the opportunity to purchase annual leave.&lt;/p&gt;\n&lt;p&gt;If you wish to apply, please complete an application form. CV&#96;s received in isolation will not be considered for interview.&lt;/p&gt;\n&lt;p&gt;Interviews will be taking place week commencing 23rd November 2020.&lt;/p&gt;\n&lt;p&gt;We are committed to promoting equality of opportunity across our workforce and particularly welcome applications from minority groups&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Keech Hospice Care", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133694"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Keech Hospice Care, Luton", "postalCode": "LU3 3NT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.9281", "longitude": "-.438709"}}, "title": "Fundraising &amp; Development Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243637", "validThrough": "2020-11-15T23:59:59+0000"}