{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-11-02T15:32:28+0000", "description": "&lt;p&gt;The Podiatry service is provided across the city of Newcastle upon Tyne, In Clinics, Outpatients Departments, In- patients, Care Homes and patient homes.&lt;/p&gt;\n&lt;p&gt;The Podiatry Service works from 2 main team sites and working base will be arranged according to the needs of the service.&lt;/p&gt;\n&lt;p&gt;An opportunity has arisen for an enthusiastic and motivated Podiatrist to join our Community Podiatry service on a temporary basis. If you believe you are forward thinking, dedicated and with good clinical skills then we would like you to apply.&lt;/p&gt;\n&lt;p&gt;Our service involves treating a diverse patient cohort, many of whom have complex needs&lt;br /&gt;You will be required to provide a range of high quality podiatric interventions in a variety of clinical and domiciliary settings.&lt;/p&gt;\n&lt;p&gt;You must possess excellent communication and interpersonal skills and be able to build and develop effective working relationships within the podiatry teams and with other healthcare professionals. We expect high levels of verbal, written and interpersonal skills accompanied by good IT ability. We will support you in developing your clinical skills, expertise and learning needs.&lt;br /&gt;&lt;br /&gt;You must possess a degree/diploma in Podiatry, and be registered with the Health and Care Professions Council as POM-A, prescription only medicines -administration.&lt;/p&gt;\n&lt;p&gt;Applicants are required to be able to work flexibly across the City of Newcastle upon Tyne and you must have a driving licence and access to your own transport for work purposes.&lt;/p&gt;\n&lt;p&gt;Full Time 37 Hours 30 Minutes/Week&lt;/p&gt;\n&lt;p&gt;For further information or an informal discussion about this post please contact: Nicola Coates, Podiatry Head of Service&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Nicola Coates&lt;/p&gt;\n&lt;p&gt;0191 2823431&lt;/p&gt;\n&lt;p&gt;nicola.coates2@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121053.jpg", "name": "The Newcastle upon Tyne Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121053"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "317 Geoffrey Rhodes Centre", "postalCode": "NE6 2UZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.9797", "longitude": "-1.57608"}}, "title": "Podiatrist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252645", "validThrough": "2020-11-12T23:59:59+0000"}