{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "33403", "minValue": "25603", "unitText": "YEAR", "value": "£25,603.50 - £33,403.50 per annum"}}, "datePosted": "2020-10-12T11:35:28+0100", "description": "&lt;p&gt;About The Role&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for a highly motivated &lt;strong&gt;Speech and Language Therapist &lt;/strong&gt;to work alongside other dedicated colleagues from Psychiatry, Psychology, Occupational Therapy and Nursing to share knowledge and skills. We enjoy excellent working relationships with colleagues from other professions and close multi-disciplinary working is firmly embedded in our culture. We would be delighted to speak to you If you’ve previously worked for the&lt;strong&gt; NHS.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt; We welcome applications from &lt;strong&gt;HCPC registered Speech and language Therapists &lt;/strong&gt;with a passion for supporting adults with learning disabilities, autism and mental health problems. You will have exceptional interpersonal skills, and have ideally had some experience of working with people with a learning disabilities, autism and mental health problems.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;strong&gt;Information about Eldertree Lodge &lt;/strong&gt;&lt;br /&gt; At Eldertree we provide specialist short term high dependency locked rehabilitation and support for adults with learning disabilities, autism, mental health problems and challenging behaviour including offending behaviour. Our site is split into six wards each comprising of six bedrooms.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt; Our aim is to help patients move into the community as soon as possible and to improve each patient’s longer term outcome. This is achieved by proving a high quality safe and secure environment that encourages the development of skills and competencies. &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the Job &lt;/strong&gt;&lt;br /&gt; You will be required to assess, diagnose and play a key role in the management of adults with complex communication needs and behaviours that challenge. You will support individual patients and people who work with the patients to promote functional communication systems and optimal independence&lt;/p&gt;\n&lt;p&gt;We are looking for an existing band 5 or an ambitious newly qualified Speech and language Therapist with: &lt;br /&gt;• Excellent interpersonal skills &lt;br /&gt;• Strong clinical and professional skills &lt;br /&gt;• Experience or a keen interest in learning disabilities, autism and mental health problems &lt;br /&gt;• Understanding of Positive behaviour support &lt;br /&gt; Good organisational and management skills &lt;br /&gt;&lt;br /&gt;&lt;strong&gt;As a service we can offer: &lt;/strong&gt;&lt;br /&gt;• An opportunity to work with a varied and interesting caseload &lt;br /&gt;• 1:1 Monthly Clinical Supervision from an excellent external supervisor with support in completing RCSLT newly qualified competences and additional dysphagia competences (if required) &lt;br /&gt;• 1:1 Monthly Management Supervision from a senior member of the Therapies Department &lt;br /&gt;• An opportunity to work in an innovative and motivated team &lt;br /&gt;• Induction training and access to additional CPD to support competency development &lt;br /&gt;• Flexible working arrangements &lt;br /&gt;• Full support from a multidisciplinary team About You&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;As a company we can offer: &lt;br /&gt;&lt;/strong&gt;• Clear pay structure, with competitive rates &lt;br /&gt;• Generous annual leave entitlement &lt;br /&gt;• Sick pay of 4 weeks full pay and 4 weeks half pay &lt;br /&gt;• The opportunity to participate in a company contributory pension scheme with up to 3% matching contributions &lt;br /&gt;• Maternity leave at 3 month’s full pay and 3 month’s half pay &lt;br /&gt;• 2 weeks paid paternity leave &lt;br /&gt;• Shared parental leave, matching the maternity leave benefit &lt;br /&gt;• Death in service benefit equivalent to 2 x salary &lt;br /&gt;• A range of staff discounts &lt;br /&gt;• Opportunities for training and development &lt;br /&gt;• Employee Assistance Program (EAP)&lt;/p&gt;\n&lt;p&gt;We welcome applications from everyone irrespective of ethnic origin, gender, age, gender identity, sexual orientation, religion, marital status, disability or social background. This is a great opportunity for someone to make a difference. About The Company&lt;/p&gt;\n&lt;p&gt;Huntercombe Group are one the leading specialist healthcare providers, with hospital and centres throughout England and Scotland, delivering wide ranging services in adult mental health and learning disabilities, specialist brain injury, child and adult mental health services (CAMHS) including eating disorders and social care for children with special needs.&lt;br /&gt; Our aspiration is to nurture the world, one person at a time and that’s why everything we do is designed to provide the best care and recovery for our patients and residents&lt;br /&gt; We’re proud to have recruited some of the most experienced doctors, nurses and therapists in their fields and alongside our supportive stable Management structure we hope that it’s you that can help make a difference to our excellent teams and workforce.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/130001.jpg", "name": "The Huntercombe Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130001"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Market Drayton, Staffordshire", "postalCode": "TF9 4LX"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9291", "longitude": "-2.35599"}}, "title": "Speech and Language Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916222139", "validThrough": "2020-11-16T23:59:59+0000"}