{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 Per Annum"}}, "datePosted": "2020-10-26T13:17:03+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for a qualified Registered Nurse or Operating Department Practitioner to join our highly-skilled and dedicated Recovery Team, working in our state of the art Theatres at St Helens and Knowsley Teaching Hospitals NHS Trust.&lt;/p&gt;\n&lt;p&gt;Applicants must be registered with the NMC or HCPC and should be enthusiastic, self-motivated with a commitment to provide quality patient care within the post -operative phase of the patients journey. The post holder must be enthusiastic, flexible have good communication skills and be a team player. Suitable applicants will have demonstrable experience, mentorship is provided for staff new in post.&lt;/p&gt;\n&lt;p&gt;The post holder may be required to work across both Whiston and St Helens sites and must be flexible to work weekends evenings and on call.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;An Enhanced DBS Certificate with the checking of the Children’s and Adults’ Barred Lists is required for this post.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interviews for this position will take place on Monday 16th November 2020. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;St Helens &amp; Knowsley Teaching Hospitals NHS Trust is the BEST acute Trusts in England for the THIRD year running!&lt;/p&gt;\n&lt;p&gt;The Trust is currently the only acute Trust in Cheshire and Merseyside, and is one of few in the entire country, to achieve the title of OUTSTANDING, rated by the Care Quality Commission.&lt;/p&gt;\n&lt;p&gt;We provide a full range of acute adult services to our local population of circa 350,000 and provide tertiary services across a much wider area in the North West, North Wales and Isle of Man. We are also a Major Trauma Unit and the Mersey Regional Burns Unit.&lt;/p&gt;\n&lt;p&gt;Our &#39;5 Star Patient Care&#39; strategy is at the heart of all that we do; supporting our vision to provide world class services for all our patients by getting it right for every patient, every time.&lt;/p&gt;\n&lt;p&gt;Our latest achievements include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Acute Trust of the Year – HSJ Awards November 2019&lt;/li&gt;\n&lt;li&gt;Trust rates Outstanding by the CQC – Inspection August 2018 and March 2019&lt;/li&gt;\n&lt;li&gt;Best in the NHS, Patient Led Assessment of the Care Environment 2017 and 2018&lt;/li&gt;\n&lt;li&gt;The Trust achieved top marks in the country for areas including; cleanliness, food, privacy and dignity, facilities for patients living with dementia and disabilities, conditions, appearance and maintenance of the hospital buildings.&lt;/li&gt;\n&lt;li&gt;Top 100 places to work in the NHS (NHS Employers and Health Service Journal)&lt;/li&gt;\n&lt;li&gt;Best acute Trust in England (NHS Staff Survey 2017,2018 and 2019)&lt;/li&gt;\n&lt;li&gt;Best Patient Experience in the NHS (CHKS Top Hospitals Awards 2015)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;In the NHS Staff Survey 2019 the Trust scored the highest marks in the following areas;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Best place to receive treatment in the NHS (for 2nd year running)&lt;/li&gt;\n&lt;li&gt;Top Acute Trust for treating its staff fairly with regards to career progression (for 3rd year running)&lt;/li&gt;\n&lt;li&gt;Quality of care (best score for 5th year running)&lt;/li&gt;\n&lt;li&gt;Staff engagement (best score for 4th year running)&lt;/li&gt;\n&lt;li&gt;Staff morale (best score for 2nd year running)&lt;/li&gt;\n&lt;li&gt;Bullying and harassment (best score for 2nd year running)&lt;/li&gt;\n&lt;li&gt;Safety culture (best score for 2nd year running)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Our staff rated our Trust as the best place to work and receive treatment. The Trust has also been recognised, for the third year running, as being the top acute Trust in the entire country for staff engagement, staff motivation, and pride in the quality of care we provide to patients.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameTony HartJob titleTeam Lead Theatre RecoveryEmail addressTony.Hart@sthk.nhs.ukTelephone number0151 430 2800&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121089.jpg", "name": "St Helens and Knowsley Teaching Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121089"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Whiston Hospital, Prescot", "postalCode": "L35 5DR"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4201", "longitude": "-2.78641"}}, "title": "Recovery Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242634", "validThrough": "2020-11-08T23:59:59+0000"}