{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 pa"}}, "datePosted": "2020-10-28T10:00:13+0000", "description": "&lt;p&gt;&lt;strong&gt;The Rotherham NHS Foundation Trust&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Pharmacy Technician&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Technical Services &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Band 4/5&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;37.5 hours&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for a Pharmacy Technician to join our dedicated team in Technical Services at the Rotherham NHS Foundation Trust. The post is 37.5 hours per week on a permanent basis.&lt;/p&gt;\n&lt;p&gt;The Technical Services team commissioned and relocated its services to a brand new aseptic unit in 2017. The department is highly regarded and valued within the Trust and has strong involvement in multidisciplinary working. We provide Chemotherapy, Parenteral Nutrition and CIVA services. The unit also supplies a variety of emergency kits to the Trust and prepares non-sterile extemporaneous medicines when required. We are committed to providing a quality, safe, patient centred service to both inpatients and outpatients of the Trust.&lt;/p&gt;\n&lt;p&gt;This post is open to applicants who meet either the Band 4 or Band 5 Person Specification. If the successful applicant meets the specification for the Band 4 post, they will have the opportunity to progress to a Band 5 position upon successful completion of the competencies and experience required for the higher role.&lt;/p&gt;\n&lt;p&gt;Applicants should be highly motivated. It is essential that the successful candidate has excellent communication skills and can work well as part of a team to achieve positive patient and service user outcomes. Candidates should also have the ability to use initiative and work autonomously. They should be able to work accurately and efficiently under pressure whilst maintaining high standards and following established procedures.&lt;/p&gt;\n&lt;p&gt;In addition, Band 5 level applicants should be able to assist in the day to day running of the unit. Previous post-registration experience of working in an aseptic unit is essential as you will be expected to be a competent aseptic operator, pre-and in-process accuracy checker, and to have a good understanding of the principles of Good Manufacturing Practice. The role will involve training and leading others at times.&lt;/p&gt;\n&lt;p&gt;If you are looking for a new challenge or to build on existing aseptic experience, we would be interested in hearing from you. For further information, please contact:&lt;/p&gt;\n&lt;p&gt;Rachael Stenton, Lead Pharmacy Technician - rachael.stenton@nhs.net, 01709 424279&lt;/p&gt;\n&lt;p&gt;Leanne Price, Lead Pharmacy Technician - leanne.price5@nhs.net, 01709 424279&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;PLEASE SEE BAND 4 &amp; 5 JOB DESCRIPTION AND PERSON SPECIFICATION&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121484.png", "name": "The Rotherham NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121484"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Rotherham", "postalCode": "S60 2UD"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4144", "longitude": "-1.34257"}}, "title": "Senior Pharmacy Technician", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245932", "validThrough": "2020-11-07T23:59:59+0000"}