{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum"}}, "datePosted": "2020-11-06T14:30:53+0000", "description": "&lt;p&gt;&lt;strong&gt;THIS POST IS FIXED TERM /SECONDMENT FOR 12 MONTHS DUE TO MEET THE NEEDS OF THE SERVICE &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;IF YOU ARE INTERESTED IN APPLYING FOR THE SECONDMENT POSITION, YOU MUST OBTAIN PERMISSION FROM YOUR CURRENT LINE MANAGER PRIOR TO APPLYING FOR THIS POST. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Head of Service – Community Hospitals (8C)&lt;br /&gt;Assistant Head of Service – Community Hospitals (8A)&lt;br /&gt;Are you looking for an exciting opportunity to shape, change and integrate primary and community services to meet the exciting and challenging agenda set out within Clinical Futures, Healthier Wales and Care Closer to Home strategies. &lt;br /&gt;We are looking to review the current focus on our community hospital and as such are looking to appoint two highly motivated and conscientious senior managers to work within the Community and Primary Care Division. The team will be responsible for leading and delivering an extensive portfolio of strategic and operational programmes across the community sites to deliver high quality, patient centred services.&lt;br /&gt;They will focus on working with the integrated teams to improve the patient experience and increase productivity and efficiency through the development of best in class, modern healthcare services and the whole system redesign of services closer to home. &lt;br /&gt;This senior management team will be responsible for the robust management of community hospitals beds across the Health Boards footprint, to include: &lt;br /&gt;• Ysbyty Aneurin Bevan (YAB)&lt;br /&gt;• County Hospital&lt;br /&gt;• St Woolos Hospital&lt;br /&gt;• Chepstow Hospital**&lt;br /&gt;(Alternative models are in place for North Resource Centre &amp; Monnow Vale as part of placed based care).&lt;br /&gt;The main objective of this team in conjunction with the senior nursing team is to ensure that patient care of the highest standards is maintained, whilst ensuring optimal use of hospital site resources and capacity. &lt;br /&gt;They will have specific responsibility for the leadership and management of the ward areas including the work force. This will also include responsibility for the improvement of patient flow from admission to discharge throughout the Hospital sites for which they are responsible.&lt;br /&gt;They will need to establish and maintain a strong team based development programme including maintaining links with the wider borough teams. They will also provide wider role model and development across a wide spectrum of general and operational management site/flow related issues.&lt;/p&gt;\n&lt;p&gt;If you enjoy working at both an operational and strategic level and have an understanding of a range of issues across the NHS, we want to hear from you.&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; Welsh and/or English speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt;Closing date: 19th November 2020&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Tracy Morgan, General Manager on 01495 241286 /tracy.morgan2@wales.nhs.uk&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;", "employmentType": "OTHER", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123197.jpg", "name": "Aneurin Bevan University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123197"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Llanarth house initially, Newbridge", "postalCode": "NP44 8YN"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6463", "longitude": "-2.99634"}}, "title": "Assistant Head of Service - Community Hospitals", "url": "https://www.jobs.nhs.uk/xi/vacancy/916260123", "validThrough": "2020-11-19T23:59:59+0000"}