{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 pa (Plus HCAS)"}}, "datePosted": "2020-11-05T14:46:19+0000", "description": "&lt;p&gt;&lt;strong&gt;Advert&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for a highly motivated Band 6 Occupational Therapist with an interest in providing community based intensive rehabilitation to people in their own homes within the NELFT’s Intensive Rehabilitation Service (IRS). The IRS is a large multi-disciplinary consisting of occupational therapists, physiotherapists and nursing staff.&lt;/p&gt;\n&lt;p&gt;We are an ever expanding community based service with lots of new and exciting service developments happening right now. These include discharge to assess, in reaching and early supported discharges and we are looking for a motivated and enthusiastic band 6 to help guide these!&lt;/p&gt;\n&lt;p&gt;We provide a service from 8am – 8pm over 7 days. Our working days cover a two shift pattern – an early shift (8.30am – 16.30) and a late shift (12noon – 8pm). All staff generally complete 2 late shifts per month. To provide cover for weekend shifts, OTs generally complete 1 day out of the weekend every 4 weeks. Shifts completed are flexible within the team.&lt;/p&gt;\n&lt;p&gt;Within IRS we offer regular supervisions, informal and formal, monthly OT CPD meetings both within IRS and an opportunity to attend trust wide CPD sessions. We have a comprehensive in-service training timetable and access to external relevant training opportunities.&lt;/p&gt;\n&lt;p&gt;This post also offers a High Cost Area Supplement of 15% of the basic salary (with a minimum of £3,483 to a maximum of £4,439).&lt;/p&gt;\n&lt;p&gt;The intensive rehabilitation service is a progressive, innovative and proactive team with a strong social media presence.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Are you enthusiastic and passionate about working with community based patients with complex needs? Are you confident in your clinical skills to provide complex rehabilitation and able to offer the appropriate advice and support to more junior members of the team&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameJay SundersinghJob titleB7 Occupational TherapistEmail addressjay.sundersingh@nelft.nhs.ukTelephone number03003001836&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NELFT NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120606"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Goodmayes Hospital, Goodmayes", "postalCode": "IG3 8XJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.578", "longitude": ".110514"}}, "title": "Band 6 Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258164", "validThrough": "2020-11-19T23:59:59+0000"}