{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "90719", "minValue": "90719", "unitText": "YEAR", "value": "£90,719 per annum"}}, "datePosted": "2020-11-03T14:47:13+0000", "description": "&lt;p&gt;&lt;strong&gt;Patient Safety Specialist &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Essex Partnership University NHS Foundation Trust is currently looking to recruit an experienced, compassionate and motivated individual to join our Nursing Directorate as the Trust’s Patient Safety Specialist.&lt;/p&gt;\n&lt;p&gt;This is a new role and we are seeking an individual that holds and demonstrates our Trust values of being open, compassionate and empowering at all times. Our Trust vison is working to improve lives and this role will play a vital part in ensuring the organisation continues to strive to excellent standards of patient safety and care.&lt;/p&gt;\n&lt;p&gt;The role will report directly in to the Executive Nurse and will be responsible for taking forward the strategic and corporate agenda for patient safety. You will provide dynamic, senior leadership, visibility and expert support to the patient safety work across the organisation.&lt;/p&gt;\n&lt;p&gt;As the Trust’s Patient Safety Specialist you will develop and lead networks to share good practice, learning from each other, whilst overseeing patient safety improvement activity, ensuring that systems thinking, human factors understanding and just culture principles are embedded.&lt;/p&gt;\n&lt;p&gt;The post holder will also be responsible for leading the development of a patient safety culture and safety systems whilst engaging directly with the Trust’s Executive Team. It is therefore imperative that the successful applicant will have considerable experience of working in a similar type role, with specialist knowledge of patient safety, human factors and improvement experience, which may have been developed through practical experience, post graduate training or short courses.&lt;/p&gt;\n&lt;p&gt;EPUT are currently system partners within 3 Sustainability Transformation Programmes within Essex and therefore a highly skilled communicator with experience of collaborative working would also be beneficial.&lt;/p&gt;\n&lt;p&gt;If you would like more information on this role please contact Natalie Hammond, Executive Nurse by email nataliehammond@nhs.net and we look forward to receiving your application.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;EPUT are looking for motivated staff who shares our Trust values of Open, Compassionate and Empowering. In return, EPUT can offer you a range of benefits and development including;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Season Ticket Loans&lt;/li&gt;\n&lt;li&gt;NHS discounts for staff&lt;/li&gt;\n&lt;li&gt;Excellent Training facilities and opportunities&lt;/li&gt;\n&lt;li&gt;Buying and Selling annual leave scheme&lt;/li&gt;\n&lt;li&gt;The opportunity to work bank shifts and expand knowledge and experience in other areas&lt;/li&gt;\n&lt;li&gt;Salary Sacrifice schemes including lease cars and Cycle to Work&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Natalie Hammond Email address nataliehammond@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120994.jpg", "name": "Essex Partnership University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120994"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Lodge, Wickford", "postalCode": "SS11 7XX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.635", "longitude": ".541768"}}, "title": "Patient Safety Specialist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254417", "validThrough": "2020-11-17T23:59:59+0000"}