{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "36738", "minValue": "29888", "unitText": "YEAR", "value": "£29,888 - £36,738 per annum inclusive of HCAS"}}, "datePosted": "2020-10-13T14:31:36+0100", "description": "&lt;p&gt;Ward 6 South is seeking a motivated Band 5 Staff Nurses to join our exciting multidisciplinary team.&lt;br /&gt;&lt;br /&gt;6 South is a 28 bedded ward that provide care to patients with a variety of interesting neurological conditions and patients who require rehabilitation following their acute stroke. We are a recognised regional specialist center and receive referrals from all over UK and abroad.&lt;br /&gt;&lt;br /&gt;Some of our patients require tracheostomy and CPAP (Continuous Positive Airway Pressure) care, and we will ensure that you will receive training in these specialist skills. You will have the support of our experienced band 6&amp;7 nursing team, therapists, doctors and colleagues. We run weekly ward teaching sessions and keen to provide more on other specialties.&lt;br /&gt;&lt;br /&gt;We are looking for nurses that have an interest in working in this specialised and rewarding area, to join our team. We want nurses who are highly motivated and passionate about delivering high quality care in accordance with our world class care values.&lt;br /&gt;&lt;br /&gt;This is an excellent opportunity to develop your clinical knowledge and skills.&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Due to social distancing and Covid 19 pressures you will be contacted if successful in shortlisting with further details regarding test (if required) and interview. We will use Skype and similar to conduct testing and interviews. Due to challenging times we are experiencing you may be asked to go to different departments and work under difficult circumstances.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Mehaad Husnoo&lt;/p&gt;\n&lt;p&gt;Ward Manager&lt;/p&gt;\n&lt;p&gt;mehaad.husnoo@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120624.jpg", "name": "Royal Free London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120624"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Royal Free Hospital, London", "postalCode": "NW3 2QG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5532", "longitude": "-.165298"}}, "title": "Band 5 Staff Nurse - 6 South", "url": "https://www.jobs.nhs.uk/xi/vacancy/916224708", "validThrough": "2020-11-08T23:59:59+0000"}