{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683"}}, "datePosted": "2020-10-29T13:01:06+0000", "description": "&lt;p&gt;An exciting new opportunity has arisen for a Locum Consultant Gastroenterologist. The successful post holder will work across sites, predominantly the John Radcliffe in Oxford and the Horton Hospital in Banbury.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be expected to have a broad experience in Gastroenterology. The individual will be responsible for the provision of a high quality clinical service to patients with gastrointestinal problems, including inpatients, day-cases, emergencies and outpatients, and will also contribute to the endoscopy service.&lt;/p&gt;\n&lt;p&gt;The inpatient base is a 19-bed Hepatology and Gastroenterology Ward and there is a 6-bed Day Case Unit. There are 250m2 of newly furbished research laboratories, a Gastroenterology Clinical Trials Facility and seminar rooms all co-located on level 5 at the John Radcliffe Hospital, while main outpatients are on level 2. Patients with gastrointestinal diseases are also managed at the Horton General Hospital, Banbury, where Gastroenterology outpatient clinics are also conducted.&lt;/p&gt;\n&lt;p&gt;Within the Gastroenterology and Hepatology Department there is a vibrant academic program of clinical and translational research in gastrointestinal diseases and close links with researchers in the Translational Gastroenterology Unit and Oxford University.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameMark Scarfe and /or Adam BaileyAdditional contact information&lt;/p&gt;\n&lt;p&gt;Candidates are highly recommended to visit the department and hospital and are invited to contact:&lt;/p&gt;\n&lt;p&gt;Dr Mark Scarfe, Clinical Director of Gastroenterology, Endoscopy and Theatres (Mark.Scarfe@ouh.nhs.uk) or&lt;/p&gt;\n&lt;p&gt;Dr Adam Bailey, Clinical Lead of Gastroenterology (01865 572607).&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Oxford University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120889"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "John Radcliffe Hospital, Oxford", "postalCode": "OX3 9DU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7639", "longitude": "-1.21979"}}, "title": "Locum Consultant - Gastroenterology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248427", "validThrough": "2020-11-12T23:59:59+0000"}