{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 pa &amp; 15% HCAS"}}, "datePosted": "2020-10-28T08:52:53+0000", "description": "&lt;p&gt;NHS Blood and Transplant (NHSBT) offers the most unique working environment. Passionate about maintaining our world class reputation for excellence in the fields of transplant and transfusion, we aren’t afraid to challenge conventional thinking. What that translates to is a dynamic organisation in which medical breakthroughs are celebrated across the team, and change initiatives are welcomed. Never has that been more relevant than when considering the ongoing issues relating to infection, and when you join us in this fast-paced role, you will be at the helm of this fascinating challenge. With the scope to implement bold initiatives and make your mark across the entire organisation, this is a career defining role that will deliver unparalleled opportunities for career progression.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Infection prevention and control (IPC) underpins all that we do at NHSBT. Helping us adopt the clinical management approaches and systems needed to maintain our high standards, you will ensure that all decisions are evidence based, and you will be responsible for the policies and guidelines that determine future working practices. Shaping and leading an IPC strategy for all relevant groups (including staff, donors and patients, you will deliver highly specialised clinical advice on all IPC issues, using your findings from risk assessment, surveillance and audits to determine the measures that need to be put in place. Through creative intervention and education, you will see to it that all staff are meeting your exacting standards, and as an astute problem-solver, you will strive for a zero-tolerance approach to inappropriate clinical practices.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About you&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you are excited about the chance to embed change across a forward-thinking organisation, you will be an excellent addition to our friendly and collaborative team. To excel in this role, you will therefore be a Registered Nurse (Adult Level 1) with expert knowledge and clinical achievements in the field. You will also:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Have exceptional verbal and written communication skills with the capacity to engage with and influence a multitude of different audiences. As such, you will also have solid presenting skills.&lt;/li&gt;\n&lt;li&gt;Be a strong and accountable leader with significant senior clinical or management experience. As such, you will be highly articulate and persuasive.&lt;/li&gt;\n&lt;li&gt;Be fluent in all IPC guidance and regulations, with a background in change management or service development.&lt;/li&gt;\n&lt;li&gt;Be ready to embrace partnership working with both local and national organisations.&lt;/li&gt;\n&lt;li&gt;Have experience of teaching within a clinical practice context.&lt;/li&gt;\n&lt;li&gt;Be able to confidently use Word, Excel and PowerPoint.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About us&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Join our ambitious colleagues, and you will see why so many NHSBT staff forge long careers within the organisation. Firstly, we are committed to developing talent and promoting from within, so you will be privy to the most exciting opportunities throughout your career. Secondly, we will ensure you have the skills needed to achieve your ambitions, and with plenty of training opportunities within our Shine Academy, we will help you secure your long-term goals. Thirdly, we will help you achieve the ideal work/life balance with flexible hours and generous annual leave. And lastly, we will provide you with a financially-secure future through multiple staff discounts, and a generous benefits package that includes a competitive pension scheme. So whatever you want to achieve in your career – do it with NHSBT.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The normal working hours for this role are 37.5 hours per week over 5 days, 7.5 hours per day during the hours of 08:30am – 17:30pm. An out of hours rota has been established to support testing and tracing of staff during the COVID-19 pandemic, it is anticipated that you would participate in this rota (until 8pm weekdays and daytime at weekends).&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This role will also attract a 15% Outer London High Cost Area Supplement (extra £3,784 - £4,822pa).&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;To find out more about this exciting role, please contactDr Su Brailsford - Interim Associate Medical Director: Manufacturing and Microbiology via email at: su.brailsford@nhsbt.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This vacancy will close at 23:59 on Sunday 15th November 2020.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Interviews are expected to take place W/c 30th November 2020 (date to be confirmed).&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NHS Blood and Transplant (NHSBT)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120628"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Colindale Blood Centre", "postalCode": "NW9 5BG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5958", "longitude": "-.25616"}}, "title": "Lead Infection Prevention Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245765", "validThrough": "2020-11-15T23:59:59+0000"}