{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Dependent on experience"}}, "datePosted": "2020-11-05T10:51:32+0000", "description": "&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Birmingham Clinical Pharmacist Vacancy&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This is an exciting time for the Modality Birmingham Division. We are looking for a highly motivated clinical pharmacist to work across our division. You will be an integral part of a new Prescriptions Management Team; working with the Divisional Lead Clinical Pharmacist helping to provide an effective service to our patients as well as developing and delivering a forward thinking service in a stimulating environment ……Does this sound like the opportunity for you? Are you up for the challenge? If so read on………?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Clinical Pharmacist will have a key role in supporting delivery of the Prescriptions Management Service in Birmingham. We are keen to develop and work with a clinical pharmacist who wants to be part of cutting edge frontline clinical practice. A self motivated individual with the vision to provide innovative clinical care to our patients, the ideal candidate will posses the right mix of relevant experience and the right approach to working in tandem with a talented multi-professional care team in a fast moving environment. You will work as part of a multi-disciplinary team to develop and run processes for repeat prescription re-authorisation, management of medicines on transfer of care and systems for safer prescribing. There will also be opportunity to develop clinical skills, especially in long term condition management.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We would welcome applications from pharmacists with a minimum of 2 years post-graduate experience. The successful candidate will also be required to have the independent prescribing qualification .The successful candidates will have a degree in pharmacy. A post-graduate diploma or higher degree in clinical pharmacy is desirable.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Candidates with the appropriate level of experience and qualifications will be expected to mentor, support and develop pharmacy colleagues across Birmingham.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We offer competitive salaries, a generous annual leave entitlement, access to the NHS Pension scheme and a commitment to developing the skills of our workforce as part of our overall remuneration package.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are looking for self-starters who are able to work well as part of a team as well as on their own initiative. The ability to work well under pressure is also an important consideration for any successful candidate &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If you are a positive, confident and organised individual who adopts a flexible ‘can do’ attitude to your work coupled with a focus on high quality service then one of these roles within a fast-paced and continuously developing environment could be just right for you.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For an informal discussion about the role please contact Jayne Hunt, General Manager: Jayne.hunt1@nhs.net&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing date for applications: Thursday 19th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt; &lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Modality Birmingham", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=136174"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Smethwick", "postalCode": "B66 3BQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4949", "longitude": "-1.9679"}}, "title": "Clinical Pharmacist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257321", "validThrough": "2020-11-19T23:59:59+0000"}