{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "38890", "minValue": "38890", "unitText": "YEAR", "value": "38890"}}, "datePosted": "2020-11-05T16:00:52+0000", "description": "&lt;p&gt;Bow Health Primary Care Network (PCN) is seeking enthusiastic, forward-thinking pharmacists to join our growing team. We are looking to recruit1.5 CP to work across our high performing gp practices in the network&lt;/p&gt;\n&lt;p&gt;The post holders will join primary care network team dedicated to providing high quality support to the PCNs practices and delivery of PCN DES.&lt;/p&gt;\n&lt;p&gt;This is an evolving job with scope for development as we expand our team further over the years. Full support will be provided, and whilst you will be expected to work autonomously you will also be a valuable member of a highly skilled multi-disciplinary team.&lt;/p&gt;\n&lt;p&gt;The successful candidate will provide expertise in clinical medicines management, provide face to face structured medication reviews, manage long term conditions, management of medicines on transfer of care and systems for safer prescribing, manage repeat prescription processes, acute prescription request, and support the needs of the patients within the locality.&lt;/p&gt;\n&lt;p&gt;The post holder will perform face to face medication review of patients with polypharmacy especially for older people, people in residential care homes and those with multiple co-morbidities and long term conditions. The post holder will provide leadership on quality improvement and clinical audit and well as managing some aspects of the Quality and Outcomes Framework. They will assist the PCN in meeting the requirements of the nationally agreed contractual obligations and service specifications as well as any locally set service specifications.&lt;/p&gt;\n&lt;p&gt;We are looking for candidates who are committed to providing high quality primary care services to our population, and who will develop and grow within the pharmacy team.&lt;/p&gt;\n&lt;p&gt;This job description is not exhaustive, and is likely to evolve as Primary Care Networks and their structures develop and mature.&lt;/p&gt;\n&lt;p&gt;Please see the attached job description for further details.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central Advertising - General Practitioners", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130654"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bow", "postalCode": "E3"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5279", "longitude": "-.022654"}}, "title": "PCN Pharmacist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258456", "validThrough": "2020-11-19T23:59:59+0000"}