{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 - £19,337 per annum, pro rata"}}, "datePosted": "2020-11-03T10:46:20+0000", "description": "&lt;p&gt;The role of the workflow administrator is to process clinical correspondence safely, ensuring that it is accurately coded. You will ensure you pass appropriate issues to GPs and other members of the practice clinical team in line with agreed clinical protocols.&lt;/p&gt;\n&lt;p&gt;Workflow aims to help people to move onto the next step of their healthcare journey safely and efficiently, and to help them have the right information when they need it.&lt;/p&gt;\n&lt;p&gt;We achieve this by processing clinical correspondence in a timely, safe and efficient manner ensuring that medical records are up to date when needed.&lt;/p&gt;\n&lt;p&gt;You will approach work flow with a curiosity and critical perspective that supports you in identifying potential system and process improvements within the Primary Care Service and the wider healthcare system.&lt;/p&gt;\n&lt;p&gt;We are looking for an administrator to work with our clinical team to effectively deal with all clinical correspondence received. The administrator will be trained to read code and action incoming clinical correspondence received electronically and written, from outside agencies.&lt;/p&gt;\n&lt;p&gt;Previous experience in general practice is preferred but training can be given to the right person.&lt;/p&gt;\n&lt;p&gt;This is a key post in our practice: we receive masses of information every day electronic and paper based, about patients and other matters, from a variety of sources and it all needs organising, coding and allocating.&lt;/p&gt;\n&lt;p&gt;Main duties of the job&lt;/p&gt;\n&lt;p&gt;To manage the information received by the Practice to enable provision of excellent patient care and ensure the patient records are kept up to date and accurate. To improve the quality of the data held. To facilitate sharing of patient records and data with other providers of health and social care&lt;/p&gt;\n&lt;p&gt;You will have a high standard of IT literacy and be able to learn and apply concepts of clinical coding and workflow management. You will help optimise the workflow with your excellent organisation and methodical skills, which aids in providing top quality patient care&lt;/p&gt;\n&lt;p&gt;We are a small friendly team who take pride in nurturing a friendly, informal and supportive environment in which to work while ensuring we deliver high quality, patient-centred care to our patients.&lt;/p&gt;\n&lt;p&gt;You will also be flexible, motivated and organised with excellent, administration, data management and communication skills. Successful applicants will possess the ability to work independently, accurately and efficiently.&lt;/p&gt;\n&lt;p&gt;It is essential that the practice is adequately staffed at all times and the successful applicant will be expected to be flexible with regards to cover for absences due to holidays or sickness&lt;/p&gt;\n&lt;p&gt;Warwick House Medical Practice is situated in the South East corner of Taunton within easy access of junction 25 of the M5 motorway. It serves a mixed urban and semi-rural population of 7,500 patients.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameSian MaraJob titleOperational ManagerEmail addresssian.mara@nhs.netTelephone number01823 282147&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Somerset NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121360"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Warwick House Medical Practice, Taunton", "postalCode": "TA1 2QA"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.0068", "longitude": "-3.07813"}}, "title": "Patient Services Administrator, Band 2", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253523", "validThrough": "2020-11-17T23:59:59+0000"}