{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37267", "minValue": "30401", "unitText": "YEAR", "value": "£30,401- £37,267 pa pro rata"}}, "datePosted": "2020-10-29T15:45:44+0000", "description": "&lt;p&gt;The Cambridgeshire Learning Disability Partnership (LDP) is an integrated health and social care service for adults with Learning Disabilities living in Cambridgeshire. The LDP aim to ensure the assessment and provision of person centred specialist health and social care services that promote an individual’s right to choice, independence, health and wellbeing in line with their assessed needs and in a way that enables them to reach their full potential. The successful applicant will be an integral and active member of this multi-disciplinary LDP team&lt;/p&gt;\n&lt;p&gt;We are looking to recruit an experienced and enthusiastic Band 6 Community Learning Disability Nurse or Band 5 Learning Disability Nurse who is seeking a development post. The position is full-time, but those interested in part-time hours will be considered.&lt;/p&gt;\n&lt;p&gt;You will have experience relevant to working within a community based multi-disciplinary team supporting people with learning disabilities. As an autonomous practitioner you will manage a specialist case load providing assessment and interventions in relation to the health needs of adults with a learning disability.&lt;/p&gt;\n&lt;p&gt;You will provide professional supervision to other staff and students including appraisals and professional development and will have a clinical role in the South Cambridgeshire locality initially but may be required to work within other localities within the LDP. There will be an expectation that you will also contribute to the planning, development, and evaluation of learning disability services, including contributing to defined projects as delegated by the LDP management team via the Lead Nurse.&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Karen Foody - Professional Nurse lead&lt;/p&gt;\n&lt;p&gt;karen.foody@cambridgeshire.gov.uk&lt;/p&gt;\n&lt;p&gt;01223 743747&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121760.JPG", "name": "Cambridgeshire and Peterborough NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121760"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "LDP Toft, South Cambridgeshire", "postalCode": "CB23 2RY"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1865", "longitude": "-.008938"}}, "title": "Senior Community Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248916", "validThrough": "2020-11-12T23:59:59+0000"}