{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-10-26T17:30:26+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for a Frailty Clinical Nurse Specialist to join ENHTs expanding Frailty service as a substantive post. At present we provide a range of innovative services to support frail elderly patients across East and North Hertfordshire, including:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Assessment of patient in our dedicated Frailty Assessment Unit.&lt;/li&gt;\n&lt;li&gt;A rapid access Frailty Clinic&lt;/li&gt;\n&lt;li&gt;Frailty Hot Line for advice and referrals&lt;/li&gt;\n&lt;li&gt;Collaborative working with community services&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The successful post holder will work within our team of Clinical nurse specialists, Trainee ACP’s and Consultant Geriatricians. Our aim is to intercept and identify frailty patients as they present to the acute trust. We pride ourselves on assessing patient holistically and comprehensively, using evidence based practice to avoid admission and manage the patient appropriately in the community by accessing community services and utilising our frailty Hot Clinic. For those patients who require short period of admission we work closely with our inpatient frailty unit creating individualised management plans and facilitating a timely discharge home.&lt;/p&gt;\n&lt;p&gt;We are looking for a dynamic and motivated individual who is passionate about caring for our vulnerable and complex frail patient group, bringing with you a variety of transferrable skills with both acute and community experience.&lt;/p&gt;\n&lt;p&gt;We welcome and encourage informal discussions regarding the post please contact Sam King Frailty CNS Lead – Samantha.king26@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120840.jpg", "name": "East and North Hertfordshire NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120840"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Lister Hospital, Stevenage", "postalCode": "SG1 4AB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.9242", "longitude": "-.211889"}}, "title": "Fraility Specialist Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243567", "validThrough": "2020-11-09T23:59:59+0000"}