{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-10-12T13:31:11+0100", "description": "&lt;p&gt;&lt;span&gt;The Royal Wolverhampton NHS Trust are looking for 2 Estates Officers (Operations) who are dynamic, enthusiastic and motivated. You need to be forward thinking individuals who will be part of a professional busy Estates Management team.&lt;br /&gt;&lt;br /&gt;The successful applicants will be part of a modernising Estates Team and will play a key role in implementing Service delivery improvements, you will be reporting directly to the Operations Manager, having specific objectives and responsibilities for high level maintenance operations. You will have a fundamental knowledge of health care estates installation, breakdowns and maintenance procedures being performance driven and passionate about delivering a first class efficient service across the Estate.&lt;br /&gt;&lt;br /&gt;He/she will demonstrate high level technical and legislative engineering/maintenance knowledge being able to resolve and repair complex engineering issues while leading your team to ensure Trust values are managed and estates KPI’s are met.&lt;br /&gt;&lt;br /&gt;It is essential that you are fully trained, time served craftsperson that has completed an apprenticeship or similar and achieved HNC/HND or equivalent in an engineering discipline and is working towards or has already achieved degree level or specialist knowledge or equivalent level of knowledge through courses or experience. You must have a high level working knowledge of engineering and operational management across a broad range of activities.&lt;br /&gt;&lt;br /&gt;The post holder will be based at any Royal Wolverhampton NHS Trust premises working across all properties as required. A current valid driving license is required allowing the post holder to commute to all properties within the Trust. You should also be able to work as part of an on call rota covering all aspects of building construction and maintenance.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameStuart CornabyJob titleOperations ManagerTelephone number01902 695355&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120737.jpg", "name": "The Royal Wolverhampton NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120737"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "New Cross Hospital, Wolverhampton", "postalCode": "WV10 0QP"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5977", "longitude": "-2.09594"}}, "title": "Estates Officer Operations", "url": "https://www.jobs.nhs.uk/xi/vacancy/916222525", "validThrough": "2020-11-09T23:59:59+0000"}