{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "42712", "minValue": "36070", "unitText": "YEAR", "value": "£36,070 - £42,712 pa inc.HCAS plus 20 % RRP of BS"}}, "datePosted": "2020-11-02T17:01:02+0000", "description": "&lt;p&gt;&lt;strong&gt;Accredited Specialist Clinical Coder&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job Reference: &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Employer: Chelsea and Westminster Hospital NHS Foundation Trust&lt;/p&gt;\n&lt;p&gt;Department: Clinical Coding&lt;/p&gt;\n&lt;p&gt;Location: London – &lt;strong&gt;West Middlesex site&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Salary: &lt;strong&gt;Band 6 with 20 % RRP of basic salary and HCAS&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;There are many good reasons to choose to come and work at Chelsea and Westminster Hospital NHS Foundation Trust.&lt;/p&gt;\n&lt;p&gt;1st September 2015 was a landmark date for Chelsea and Westminster and West Middlesex hospitals as we officially came together to form the enlarged Foundation Trust. This helps secure the future of both major acute hospitals and by combining into a single, unified trust there will be more scope to innovate and develop even better services for our patients.&lt;/p&gt;\n&lt;p&gt;We aim to be a hospital of choice for patients and an employer of choice for staff. In order to improve all aspects of the patient experience, we rely upon having a highly skilled, motivated, diverse, productive and patient focused workforce. Our vision is to be a first class hospital for our community and we will build a strong and sustainable foundation trust which provides high-quality, value-for-money services to meet the health needs of the local population. It&#39; s a very exciting time to come and work for us.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Accredited Specialist Clinical Coder, Band 6&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;The Clinical Coding Department has undergone a restructure and as part of a significant investment in the coding team we are looking to recruit highly motivated and enthusiastic individuals with excellent organisational skills to join the Trust’s Clinical Coding Department. &lt;br /&gt;&lt;br /&gt;The successful applicants will provide a vital and dynamic role in supporting delivery of the clinical coding service. The coding function has an enviable high profile throughout the Trust, allowing coders the opportunity to work with individual clinicians and clinical divisional leads. &lt;br /&gt;&lt;br /&gt;The successful candidates will be directly accountable for improving coding quality through clinical engagement, ensuring the ongoing accuracy of clinical coding as well as meeting Trust’s deadlines associated with clinical coding. Increased demand for higher quality clinical coding and quicker turnaround times mean opportunities for new ways of working and we need people who can deliver.&lt;br /&gt;&lt;br /&gt;This role will require great attention to detail, excellent concentration span and logical thought process. You will need to be dynamic, enthusiastic and methodical. At Chelsea and Westminster Hospital NHS Foundation Trust we have a clear and structured career progression pathway and there are many and varied opportunities within this profession. &lt;br /&gt;&lt;br /&gt;The candidates will require the Accredited Clinical Coding (ACC) qualification, will have demonstrable coding experience in a wide range of specialties, have good working knowledge of HRGs and therefore be able to deal with the most complex and challenging coding. Other essential skills include excellent written and verbal communication skills to effectively communicate with clinical coders, auditors, clinicians and management.&lt;br /&gt;&lt;br /&gt;&lt;strong&gt; Please note that this post attracts a 20% recruitment and retention premium&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;West Middlesex is easily accessible and well connected by public transport:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;It takes 35 minutes from Hammersmith to Hospital (via bus 267)&lt;/li&gt;\n&lt;li&gt;It takes 25 minutes, from Clapham junction to Isleworth / Syon lane station, (via South West trains) and then 10 minutes’ walk&lt;/li&gt;\n&lt;li&gt;It takes 30 minutes from Richmond overground /underground.&lt;/li&gt;\n&lt;li&gt;The nearest underground station is Hounslow East (Piccadilly line)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;For further details / informal visits contact Rukhsana Kamal, Clinical Coding Manager on Rukhsana.Kamal@chelwest.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121244.png", "name": "Chelsea and Westminster Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121244"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "West Middlesex University Hospital, Isleworth", "postalCode": "TW76AF"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4741", "longitude": "-.326168"}}, "title": "Accredited Clinical Coder", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252964", "validThrough": "2020-11-16T23:59:59+0000"}