{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum pro rata"}}, "datePosted": "2020-10-26T08:45:24+0000", "description": "&lt;p&gt;We are currently looking to recruit an enthusiastic and motivated CAMHS Crisis Care Mental Health Practitioner to join our First Response Service.&lt;/p&gt;\n&lt;p&gt;The First Response Service provides 24 hour access to mental health services for people who identify, or have been identified as being in a mental health crisis. It is an all age service. &lt;br /&gt;&lt;br /&gt;Support is provided initially over the phone by Psychological Wellbeing Telecoaches, who are trained in the process of mental health triage and who will attempt to de-escalate the individual’s crisis over the phone and formulate a safety plan for that individual. Dependent on the risk and need identified, a face to face assessment can be arranged and carried out by a Mental Health First Responders. The team is overseen each shift by a Clinical Lead. The outcome of the telephone triage or face to face assessment is that the patient will be supported, given advice, referred to appropriate services.&lt;/p&gt;\n&lt;p&gt;The post involves flexible working hours with children and young people in a range of settings.&lt;/p&gt;\n&lt;p&gt;These include primary care settings, other community settings, and other health service sites including Acute Hospitals, as required. Lone working in the community is a major element of this job as is potential exposure to verbal and physical aggression. The working environment includes exposure to high levels of distress in others. There is a requirement for substantial periods of concentration and sitting. The nature of the working environment requires regular and frequent travel from base to and between the above-mentioned settings. It also requires detailed work in terms of analysing assessments and writing reports using relevant IT systems&lt;/p&gt;\n&lt;p&gt;The ideal candidate will have a strong team work ethic, sense of accountability, accompanied by an ability to work under considerable pressure at times. This post is open to professionals with the right attributes to enhance a team.&lt;/p&gt;\n&lt;p&gt;In return we will provide the necessary support to ensure your development within your role. We are keen to support and develop our staff through a clear career pathway and encourage promotional opportunities within the Trust.&lt;/p&gt;\n&lt;p&gt;If you are looking for a new challenge, enjoy variety in your work and wish to be part of a team striving to make a difference for our community by supporting people with mental health or learning disability needs then we want to hear from you.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Carolyne Coenen 07973723884&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;carolyne.coenen@cpft.nhs.uk&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121760.JPG", "name": "Cambridgeshire and Peterborough NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121760"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Redshank House, Huntingdon", "postalCode": "PE29 6FN"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.3369", "longitude": "-.207111"}}, "title": "CAMHS Crisis Care Mental Health Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241779", "validThrough": "2020-11-09T23:59:59+0000"}