{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "14826", "minValue": "14826", "unitText": "YEAR", "value": "£8.82 per hour"}}, "datePosted": "2020-11-03T09:18:20+0000", "description": "&lt;p&gt;&lt;span&gt;&lt;strong&gt;&lt;span&gt;Support Worker - Granville&lt;/span&gt;&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Granville Lodge, part of the Huntercombe Group, is a 9 bedded residential home close to the centre of Hartlepool for children and young people who require a high level of specialist care due to physical and learning disabilities due to conditions such as Cerebral Palsy and Epilepsy.  &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;We also welcome Children and Young People who stay with us for short breaks to provide respite.  &lt;/span&gt;&lt;span&gt;We encourage and promote lots of activities and trips out with our young people to ensure that they get a chance to have fun and encounter different experiences; we aim to replicate a family environment.&lt;/span&gt;&lt;span&gt;  &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are looking for a part time Support Worker to:&lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;assist nursing staff in providing high quality individualised care to a clearly defined group of patients / residents, relatives and carers.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;work and act as a key member of the team, supporting each patient / resident in achievement of their planned outcomes.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Key Accountabilities&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;With regular supervision and support from nursing staff&lt;/strong&gt;&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;To assist the nursing team with the assessment of individual patient / resident needs, planning, delivery and evaluation of care for a number of individuals or groups of patients / residents, including following the clinical risk assessment plan.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;To exercise a reasonable and agreed degree of professional autonomy and make judgements and decisions in order to satisfy the expectations and demands of the job.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;To undertake clinical work related tasks as delegated by senior nursing staff, following appropriate training and assessment of competency.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;To undertake clinical supervision to further develop competence and clinical practice.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;To liaise effectively with all stakeholders in the care process, including carers and relatives, aspiring to provide an effective, seamless and integrated service to patients / residents.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;To maintain accurate, legible records of care provided, based upon the care plan incorporating all relevant communication and liaison.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;To maintain and update relevant knowledge and skills, maintain a professional portfolio and participate in further training as appropriate, in order to enhance quality of care for patients / residents and carers.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;To comply with the Huntercombe Group Health and Safety Policies and Protocols in order to contribute to safe working practices.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;To protect vulnerable adults / children from internal/external elements and act as a Patient / resident Advocate.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Communication and Relationship Skills&lt;/strong&gt;&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Communicates with clarity in confidence in a variety of situations, relays information accurately to staff&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Is actively involved in meeting own and team objectives through encouraging and supporting others.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Participates in discussions and debates and staff meetings offering views.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Participate in the process of positively supporting and inspiring colleagues within the service to improve standards and quality and to develop professional practice.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Communicate all relevant issues pertaining to care.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are recruiting part time Support Workers to work 30 hours per week on a rota to cover days and waking nights. The hourly rate of pay is £8.82 ph.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Please take a look at our progressive and rewarding benefits package&lt;/p&gt;\n&lt;p&gt;•             Employee Assistance Programme (EAP)&lt;/p&gt;\n&lt;p&gt;•             Maternity leave at 3 month’s full pay and 3 month’s half pay, (up to a max salary of £50k)&lt;/p&gt;\n&lt;p&gt;•             2 week’s paid paternity leave&lt;/p&gt;\n&lt;p&gt;•             Shared parental leave, matching the maternity leave benefit&lt;/p&gt;\n&lt;p&gt;•             A thorough Induction Programme tailored to the hospital where you will be working&lt;/p&gt;\n&lt;p&gt;•             Clear pay structure, with competitive rates&lt;/p&gt;\n&lt;p&gt;•             Generous annual leave allowance&lt;/p&gt;\n&lt;p&gt;•             Sick pay of 4 weeks full pay and 4 weeks half pay&lt;/p&gt;\n&lt;p&gt;•             The opportunity to participate in a company contributory pension scheme with up to 3% matching contributions&lt;/p&gt;\n&lt;p&gt;•             Death in service benefit equivalent to 2 x salary&lt;/p&gt;\n&lt;p&gt;•             A range of staff discounts&lt;/p&gt;\n&lt;p&gt;•             Continuing Professional Development (CPD)&lt;/p&gt;\n&lt;p&gt;The Huntercombe Group are one the leading specialist healthcare providers, with hospital and centres throughout England and Scotland, delivering wide ranging services in adult mental health and learning disabilities, specialist brain injury, child and adolescent mental health services (CAMHS) including eating disorders and social care for children with special needs.&lt;/p&gt;\n&lt;p&gt;We welcome applications from everyone irrespective of ethnic origin, gender, age, gender identity, sexual orientation, religion, marital status, disability or social background. This is a great opportunity for someone to make a difference.&lt;/p&gt;\n&lt;p&gt;Our aspiration is to nurture the world, one person at a time and that’s why everything we do is designed to provide the best care and recovery for our patients and residents&lt;/p&gt;\n&lt;p&gt;We’re proud to have recruited some of the most experienced doctors, nurses and therapists in their fields and alongside our supportive stable Management structure we hope that it’s you that can help make a difference to our excellent teams and workforce.&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/130001.jpg", "name": "The Huntercombe Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130001"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hartlepool", "postalCode": "TS26 8ND"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.6897", "longitude": "-1.23084"}}, "title": "Support Worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253262", "validThrough": "2020-12-03T23:59:59+0000"}