{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 Per annum"}}, "datePosted": "2020-10-22T14:16:20+0100", "description": "&lt;p&gt;An opportunity has arisen for a highly motivated Consultant in Cardiology to join our team at Calderdale and Huddersfield NHS Foundation Trust.&lt;/p&gt;\n&lt;p&gt;Calderdale and Huddersfield NHS Foundation Trust are proud providers of acute hospital services, where we value our staff and recognise that they are our greatest asset. With a fantastic leadership team, headed by Owen Williams, our CEO who has just made it to the top 100 BAME Leaders list CHFT is at the forefront of Digital Health utilising a number of electronic solutions to improve patient care. The CQC rated us as Good in June 2018. In their report they confirmed that; “Staff were caring and provided compassionate care. Patients were treated with dignity and respect and their privacy was respected. Patients spoke positively about the care they received”.&lt;/p&gt;\n&lt;p&gt;If you want to join a supportive and friendly team providing compassionate care then come and join us to help us achieve ‘outstanding’ in the next CQC inspection. We are nestled in the heart of the stunning Pennine hills; the area which inspired the works of the Bronte sisters. We’re conveniently located close to Manchester, and surrounded by breathtaking scenery, places to visit and things to do. With an affordable housing market and fantastic schools CHFT is perfect for family life as well as professional development.&lt;/p&gt;\n&lt;p&gt;Applicants must be on the General Medical Council Specialist Register or within six months of being admitted to the Register for trainees if in a training programme within the UK. In accordance with the regulations, all other categories of doctors must be on the GMC Specialist Register to be considered for a consultant appointment by the Advisory Appointments Committee. Applicants must continue to hold a License to Practice.&lt;/p&gt;\n&lt;p&gt;If you want to talk about opportunities please contact us at medicalhr@cht.nhs.uk and we will put you in touch with the relevant people that can tell you more about the role and how you can fit into the team. If you require any further information you can call the Medical HR team on 01484 355029.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;Karthik Viswanathan - Clinical Lead - 01422 357171&lt;/p&gt;\n&lt;p&gt;Rehan Naseer - Clinical Director - 01422 357171&lt;/p&gt;\n&lt;p&gt;Ashwin Verma - Divisional Director - 01422 223121&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Calderdale and Huddersfield NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121129"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Calderdale and Huddersfield NHS Foundation Trust,", "postalCode": "HX3 0PW"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7053", "longitude": "-1.85728"}}, "title": "Consultant in Cardiology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916238824", "validThrough": "2020-11-19T23:59:59+0000"}