{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "49325", "minValue": "43712", "unitText": "YEAR", "value": "£43,712 - £49,325 PA INC HCAS"}}, "datePosted": "2020-10-27T11:16:31+0000", "description": "&lt;p&gt;Assistant Contract Manager – Band 7&lt;/p&gt;\n&lt;p&gt;The Private Care Directorate is seeking an exceptional candidate to join our management team as Assistant Contracts Manager.&lt;/p&gt;\n&lt;p&gt;The Assistant Contracts Manager is a key role within the Private Care Directorate, supporting the Contracts Manager in developing and driving the contract strategy with key sponsors by leading commercially solid negotiations to ensure the Trust’s interest are preserved and are in line with business growth targets.&lt;/p&gt;\n&lt;p&gt;It is expected that the post holder will be able to build excellent relationships with stakeholders internally and externally and manage communications to ensure expectations are understood and achieved. &lt;br /&gt;Commercially minded, focussed on attention to detail and self-motivated, the successful candidate will need to manage competing demands and priorities. With strong leadership and interpersonal skills, the successful candidate will also demonstrate an ability to lead and influence stakeholders externally as well as work effectively with their peers and senior managers within the Directorate.&lt;/p&gt;\n&lt;p&gt;This is an exciting time to join Private Care, as we expand our business and strive to consistently provide the highest quality of clinical and non-clinical care to our patients. If you would like to find out more about the role, please contact Julie Tipler, Contracts Manager.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Julie Tipler, Contracts Manager, julie.tipler@rmh.nhs.uk, 020 3186 5080&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "The Royal Marsden NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123033"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Royal Marsden, Sutton", "postalCode": "SM2 5PT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3436", "longitude": "-.190366"}}, "title": "Assistant Contracts Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244192", "validThrough": "2020-11-10T23:59:59+0000"}