{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 - £19,337 Per Annum Pro Rata"}}, "datePosted": "2020-11-04T11:08:17+0000", "description": "&lt;p&gt;Torbay and South Devon Healthcare is a Foundation Trust which provides healthcare services for a population of over 300,000. The Laboratory Medicine Directorate provides a comprehensive Pathology service for the Acute Trust, associated NHS organisations and GPs.&lt;/p&gt;\n&lt;p&gt;The Central Pathology Reception provides a vital role for the Laboratory Medicine directorate in the pre-analytical processing and data entry of over 3000 blood samples a day for the Biochemistry and Haematology Laboratories and approximately 600 samples for Microbiology.&lt;/p&gt;\n&lt;p&gt;The laboratory uses the Laboratory Information System Winpath 5.32 . Electronic requesting is carried out via Cyberlab but some manual data entry is still carried out.&lt;/p&gt;\n&lt;p&gt;A position is now available in this busy Department. You will be expected to work20 Hours per week (Core hours are 09:00 - 5.30pm Monday – Friday (with expectation to work on some days until 6pm on a rotational basis. In addition to this, you will be required to work Saturdays and Bank Holidays).&lt;/p&gt;\n&lt;p&gt;You will need to work well as part as a team and have excellent communication skills and telephone manner.&lt;/p&gt;\n&lt;p&gt;For further information please contact Alison Miles (Reception Supervisor) on 01803 655207 or Patrick Lee 01803 655206.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120957.jpg", "name": "Torbay and South Devon NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120957"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Laboratory Medicine, Level 3, Torbay Hospital", "postalCode": "TQ2 7AA"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.4823", "longitude": "-3.55381"}}, "title": "Medical Laboratory Assistant (MLA)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255539", "validThrough": "2020-11-18T23:59:59+0000"}