{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 pa pro rata"}}, "datePosted": "2020-10-22T15:16:16+0100", "description": "&lt;p&gt;Are you an experienced Healthcare Registrant looking to further your career in Education?&lt;/p&gt;\n&lt;p&gt;An exciting vacancy has arisen to join the Pre-Registration Education Team. This is an excellent opportunity to make an impactful difference to Pre-Registration training pathways and to expand your own horizons!&lt;/p&gt;\n&lt;p&gt;Practice experience and clinical placements are vital for growing our healthcare workforce of the future. Buckinghamshire Healthcare NHS Trust is an integrated Trust who cares for patients and service users in hospital, step-down healthcare environments and at home.&lt;/p&gt;\n&lt;p&gt;We are looking to recruit an experienced Registered Professional with a minimum of 2 years post qualification experience. Applicants will have a strong clinical background, teaching experience and expert knowledge to support quality in the learning environment for Pre-Registration learners across programmes at Buckinghamshire Healthcare NHS Trust.&lt;/p&gt;\n&lt;p&gt;This is advertised as fixed term or secondment opportunity for 18 months, however may present more permanent opportunities in the future as the service evolves.&lt;/p&gt;\n&lt;p&gt;The pre-registration team are primarily based at Stoke Mandeville Hospital, however cross-site working enables flexibility with work-bases. The post holder will be required to travel across the county and there will be opportunities to work at home subject to necessary risk assessments. As a general guideline, working hours are weekdays 9am-5pm or 8am-4pm.&lt;/p&gt;\n&lt;p&gt;The appointee will be enthusiastic about education and has demonstrable portfolio of experience in supporting pre-registration learners. The appointee will be highly motivated, creative and innovative – striving for excellence and will be passionate about supporting and facilitating the progression of others. You will be well supported and have access to professional development, regular 1:1 support and monthly meetings.&lt;/p&gt;\n&lt;p&gt;With excellent teaching facilities, Research, Library and Knowledge services, expert Leadership and Organisational development team and a forward thinking Education department, there is no better time to opt for Bucks Healthcare as your choice for employment!&lt;/p&gt;\n&lt;p&gt;For further details / or to book a video discussion contact: Penny Boon: penny.boon@nhs.net&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Buckinghamshire Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120887"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Stoke Mandeville, Aylesbury", "postalCode": "HP21 8AL"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7983", "longitude": "-.802734"}}, "title": "Learning Environment Facilitator - Pre-Registration", "url": "https://www.jobs.nhs.uk/xi/vacancy/916239108", "validThrough": "2020-11-08T23:59:59+0000"}