{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 Per annum"}}, "datePosted": "2020-10-30T10:02:28+0000", "description": "&lt;p&gt;Hospital@Night is part of the Acute Medicine Division within Urgent and Emergency care.&lt;/p&gt;\n&lt;p&gt;We are looking for experienced and motivated registered nurses to join our cross site team during a time of expansion and development into providing a 24/7 service. These posts are secondments&#39; and or fixed term.&lt;/p&gt;\n&lt;p&gt;The Hospital at Night team provides and facilitates care over both CHN and QMC campuses of NUH for both medical and surgical specialities.&lt;/p&gt;\n&lt;p&gt;The post holder will be accountable on a shift-by-shift basis for proactively managing the clinical workload for the Hospital@Night team. The visible presence of post holders will be key in supporting staff working across all aspects of patient care and specialties.&lt;/p&gt;\n&lt;p&gt;You will provide leadership, clinical support and advice to nursing and junior medical staff, acting as the first point of contact and making referrals to or coordinating the contribution of other members of the Hospital@Night team. The successful candidate will need to be committed to working as part of a team to deliver high quality care and will be able to work well under pressure in this busy setting. If you are enthusiastic, able to work in a demanding yet rewarding environment within a friendly and supportive team then this is the role for you.&lt;/p&gt;\n&lt;p&gt;In return we will offer you a full induction package, the opportunity to widen your skills through extended packages and a supernumerary period across both NUH sites.&lt;/p&gt;\n&lt;p&gt;The Department has operational responsibility for Hospital at Night across the organisation. As such the post holder will be required to rotate between both main campuses that make up Nottingham University Hospitals NHS Trust. If you are looking for a new challenge and enjoy a fast paced environment then we would like to hear from you.&lt;/p&gt;\n&lt;p&gt;Informal insight visits are recommended.&lt;/p&gt;\n&lt;p&gt;please note- If you have applied for this position within the past 12 months you need not apply.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameAdam Shelton-JohnsonJob titleLead NurseEmail addressadam.shelton-johnson@nuh.nhs.ukTelephone number07812275450&lt;/p&gt;", "employmentType": "OTHER", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122234.jpg", "name": "Nottingham University Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122234"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Cross Campus, Nottingham", "postalCode": "NG5 1PB"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9893", "longitude": "-1.16006"}}, "title": "Hospital@Night Coordinators", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249631", "validThrough": "2020-11-13T23:59:59+0000"}