{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-10-28T09:46:41+0000", "description": "&lt;p&gt;NHS England and Improvement is expanding their analytical capacity and are looking to recruit analysts at band 7 level to support the analysis in the NHS.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Performance Analytical Team consists of three central analytical teams and seven regional teams. All are responsible for the collection, reporting and analysis of information about NHS operational activity and performance, and work varyingly with Chief Executive’s Office, Regional Directors and their teams, the Chief Operating Officer’s Directorate and the Finance Directorate. Examples of work include:&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Developing performance metrics to understand how patients experience the NHS – for example collecting and publishing statistics on A+E 4hr performance and considering options for any replacement. This also includes monitoring performance and identifying reasons for changes and variation in performance.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Assisting with how the NHS plans for its delivery of services – enabling the annual planning round, translating Chief Exec and Chief Operating Officer requirements into metrics and templates for all 44 NHS STPs to complete and analysing their results to ensure that plans are cohesive and realistic.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Deep dive pieces of analysis – these are multiple and varied in their topic and method applied. Previous areas include impact of Pension Changes, modelling impact of COVID on waiting times for treatments, where to locate NHS Nightingale sites.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Projecting demand for NHS services and required capacity over the course of the year and future years. For example - how might services, such as changing outpatient appointments from face to face to video affect the required capacity and what other impacts (positive and negative) might this change in service have.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For these roles, the key skills we are looking for include:&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;You need to be inquisitive and methodical in applying analytical skills. This may include as interpretation of data, statistics, evaluation, or simple modelling or forecasting as needed. As an analyst you will know how to use techniques appropriately and have a degree in a highly numerate area such as Mathematics, Statistics, Engineering or Sciences or evidence of equivalent experience.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;You need to apply Technical skills - We currently use a mix of SQL, VBA, R &amp; Tableau to work directly with large data sets and produce analysis at scale. As an analyst you’ll need to be familiar with using technical tools or show keenness to learn these.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;You need to be comfortable working with data and evidence - The NHS has a multitude of large data sets. Experience in NHS data sources is welcome, although transferrable skills are considered.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;You will need to building relationships &amp; networks - Our analysis and support is needed to influence the design of the NHS and support those taking difficult decisions, you need to be able to work to a brief to deliver timely analysis.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;You need great communication skills - You will be able to communicate your analysis, both verbally and in written forms.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;While a healthcare background is beneficial, it is not essential, you could bring transferrable experience and skills with intelligence and data. Or you might have a huge experience in healthcare but haven’t quite developed the technical skills – if you have the right numerate background and can demonstrate the right aptitude, please do apply as we can support training and development.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Allison Jordan&lt;/p&gt;\n&lt;p&gt;Job title: Deputy Director of Analytical Services (South East)&lt;/p&gt;\n&lt;p&gt;Email address: allison.jordan@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/126694.png", "name": "NHS England and NHS Improvement", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126694"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Premier House, Reading, Reading", "postalCode": "RG1 7EB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4587", "longitude": "-.976695"}}, "title": "Analyst", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245883", "validThrough": "2020-11-11T23:59:59+0000"}