{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 pa pro rata"}}, "datePosted": "2020-10-28T13:16:22+0000", "description": "&lt;p&gt;The Adult Eating Disorder service (AEDS) was established in 2004. It is part of the Adult and Specialist directorate within CPFT. It offers treatment for patients age 18 years and older with moderate to severe eating disorders registered with GP practices in the Cambridgeshire and Peterborough CCG.&lt;/p&gt;\n&lt;p&gt;It offers treatment for patients age 18 years and older with moderate to severe eating disorders registered with GP practices in the Cambridgeshire and Peterborough CCG. The service has been allocated transformation funding to develop into a comprehensive leading-edge service. We hope to minimise obstacles in accessing treatment; accepting self-referrals and treat patients rapidly and safely. Our new treatment pathways include and early intervention pathway, a high-risk pathway that includes medical monitoring and a quality of life pathway for patients with severe and enduring eating disorders.&lt;/p&gt;\n&lt;p&gt;The service will become a pioneer in the care of eating disorders and there are many opportunities to be involved in the transformation and develop a stimulating leadership role.&lt;/p&gt;\n&lt;p&gt;We are currently looking to recruit a keen, enthusiastic and highly motivated band 7 Clinical Psychologist to join our Cambridge Adult Eating Disorder service Community Team, based at Addenbrookes Hospital in the beautiful university city of Cambridge.&lt;/p&gt;\n&lt;p&gt;As a key member of our team you will play a vital role in developing services.&lt;/p&gt;\n&lt;p&gt;For this post and you will be required to work collaboratively and independently within our service.&lt;/p&gt;\n&lt;p&gt;Developing and improving clinical care form the key elements of this post and you will be required to give expert advice and support to patients, their families/carers, the multidisciplinary team and other healthcare professionals. In return for your commitment and enthusiasm, working within the unique Adult Eating Disorders Team will give you the opportunity to practice a full range of core skills and therapies within the multi-disciplinary team.&lt;/p&gt;\n&lt;p&gt;Cambridge and Peterborough NHS Foundation Trust are keen to support and develop staff through a clear career pathway with CPD options and encourage promotional opportunities within the service and the wider Trust, we also have a close working partnership with the University of Bedford and opportunities exist to participate in clinical research and innovative practice. In addition, we offer a 4-day induction on commencement in post, and professional leadership programmes for experienced staff nurses through the NHS Academy and CPD opportunities specific to role.&lt;/p&gt;\n&lt;p&gt;If you are looking for a new challenge, enjoy variety in your work and wish to be part of a team striving to make a difference for our community by supporting people with their mental well-being then we want to hear from you.&lt;/p&gt;\n&lt;p&gt;Other benefits from joining us are:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Annual leave allowance 27 days plus bank holidays (depending on NHS service)&lt;/li&gt;\n&lt;li&gt;Pension scheme&lt;/li&gt;\n&lt;li&gt;Full-time/Part-time or job share opportunities&lt;/li&gt;\n&lt;li&gt;Salary sacrifice scheme&lt;/li&gt;\n&lt;li&gt;Staff discount scheme&lt;/li&gt;\n&lt;li&gt;Professional leadership programmes for experienced staff through NHS Academy&lt;/li&gt;\n&lt;li&gt;Regular clinical and managerial supervision and training opportunities specific to eating Disorders&lt;/li&gt;\n&lt;li&gt;Stress awareness training&lt;/li&gt;\n&lt;li&gt;Mindfulness training&lt;/li&gt;\n&lt;li&gt;Staff Counselling service&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;For further information relating to this role please contact Sarah Beglin, Consultant Psychologist or Team manager Lynn Eldred on 01223 596201&lt;/p&gt;\n&lt;p&gt;The Trust is committed to safeguarding and promoting the welfare of children, young people and vulnerable adults and expects all staff and volunteers to share this commitment. As part of the selection process you may be required to undergo a Disclosure and barring check.&lt;/p&gt;\n&lt;p&gt;The Trust is an equal opportunities employer and we positively encourage applications from people who have experienced mental health issues.&lt;/p&gt;\n&lt;p&gt;The Trust believes in treating everyone with dignity and respect and encourages applications from all sectors of the community. We guarantee an interview to candidates with disabilities who meet the minimum essential criteria.&lt;/p&gt;\n&lt;p&gt;Please note that due to the variety of contacts you may provide it cannot be guaranteed that the recruitment process will be managed exclusively within the NHS email system. Please ensure that all the details you provide on your application form are correct.&lt;/p&gt;\n&lt;p&gt;**Internal CPFT Trust applicants who are currently ‘at risk’ and who meet the essential criteria will be given prior consideration over any other candidates who may apply for this post. Further consideration will then be given to other internal applicants currently ‘affected by change’ and then to other NHS applicants who are currently ‘at risk’ within the wider NHS. If you are ‘at risk’ or ‘affected by change’ please make it clear on your application so that you receive priority consideration**&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Sarah Beglin, Consultant Psychologist or Team manager Lynn Eldred on 01223 596201&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121760.JPG", "name": "Cambridgeshire and Peterborough NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121760"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Adult Eating Disorder Service, Addenbrookes Hopsital, Cambridge", "postalCode": "CB2 0QQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1751", "longitude": ".141751"}}, "title": "Clinical/ Counselling Psychologist or CBT Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246738", "validThrough": "2020-11-11T23:59:59+0000"}