{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "32426", "minValue": "32426", "unitText": "YEAR", "value": "£19.29"}}, "datePosted": "2020-10-07T11:06:28+0100", "description": "&lt;p&gt;&lt;strong&gt;**PLEASE NOTE THIS IS TO APPLY TO JOIN NHS PROFESSIONALS’ ALLIED HEALTH PROFESSIONALS BANK**&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job Title and Grade:&lt;/strong&gt; Children’s Occupational Therapist Specialist  &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location/Trust: &lt;/strong&gt;Callaghan House, Salford Royal NHS Foundation Trust (Northern Care Alliance)&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Department Covered:&lt;/strong&gt; Children’s Acute and ongoing Needs Service &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Pay Rates:  &lt;/strong&gt;Days: £19.29 Saturdays/Nights: £25.08 Sunday/Bank Hols: £30.86&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Placement Ref/ID&lt;/strong&gt;: 35655&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Role:         &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Shaping The Future Of Occupational Therapy.…join the bank for flexibility in how you work.&lt;/p&gt;\n&lt;p&gt;Would you like to be part of a team that has a real supportive and inclusive ethos and sense of community, in a Trust rated ‘Outstanding’ in a recent CQC report, working in a location with all the benefits of country living with the convenience of big city life?&lt;/p&gt;\n&lt;p&gt;If you answered ‘yes’ to the above, we’d love to hear from you! &lt;/p&gt;\n&lt;p&gt;We have long term placement opportunities available for Occupational Therapist available at Salford Royal NHS Foundation Trust specifically providing a service working as a member of the Paediatric Occupational Therapy team under the direct and indirect supervision of a Specialist Paediatric Occupational Therapist.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Paediatric Occupational Therapy team works with children and young people from 0 – 19 years in the borough of HMR in a variety of settings including clinics, nurseries, mainstream and special schools. The team works with children with a variety of conditions including children with co-ordination difficulties, neurological impairments, developmental delay and physical disabilities. Some of the children have complex health care needs.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The post holder will work as an autonomous practitioner and be professionally and legally responsible, and accountable for all aspects of their own work. This includes the management of patients in their care in accordance with trust and professional guidelines. This is in order to ensure a high standard of clinical care for patients with appropriate support from senior occupational therapists.&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Key Responsibilities of the Post:&lt;/span&gt;                                                                                  &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Independently manage a specialised clinical caseload. This will be predominantly working with children with sensory processing difficulties.&lt;/li&gt;\n&lt;li&gt;Assessment, advising, planning, delivering and evaluating treatment for a complex caseload of children working in partnership with health and education colleagues where appropriate.&lt;/li&gt;\n&lt;li&gt;Provides specialist advice, training and support to educational staff, outside agencies, parents and carers.&lt;/li&gt;\n&lt;li&gt;Ensuring the accurate documentation of case notes.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Occupational Therapy Team sits within the Integrated Children&#39;s Acute and On-going Needs Service within HMR Community Services and is based at Callaghan House in Heywood. We work across Heywood, Middleton and Rochdale in a variety of settings to deliver an Occupational Therapy Service to children and young people from 0 – 19 years with a wide range of difficulties and disabilities.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Children’s Occupational Therapy Team enables children with a wide range of difficulties and disabilities to maximise their development and become independent participants in the community.&lt;strong&gt;&lt;br /&gt; &lt;br /&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Salford Royal Foundation Trust has an enviable reputation, great supportive team with a family feel.  Based in the heart of the Hospitals main site, the post holder here will be pivotal in providing the best level of quality care to varying departments and their patients needs.&lt;/p&gt;\n&lt;p&gt;Excellent transport links mean their location is commutable from Eccles Train Station, and there’s also a free staff car park a 5 minute walk away.  They also offer a shuttle bus service running from the local mainline train station.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Skills/Responsibilities:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Skills/Responsibilities &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;To apply for this post, you will have:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Post registration experience&lt;/li&gt;\n&lt;li&gt;Experience working with children with sensory processing difficulties&lt;/li&gt;\n&lt;li&gt;Postgraduate sensory integration training&lt;/li&gt;\n&lt;li&gt;Previous experience across a broad range of junior rotations&lt;/li&gt;\n&lt;li&gt;Advanced clinical reasoning skills in paediatric&lt;/li&gt;\n&lt;li&gt;Specialist knowledge in anatomy and physiology to support relevant clinical skills&lt;/li&gt;\n&lt;li&gt;Knowledge of areas of clinical governance including quality, audit and risk management&lt;/li&gt;\n&lt;li&gt;Basic understanding of computers and their applications&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;In return for your hard work commitment NHS Professionals (NHSP) can offer you some fantastic benefits: –&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Competitive Pay Rates &lt;/strong&gt;- work this week, get paid next week!&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;First choice of placements at over 50 NHS Trusts in England&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Dedicated consultants&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Flexible working options&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Free DBS and free training&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Build holiday allowance &lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Support when you need it – 24/7 365 days – &lt;/strong&gt;Call us anytime on 03330 144 370&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Stakeholder pension scheme&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Who are NHS Professionals?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;NHS Professionals (NHSP), owned by the Department of Health and Social Care (DHSC), works in partnership with hospital trusts to provide a bank of highly skilled temporary workers who want to work flexibly within the NHS. &lt;/p&gt;\n&lt;p&gt;Working through the NHSP bank means Trusts don’t have to rely on expensive agencies. Right now, we have over 130,000 members registered on our bank from various roles, grades and specialities, saving the NHS over &lt;strong&gt;£70 million&lt;/strong&gt; each year. This money is then reinvested back into the NHS.&lt;/p&gt;\n&lt;p&gt;Register today for various flexible working options and long term placement opportunities.&lt;/p&gt;\n&lt;p&gt;For more information on the roles or details on how to join NHS Professionals, simply get in touch with &lt;em&gt;Katie Phillips, Recruitment Consultant on 0333 014 4370 or katie.phillips&lt;/em&gt;&lt;em&gt;@nhsprofessionals.nhs.uk&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;We look forward to hearing from you soon.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Disclaimer &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Please note, you will be contacted by email throughout the recruitment process, so please check your emails, including your junk/spam regularly. We regret we cannot contact everyone who is not selected for an interview, therefore if you do not hear from us within 21 days after submitting your application, please assume you have not been successful on this occasion.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "NHS Professionals - Flexible Workers", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121069"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Heywood", "postalCode": "OL10 1PR"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5892", "longitude": "-2.20635"}}, "title": "Paediatric Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916216146", "validThrough": "2020-11-30T23:59:59+0000"}