{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62001", "minValue": "53168", "unitText": "YEAR", "value": "£53,168 to £62,001 pa (pro rata)"}}, "datePosted": "2020-10-21T13:15:32+0100", "description": "&lt;p&gt;We are seeking an experienced Clinical or Counselling Psychologist to work in Leeds CAMHS as part of our specialist Eating Disorders Service. We are looking for someone who has clinical experience in this specialist area and who will bring passion and enthusiasm to this role. This is a permanent, part time post at 0.6 wte. &lt;br /&gt; &lt;br /&gt; The Team &lt;br /&gt; &lt;br /&gt; Leeds Children &amp; Young people&#39;s Eating Disorder&#39;s Service is a specialist service within Leeds Child &amp; Adolescent Mental Health Services (CAMHS). We are a citywide, multidisciplinary team working with young people and families with a range of eating problems. The service provides specialist assessment and intervention for young people and their families up to the age of 18. We are from a range of backgrounds, including psychiatry, nursing, psychology, paediatrics, social work, dietetics and Occupational therapy. &lt;br /&gt; We offer Family Based Treatment as a core treatment as well as CBT - E an d individualised therapies. &lt;br /&gt; &lt;br /&gt; We work closely with our colleagues in CAMHS, schools and local medical services and are a forward thinking and proactive team. We are a friendly and established team and are looking for someone to join us who shares our core values and has a passion for the work they do. &lt;br /&gt; &lt;br /&gt; The Role &lt;br /&gt; &lt;br /&gt; The post holder will be based in our specialist multi-disciplinary CAMHS Eating Disorders Team which covers the whole of Leeds. You will offer direct clinical assessments and interventions to young people and their families alongside team colleagues. You will also provide clinical supervision to team colleagues, including a qualified psychologist, an assistant psychologist and trainee psychologists. You will have a lead role in relation to developing psychological formulation skills and practice. You will provide teaching and training to team colleagues and to external agencies. You will contribute to service development and work with other senior cli nicians and the team manager as a member of the team&#39;s leadership group. &lt;br /&gt; &lt;br /&gt; You will join a service which prioritizes reflective practice, clinical supervision and continuing professional development. You will join an enthusiastic group of clinical psychologists which provides professional support, collaborative learning and development opportunities. We have close links with the University of Leeds Doctoral Clinical Psychology Training Programme and contribute routinely to teaching and supervision of trainees.&lt;/p&gt;\n&lt;p&gt;About You &lt;br /&gt; &lt;br /&gt; This post is ideal for someone who is looking for a varied role within an experienced and supportive multi-disciplinary team. You will enjoy working collaboratively to achieve improved outcomes for children and young people. You will have substantial post-qualification experience including experience of working with young people presenting with eating disorders. You will bring specialist theoretical knowledge in this area and will have undertaken further training that is relevant to working with this group of young people. You will have a strong track record as a clinical leader and will have developed skills in this area. You will be an experienced clinical supervisor and have a commitment to service-related evaluation/research. Skills in Family Based Treatment and CBT-E would be desirable.&lt;/p&gt;\n&lt;p&gt;Who are we? &lt;br /&gt; &lt;br /&gt; Leeds Community Healthcare provides a range of community-based health services across the whole city. Our organisation has a values-based culture and our focus at all times is on providing the best quality care to every community in Leeds. Our CAMHS vision is to facilitate specialised mental health care for children, young people and their families within an emotional and mental wellbeing pathway across Leeds through partnership working. &lt;br /&gt; &lt;br /&gt; We welcome you to contact us for an informal discussion about this post or to arrange to visit us to find out more. Please contact Louise Jones, Team Manager (0113 843 4317 louisejones13@nhs.net)&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122058.jpg", "name": "(CS) Leeds Community Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122058"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Leeds", "postalCode": "LS7 3EX"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8173", "longitude": "-1.53061"}}, "title": "Highly Specialist Clinical Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916236572", "validThrough": "2020-11-08T23:59:59+0000"}