{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 Per annum"}}, "datePosted": "2020-10-30T13:31:01+0000", "description": "&lt;p&gt;We are open every day of the year our rota&#39;s include weekends, bank holidays and late nights.&lt;br /&gt;&lt;br /&gt;At the Liverpool University Hospitals NHS Foundation Trust pharmacy technicians have become valued members of the Trust workforce, following successful developments within the pharmacy department itself. Having technicians working alongside Pharmacists in a number of specialities including, Emergency Floor, Cardiology, Infectious Diseases, Respiratory, Renal, General Surgery for many years, we are looking to expand our teamwork approach further. You will work as part of the pharmacy team to help deliver a high standard of medicines optimisation to designated wards.&lt;br /&gt;&lt;br /&gt;These particular posts are to maintain and develop the service provided to various wards on a rota basis where there will be a high degree of involvement in direct patient medicines management at Royal Liverpool University Hospital and Broadgreen Hospital sites. This involves:&lt;br /&gt; &lt;br /&gt;•Taking Medication History &lt;br /&gt;•Ensuring efficient delivery of critical medicines&lt;br /&gt;•Ensuring efficient provision of medication on admission or discharge or transfer&lt;br /&gt;•Liaison with clinical pharmacists nursing staff and primary care to ensure safe and effective use of medication.&lt;br /&gt;•Participation in audit and data collection for research purposes.&lt;br /&gt;•Training&lt;br /&gt;&lt;br /&gt;You will need to be a confident communicator, with excellent written and verbal skills. You will need to be a highly motivated and enthusiastic person. &lt;br /&gt;&lt;br /&gt;If you are a forward-thinking and innovative technician, who feels they have more to offer than their current post allows, why not consider joining us in Liverpool. &lt;br /&gt;&lt;br /&gt;Applicants must be registered with the General Pharmaceutical Council, plus have 2 years post qualification experience an possess an accredited checking qualification.&lt;/p&gt;\n&lt;p&gt;If you are interested in applying for these posts and would like to look around the pharmacy department at the Royal Liverpool Hospital site please contact us to organise a visit.&lt;/p&gt;\n&lt;p&gt;To hear about the exciting work we do from our dedicated Trust employees and departments, for a future you could be a part of, please visit our Trust Facebook page by searching Royal Liverpool and Broadgreen University Hospitals NHS Trust.&lt;/p&gt;\n&lt;p&gt;Click the Like button on the page to keep up to date with current vacancies and Trust news.&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Name Cheryl Kelly&lt;/p&gt;\n&lt;p&gt;Job title Deputy Technical Services Manager&lt;/p&gt;\n&lt;p&gt;Email address&lt;/p&gt;\n&lt;p&gt;cheryl.kelly@liverpoolft.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number 0151 706 2025&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;Lena Whittall, Technical Services Manager&lt;/p&gt;\n&lt;p&gt;0151 706 2095&lt;/p&gt;\n&lt;p&gt;Lena.Whittall@liverpoolft.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121281.png", "name": "Liverpool University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121281"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Pharmacy Dept, Royal Liverpool University Hospital, Liverpool", "postalCode": "L7 8XP"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4095", "longitude": "-2.96481"}}, "title": "Ward Based Pharmacy Technician", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250358", "validThrough": "2020-11-15T23:59:59+0000"}