{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Band 7"}}, "datePosted": "2020-10-28T14:23:15+0000", "description": "&lt;p&gt;University College London Hospitals NHS Foundation Trust (UCLH) is one of the most complex NHS trusts in the UK, serving a large and diverse population. In July 2004, we were one of the first NHS trusts to achieve Foundation Trust status.&lt;/p&gt;\n&lt;p&gt;We are looking for a Band 7Senior Social Work Practitionerservice to inpatients on the Neurorehabilitation Unit (NRU) and manage the Social Work Assistants.&lt;/p&gt;\n&lt;p&gt;Key points of the role will be:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;To establish needs of patients with complex neurological disability and those of their carers, and to identify relevant resources to meet them. This involves liaising with various external voluntary and statutory organisations to ensure the development and implementation of a care management plan that provides for a safe discharge for NRU patients.&lt;/p&gt;\n&lt;p&gt;• To liaise effectively, with all parties involved in the patient’s care locally and nationally, and to maintain appropriate and accurate documentation as an autonomous practitioner.&lt;/p&gt;\n&lt;p&gt;• To manage Social Work Assistant and to participate in the recruitment selection and induction of staff when necessary.&lt;/p&gt;\n&lt;p&gt;• To act as a resource for all NRU based health care professionals regarding Local Authority policy and practice and advice regarding the impact of any changes in legislation or policy.&lt;/p&gt;\n&lt;p&gt;• To promote the implementation of clinical governance and to participate in reviewing clinical practice and policy making.&lt;/p&gt;\n&lt;p&gt;• To be committed to implementing practices to promote an integrated multidisciplinary service ensuring holistic client cantered care.&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;To be considered for the roles, you will need:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;At least six months NHS experience in a similar position&lt;/li&gt;\n&lt;li&gt;HCPC registration&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Working through the Bank you will benefit from:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;First opportunity for work placements before agency staff&lt;/li&gt;\n&lt;li&gt;Competitive pay rates&lt;/li&gt;\n&lt;li&gt;A dedicated booking consultant available to assist with any queries and advise on suitable assignments tailored to you&lt;/li&gt;\n&lt;li&gt;Electronic timesheet system with weekly payroll&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;If you meet these requirements and are committed to delivering top quality patient care,&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "University College London Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120731"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "London", "postalCode": "NW1 2PG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5257", "longitude": "-.13737"}}, "title": "Bank Senior Social Work Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246968", "validThrough": "2020-11-27T23:59:59+0000"}