{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "87754", "minValue": "75914", "unitText": "YEAR", "value": "£75,914 - £87,754 p.a. pro rata"}}, "datePosted": "2020-10-26T13:46:50+0000", "description": "&lt;p&gt;&lt;strong&gt;Our Trust&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Cambridge University Hospitals (CUH) NHS Foundation Trust comprises Addenbrooke’s Hospital and the Rosie Hospital in Cambridge. With over 11000 staff and over 1100 beds the priorities of the Trust focus on a quality service which is all about people – patients, staff and partners. Recognised as providing ‘outstanding’ care to our patients and rated ‘Good’ overall by the Care Quality Commissioner, is testament to the skill and dedication of the people who work here. CUH’s values – Together- safe, kind, excellent – are at the heart of patient care, defining the way all staff work and behave. The Trust provides accessible high-quality healthcare for the local people of Cambridge, together with specialist services, dealing with rare or complex conditions for a regional, national and international population.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We have an exciting opportunity to join the senior management team of the Trust’s award winning eHospital team, and in doing so to be at the heart of helping to shape and deliver our future digital journey. The Trust was recently recognised as the first UK hospital to achieve HIMSS EMRAM Stage 7. However, this is by no means the end of the journey, merely another step along the way. We are therefore looking to appoint a passionate, skilled, and forward-thinking Associate Director of IT Service. This post will join three other Associate Directors (Technology, Informatics, and Informatics (Finance / Coding)) reporting to the Director of Digital / Chief Clinical Information Officer. You will provide leadership for the division and support colleagues from across the organisation to take forward our digital strategy – the delivery of ever increasing high-quality health care underpinned by technology.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are seeking individuals with an appropriate level of expertise and experience in the management of service delivery and related domains, including working with an outsourced service provider, as well as a proven track record of working across complex environments and with colleagues to facilitate successful change.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Benefits to you&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We offer development opportunities and a wide range of benefits including on-site leisure facilities, shopping concourse, day nurseries and access to a great transport system with easy access to airports and rail travel.&lt;/p&gt;\n&lt;p&gt;For further details of our fantastic benefits please refer to the attachment below - CUH Benefits.&lt;/p&gt;\n&lt;p&gt;Please note if you would like to discuss the required hours of this role further, you should approach the contact given. In some cases alternative working hours will be considered.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We welcome applications from the Armed Forces.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameAfzal ChaudhryJob titleDirector of DigitalEmail addressanc35@cam.ac.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Cambridge University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121319"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Addenbrookes Hospital - Division Corporate, Cambridge", "postalCode": "CB2 0QQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1751", "longitude": ".141751"}}, "title": "Associate Director of IT Service", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242746", "validThrough": "2020-11-19T23:59:59+0000"}