{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 £21,892-£24,157 per annum plus u"}}, "datePosted": "2020-11-03T11:32:05+0000", "description": "&lt;p&gt;Nottingham University Hospitals NHS Trust is a large, busy teaching hospital.&lt;br /&gt;As an Associate Practitioner you will be providing professional support to Biomedical Scientists and other staff in the Biochemistry sections of the Clinical Pathology laboratory. The role requires participation in 24/7 rosters on both Nottingham University Hospital campuses. Full training will be given for this as required.&lt;/p&gt;\n&lt;p&gt;Duties will include: Carrying out laboratory analyses associated with the post, including maintaining appropriate records and documentation; Undertaking quality control procedures and examining quality control results to assess performance and report findings to Biomedical Scientist staff; Participation in the operation, routine maintenance and troubleshooting of equipment; Maintaining an adequate supply of laboratory consumables, reagents and equipment; Assisting in the supervision and training of more junior staff and participation in the departmental training plan; Assisting in the development of new methods and the implementation of new technology; Assisting in the production, maintenance and implementation of Standard Operating Procedures and Ensuring that safe working practices are followed in accordance with departmental Safety Policy.&lt;/p&gt;\n&lt;p&gt;We are looking for a dedicated individual who has an eye for detail and is interested in a role that is challenging and rewarding. Candidates with experience of working in an NHS clinical pathology environment will be aware of the roles of an Associate Practitioner. The candidate will need to be driven to learn new processes and working in a fast and varied department.&lt;/p&gt;\n&lt;p&gt;Selection will be by interview consisting of a panel of staff members to test your knowledge and experiences as well as your understanding of the Trust&#39;s Values and Behaviors.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameSusan TaylorJob titleDSMEmail addresssusan.taylor@nuh.nhs.ukTelephone number0115 9691169 ext 77021Additional contact informationFor further details&lt;/p&gt;\n&lt;p&gt;Daniella Wainwright, daniella.wainwright@nuh.nhs.uk 0115 9249924 ext 63094&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122234.jpg", "name": "Nottingham University Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122234"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Across both campus, Nottingham", "postalCode": "NG5 1PB"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9893", "longitude": "-1.16006"}}, "title": "Associate Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253759", "validThrough": "2020-11-16T23:59:59+0000"}