{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51393", "minValue": "45780", "unitText": "YEAR", "value": "£45,780 - £51,393 per annum, inc HCA"}}, "datePosted": "2020-11-03T17:45:28+0000", "description": "&lt;p&gt;&lt;span&gt;King’s College Hospital NHS Foundation Trust part of King&#39;s Health Partners Academic Health Sciences Centre (AHSC), is one of the UK’s largest and busiest teaching hospitals with a turnover of nearly £1 billion, 1.5 million patient contacts a year and more than 12,600 staff based across 5 main sites in South East London and Kent.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Trust provides a full range of local hospital services across its different sites, and specialist services from King’s College Hospital (KCH) site in Camberwell and the Princess Royal University Hospital (PRUH) site in Bromley, Orpington Hospital, and some services at Beckenham Beacon and Queen Mary’s Sidcup.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Trust is recognised internationally for its work in liver disease and transplantation, neurosciences, cardiac, haemato-oncology, fetal medicine, stroke, major trauma, and Emergency Department.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;King&#39;s Cardiology is delighted to offer you the opportunity to apply for the role of Arrhythmia Clinical Nurse Specialist. This Band 7 post would suit a highly motivated and innovative nurse with a strong Cardiac background and a desire to deliver outstanding, individualised patient care. Working alongside your supportive team of arrhythmia nurse specialists, consultant electrophysiologists, cardiologists and allied health professionals, you will be able to use your excellent interpersonal and communication skills to guide patients throughout their journey from diagnosis to treatment and on to follow up.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This will involve care of both inpatients and outpatients and your workload will be varied as you deal with a diverse population with complex needs. One day you will be organizing and running your own pre-assessment and follow-up clinics, and the next day you will be counselling inpatients in preparation for their VT ablation or ICD implant. You will be responsible for the nurse-led Cardioversion service, for Ajmaline testing and for identifying patients who may be suitable for research studies. With the department performing procedures at the cutting edge of electrophysiology, you will be expected to maintain a contemporaneous knowledge base and aim to undertake your own audit and service evaluations with a view to presentation both locally and nationally.&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Name Jonathan Breeze&lt;/p&gt;\n&lt;p&gt;Job title Lead Cardiac Research Nurse&lt;/p&gt;\n&lt;p&gt;Email address jonathan.breeze@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number 0203 2991285&lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Cardiovascular Matron, Esther Randall on 0203 2992490 or e.randall@nhs.net.&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "King's College Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120921"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Denmark Hill, London", "postalCode": "SE5 9RS"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4684", "longitude": "-.09228"}}, "title": "Arrhythmia Clinical Nurse Specialist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254968", "validThrough": "2020-11-12T23:59:59+0000"}