{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "30401", "unitText": "YEAR", "value": "£30,401 - £37,890 per annum"}}, "datePosted": "2020-10-27T16:02:13+0000", "description": "&lt;p&gt;&lt;strong&gt;Band 6 Mental Health Practitioner&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Do you have a high level of clinical confidence and the ability to work autonomously? Can you use these skills to assess the mental health needs of over 65’s admitted to the acute medical hospital? If you can honestly say ”yes”, then the Trust wants to hear from you!’&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Whilst a comprehensive Job and Person specification is attached to this vacancy, key elements include (but aren’t limited to):&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Assessing the mental health of patients admitted to A&amp;E or medical wards using your communication skills to understand their situations. This will involve working alongside medical colleagues.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Independently and confidently assessing patients and developing appropriate formulations, taking an evidence-based approach.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Provide education and teaching and mentorship regarding mental health issues, to other staff.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Act as a role model, mentoring, assessing and supporting students and learners on placement&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Applicant&lt;/strong&gt;&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;The successful candidate must have good assessment skills and good understanding/knowledge around thorough clinical risk assessment.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Be highly organised to be able to prioritise your workload&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Should have excellent communications skills and be able to work alone as well as part of a team. We are proud of our multi-disciplinary team approach, providing holistic mental and physical healthcare.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Be an enthusiastic motivated and experienced RMN, OT or Social Worker with relevant post registration experience gained in mental health nursing, ideally within an acute setting&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;The Team&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Mental Health Liaison Service team has close working partnerships with medical staff, UHL wards and secondary mental health care, with a strong commitment to supervision, training and regular appraisal, from which you will benefit. You will be provided with a laptop and mobile and benefit from the support and advice of a team with a reputation for supporting each other.&lt;/p&gt;\n&lt;p&gt;The role works 9 to 5, 7 days a week across all 3 main hospital sites in Leicester&lt;/p&gt;\n&lt;p&gt;For more information or to just have an informal chat about the role and team, please contact Holly Vallender at Holly.Vallender@leicspart.nhs.uk or call the unit on 01162 585587&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Leicestershire Partnership Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120650"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Leicester", "postalCode": "LE1 5WW"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6278", "longitude": "-1.13479"}}, "title": "Band 6 Mental Health Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245333", "validThrough": "2020-11-10T23:59:59+0000"}