{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51393", "minValue": "45780", "unitText": "YEAR", "value": "£45,780 - £51,393 per annum inc HCAS pro rata"}}, "datePosted": "2020-11-03T11:46:35+0000", "description": "&lt;p&gt;We are looking for a high motivated Clinical Psychologist within the Rehabilitation Unit at St Pancras Hospital. The Rehabilitation Unit is a multi-disciplinary team including psychology, physiotherapy, speech and language therapy, occupational therapy, social workers, rehabilitation assistants, medical staff and nursing.&lt;/p&gt;\n&lt;p&gt;The post-holder will be based within the MDT and will have the opportunity to work as part of a multi-disciplinary team across three rehabilitation wards (neurological and complex care including frailty and polytrauma). The post-holder will work with patients to support adjustment to diagnosis, provide neuropsychological assessment, contribute to discharge planning and provide consultation to team members. The role also involves the assessment and management of challenging behaviours and carer / family support as required.&lt;/p&gt;\n&lt;p&gt;This is a busy and varied role and will suit applicants who are able to work autonomously and on their own initiative. Applicants should have a background in neuropsychology or an interest in working in physical health or older adult services.&lt;/p&gt;\n&lt;p&gt;The role is part-time (minimum 18.75 hours p/w to maximum 26.25 hours p/w) we offer flexibility from Monday to Wednesday with some fixed hours on Thursday and Friday to meet the needs of the service. If you would like to discuss hours arrangements or simply would like to find out more about the role please see contact information below.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Dr Jasbir Dhillon&lt;/p&gt;\n&lt;p&gt;Job title Senior Clinical Psychologist&lt;/p&gt;\n&lt;p&gt;Email address Jasbir.Dhillon4@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number 07712230962&lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;Dr Kiran Chohan, Clinical Psychologist - kiranchohan@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central and North West London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120736"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St Pancras Rehabilitation Unit, South Wing at St Pancras Hospital, London", "postalCode": "NW1 0PE"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5365", "longitude": "-.131478"}}, "title": "Clinical Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253804", "validThrough": "2020-11-24T23:59:59+0000"}