{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 + 5% HCAS"}}, "datePosted": "2020-11-03T15:57:33+0000", "description": "&lt;p&gt;Surrey Downs Health &amp; Care is an innovative partnership between the three GP Federations, community trust and acute trust, Surrey Downs Health and Care is delivering true transformational change for adult community services across Surrey Downs to the benefit of patients and the local healthcare system. Our delivery model is formed around a shared vision and innovative use of the wealth and diversity of both the clinical and managerial experience that the partnership brings and as such it will provide a truly holistic, person-centred service that no one partner could provide on its own.&lt;/p&gt;\n&lt;p&gt;We are recruiting for a dedicated and motivated full time Band 6 Staff nurse to join our community nursing team in the Dorking Primary Care Network. You will work both autonomously and collaboratively within a supportive environment, ensuring excellent patient care whilst reassuring and helping families along the way. Emphasis is placed on the proactive vision of care for patients in the community setting, including caseload management, prevention of admission, enablement and end of life care. You will need to have community nursing experience and evidence of leading a team of nurses.&lt;/p&gt;\n&lt;p&gt;The team are based at Medwyn Surgery, close to Dorking High Street. There are excellent opportunities for personal development and supporting specialist interests. The community nursing service works over a 7 day week (8.00am to 18.30pm) and includes weekend and bank holiday working on a rotational basis.&lt;/p&gt;\n&lt;p&gt;Individuals will be expected to deliver and maintain a high standard of clinical and professional Nursing Care and to assist in the delivery of all aspects of individualised patient care.&lt;/p&gt;\n&lt;p&gt;In addition to the basic salary, this post attracts a High Cost Area Supplement of 5% of basic salary subject to a minimum payment of £1,034 and a maximum payment of £1,791 per annum (pro rata where applicable).&lt;/p&gt;\n&lt;p&gt;If you would like an informal visit to the team or have any queries please contact Emma Alderman, Operational Manager, emma.alderman@nhs.net&lt;/p&gt;\n&lt;p&gt;While this post remains within CSH, the post is accountable to Surrey Downs Health &amp; Care. This will not impact on any of your terms of employment.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123532.JPG", "name": "CSH Surrey", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123532"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Medwyn Surgery - Dorking", "postalCode": "RH4 1SD"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2348", "longitude": "-.324379"}}, "title": "Band 6 - Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254683", "validThrough": "2020-11-17T23:59:59+0000"}