{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pa pro rata"}}, "datePosted": "2020-11-02T09:46:23+0000", "description": "&lt;p&gt;&lt;strong&gt;Are you an outstanding nurse ready for your next challenge? Do you share our Trust values and strive for clinical excellence? Would you like to work in an outstanding Trust and make a difference to people’s lives?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;At UHBW, our nurses truly are the life blood of our Trust and we pride ourselves on creating a nurturing environment for our nursing staff to take the next step in their nursing journey. You may be ready for a change from your current specialty or it may be that you are at a point in your career where you&#39;ve got some itchy feet and just want a new environment. Whatever the case let us show you that UHBW is the place for you.&lt;/p&gt;\n&lt;p&gt;Due to service reconfiguration, our Respiratory ward has transferred to a much larger area. Therefore we are in a position to expand our workforce and offer new opportunities for Band 5 Staff Nurses to join this friendly and welcoming team. We now have 32 beds including 24 cubicles and 2 four-bedded bays. We care for patients who require both ward-based respiratory care and respiratory high care. Our highly skilled team provide interventions including NIV BIPAP/CPAP, High Flow Oxygen therapy and Tracheostomy care. We can provide support and training to develop the skills and knowledge to enable you to progress in this speciality.&lt;/p&gt;\n&lt;p&gt;We are looking for nurses who inspire others and who work harder because they want to, not because they have to. If you are highly motivated, enthusiastic and have excellent communication skills this could be the job for you.&lt;/p&gt;\n&lt;p&gt;At UHBW, we’ll give you the tools and support but you will be in full control of your development. Our nurses know why they chose to continue their nursing journey here, join us and find out your reason why.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Adelaide Campbell-Upton, Sister: Adelaide.Campbell-Upton@uhbw.nhs.uk&lt;/p&gt;\n&lt;p&gt;Suzanne Guest, Sister: Suzanne.Guest@uhbw.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120778.png", "name": "University Hospitals Bristol and Weston NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120778"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bristol Royal Infirmary, Bristol", "postalCode": "BS2 8HW"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4594", "longitude": "-2.59606"}}, "title": "Staff Nurse - Respiratory Ward", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251474", "validThrough": "2020-11-30T23:59:59+0000"}