{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "40000", "minValue": "40000", "unitText": "YEAR", "value": "£40000 (DOE)"}}, "datePosted": "2020-10-19T11:12:15+0100", "description": "&lt;p&gt;Nuffield Health is Britain’s largest not-for-profit healthcare organisation. Join us as a Orthopaedic Team Leader in our Tunbridge Wells Hospital and play your part in building a healthier nation.&lt;br /&gt;If you driven, motivated and want to be part of a team who are dedicated to delivering high quality care to patients please read through what we have to offer.&lt;br /&gt;&lt;br /&gt;The Role &lt;/p&gt;\n&lt;p&gt;As our Orthopaedic Team Leader you will:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Lead and organise the Orthopaedic team within theatre&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Smooth running of the theatre list and organising booking forms.  &lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Extensive Knowledge required for dealing with loans equipment.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;You will be required to work collaboratively and flexibly across the theatre suites to accommodate the service demands of each department.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;The role will include clinical sessions in theatre.&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The Person&lt;/p&gt;\n&lt;p&gt;To succeed as a Orthopaedic Team Leader you will need:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Minimum of 5 years post registration in orthopaedics experience.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Knowledge and understanding of surgical techniques and associated equipment is also essential.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Good communication and organisational skills and the ability to work as part of a team.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Must be NMC Registered Nurse or HCPC Registered Operating Department Practitioner.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Must be clinically excellent, be able to demonstrate strong leadership qualities, which includes leading a team to a shared vision and being able to promote innovation and sustainability.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Trained Surgical First assistant or Surgical Care Practitioner is ideal for this role&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; The Benefits &lt;/p&gt;\n&lt;p&gt;We want you to be the best you can be. We promise that we will support you with training opportunities, career development options and our unique health &amp; wellbeing focused benefits package. This includes free membership across all of our Fitness &amp; Wellbeing clubs, along with free private healthcare. Not only this, but we also offer a range of lifestyle and financial wellbeing benefits.&lt;/p&gt;\n&lt;p&gt;Be your best and join us in building a healthier nation. &lt;/p&gt;\n&lt;p&gt;Location - Tunbridge Wells&lt;br /&gt;Contract Type - Permanent&lt;br /&gt;Weekly hours - 37.5&lt;br /&gt;Salary - £38,000-£40,000 Depending on experience &lt;br /&gt;Closing date - 16/11/2020 &lt;/p&gt;\n&lt;p&gt;Applications will be considered as they are received and interviews will be arranged accordingly. We reserve the right to close adverts early, for example, where we have received an unprecedented high volume of applications. Therefore please apply early to ensure you are considered for the post.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/132134.jpg", "name": "Nuffield Health", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132134"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Tunbridge Wells", "postalCode": "TN2 4UL"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.1315", "longitude": ".278081"}}, "title": "Orthopaedic Team Leader", "url": "https://www.jobs.nhs.uk/xi/vacancy/916231970", "validThrough": "2020-11-16T23:59:59+0000"}