{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-11-04T10:16:16+0000", "description": "&lt;p&gt;Are you interested in working with adults with eating disorders? We are currently looking for an enthusiastic Dietitian to join our team of Dietitians working within Tees, Esk and Wear Valleys NHS Foundation Trust.&lt;/p&gt;\n&lt;p&gt;This exciting post offers the opportunity to work with adults with eating disorders as part of the Eating Disorders Day Service Team based in Teesside. This will be based at 9 - 11 Imperial Avenue Norton.&lt;/p&gt;\n&lt;p&gt;The successful post holder will work alongside the specialist team at the Intensive Day Service. The post holder will have the opportunity to participate in policy development, audit, research activities, catering as well as staff and student training.&lt;/p&gt;\n&lt;p&gt;Within the Trust there is an established team of 27 Dietitians, 4 Associate Practitioners and 4 Dietetic Assistants working in a number of clinical areas in Teesside, Darlington, County Durham, North Yorkshire and York. We have several experienced Lead Dieticians in the areas of adult eating disorders, children and young people, learning disabilities, older people and forensics.&lt;/p&gt;\n&lt;p&gt;We are rapidly developing a high profile as a good quality Dietetic service at both local and national levels. We have strong links with the Mental Health Group of the BDA as well as Teesside University and are committed to providing first class professional development.&lt;/p&gt;\n&lt;p&gt;Candidates should be a registered Dietitian with significant experience in Dietetics. They should have excellent communication and IT skills. A working knowledge of motivational interviewing would be desirable. Supervision will be provided by the Lead Dietitian for Adult Eating Disorders and there will be a strong emphasis on Continued Professional Development and specialist training. If applicable, costs of relocation will be met.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Applicants must ensure that prior to applying they have agreement from their current line manager that they can be released on a secondment basis.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;In the event that permanent funding is secured for this post the successful applicant will be confirmed in post on a permanent basis.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Sarah Elder, Lead Dietitian - 01642 550863&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122252.jpg", "name": "Tees, Esk and Wear Valleys NHS Foundation Trust ", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122252"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "9 - 11 Imperial Avenue, Norton", "postalCode": "TS20 2EW"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.5821", "longitude": "-1.30865"}}, "title": "Specialist Dietitian", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255340", "validThrough": "2020-11-11T23:59:59+0000"}