{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "56490", "minValue": "50575", "unitText": "YEAR", "value": "£50,575 - £56,490 per annum, inc HCA"}}, "datePosted": "2020-10-28T16:30:57+0000", "description": "&lt;p&gt;&lt;span&gt;King’s College Hospital NHS Foundation Trust part of King&#39;s Health Partners Academic Health Sciences Centre (AHSC), is one of the UK’s largest and busiest teaching hospitals with a turnover of nearly £1 billion, 1.5 million patient contacts a year and more than 12,600 staff based across 5 main sites in South East London and Kent.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Trust provides a full range of local hospital services across its different sites, and specialist services from King’s College Hospital (KCH) site in Camberwell and the Princess Royal University Hospital (PRUH) site in Bromley, Orpington Hospital, and some services at Beckenham Beacon and Queen Mary’s Sidcup.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Trust is recognised internationally for its work in liver disease and transplantation, neurosciences, cardiac, haemato-oncology, fetal medicine, stroke, major trauma, and Emergency Department.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Do you find yourself thinking of solutions to problems at work but never have the opportunity to make these a reality? Do you want to make trust-wide significant changes to improve the safety of medication use for our patients?&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;An exciting opportunity has arisen for a motivated, enthusiastic and experienced clinical pharmacist to join the King’s Medication Safety Team for one-year maternity leave cover. This is a fantastic opportunity to further develop leadership, problem-solving, change management and quality improvement skills. Reducing preventable harm caused by medication is a national priority; this role involves delivering the national and local medication safety agenda and driving a positive safety culture across the organisation.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Key attributes for the role:&lt;br /&gt;• Excellent problem-solving skills&lt;br /&gt;• Having an approachable and supportive nature&lt;br /&gt;• Ability to adapt to new and conflicting priorities&lt;br /&gt;• A good team player&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Many opportunities are available for personal and professional development as the post holder will develop and implement improvement initiatives and provide risk management expertise to colleagues across the Trust. They will also develop and implement Trust policies and guidelines, promote safe practice with medicines and represent the Medication Safety and Pharmacy teams.&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Interview date – 16th November 2020 &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameSeetal Jheeta PuaarJob titleConsultant Pharmacist Medication SafetyEmail addressseetal.puaar@nhs.netTelephone number02032991493&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "King's College Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120921"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Princess Royal University Hospital, Orpington", "postalCode": "BR6 8ND"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3657", "longitude": ".059653"}}, "title": "Medication Safety Pharmacist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247390", "validThrough": "2020-11-08T23:59:59+0000"}