{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "103806", "minValue": "97357", "unitText": "YEAR", "value": "£97,357 - £103,806 Per Annum"}}, "datePosted": "2020-11-02T14:16:46+0000", "description": "&lt;p&gt;&lt;/p&gt;\n&lt;p&gt;A vacancy has arisen in the Health Board for a Consultant Oral &amp; Maxillofacial Surgeon with an interest in Head and Neck Oncology and Reconstruction based in Royal Glamorgan Hospital, Llantrisant. Other hospitals at which duties are performed: Prince Charles Hospital, Merthyr. The successful candidate would complement a department of 6 Dental Core Trainees, 1 Specialty Trainee, 6 Associate Specialists/Specialty Doctors and 7 consultants. The department provides Oral &amp; Maxillofacial surgery, Restorative Dentistry &amp; Orthodontic Dentistry for the Cwm Taf Morgannwg &amp; Powys catchment area.&lt;/p&gt;\n&lt;p&gt;Cwm Taf Morgannwg University Health Board currently provides dental services to around 500,000 people. The Health Board primarily serves the residents of Merthyr Tydfil and Rhondda Cynon Taff as well as residents of North Cardiff, parts of the Rhymney Valley, South Powys and other adjacent health communities. Residents of Rhondda Cynon Taff, from Treherbert and Maerdy in the North to Ynysybwl, Llantrisant and Beddau in the South, the Cynon Valley in the centre and Merthyr Tydfil and the Rhymney Valley in the East will use the services provided by the Health Board.&lt;/p&gt;\n&lt;p&gt;In addition, the Health Board provides some specialist services to the catchment areas of Bridgend and Caerphilly.&lt;/p&gt;\n&lt;p&gt;Potential candidates must have or be eligible for GDC registration.&lt;/p&gt;\n&lt;p&gt;South East Wales is a delightful place to live, with easy access to the coast and the outstanding natural beauty of the Brecon Beacons National Park and the Wye Valley. The area offers excellent opportunities for many outdoor pursuits including hill walking, mountain biking, mountaineering and a variety of water sports.&lt;/p&gt;\n&lt;p&gt;Cardiff, the Capital city of Wales, is only 13 miles from Llantrisant with established air, rail and sea links providing easy access for travel throughout the UK and beyond. It is a vibrant, cosmopolitan city offering a wide variety of bars, restaurants, sporting and concert venues, theatres, art galleries as well as the new St David’s shopping centre.&lt;/p&gt;\n&lt;p&gt;Only electronic applications via the NHS Jobs site application form will be accepted for this post.&lt;strong&gt;     &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Informal enquiries are welcomed contacting Mr Shakir Mustafa (Consultant Oral Surgeon) on 01685 728142&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123872.png", "name": "Cwm Taf Morgannwg University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123872"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Glamorgan Hospital, Llantrisant", "postalCode": "CF72 8XR"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5476", "longitude": "-3.39093"}}, "title": "Consultant Oral &amp; Maxillofacial Surgeon", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252399", "validThrough": "2020-11-23T23:59:59+0000"}