{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-11-06T16:16:20+0000", "description": "&lt;p&gt;The Improving Access to Psychological Therapies (IAPT) programme is driving forward the expansion of its delivery of psychological interventions. This is an excellent opportunity to join a large and innovative NHS Foundation trust in which Talking Space Plus services has a strong track record for supporting the development of psychological therapy services.&lt;/p&gt;\n&lt;p&gt;We are looking for people who have the enthusiasm and skills to join our service and who are committed to making a difference within primary care and the wider community. We are looking for a motivated and enthusiastic, skilled individual who will support a developing workforce and service delivery model in primary care.&lt;/p&gt;\n&lt;p&gt;The Trainee High Intensity Therapist will be a core member of the Service, undertaking training to provide high intensity interventions – initially Cognitive Behavioural Therapy (CBT), whilst working in a training role working with clients who have a range of anxiety and depression related problems for which CBT is demonstrated to be clinically effective.&lt;/p&gt;\n&lt;p&gt;The post involves providing psychological assessments and evidence based interventions for people with common mental health problems and people living with long term physical health conditions (on the telephone and in an individual and group setting). You will be based at TalkingSpace Plus venues within Oxfordshire and provide treatment in GP practices and community venues located around the county.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Core Professionals&lt;/strong&gt;: Potential candidates will hold a recorded/registered qualification in one of the following at graduate level: nursing, social work, occupational therapy, arts therapy or within a psychological therapy.&lt;/p&gt;\n&lt;p&gt;You will have experience of working in a stepped care service for anxiety and depression in addition to being able to evidence ability to work towards the full range of skills and competencies as laid out in the competence framework for CBT (Roth and Pilling, 2007).&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Alternatively you can apply needing to&lt;/strong&gt; &lt;strong&gt;demonstrate and provide evidence that you have practiced within the career framework of training and working in mental health and can produce a full and completed KSA Portfolio &lt;/strong&gt;as defined by the BABCP requirements.&lt;/p&gt;\n&lt;p&gt;This with evidence of knowledge, skills and attitude (KSA) competences. If invited to interview, this evidence should be brought to interview where it will be reviewed by a KSA assessor from the University of Reading to ensure it meets BABCP requirements. Further information on how to assemble a KSA portfolio and full criteria requirement can be found on the BABCP website. Any place on the training course is conditional on a completed KSA portfolio.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Psychological Wellbeing Practitioners (PWPs) cannot be recruited as HI IAPT trainees until two years post qualification and&lt;/strong&gt; &lt;strong&gt;are&lt;/strong&gt; &lt;strong&gt;expected to have practised in this role for two years to consolidate their skills.&lt;/strong&gt; These two years of practice commence only at the date of confirmation of the full PWP qualification by the University, not at the end of the teaching timetable. This standard is monitored nationally by the BABCP.&lt;/p&gt;\n&lt;p&gt;All successful candidates will undertake an intensive one year Post-Graduate Diploma IAPT: High Intensity Psychological Therapies at the University of Reading (please visit the University of Reading website for further information on course registration requirements). Post-holders must be able to attend all university training as required. Most teaching will be 2 days per week in conjunction with a minimum period of high intensity CBT clinical practice per week working within the service. You will also receive clinical supervision from the University and TalkingSpace Plus from BABCP accredited supervisors.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;All successful candidates will need to be in a position to commence employment with Oxford Health Foundation Trust in March 2021.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;When completing the supporting information section of the application form, candidates should relate directly to the person specification requirements in the job description and should be answered in the same order as the specification.&lt;/p&gt;\n&lt;p&gt;The qualifications, training &amp; experience requirements for the role are underlined in the Job Description/Person Specification. Shortlisting of application forms will be based only on the supporting information provided. CVs will not be considered.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameLiam CuttellTelephone number01865 901222&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Oxford Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122233"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Slade, Abell House, Oxfordshire", "postalCode": "OX3 7JH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7435", "longitude": "-1.19866"}}, "title": "Trainee High Intensity Cognititive Behaviour Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916260576", "validThrough": "2020-11-22T23:59:59+0000"}