{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 pro rata per annum"}}, "datePosted": "2020-10-28T14:01:21+0000", "description": "&lt;p&gt;Band 7 Team Lead Early Years Speech and Language Therapist&lt;/p&gt;\n&lt;p&gt;18.75 Hours per week (0.5 wte) Fixed term for 12 months&lt;/p&gt;\n&lt;p&gt;This is an opportunity to effectively lead and oversee the Early Years Service in the Thanet area of the Children&#39;s Speech and Language Therapy Team, East Locality operationally on a day to day basis, working across the East locality alongside the Early Years Team Lead in Canterbury/Coastal.&lt;/p&gt;\n&lt;p&gt;Kent Community Health NHS Foundation Trust provides wide-ranging NHS care for people, in their community, in a range of settings including people&#39;s own homes; nurseries; schools, health centres and community hospitals.&lt;/p&gt;\n&lt;p&gt;We are one of the largest NHS community health providers in England, serving a population of about 1.4 million. We employ 5,000 staff, including community nurses, physiotherapists, dietitians, and many other healthcare professionals.&lt;/p&gt;\n&lt;p&gt;Our vision is to deliver excellent services which improve the health of our communities. To do this we need to have outstanding people who share a common set of values and aspirations.&lt;/p&gt;\n&lt;p&gt;As a dynamic organisation, with a fast changing service provision we take a flexible approach in terms of what we are able to offer. This means that we reserve the right to change the hours detailed in this advert to full time or part-time to meet the service requirements.&lt;/p&gt;\n&lt;p&gt;Successful applicants will be contacted via email with regards to interview details. Please note that where the salary stated above is based on full time working it should be pro rata for part time working.&lt;/p&gt;\n&lt;p&gt;We are committed to a policy of equality in all our employment practices and strive to eliminate unfair discrimination, harassment, bullying and victimisation. Equality of opportunity is a high priority within the Trust. The Trust will not unlawfully, unfairly or unreasonably discriminate or treat individuals less favourably on the grounds of gender, marital status, sexual orientation, religion or belief, disability, age, race, nationality or ethnic origin. Please contact us if you need the application form in an alternative format.&lt;/p&gt;\n&lt;p&gt;In cases where we receive a high volume of applications for a post, we may bring the closing date forward. Therefore you are advised to submit your completed application form as early as possible to avoid disappointment. We regret we cannot contact everyone who is not short-listed for an interview, therefore if you do not hear from us in 21 days after the closing date, please assume you have not been successful on this occasion. All information you supply in support of your application for employment should, to the best of your knowledge, be true and accurate. The Trust reserves the right to contact and share information with the NHS Protect if they suspect any information to be deliberately misleading.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interviews will be held on the 23rd November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameLesley PerryJob titleLocality Clinical ManagerEmail addresslesley.perry@nhs.netTelephone number03001238112Additional contact information&lt;/p&gt;\n&lt;p&gt;For further details or informal visits please contact: Helen Caiels Team Lead Early Years Speech and Language Therapist, East Locality Children&#39;s Therapies.&lt;/p&gt;\n&lt;p&gt;Tel: 0300 123 8112&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120633.png", "name": "Kent Community Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120633"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Greenbanks Margate, East Kent", "postalCode": "CT9 5PA"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3789", "longitude": "1.36304"}}, "title": "Team Lead Early Years Speech and Language Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246883", "validThrough": "2020-11-10T23:59:59+0000"}