{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-10-13T11:16:05+0100", "description": "&lt;p&gt;Chief Clinical Physiologist Team Leader (Invasive Cardiology including Electrophysiology)&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for a highly motivated and enthusiastic individual&lt;br /&gt;to join our busy and dynamic cardiac physiology team at The Newcastle upon Tyne&lt;br /&gt;Hospitals NHS Foundation Trust.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;We are currently seeking a Chief Cardiac Physiologist to join our friendly but&lt;br /&gt;dedicated team. The post will be predominantly based in the Cardiac Cath Lab&lt;br /&gt;focusing mainly on electrophysiology and coordinating junior staff in all aspects of&lt;br /&gt;invasive service. This post would suit an individual looking to enhance their&lt;br /&gt;knowledge and develop specialist electrophysiology/invasive skills. Our&lt;br /&gt;internationally renowned Cardiothoracic Directorate provides secondary and tertiary&lt;br /&gt;Cardiac and transplantation services to the North of England and beyond. The&lt;br /&gt;successful applicant will therefore be working at the cutting edge of&lt;br /&gt;Electrophysiology within this setting. Candidates should have experience working&lt;br /&gt;independently within EP and proficient in the use of 3D mapping.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;The post holder will be expected to work alongside the Professional Lead Cardiac&lt;br /&gt;Physiologist and deputise in planning meetings, able to perform appraisals for&lt;br /&gt;physiology staff working in Invasive areas and have full oversight of E-rostering.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Continued professional and personal development is actively encouraged and&lt;br /&gt;successful candidates will be given opportunities and will be supported to develop&lt;br /&gt;their postgraduate skills.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;The post holder is required to participate in the electrophysiology on-call rota ,&lt;br /&gt;providing 24 hour emergency service cover. Applicants must possess BSc (Hons) in&lt;br /&gt;Cardiac Physiology or equivalent, BHRS and registration with RCCP or equivalent is&lt;br /&gt;essential.&lt;/p&gt;\n&lt;p&gt;Full time 37 Hours 30 Minutes/Week&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121053.jpg", "name": "The Newcastle upon Tyne Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121053"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "317 01 Freeman Hospital", "postalCode": "NE7 7DN"}, "geo": {"@type": "GeoCoordinates", "latitude": "55.0028", "longitude": "-1.59341"}}, "title": "Chief Clinical Physiologist Team Leader", "url": "https://www.jobs.nhs.uk/xi/vacancy/916223972", "validThrough": "2020-11-06T23:59:59+0000"}