{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "73664", "minValue": "63751", "unitText": "YEAR", "value": "£63,751 - £73,664 per annum"}}, "datePosted": "2020-10-27T11:16:33+0000", "description": "&lt;p&gt;Post title: Head of Corporate Finance&lt;/p&gt;\n&lt;p&gt;Salary: Band 8C&lt;/p&gt;\n&lt;p&gt;Accountable to: Deputy Director of Finance&lt;/p&gt;\n&lt;p&gt;Location: Dewi Sant hospital, Pontypridd&lt;/p&gt;\n&lt;p&gt;Cwm Taf Morgannwg Health Board is looking for an ambitious finance professional to join the Senior Management Team in Finance, providing leadership and direction to improve the overall financial management and performance of the Health Board.&lt;/p&gt;\n&lt;p&gt;The Head of Corporate Finance will have significant opportunities for personal and professional development as well as exposure to a wide range of issues and challenges. The post holder will:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;provide overall leadership and direction to the Corporate Finance Team (CFT), consisting of Financial Accounting, Financial systems and governance, Accounts Receivable and Treasury.&lt;/li&gt;\n&lt;li&gt;provide strategic leadership for the Health Board’s finance and business intelligence systems and ensure that the integrity of the organisation’s main accounting and reporting systems is maintained at all times.&lt;/li&gt;\n&lt;li&gt;deliver effective internal controls over all financial systems which comply with financial control standards and best practice.&lt;/li&gt;\n&lt;li&gt;manage the preparation of the Heath Board’s Annual statutory accounts (including Charitable Funds)&lt;/li&gt;\n&lt;li&gt;take the lead role in liaising with the internal and external auditors regarding the audit plans, Internal Audit reports, resolution to and monitoring of audit recommendations, reporting to the Audit Committee.&lt;/li&gt;\n&lt;li&gt;act as the Health Board’s technical lead and provide advice and interpretation on the application of accounting standards and guidance provided by regulatory bodies including HMRC.&lt;/li&gt;\n&lt;li&gt;provide professional insight, expertise and judgement on matters relating to accounting and reporting, the formulation and direction of the financial services strategy, and the development and maintenance of the financial processes and controls.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The successful candidate will:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;be a qualified accountant with experience of working in a large complex organisation,&lt;/li&gt;\n&lt;li&gt;be a natural leader, team player with a can do attitude and strong communication and influencing skills&lt;/li&gt;\n&lt;li&gt;be technically strong with a passion for best practice and a keen eye for detail.&lt;/li&gt;\n&lt;li&gt;bring experience, vision, strategic thinking and energy to help shape and develop the Health Board’s finance and business intelligence systems.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Interview dates: TBC&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; Welsh and/or English speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt;Closing Date: 15/11/2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Mark Thomas&lt;/p&gt;\n&lt;p&gt;Job title: Deputy Dierctor of Finance&lt;/p&gt;\n&lt;p&gt;Email address: Mark.thomas5@wales.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number: 01443 443845&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123872.png", "name": "Cwm Taf Morgannwg University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123872"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Dewi Sant Hospital, Pontypridd", "postalCode": "CF37 1LB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.598", "longitude": "-3.34377"}}, "title": "Head of Corporate - Finance", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244194", "validThrough": "2020-11-15T23:59:59+0000"}