{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-10-27T13:23:12+0000", "description": "&lt;p&gt;An opportunity has arisen for a Band 6 Respiratory Specialist Nurse/Occupational Therapist/Physiotherapist to join the Community Respiratory Team at Frimley Hospital Foundation Trust.&lt;/p&gt;\n&lt;p&gt;We are looking for a dynamic and enthusiastic practitioner with a special interest in Respiratory care to develop an exciting and innovative integrated community service managing complex patients who suffer from chronic lung conditions.&lt;/p&gt;\n&lt;p&gt;We invite applications from a wide group of practitioners who have recent clinical experience within the Respiratory field, along with expertise in assessing and treating this client group. The applicant would have an excellent understanding of the effects of Respiratory conditions on individual function and quality of life, and interventions for both the physical and psychological well-being of patients.&lt;/p&gt;\n&lt;p&gt;The post holder will work jointly with physiotherapists and nurses within the respiratory team as well as community colleagues and will promote and maintain a collaborative working with the Respiratory Consultants and Clinical Nurse Specialists for the in-patient service.&lt;/p&gt;\n&lt;p&gt;The post holder must be able to demonstrate the ability to take on new challenges, and actively participate on the continuous development of this new service. They must have knowledge and skills to participate in local and national audits and collect and report data.&lt;/p&gt;\n&lt;p&gt;This role requires the applicant to have significant post graduate NHS experience and knowledge of dealing with patients that require psychological support and breathlessness management. In addition, excellent communication skills are essential and the ability to manage and prioritize a large caseload of patients with complex needs.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Daniela Nedelcu&lt;/p&gt;\n&lt;p&gt;Job title Team Lead FHFT Community Respiratory Service&lt;/p&gt;\n&lt;p&gt;Email address daniela.nedelcu@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number 01483782237&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121099.png", "name": "Frimley Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121099"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Farnham Hospital, Farnham", "postalCode": "GU9 9QL"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2206", "longitude": "-.784694"}}, "title": "Respiratory Specialist Nurse/Occupational Therapist/Physiotherapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244716", "validThrough": "2020-11-10T23:59:59+0000"}