{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "33000", "minValue": "33000", "unitText": "YEAR", "value": "up to £33,000 pro rata per annum DOE"}}, "datePosted": "2020-11-04T11:55:49+0000", "description": "&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;I help to make a difference!&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;HMP Pentonville is a large purpose built healthcare centre which has 22 inpatient beds, a day care facility for Practice Plus Group are Health in Justice Market leader, providing healthcare services to offenders across the country. Our model of care is our Wellbeing Approach – an integrated, comprehensive approach in recognition of the fact prisoners are a socially-excluded group with healthcare needs which are complex and often associated with poor outcomes. It adopts the premise no single health/wellbeing factor can be taken in isolation of other motivational issues which might impact a person’s care.&lt;/p&gt;\n&lt;p&gt;To ensure the continued quality of care at HMP Pentonville, we’re looking for a Pharmacy Technician to come and join our team on a part time basis.&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;A little bit about the job...&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;As a Pharmacy Technician, you will assist with the provision and delivery of an integrated, safe, legal, high quality prison pharmaceutical service, taking into consideration, at all times, the need to maintain a high level of security.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will be required to support the delivery of Pharmacy Services, which will be part be of a comprehensive healthcare package, based on the prison service’s needs. As a Pharmacy Technician, you will be an integral member of the Pharmacy Team, which forms part of the wider cluster of Healthcare Services. Practice Plus Group policies and procedures and statutory frameworks governing patient care in a prison setting, will be used in order to deliver the highest standard of care to clients in line with National Guidelines.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You&#39;ll be required to accept certain activities in relation to the day to day operational management of their unit and as such must ensure that they are trained and competent to take on these additional responsibilities. You may be required to take on a role of working across multiple Pharmacy Services if and when required.&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;A little bit about you...&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;You will hold NVQ Level 3, BTEC or equivalent qualifications and must have a current registration with the General Pharmaceutical Council. You will also have relevant post-registration experience working within a multi-disciplinary team. &lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;More Information...&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;HMP Pentonville is a Cat B/Local Men&#39;s Prison situated in N7, London.&lt;/p&gt;\n&lt;p&gt;On each of the wings there is a primary care facility incorporating a GP&#39;s clinic and area for dispensing of medication. These also include; Dentistry, Ophthalmology, Podiatry &amp; Physiotherapy.&lt;/p&gt;\n&lt;p&gt;This is a part time role working 22.5 hours per week.&lt;/p&gt;\n&lt;p&gt;Salary for this role is anything up to £33,000 pro rata per annum - depending on experience.&lt;/p&gt;\n&lt;p&gt;Please note that offers of employment are subject to receipt of of satisfactory references, enhanced DBS check and prison vetting.&lt;/p&gt;\n&lt;p&gt;At Practice Plus Group we actively promote diversity and equal opportunities.&lt;/p&gt;\n&lt;p&gt;We reserve the right to close this job once we have received sufficient number of applications.&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Practice Plus Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130136"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "London", "postalCode": "N7 8TT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5442", "longitude": "-.116957"}}, "title": "Part Time Pharmacy Technician- HMP Pentonville", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255693", "validThrough": "2020-11-18T23:59:59+0000"}