{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-10-16T14:00:47+0100", "description": "&lt;p&gt;Calling band 6 and 7 pharmacists! We are looking for the next generation of oncology pharmacists.&lt;/p&gt;\n&lt;p&gt;We would welcome applications from band 7s looking to enhance or begin their careers in cancer services. Alternatively if you are a band 6 with substantial hospital experience, working towards a post graduate certificate all you will need is a keen interest in oncology. In this situation we can provide the opportunity for a 6 to 7 progression post based on a competency framework with incremental enhancement.&lt;/p&gt;\n&lt;p&gt;Oncology experience is desirable but not essential. All the necessary training will be provided as you rotate through adult oncology, paediatric oncology and technical services.&lt;/p&gt;\n&lt;p&gt;You will have the opportunity to develop clinical and managerial skills in every facet of pharmaceutical care required to deliver a clinical pharmacy service to oncology patients aged from infant to old age.&lt;/p&gt;\n&lt;p&gt;Cancer services is a continuously growing area and we have a truly successful cancer services rotation with our recent rotational pharmacists being promoted to 8A Advanced Oncology Pharmacists. You would also get to work in Brighton, a vibrant city providing a fantastic work life balance being placed between the sea and the South Downs&lt;/p&gt;\n&lt;p&gt;The successful candidate, within each rotation, will be presented with an exciting and unique opportunity to work closely as part of a dedicated multi-disciplinary team, with the ability to make a significant contribution to medicines management for all patients within the oncology service as well as play an integral role in the governance frameworks for the unit ranging from procedure and guideline writing to authoring of chemotherapy prescriptions on the Chemocare® prescribing system.&lt;/p&gt;\n&lt;p&gt;The successful candidate, within the paediatric rotation, will also play an integral role in managing our paediatric oncology level 3 unit. There will also be the opportunity with the paediatric rotation to experience areas beyond oncology, being trained to deliver care to our tertiary neonatal unit or to general paediatric patients.&lt;/p&gt;\n&lt;p&gt;Attainment of a clinically enhanced pharmacist independent prescribing qualification during the rotations is encouraged following completion of a clinical diploma or equivalent experiential portfolio.&lt;/p&gt;\n&lt;p&gt;The post holder will also manage a band 6 pharmacist providing the opportunity to build on managerial skills.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Summer Ibrahim&lt;/p&gt;\n&lt;p&gt;Job title Lead Specialist Pharmacist Oncology&lt;/p&gt;\n&lt;p&gt;Email address summer.ibrahim2@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number 01273 696955 ext. 64183&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Additional contact information&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;David Annandale,&lt;/p&gt;\n&lt;p&gt;Lead Pharmacist Women’s &amp; Children&lt;/p&gt;\n&lt;p&gt;01273 696955 ext. 2491 or pager 8694&lt;/p&gt;\n&lt;p&gt;d.annandale@nhs.net&lt;/p&gt;\n&lt;p&gt;or&lt;/p&gt;\n&lt;p&gt;Caroline Aherne,&lt;/p&gt;\n&lt;p&gt;Advanced Cancer Services Pharmacist&lt;/p&gt;\n&lt;p&gt;01273 696955 ext 63382&lt;/p&gt;\n&lt;p&gt;caroline.aherne@nhs.net&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Brighton and Sussex University Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120968"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Sussex County Hospital, Brighton", "postalCode": "BN2 5BE"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8195", "longitude": "-.118149"}}, "title": "Specialist Rotational Pharmacist, Cancer Services (Adult &amp; Paediatric", "url": "https://www.jobs.nhs.uk/xi/vacancy/916230503", "validThrough": "2020-11-15T23:59:59+0000"}