{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "73664", "minValue": "63751", "unitText": "YEAR", "value": "£63,751 - £73,664 per annum"}}, "datePosted": "2020-11-05T11:01:33+0000", "description": "&lt;p&gt;&lt;strong&gt;Tissue Viability and Wound Care Consultant Practitioner / Nurse &lt;/strong&gt;– full time – substantive role – band 8c&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Are you an expert in tissue viability and wound care management and looking for a Consultant Practitioner post?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Team NNUH are looking for a Tissue Viability and Wound Care Consultant Practitioner to proactively lead the strategic and professional direction of our Tissue Viability Services.&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity for the right candidate to lead the development and redesign of our patient pathways. You may be an advanced care practitioner with experience in tissue viability, wound care or podiatry; or perhaps you are a consultant nurse or practitioner looking for your next challenge?&lt;/p&gt;\n&lt;p&gt;The ideal candidate should be a compassionate and transformational leader, you will be working across professional and organisational boundaries with the aim of improving continuity of care and optimising patient care, experience and outcomes.&lt;/p&gt;\n&lt;p&gt;You will lead services within our Acute trust and will also be required to scope services across Community services, you should therefore be able to demonstrate system leadership ability, be able to build professional relationships at all levels and engage and influence key stakeholders when required.&lt;/p&gt;\n&lt;p&gt;The ideal candidate should be educated to the required level, have extensive expert clinical experience and continuous service at a clinical advance level, you should have experience mentoring, delivering education programmes and previous involvement working with local and national networks.&lt;/p&gt;\n&lt;p&gt;This post is a new role and would be suited to someone who has the ability to provide expert clinical practice, has a high degree of autonomy and will act as an expert resource. You will also have the ability to build strong professional relationships with staff at all levels, to evolve within the role and drive service and quality improvements.&lt;/p&gt;\n&lt;p&gt;If you would like to find out more about this challenging new post, please get in touch.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Full time:&lt;/strong&gt; 37.5 hours per week&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview date:&lt;/strong&gt; TBC&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Open for applications:&lt;/strong&gt; 5th November 2020&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Close for applications:&lt;/strong&gt; 19th November 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Debbie Whittaker, Deputy Chief Nurse via PA Jane McCluskey&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Email: &lt;/strong&gt;jane.mccluskey@nnuh.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122492.jpg", "name": "Norfolk and Norwich University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122492"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Norfolk and Norwich University Hospital, Norwich", "postalCode": "NR4 7UY"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6181", "longitude": "1.22109"}}, "title": "Tissue Viability and Wound Management Consultant Practitioner / Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257356", "validThrough": "2020-11-19T23:59:59+0000"}