{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-11-04T11:01:19+0000", "description": "&lt;p&gt;Durham and Darlington Adult Mental Health Services are continuing to develop urgent care responses within the locality. As a part of this we have successfully bid to provide a &#39;help line&#39; service to members of the public who may be experiencing mental health symptoms or have concerns about their mental health.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;This is an exciting and important addition to our existing urgent care provision within the locality, and it is anticipated will be a well utilised point of support and contact by members of the public, health care professionals and other agencies. It will provide a much needed point of contact for individuals who may not feel they need &#39;crisis&#39; interventions but have concerns about their mental well being, and are seeking additional information or advice as to where they can access support.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;We are looking for highly motivated applicant who want to make a difference to others at the point they contact services seeking advice and support. You will have excellent interpersonal skills, be compassionate, calm and confident in providing appropriate interventions to callers and in supporting junior staff who will be the first point of contact for the majority of those contacting the service.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;You will be working as part of a team within this 24 hour/7 day a week service and working closely with other teams who provide urgent care within the Trust - such as Crisis Teams and Street Triage.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Applicants will need to demonstrate the ability to work on their own initiative, and to work flexibly and cooperatively as part of a team. They will also benefit from having worked within a customer service environment, though this is not essential.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;You will be:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;expert in validating, de-escalating crisis and coaching people in distress both over the phone and face to face where required&lt;br /&gt;highly skilled in working with clients experiencing Mental Health distress or who are in crisis&lt;/li&gt;\n&lt;li&gt;able to utilise a range of brief psychological interventions to empower patients, carers and their families to manage distress and crisis effectively&lt;br /&gt;skilled at managing immediate risk, providing support and response appropriate to the immediate situation&lt;/li&gt;\n&lt;li&gt;able to promote a recovery model that empowers patients, carers and relatives to be at the forefront of decision making&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;See job description for full set of information regarding skills and required qualifications for this role.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Trish Slack, Project Manager&lt;/p&gt;\n&lt;p&gt;07876 145311&lt;/p&gt;\n&lt;p&gt;Emma Burke, Service Manager&lt;/p&gt;\n&lt;p&gt;emma.burke3@nhs.net&lt;/p&gt;\n&lt;p&gt;07585100288&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122252.jpg", "name": "Tees, Esk and Wear Valleys NHS Foundation Trust ", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122252"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Auckland Park Hospital, Bishop Auckland", "postalCode": "DL14 6AE"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.6548", "longitude": "-1.68087"}}, "title": "Supervisor/Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255495", "validThrough": "2020-11-12T23:59:59+0000"}