{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 - £19,337 pa"}}, "datePosted": "2020-10-28T12:17:06+0000", "description": "&lt;p&gt;Seacole Virtual Hospital is a 58 bedded virtual community hospital set across 5 sites in Milton Keynes. including WICU which is a 19 bedded intermediate care rehabilitation unit. The hospital was initially set up as part of the MK wide system response to Covid 19 and has gone from strength to strength.&lt;/p&gt;\n&lt;p&gt;The next exciting phase of the hospital is to repurpose the beds in WICU to provide specialist beds for both Post Stroke rehabilitation and Post Surgical Ortho-Geriatric rehab. This is an exciting pathway development between MKUHFT and CNWL aimed at improving outcomes for patients and reducing length of stay.&lt;/p&gt;\n&lt;p&gt;We are excited to be working towards this joint initiative which we believe will bring further specialist clinical opportunities. We are exploring rotational posts and joint learning posts to facilitate these holistic pathways.&lt;/p&gt;\n&lt;p&gt;We are looking for Health and Support Rehabilitation Practitioners who are kind and caring but also understand the importance of rehabilitation and working with patients to improve their independence. In return for everything you give you will receive, support, development, dedicated supervision and a first class learning experience of all aspects of rehabilitation care.&lt;/p&gt;\n&lt;p&gt;The position will include shift work, including early and late shifts, weekends and night duty.&lt;/p&gt;\n&lt;p&gt;We would encourage an informal discussion and where possible a visit to the unit..&lt;/p&gt;\n&lt;p&gt;To arrange an informal discuss or visit then please contact Dawn Caine on 01908 376 415 or via email on dcaine@nhs.net&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDawn CaineJob titleWard ClerkEmail addressdcaine@nhs.netTelephone number01908 376415Additional contact information&lt;/p&gt;\n&lt;p&gt;Vanessa North - B7 Nursing Lead - 01908 376415&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central and North West London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120736"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Windsor Intermediate Care Unit, Milton Keynes", "postalCode": "MK3 6EN"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.9974", "longitude": "-.747617"}}, "title": "Healthcare &amp; Rehabilitation Support Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246544", "validThrough": "2020-11-11T23:59:59+0000"}