{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "39681", "minValue": "32933", "unitText": "YEAR", "value": "£32,933 - £39,681 Incl Fringe HCAS"}}, "datePosted": "2020-10-29T10:54:21+0000", "description": "&lt;p&gt;Surrey and Borders Partnership NHS Foundation Trust are looking to recruit a Band 6 Physiotherapist to work in our Working Age Adults (three days per week / 22.5 Hours) Mental Health in-patient units at the Abraham Cowley Unit, Chertsey and Farnham Road Hospital, Guildford.&lt;/p&gt;\n&lt;p&gt;You will be working within the Acute Therapy Service providing physiotherapy assessment and treatment for service users with mental health needs to the Adult Acute Inpatient Wards. The team is multidisciplinary and provides a variety of therapeutic interventions including Psychology, Occupational Therapy and Diversional Activity.&lt;/p&gt;\n&lt;p&gt;The potholder’s duties will be and contributing to the multidisciplinary care of in-patients both, direct clinical contacts and at team level. The post holder will be expected to demonstrate good skills and a strong commitment to working in partnership with multidisciplinary colleagues.&lt;/p&gt;\n&lt;p&gt;Our Services are committed to working in partnership to deliver high quality care and a recovery based approach to mental health services. We are passionate about ensuring that both the physical and emotional needs of people using our services are met.&lt;/p&gt;\n&lt;p&gt;In return, you will enjoy working with a supportive, experienced, enthusiastic team and will benefit from the Trusts commitment to staff development, supervision and training. We will offer you an active clinical supervision infrastructure, an individually tailored development plan; opportunities to gain a breadth of experience across mental health areas and of course the boost to your career of playing an important role in the development of our service&lt;/p&gt;\n&lt;p&gt;If you would like to discuss the post in more detail, contact&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Michelle Marland, Acute Therapy Service Manager on michelle.marland@sabp.nhs.uk&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121260.jpg", "name": "Surrey and Borders Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121260"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Chertsey and Guildford", "postalCode": "KT16 0AE"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3793", "longitude": "-.528933"}}, "title": "Physiotherapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247994", "validThrough": "2020-11-12T23:59:59+0000"}