{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "35000", "minValue": "33000", "unitText": "YEAR", "value": "£33,000 - £35,000 depending on experience"}}, "datePosted": "2020-10-14T10:52:44+0100", "description": "&lt;p&gt;The friendly team at Priory Hospital Southampton has received an OUTSTANDING CQC rating in the Caring inspection area and is rated GOOD overall. The report on CAMHS stated that the &quot;young people said that &quot;they felt safe on the ward and the staff treated them well&quot;. It also noted that the leaders on the service &quot;had the intergrity, skills and abilities to run it&quot;.&lt;/p&gt;\n&lt;p&gt;Job Advert Role Description&lt;/p&gt;\n&lt;p&gt;The role of the Deputy Ward Manager is to provide senior nursing leadership to the ward nursing team in support of the Ward Manager. They will have a degree of clinical experience and leadership that provides expertise and confidence to the nursing team and ward overall. They will have defined delegated responsibilities from the Ward Manager; have 1 day a week protected time for their deputy Ward Manager duties and have supervisory responsibilities for an agreed group of staff. The successful applicant will be patient centred and have the clinical ability to provide a high quality evidence based service, and the management skills to support the Ward Manager and the multi-disciplinary team. You will need to be a confident and effective leader who is motivated, dynamic and have a good working knowledge in mental health.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Responsibilities of the Deputy Ward Manager include:&lt;/p&gt;\n&lt;p&gt;• Works as Senior Nurse in a Ward or equivalent area ensuring a safe and therapeutic environment for patients, their families and visitors&lt;/p&gt;\n&lt;p&gt;• Applies relevant policies and statutory requirements within the ward and hospital framework of governance and communicates requirements to the wider team.&lt;/p&gt;\n&lt;p&gt;• Ensures that risk is assessed and managed across the immediate and wider working environment and that statutory requirements are met.&lt;/p&gt;\n&lt;p&gt;• Respects and applies the requirements of equality and diversity, promoting and role modelling these across the team.&lt;/p&gt;\n&lt;p&gt;• Identifies deficits in skill mix and safe staffing levels and acts to address these.&lt;/p&gt;\n&lt;p&gt;• Supervises a defined group of team members and contributes to their overall CPD, mandatory training and appraisal process recognising the skills required across the team. This will also include addressing any performance issues that are below the expected standard.&lt;/p&gt;\n&lt;p&gt;• Acts as a role model to promote a culture of learning development, inquiry and a team vision.&lt;/p&gt;\n&lt;p&gt;• Implements, monitors and evaluates therapeutic interventions within an overall care programme, enabling people with mental health and or learning disability needs to develop coping strategies.&lt;/p&gt;\n&lt;p&gt;• Actively supports and contributes to effective Multi Disciplinary Working&lt;/p&gt;\n&lt;p&gt;• Engages in collaborative problem solving, supporting and encouraging clients to take ownership of issues, identify problems and to develop solutions to them based on their own needs and preferences.&lt;/p&gt;\n&lt;p&gt;• Contributes to the process of collaboratively assessing and acting on risks of harm, danger and abuse.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;To be successful as a Deputy Ward Manager, you will need:&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;- To be a First level Registered Nurse&lt;/p&gt;\n&lt;p&gt;- At least 3 years, or equivalent experience post-registration in Mental Health&lt;/p&gt;\n&lt;p&gt;- To be a trained Mentor&lt;/p&gt;\n&lt;p&gt;- Clinical Supervision experience essential, training desirable&lt;/p&gt;\n&lt;p&gt;- Evidence of Continued Professional Development and intent to maintain and develop Continued professional development and leadership&lt;/p&gt;\n&lt;p&gt;- Good computer skills&lt;/p&gt;\n&lt;p&gt;- Effective written, verbal and non-verbal communication skills.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The post-holder will be required to work a regular shift pattern over a 7 day period, and this will include supernumery time of 20% of their contracted hours to undertake their deputy role, as delegated by the Ward Manager.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Priory Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133434"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southampton", "postalCode": "SO40 4WU"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8846", "longitude": "-1.45034"}}, "title": "CAMHS Deputy Ward Manager WITH £3K Welcome Bonus", "url": "https://www.jobs.nhs.uk/xi/vacancy/916225817", "validThrough": "2020-11-13T23:59:59+0000"}