{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "26000", "minValue": "24000", "unitText": "YEAR", "value": "Circa £24,000-£26,000 Plus Enhancements 30% - 60%"}}, "datePosted": "2020-10-27T09:13:02+0000", "description": "&lt;p&gt;Isabel Hospice is a highly respected local charity with deep roots in the communities we have served for over 35 years. Providing a wide range of care and support to people with life limiting illnesses and their families, we have cared for 1,555 patients across all of our services during the last year alone.&lt;br /&gt;&lt;br /&gt; Our services are leading edge; enabling people to access the support and care they need to live well for as long as possible and die with dignity in the place of their choice.&lt;/p&gt;\n&lt;p&gt;Do you have a passion for end of life and palliative care? Would you like the opportunity to practise person centred care for patients and their families? If so we would like to hear from you! We are looking for a full time staff nurse to join our team. Previous palliative care experience is not essential but a passion for providing excellent nursing care in a small team is.&lt;/p&gt;\n&lt;p&gt;By joining our team you will be part of our visionto help us to reach more patients, earlier in their journey, educate those around us by sharing our expertise, and collaborate with others, building partnerships to benefit our patients and their families.&lt;/p&gt;\n&lt;p&gt;You will assess individual care needs and develop appropriate care plans using a holistic approach, working as part of the multi disciplinary team. You will also maintain accurate nursing records and provide support to Health Care Assistants and students.&lt;/p&gt;\n&lt;p&gt;To be considered for this post you will need to be a Level 1 registered nurse and interested in developing your skills in a palliative care setting. Previous experience of working with terminally ill patients or in an oncology setting would be desirable but not essential. You will need to be flexible and a good team player and able to work a range of shifts including earlies, lates, nights across weekdays, weekends and bank holidays on a shift basis.&lt;/p&gt;\n&lt;p&gt;We offer 27 days holiday which increases with service plus bank holidays, free uniform, pension and life assurance. We also offer ongoing membership of the NHS Pension Scheme for existing members and honour NHS long service leave. We provide excellent training and education and opportunities for further career development.&lt;/p&gt;\n&lt;p&gt;To apply, please complete the application pack.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;strong&gt;Join our Award Winning Team &lt;/strong&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;strong&gt;Inspiring Hertfordshire Business of the Year and Community Champion 2018&lt;/strong&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Inspiring Hertfordshire Awards 2019 - Winner Excellence in Customer Commitment&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Isabel Hospice ", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130594"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Welwyn Garden City, Herts", "postalCode": "AL7 4HQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.783", "longitude": "-.185828"}}, "title": "Staff Nurse (NHS pension scheme for exist. members)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243785", "validThrough": "2020-11-10T23:59:59+0000"}