{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 to £21,142 per annum pro rata"}}, "datePosted": "2020-11-04T16:15:24+0000", "description": "&lt;p&gt;&lt;span&gt;We are recruiting for a permanent Customer Services &amp; Administrative Officer to join the MindMate Single Point of Access Team. This is a full time post and hours would need to be worked Monday - Friday. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Leeds MindMate SPA is a Leeds Community Healthcare hosted service that receives referrals for school age children and young people, who need support with their emotional wellbeing or mental health. The team comprises of administrative staff and clinicians from services such as The Market Place and CAMHS. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will play a key role in the team as the first point of contact for children and young people, their families and other professionals wishing to make a referral to the service by telephone. You will be confident in responding to a range of enquires and completing the first stage of the self- referrals recording information whilst on the telephone directly on to word or databases. In addition to telephone referrals we receive referrals by email and an online facility. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are a mainly paperless service and your application will need to demonstrate a high level of competency through experience in the use of different IT systems, including patient information systems, databases, spreadsheets, word, email and Microsoft teams. You will have the ability to navigate across multiple systems and accurately transcribe information between them. You will also be required to produce patient letters inputting information from clinicians into a template and ensuring letters meet required standards.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Please ensure you meet the following requirements before applying. &lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Previous experience of both customer service and administration is essential.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;English and Maths GCSE level or equivalent qualification is essential.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;RSA Level 2 in IT or demonstration of equivalent experience/skill is also essential.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Experience of working in a NHS or mental Health service environment would also be an advantage.&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;span&gt;Whilst changes to the service in response to the current pandemic mean that there will be the opportunity to work from home on a Rota basis, you must be able to work from the office which is based at Merrion House in Leeds City Centre. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;For further information on Leeds MindMate SPA please visit mindmate.org.uk/im-a-professional/leeds-mindmate-single-point-access/ &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;If you are interested and would like to know please contact Liam Carr, Senior Admin Manager on 03005550324 or Team Manager Kay Jefferies on 07957379036. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Please note the advert will close early if we receive large number of applications.&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122058.jpg", "name": "(CS) Leeds Community Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122058"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Merrion House", "postalCode": "LS2 8BB"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8012", "longitude": "-1.54663"}}, "title": "Customer Services &amp; Administrative Officer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256576", "validThrough": "2020-11-13T23:59:59+0000"}