{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "35207", "minValue": "28691", "unitText": "YEAR", "value": "£28,691 to £35,207 pa inc"}}, "datePosted": "2020-10-29T09:15:48+0000", "description": "&lt;p&gt;A unique opportunity has arisen for a dynamic and experienced Dental Nurse to work within our Out Patient Department Dental service at LNWH NHS Trust. The role offers the rare opportunity for staff to work both within the hospital setting. You will be supported by an experienced team including a Dental Team Leaders, Clinical Nurse Manager and Matron. The variety of settings offers different learning opportunities as well as a chance to develop management skills. Each area brings with it a different focus allowing you the opportunity to expand your CV!&lt;/p&gt;\n&lt;p&gt;If you have any or all of the following qualities please apply for this post:&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;• Proactive with a caring, positive mental attitude?&lt;br /&gt;• Focused on your skill development and open to new ways of working?&lt;br /&gt;• Driven and enthusiastic with a mind-set that means you are happy to do whatever task is necessary&lt;br /&gt;to make the service work?&lt;br /&gt;• Keen to join a superb team where career development and opportunities are available for those wishing to expand their skills?&lt;br /&gt;• A confident communicator with a passion for helping people?&lt;br /&gt;• A committed team player who always acts with integrity and takes accountability?&lt;br /&gt;• Have a good nature, be meticulous and patient?&lt;br /&gt;• Be proactive and have exceptional attention to detail?&lt;br /&gt;• Have a high level of compliance with infection control?&lt;br /&gt;• Be able to provide a high level of patient care?&lt;br /&gt;• Have excellent patient record keeping?&lt;br /&gt;• Manage Stock Control?&lt;br /&gt;• Be presentable?&lt;/p&gt;\n&lt;p&gt;Desirable: 1-2 years’ experience in hospital setting as dental nurse&lt;br /&gt;Qualifications: Dental Nurse Qualification - GDC Registration (NEBDN)&lt;br /&gt;Development Opportunities: Training needs will be evaluated and development plans implemented to support you with your own personal and professional development needs.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameJoseph OrenseJob titleClinical ManagerEmail addressj.orense@nhs.netTelephone number07447934613&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120623.png", "name": "London North West University Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120623"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Northwick Park Hospital, London", "postalCode": "HA1 3UJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5751", "longitude": "-.322459"}}, "title": "Dental Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247705", "validThrough": "2020-11-12T23:59:59+0000"}