{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82096- £110683 pa, pro rata"}}, "datePosted": "2020-10-21T10:01:20+0100", "description": "&lt;p&gt;We have an exciting opportunity for a highly motivated Psychotherapist to be part of a new service and to maintain a significant teaching and supervision component for Junior Doctors. This opportunity has arisen due to the retirement of the current post holder and commissioning of a new team.&lt;/p&gt;\n&lt;p&gt;This post holds potential for excellent personal development and of superb job satisfaction for a duly qualified candidate with MRCPsych and a CCT in Psychotherapy.&lt;/p&gt;\n&lt;p&gt;The successful applicant will take a key role in the Trust, providing medical leadership to the newly developed Emotion Regulation Pathway team with which they will be working and supporting current and future service developments. In addition, the post holder will be offering Psychotherapy Tutorship to Core &amp; Specialist Psychiatric trainees.&lt;/p&gt;\n&lt;p&gt;This post offers a varied job working closely with the multidisciplinary team. We put a high emphasis on quality of care, peer support and on clinical engagement in service development and management.&lt;/p&gt;\n&lt;p&gt;We welcome candidates who bring an enthusiasm for innovation, teaching and development and can work closely with colleagues from different professional backgrounds.&lt;/p&gt;\n&lt;p&gt;Derbyshire is a wonderful place to live, situated within the Peak District National Park with stunning countryside, amazing history and, of course, fabulous people. It is an area of great natural beauty with rugged, peat-covered moorlands and magnificent limestone dales, with picturesque towns and villages, historic churches and some grand houses. It is the location of Britain’s first National Park - the Peak District National Park, which is the world’s second most visited National Park.&lt;/p&gt;\n&lt;p&gt;Whether you enjoy your shopping or leisurely sightseeing trips, Derbyshire’s lively towns offer a delightful array of attractions. Derby itself is a lively and cosmopolitan University City in the heart of Derbyshire offering the best of both worlds – multicultural city life on the doorstep of a stunning rural environment.&lt;/p&gt;\n&lt;p&gt;Why not grow your career in a Trust that cares and puts people first; we are able to offer an excellent well supported training package, supervision and an appraisal to support career progression opportunities. This will include exceptional peer support and allocation of a responsible officer for revalidation purposes. We can offer study leave support of £1,000 per annum towards any continuous professional development.&lt;/p&gt;\n&lt;p&gt;We are committed to equal opportunities and improving the working lives of our staff and will consider applications to work flexibly.&lt;/p&gt;\n&lt;p&gt;We encourage you to contact the Trust to find out more about this post, our services and discuss what is important to you.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;To find out more about our Trust and Derbyshire as a place to work and live please visit our recruitment site which you will find under further links.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Dr Mark Broadhurst&lt;/p&gt;\n&lt;p&gt;Deputy Medical Director&lt;/p&gt;\n&lt;p&gt;m.broadhurst1@nhs.net&lt;/p&gt;\n&lt;p&gt;01629 761600&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121834.jpg", "name": "Derbyshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121834"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Derby &amp; Chesterfield, Derby &amp; Chesterfield", "postalCode": "DE22 3LZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9167", "longitude": "-1.51329"}}, "title": "Consultant Medical Psychotherapist and Psychotherapy Tutor", "url": "https://www.jobs.nhs.uk/xi/vacancy/916235759", "validThrough": "2020-11-10T23:59:59+0000"}