{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683"}}, "datePosted": "2020-09-25T15:58:40+0100", "description": "&lt;p&gt;&lt;strong&gt;Consultant in Sexual Health and HIV – 6PA&#39;s&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;iCaSH (Integrated Contraception and Sexual Health)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Norfolk (King’s Lynn)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This post of Consultant positon in Sexual Health and HIV has become available within the Norfolk locality of Cambridgeshire Community Services NHS Trust (CCS NHS trust).&lt;/p&gt;\n&lt;p&gt;The post holder will work alongside the existing full time experienced Sexual Health Consultant and HIV clinicians, providing a wide range of integrated Sexual Health and HIV Medicine Services, based in King’s Lynn.&lt;/p&gt;\n&lt;p&gt;The post holder will be expected to have broad experience in all aspects of Genito-Urinary Medicine and HIV medicine. The post holder will, in conjunction with existing Consultant, have responsibilities for providing advice, training, diagnosis and treatment of patients with sexually transmitted infections, including HIV infection.&lt;/p&gt;\n&lt;p&gt;You will be committed to developing integrated Sexual Health Services in line with National Strategy for Sexual Health, Contraception and HIV. The post holder will be expected to help lead on innovation of service change designed to achieve local and national targets; optimise cost efficiency of the service; including implementation of new technology and development of services.&lt;/p&gt;\n&lt;p&gt;The post holder will be required to build close professional relationships with all colleagues as part of the multi-disciplinary team at the locality as well as throughout the County. They will also be required to participate in quality improvement, research and management of the service. They will also be expected to work alongside colleagues countywide in providing educational supervision for the multi-disciplinary team, junior colleagues and nursing staff.&lt;/p&gt;\n&lt;p&gt;As a means of discussing the post, candidates are invited to contact Dr Nelson David, Associate Medical Director iCaSH, CCS NHS Trust on 07519144288.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/125234.png", "name": "Cambridgeshire Community Services NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=125234"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Kings Lynn", "postalCode": "PE30 5EJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.7516", "longitude": ".402073"}}, "title": "Consultant in Sexual Health and HIV", "url": "https://www.jobs.nhs.uk/xi/vacancy/916201234", "validThrough": "2020-11-06T23:59:59+0000"}