{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Band 6"}}, "datePosted": "2020-10-14T09:22:20+0100", "description": "&lt;p&gt;&lt;strong&gt;Deputy Sister | Ward | Band 6 | Portsmouth | Mixed Shifts with on call&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Spire Portsmouth Hospital are looking for an experienced Deputy Sister, to join their busy nursing team. In this role you will be expected to work on the multi-disciplinary surgical ward. Working with a wide variety of specialisms (including Orthopaedics, General Surgery, Urology, and more) you will be able to develop your clinical skills in a modern and supportive environment. We offer a full induction for all staff to ensure that you feel supported and set up for success in your new role. You will have the opportunity to work alongside some of the regions most experienced Consultants, covering a varied and diverse caseload.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Spire Portsmouth Hospital holds a long standing reputation for providing high quality, comprehensive private hospital care. Our facilities are excellent and the hospital is staffed by a valued team of highly skilled professionals. We provide a dynamic and stimulating environment for highly motivated nurses.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Duties and Responsibilities:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Deliver high standards of quality care by assessment at all times, evaluation and implementation of patient needs and guide others in this process.&lt;/li&gt;\n&lt;li&gt;Accepting delegated responsibilities from the Ward Sister/Charge Nurse as required.&lt;/li&gt;\n&lt;li&gt;Expected to be part of the Hospital’s Clinical On-Call rota.&lt;/li&gt;\n&lt;li&gt;You will participate through mentorship in the orientation and development of junior staff.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Who we are looking for:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;NMC registration - your pin should not have any restrictions or conditions&lt;/li&gt;\n&lt;li&gt;Evidence of continuous professional development, with a good understanding of NMC Code of Professional Conduct and revalidation.&lt;/li&gt;\n&lt;li&gt;Good knowledge and recent experience in surgical nursing, with good communication skills.&lt;/li&gt;\n&lt;li&gt;A mentorship qualification is not essential, however it desirable and will be utilised.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Benefits&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We offer employees a competitive salary as well as a comprehensive benefits package which includes but is not limited to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;35 days annual leave inclusive of bank holidays&lt;/li&gt;\n&lt;li&gt;Employer and employee contributory pension with flexible retirement options&lt;/li&gt;\n&lt;li&gt;‘Spire for you’ reward platform - discount and cashback for over 1000 retailers&lt;/li&gt;\n&lt;li&gt;Free Bupa wellness screening&lt;/li&gt;\n&lt;li&gt;Private medical insurance&lt;/li&gt;\n&lt;li&gt;Life assurance&lt;/li&gt;\n&lt;li&gt;Save an average of £50 per month with our free onsite car park&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We commit to our employees well-being through work life balance, on-going development, support and reward.&lt;/p&gt;\n&lt;p&gt;Spire Healthcare is a leading independent hospital group that has been putting patients at the heart of everything we do for over 40 years. We have 39 hospitals, 10 clinics and a Specialist Cancer Care Centre across England, Wales and Scotland.&lt;/p&gt;\n&lt;p&gt;For further information about this role or for an informal conversation about the range of career options available with Spire please contact Penny Lawless on 07715 055760 or penny.lawless@spirehealthcare.com&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;For us, it&#39;s more than just treating patients; it&#39;s about looking after people. &lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Spire Healthcare Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132894"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Portsmouth", "postalCode": "PO9 5NP"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8688", "longitude": "-.955234"}}, "title": "Deputy Sister", "url": "https://www.jobs.nhs.uk/xi/vacancy/916225461", "validThrough": "2020-11-14T23:59:59+0000"}