{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "42712", "minValue": "36070", "unitText": "YEAR", "value": "£36,070 to £42,712 pa Inclusive"}}, "datePosted": "2020-10-26T14:16:04+0000", "description": "&lt;p&gt;&lt;strong&gt;Ward B3 -Junior Ward Sister/ Charge Nurse&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Are you a compassionate nurse? Are you enthusiastic, highly motivated, experienced and passionate about surgery? If so, we would love to hear from you. We are searching for an outstanding and committed Deputy Sister (band 6) to support the Ward Manager and Clinical Matron in this busy Trauma and Orthopaedic and general surgical ward within St Helier Hospital.&lt;/p&gt;\n&lt;p&gt;B3 ward is a surgical ward comprising of 16 beds. We have a clear and ambitious vision to provide outstanding patient care and to become the best, we would like you to be part of our success.&lt;/p&gt;\n&lt;p&gt;All staff members are encouraged to develop and excel in their roles and we can offer experience within the unit, to ensure you have the opportunity of progression into ward manager position. You will have the opportunity to develop your skills, both clinical and leadership, supported by a Ward based Clinical Matron and highly visible senior leadership team, who pride themselves on being supportive and transformational in approach.&lt;/p&gt;\n&lt;p&gt;You will be provided with a bespoke and structured induction programme together with the support to develop your skills through specialist courses, in addition to our specific structured competency programme.&lt;/p&gt;\n&lt;p&gt;If you are passionate about delivering the highest standards of care to your patients, and would like to work in a friendly and dynamic team, this department provides a fantastic opportunity and we would welcome your application.&lt;/p&gt;\n&lt;p&gt;Please note, the successful candidate will be required to work a mixture of long days and nights.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Lisa Baker Clinical Matron  Lisa.baker17@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number  07584203191&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121992.jpg", "name": "Epsom and St Helier University Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121992"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St Helier Hospital, Carshalton", "postalCode": "SM5 1AA"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3801", "longitude": "-.183166"}}, "title": "Junior Ward Sister/ Charge Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242852", "validThrough": "2020-11-09T23:59:59+0000"}