{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "27941", "minValue": "25676", "unitText": "YEAR", "value": "£25,676 - £27,941 per annum inc HCAS"}}, "datePosted": "2020-11-03T10:31:24+0000", "description": "&lt;p&gt;We are looking for a bright enthusiastic and motivated individual to join our Hillingdon Stroke ESD Team. The main role is to provide rehabilitation programmes for patients in the patients’ place of residence under guidance of therapists for patients who have had an acute stroke. This post would be an exciting opportunity for all rehab/therapy assistants who are looking to further develop their skills and expertise in the area of physical health. The post holder must have very good communication skills and be able to work as team play&lt;/p&gt;\n&lt;p&gt;There is a strong multi-professional team focus to patient care and you will be supported by experienced senior clinicians and a team leader. Our community services are broad and diverse so we actively support staff with accessing opportunities to work in a variety of the specialisms and team we provide. Continuing professional development is actively provided via clinical supervision, Personal Development Reviews and in-service training. Trust also has extensive in house training programme.&lt;/p&gt;\n&lt;p&gt;Preference will be given to applicants with previous experience as Band 3 therapy / rehab assistants and multi-disciplinary working especially with speech and language therapist, occupational therapist, dietitians and physiotherapist. As the position will require you to visit various locations throughout our supported area, it is essential that candidates hold a driver’s license and have use of a car for business purposes.&lt;/p&gt;\n&lt;p&gt;There is a possibility of successful candidate to work across CNWL and The Hillingdon Hospital Acute Trust as part of rotation. The post holder will be expected to take part in seven day working.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameSneha VobilisettyEmail addresssneha.vobilisetty@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central and North West London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120736"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hillingdon, Hillingdon", "postalCode": "UB8 1QG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.544", "longitude": "-.477739"}}, "title": "Rehabilitation Support Worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253462", "validThrough": "2020-11-10T23:59:59+0000"}