{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "39681", "minValue": "32933", "unitText": "YEAR", "value": "£32,933 to £39,681 pa incl. HCAS"}}, "datePosted": "2020-10-30T14:48:45+0000", "description": "&lt;h2&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Specialist Occupational Therapist (Rotational Post)&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;em&gt;&lt;strong&gt;Band 6 - Full time - Permanent&lt;/strong&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;The Royal Surrey NHS Foundation Trust are looking for a Band 6 Occupational Therapist to join our well established rotation. We have fantastic opportunities for staff who have completed their basic rotations who are looking to expand their knowledge, skills and experience within the acute setting.&lt;/p&gt;\n&lt;p&gt;Our rotations include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Orthopaedics&lt;/strong&gt; – working across trauma and elective wards, you will have the opportunity to develop skills in fracture bracing (humeral braces, hard collars, hinged knee braces and thoracic-lumbar-sacral orthoses), complex trauma discharge and as well as being part of the ground-breaking Fast Track hip/knee replacement pathway which aims to get patients home the same day as their operation.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;A&amp;E, MAU and SAU&lt;/strong&gt; – based at the ‘front door’ you will work closely with specialist nurses and consultants to prevent admission. You will develop skills in rapid assessment and discharge planning.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Older Persons Unit&lt;/strong&gt; – this rotation will develop your complex discharge skills and allow you to expand on your knowledge and expertise of large equipment provision.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Short stay frailty&lt;/strong&gt; – within Care of the Elderly is our short stay frailty unit where patients aim to be turned around within 72 hours. This rotation brings together the skills of rapid assessment and complex discharges for older people.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Neurology&lt;/strong&gt; – you will develop specialist Stroke and Neurology knowledge and skills including standardised and non-standardised assessments, formulating rehab programmes and upper limb splinting&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;HOST (Hospital Outreach Support Team)&lt;/strong&gt; – our early supported therapy team follows patients from the hospital into the community. Taking referrals from every specialty within the hospital as well as from GPs, social services and outpatients, you will prevent discharge as well as expedite a patient returning home. You will also be up-skilled in basic physio interventions as you work in this integrated team, develop skills in bracing and provide complex equipment within the patient’s own home.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Medical/ Surgery&lt;/strong&gt; – covering respiratory, cardiology, oral &amp; maxillofacial surgery, ENT, colorectal, urology, gastro-intestinal, gastroenterology and diabetes, the medical/surgical team offers a smorgasbord of conditions for you to get your teeth into.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Oncology/Palliative care&lt;/strong&gt; – complete specialist assessments and interventions in fast track and palliative care supporting patients and their carers through emotionally challenging discharge planning to support end of life care.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;You may already be a senior therapist looking for a new challenge or a Band 5 ready to make the move into a senior role. As a Band 6 you will be expected to perform to a high clinical standard, supervise band 5s and/or assistants, and Occupational Therapy Students on placement, as well as contribute to our service development. In all fields of practice you will be supported by an experienced team lead.&lt;/p&gt;\n&lt;p&gt;There will also be opportunities for working more closely with our local community services as the Trust welcomed these services alongside Pro-Care from April 2018.&lt;/p&gt;\n&lt;p&gt;Our services cover 7 days per week and the post holder will be expected to work regular weekends and bank holidays. Use of own car for business use is essential.&lt;/p&gt;\n&lt;p&gt;As a department we are a friendly bunch of therapists who all work together to provide a dynamic and pro-active service to our patients. We have a range of experience and specialisms ranging from Assistants to Advanced Clinical Specialists providing clinical support, and formal and informal training, and the department benefits from being managed by an Occupational Therapist who provides a strong professional lead. We have a strong commitment to clinical supervision and Continuing Professional Development; you will be regularly supervised by a senior therapist and attend the band 6 Occupational Therapy support groups. You will be supported to engage in service development and encouraged to put forward suggestions as to how we can enhance and grow the services we offer. We have a well-structured In-Service Training Programme which the successful applicant will be able to learn from as well as the opportunity to lead sessions with support from your team. We benefit from a well-stocked Gym which can be used by staff either before or after working times.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We offer&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Opportunities for professional &amp; personal development&lt;/li&gt;\n&lt;li&gt;In-service training &amp; post graduate education&lt;/li&gt;\n&lt;li&gt;Clinical Supervision&lt;/li&gt;\n&lt;li&gt;Flexible Working&lt;/li&gt;\n&lt;li&gt;Multidisciplinary working&lt;/li&gt;\n&lt;li&gt;Welcoming department&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Essential requirements&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Acute NHS experience&lt;/li&gt;\n&lt;li&gt;Current HCPC registration&lt;/li&gt;\n&lt;li&gt;Own car for business use&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The Royal Surrey Foundation Trust is a District General Hospital and regional cancer centre with links to a range of related services providing excellent opportunities for multidisciplinary working.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;For further information, or for an informal visit/chat please contact Suzanne Ward (Head Occupational Therapist) or Isla Pavey (Deputy Head Occupational Therapist) on 01483 571122 ext 4766. Email: suzanneward@nhs.net or isla.pavey@nhs.net&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Date of Interview: TBA&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120970.jpg", "name": "Royal Surrey NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120970"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Guildford, Surrey", "postalCode": "GU2 7XX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.241", "longitude": "-.607442"}}, "title": "Specialist Occupational Therapist (Rotational Post)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250661", "validThrough": "2020-11-16T23:59:59+0000"}