{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "23810", "minValue": "22478", "unitText": "YEAR", "value": "£22,478 - £23,810 per annum inclusive of HCAS"}}, "datePosted": "2020-11-06T09:15:50+0000", "description": "&lt;p&gt;We are passionate about getting it right for patients and their families. In order to achieve this we are looking to appoint compassionate, enthusiastic, motivated and caring Nursing Assistants who have proven experience in providing care – either in a Hospital or Care setting. You will need to demonstrate excellent communication skills - including written, verbal, and non-verbal. &lt;br /&gt;&lt;br /&gt;Working alongside trained nurses as part of the team our Nursing Assistants will be trained to deliver excellent care to our patients. In order to develop you as a Nursing Assistants – we offer a comprehensive a training program to ensure you are able to meet the Care certificate standards. The Royal Free London NHS Foundation Trust is also a diploma Centre, offering the Diploma in clinical health at levels 2 and 3. Continuing your personal and professional development is strongly encouraged and supported by the Trust.&lt;br /&gt;&lt;br /&gt;This advert covers three of our divisions Surgery and Associated Specialties, Urgent Care and Transplantation and Specialist Services, these divisions cover a variety of areas as below:&lt;br /&gt;&lt;br /&gt;In the Surgical and Associated Specialties Division (SAS) we cover areas such as general surgery, theatres and specialties including trauma and orthopedics, vascular, plastics, breast, colorectal surgery, urology and ENT.&lt;br /&gt;&lt;br /&gt;In the Urgent Care Division we cover areas such as HSEP (Health Service for Elderly People), short stay acute medicine, rehabilitation and enablement, intensive care and accident and emergency.&lt;br /&gt;&lt;br /&gt;In the Transplantation and Specialist Services Division we cover areas such as Hematology, Oncology, Liver, Gastroenterology, Endoscopy, HPB (Liver Surgery), Renal, Urology, Outpatients and Ambulatory Care Services.&lt;br /&gt;&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120624.jpg", "name": "Royal Free London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120624"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Free Hospital, Hampstead", "postalCode": "NW3 2QG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5532", "longitude": "-.165298"}}, "title": "Band 2 Nursing Assistant - Royal Free Hospital", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258980", "validThrough": "2020-11-09T23:59:59+0000"}