{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 £24,907 - £30,615 per annum, pro"}}, "datePosted": "2020-11-03T15:00:50+0000", "description": "&lt;p&gt;&lt;strong&gt;Staff Nurses ED&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The real 24 hours in A&amp;E&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Not everyone can handle working in our Emergency Departments, but that’s ok as we want to find those of you who thrive on working in an area full of drama, joy and all round full steam ahead. Somewhere where your absolute passion for emergency and trauma care can thrive.&lt;/p&gt;\n&lt;p&gt;Our patients aren’t with us for a long time, but we give them all we have to ensure that they receive the best possible love and care whilst at their most scared whilst they wait to be diagnosed and treated.&lt;/p&gt;\n&lt;p&gt;We have two amazing Emergency Departments, but just one amazing #TeamED vision – it’s exciting as staff will be flexible across both locations, learning loads of new skills along the way. We can promise you it’s definitely not going to be dull! 12 hour shifts are our norm and the feedback we get from our fab team members is that they really value them, and the worklife balance this brings when they are not at the forefront of emergency patient care.&lt;/p&gt;\n&lt;p&gt;121,500 patients per year come through our Preston and Chorley hospital doors, nearly 28,000 of these are children and over 700 are major trauma patients…Did we mention we are the Major Trauma Centre for the North West and the very distinctive Air Ambulance helicopter can be seen coming and going at Preston few times a day – bringing people from all across the area for us to treat.&lt;/p&gt;\n&lt;p&gt;It’s all about #TeamED here and we are so really proud of this – our colleagues feel like family so it’s a pleasure to work with them every day. You will work alongside Advanced Nurse Clinicians, Emergency Nurse Practitioners, Consultants, Trauma Technicians and our fabulous Senior Healthcare Assistants who support us all the way. When you start you are assigned a mentor who will work alongside you for the first couple of weeks and we get loads of positive feedback about this.&lt;/p&gt;\n&lt;p&gt;We are a forward thinking department with a real emphasis on staff development and training – we have not one but two educators. Once a month our consultants provide training to the nursing staff covering an assortment of topics to ensure you are always on top of your game and up-to-speed with the very latest tools to help you do the job you love – the relationship between our medical and nursing staff is second to none.&lt;/p&gt;\n&lt;p&gt;We have a variety of departmental study days such as:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;The Triage process&lt;/li&gt;\n&lt;li&gt;Minor injury assessment and management&lt;/li&gt;\n&lt;li&gt;Acute paediatric care&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We also have in situ simulations carried out on the shop floor and lead by the North West Human Factors lead – so there is always something new to learn and get involved in!&lt;/p&gt;\n&lt;p&gt;We really can deal with everything and anything so the opportunities for you to enhance your skills, knowledge and experience is second to none. #TeamED really value the personal skills, experience and qualities that every member of our team bring to us, creating a diverse, knowledgeable and very supportive team who feel motivated and able to influence the future direction of the service.&lt;/p&gt;\n&lt;p&gt;We do not mind if your background is Adults or Children’s nursing – we want to hear from you.&lt;/p&gt;\n&lt;p&gt;It’s impossible to cram everything in just one advert, so we really welcome you to get in touch and have a chat with us to find out a lot more about joining us. Contact our team - Clare.Holbourn@LTHTR.nhs.uk, Deborah.Lealman@LTHTR.nhs.uk and Lynn.SIME@lthtr.nhs.uk&lt;/p&gt;\n&lt;p&gt;We also want you to follow us on Twitter – it’s where you will start to see the real ED as we share the stories of our world here @LTHTREmergency1&lt;/p&gt;\n&lt;p&gt;We intend to interview on an ongoing basis for this role, so we won’t be waiting for a closing date, – it means we will get you in even sooner to start with us.&lt;/p&gt;\n&lt;p&gt;*Previous applicants need not apply*&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameJennifer AshcroftAdditional contact information&lt;/p&gt;\n&lt;p&gt;Unit manager Jennifer Ashcroft 01772 522402&lt;/p&gt;\n&lt;p&gt;Matron Lynn Sime 01772 522877&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Lancashire Teaching Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121125"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Preston Hospital/Chorley &amp; District General Hospital, Preston", "postalCode": "PR7 1PP"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.6656", "longitude": "-2.63575"}}, "title": "Staff Nurse - Emergency Department", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254452", "validThrough": "2020-11-30T23:59:59+0000"}