{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Band 5 dependent on experience"}}, "datePosted": "2020-10-28T08:59:49+0000", "description": "&lt;p&gt;&lt;strong&gt;Pre-Operative Assessment | Pre-Assessment | Band 5 dependent on experience | Parkway | Full time&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Spire Parkway have an exciting opportunity for a Registered Nurse to join their Pre-Assessment team on a full-time basis.&lt;/p&gt;\n&lt;p&gt;Our dedicated hospital team are passionate about excellent patient care and we offer a range of specialist treatments to patients across Birmingham, Warwickshire and the West Midlands. This includes diagnostic services, rehabilitation, cutting-edge surgical procedures and excellence in specialist fields like orthopaedics, women’s health and cancer care. We have 51 bedrooms and five operating theatres.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Duties and responsibilities:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Assessing pre-operative patients and ensuring they are prepared for surgery including dealing with blood results and ECGs.&lt;/li&gt;\n&lt;li&gt;Responsible for providing exemplary care for patients visiting the hospital for surgery.&lt;/li&gt;\n&lt;li&gt;Working as part of a wider MDT team including surgeons and consultants.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Who we&#39;re looking for:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;You must be a qualified nurse with a minimum of 2 years post registration experience&lt;/li&gt;\n&lt;li&gt;You hold a valid NMC pin with no conditions or restrictions&lt;/li&gt;\n&lt;li&gt;You must have experience working in pre-operative assessment.&lt;/li&gt;\n&lt;li&gt;Excellent communication skills&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Benefits:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We offer employees a competitive salary as well as a comprehensive benefits package which includes but is not limited to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;35 days annual leave inclusive of bank holidays&lt;/li&gt;\n&lt;li&gt;Employer and employee contributory pension with flexible retirement options&lt;/li&gt;\n&lt;li&gt;‘Spire for you’ reward platform - discount and cashback for over 1000 retailers&lt;/li&gt;\n&lt;li&gt;Free Bupa wellness screening&lt;/li&gt;\n&lt;li&gt;Private medical insurance&lt;/li&gt;\n&lt;li&gt;Life assurance&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Please see the attached benefits leaflet for more information.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Spire Healthcare is a leading independent hospital group in the United Kingdom and the largest in terms of revenue. From 39 hospitals and 8 clinics across England, Wales and Scotland, Spire Healthcare provides diagnostics, inpatient, day case and outpatient care.&lt;/p&gt;\n&lt;p&gt;For further information about this role or for an informal conversation about the range of career options available with Spire please contact Rebecca O’Neill on Rebecca.o’neill@spirehealthcare.com&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;For us, it&#39;s more than just treating patients; it&#39;s about looking after people.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Closing date: In order to streamline our recruitment process, we reserve the right to expire vacancies prior to the advertised closing date once we have received a sufficient number of applications&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Spire Healthcare Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132894"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Solihull", "postalCode": "B91 2PP"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4219", "longitude": "-1.76313"}}, "title": "Pre-Operative Assessment Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245771", "validThrough": "2020-11-28T23:59:59+0000"}