{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "26520", "minValue": "26520", "unitText": "YEAR", "value": "Up to £26,520 - dependent on experience"}}, "datePosted": "2020-10-21T01:03:16+0100", "description": "&lt;h2&gt;&lt;strong&gt;Are you looking for a job where no two days are the same?&lt;/strong&gt;&lt;/h2&gt;\n&lt;h2&gt;Have you ever thought about working as part of a Medicines Management service in a prison?&lt;/h2&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Practice Plus Group are Health in Justice Market leader, providing healthcare services to offenders across the country. Our model of care is our Wellbeing Approach – an integrated, comprehensive approach in recognition of the fact prisoners are a socially-excluded group with healthcare needs which are complex and often associated with poor outcomes. It adopts the premise no single health/wellbeing factor can be taken in isolation of other motivational issues which might impact a person’s care.&lt;/p&gt;\n&lt;p&gt;To ensure the continued quality of care, we’re looking for Pharmacy Technicians to come and join our Medicines Management team and work in the healthcare department.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h2&gt;&lt;strong&gt;Want to know more about HMP Hewell?&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This prison is a closed category B male remand, with an operational capacity of 1,104. In the main closed site, there are 6 main house block residential units. The prison is operated by Her Majesty’s Prison Service.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h2&gt;&lt;strong&gt;One of our pharmacy technicians at HMP Hewell says,&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;“Prison pharmacy is a great self-rewarding place to work. There are numerous learning opportunities to develop your career. There are no two days the same, and you have the opportunity to make a real difference to the lives of people otherwise cut off from society.&lt;/p&gt;\n&lt;p&gt;I thoroughly enjoy my role, and can see a great career path already set out for me. I would encourage anyone who has an interest in prison pharmacy to join a flourishing function with a genuine interest in supporting patients and ensuring they receive the best out of their medication.”&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h2&gt;&lt;strong&gt;What will you be doing?&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;As a Pharmacy Technician in the Medicines Management team, you will assist with the provision and delivery of an integrated, safe, legal, high quality prison pharmaceutical service, taking into consideration, at all times, the need to maintain a high level of security.&lt;br /&gt; &lt;br /&gt; You will be required to work within the healthcare department and hold direct patient contact, which will be part be of a comprehensive healthcare package, based on the prison service’s needs.&lt;br /&gt; &lt;br /&gt; Within this role, you will be an integral member of the Medicines Management team, which forms part of the wider cluster of Healthcare Services. Practice Plus Group policies and procedures and statutory frameworks governing patient care in a prison setting, will be used in order to deliver the highest standard of care to clients in line with National Guidelines.&lt;br /&gt; &lt;br /&gt; You&#39;ll be required to accept certain activities in relation to the day to day operational management of their unit and as such must ensure that they are trained and competent to take on these additional responsibilities.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h2&gt;&lt;strong&gt;Job Requirements&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will hold NVQ Level 3, BTEC or equivalent qualifications and must have a current registration with the General Pharmaceutical Council. You will also have relevant post-registration experience working within a multi-disciplinary team.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h2&gt;&lt;strong&gt;Salary and Benefits&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The salary for this role is up to £26,520 per annum pro-rata – dependent on experience.&lt;br /&gt; &lt;br /&gt; Practice Plus Group benefits include training &amp; development opportunities, company contributory pension scheme, 25 days annual leave (pro-rata) plus 8 public bank holidays, staff well-being, cycle to work scheme and free onsite parking.&lt;br /&gt; &lt;br /&gt; We are also proud to support our employees with continued professional development opportunities and further education.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h2&gt;&lt;strong&gt;More information&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This is a part-time role, offering a variety of hours per week across 7 days on a rotational basis including weekends and public holidays, no nights. Let us know what you require regarding shifts and we will do our best to accomodate this!&lt;/p&gt;\n&lt;p&gt;Full-time or Bank applications will also be considered.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Please note that offers of employment are subject to Practice Plus Group Terms and Conditions and receipt of satisfactory references, enhanced DBS check and prison vetting (arranged locally by the prison).&lt;/em&gt;&lt;br /&gt; &lt;br /&gt; &lt;em&gt;At Practice Plus Group we actively promote diversity and equal opportunities.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Practice Plus Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130136"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Redditch", "postalCode": "B97 6QS"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.3256", "longitude": "-1.9916"}}, "title": "Pharmacy Technician - HMP Hewell", "url": "https://www.jobs.nhs.uk/xi/vacancy/916235488", "validThrough": "2020-11-11T23:59:59+0000"}