{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51069", "minValue": "32478", "unitText": "YEAR", "value": "£32,478 to £51,069 pa"}}, "datePosted": "2020-10-20T11:30:46+0100", "description": "&lt;p&gt;Paediatric Anaesthesia&lt;/p&gt;\n&lt;p&gt;Advanced Level Training&lt;/p&gt;\n&lt;p&gt;Alder Hey Children’s NHS Foundation Trust&lt;/p&gt;\n&lt;h1&gt;Advanced level training in paediatric anaesthesia&lt;/h1&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;A vacancy has arisen for advanced level training in paediatric anaesthesia at Alder Hey Children’s NHS Foundation Trust for a period of one year. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;To commence in August 2021&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Alder Hey Children’s Hospital is one of Europe’s busiest paediatric hospitals. We moved into a new building, “Alder Hey in the Park”, in October 2015. The hospital has 237 beds, including a 47 bed critical care unit. The critical care unit incorporates general and cardiac intensive care, high dependency care and a burns unit. We are a designated children’s major trauma centre.&lt;/p&gt;\n&lt;p&gt;The hospital is a regional and supra-regional referral centre for craniofacial surgery, children’s epilepsy surgery and cardiac surgery including ECMO. Experience can be gained in anaesthesia for these specialties as well as major orthopaedic surgery, neurosurgery, neonatal surgery, general surgery, urology, spinal surgery, oncology, ENT and cleft palate surgery, cardiac catheterisation, interventional radiology/CT/MRI, endoscopies, ophthalmology, maxillo-facial/dental surgery, plastic surgery and burns. Approximately 18 000 patients undergo general anaesthesia each year within the 12 inpatient theatres, 5 day case theatres and MRI and radiology suites. The department provides an acute and multidisciplinary chronic pain service. There are currently 26 full-time consultant paediatric anaesthetists, 11 specialty trainees from the Mersey School of Anaesthesia and 4 fellows (advanced training in paediatric anaesthesia).&lt;/p&gt;\n&lt;p&gt;The job is for one year with at least nine months training in anaesthesia in theatres, and a maximum of three months of paediatric intensive care training which may be divided into a block on the intensive care unit and a block working with the North West and North Wales Paediatric Transfer Service.&lt;/p&gt;\n&lt;p&gt;Advanced trainees will be expected to be actively involved in audit and quality improvement.&lt;/p&gt;\n&lt;p&gt;The posts provide advanced training in paediatric anaesthesia as described in the Royal College of Anaesthetists 2010 curriculum.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further information please contact &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Dr Jo Haidon, College Tutor, Jackson Rees Department of Anaesthesia, Alder Hey Children’s Hospital. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Joanne.Haidon@alderhey.nhs.uk&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Tel: - 0151 252 5223 (direct line). &lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120727.jpg", "name": "Alder Hey Children's NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120727"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Liverpool", "postalCode": "L12 2AP"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4213", "longitude": "-2.8978"}}, "title": "Advanced Training Fellowship", "url": "https://www.jobs.nhs.uk/xi/vacancy/916234154", "validThrough": "2020-11-06T23:59:59+0000"}