{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "35530", "minValue": "27628", "unitText": "YEAR", "value": "£27,628 - £35,530 Per annum inc"}}, "datePosted": "2020-10-26T14:01:19+0000", "description": "&lt;p&gt;Exciting opportunities have arisen at the Royal London Hospital, Barts Health NHS Trust for dynamic, innovative, committed and skilled individuals to join our Scrub Practitioner Teams.&lt;/p&gt;\n&lt;p&gt;You will be a Registered Nurse or Operating Department Practitioner, ideally with experience of working in a busy theatre environment. However previous theatre experience is desirable but not essential as we would welcome applications from newly qualified staff or someone seeking a change of career direction.&lt;/p&gt;\n&lt;p&gt;We are committed to developing your professional competence and building your skills portfolio through experiential learning and education to maximise your career prospects.&lt;/p&gt;\n&lt;p&gt;We have 26 Theatres at the Royal London Hospital covering a diverse range of both elective and emergency work in a variety of specialties including major trauma, via the Helicopter Emergency Medical Service (HEMS). We have a well-established team where excellent standards of care are delivered. We understand the rights to privacy and dignity and we always put patients first.&lt;/p&gt;\n&lt;p&gt;Our Peri-operative Department, part of the Surgery Division, is committed to building a dynamic, flexible and enthusiastic team to help develop our services and achieve the Barts Health vision for the future. If you are up for the challenge, you will be joining our team at an important time of change as we continue our initiatives to improve our patients’ experience at Bart’s Health.&lt;/p&gt;\n&lt;p&gt;If this sounds like a role you would be interested in and can demonstrate the requirements, then we are keen to hear from you.&lt;/p&gt;\n&lt;p&gt;Follow Team Peri-Op on Twitter @peri_team to find out more about us!&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Biju Bhaskaran, IP Theatres Team Leader, on Biju.Bhaskaran@bartshealth.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120603.jpg", "name": "Barts Health NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120603"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Royal London Hospital, London", "postalCode": "E1 1BB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.519", "longitude": "-.058048"}}, "title": "Scrub Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242801", "validThrough": "2020-11-08T23:59:59+0000"}