{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "Band 2 £18,005 - £19,337 pro rata per annum"}}, "datePosted": "2020-11-04T09:15:44+0000", "description": "&lt;p&gt;Department of Microbiology (Stockport NHS Foundation Trust) Medical Laboratory Assistant - Full Time&lt;/p&gt;\n&lt;p&gt;An excellent opportunity has arisen within the Microbiology Department at Stepping Hill Hospital for a medical laboratory assistant to join our professional team. The successful applicant would be joining a passionate and highly motivated staffing group providing diagnostic services to the hospital and patients of the GP practices in Stockport and the High Peak areas.&lt;/p&gt;\n&lt;p&gt;The laboratory provides a comprehensive service to the hospital and patients of GPs in the surrounding area. Working hours are 12:40 - 17:20 on Wednesdays and 09:00 - 17:20 Thursday and Friday. There will also be a requirement to work late and early shifts. Participation in a weekend rota is also essential, which is paid at enhanced rates.&lt;/p&gt;\n&lt;p&gt;The role includes but is not limited to the processing of patient samples, enrolling patient data into the laboratory information management system and sterilization and disposal of laboratory waste.&lt;/p&gt;\n&lt;p&gt;The laboratory has ISO 15189 accreditation and is committed to providing a service of the highest quality 24 hours per 7 day week and requires flexibility to work at peak times to support this.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;The Trust is committed to safeguarding and promoting the welfare of children, young people and vulnerable adults and expects all staff and volunteers to share this commitment and promote safeguarding by implementing the Trust’s policies and procedures, acting promptly on concerns, communicating effectively and sharing information appropriately.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If successful, this vacancy will require an standard DBS check at a cost of £26.50. This cost will be deducted from your first Trust salary. In addition to this it will be a condition of your employment that you will join the DBS update service and pay the annual subscription fee of £13.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameSimon EcclesJob titleTechnical Head of MicrobiologyEmail addresssimon.eccles@stockport.nhs.ukTelephone number0161 419 5601&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Stockport NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122553"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Stepping Hill Hospital, Stockport", "postalCode": "SK2 7JE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3838", "longitude": "-2.13202"}}, "title": "Medical Laboratory Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255164", "validThrough": "2020-11-18T23:59:59+0000"}