{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 to £44,503 pa"}}, "datePosted": "2020-10-30T12:00:35+0000", "description": "&lt;p&gt;22.5 hours per week.&lt;/p&gt;\n&lt;p&gt;We are looking for an enthusiastic and motivated registered pharmacist with excellent communication skills to join our friendly team to provide maternity cover.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Trust has four community hospitals where you will play a key part in medicines optimisation, as well as being a regular member of the wards multi-disciplinary team meetings.  We are a department that is committed to personal and professional development with clinical / professional supervision delivered during our monthly team meetings.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This post is suited to a current band 6 pharmacist looking to further develop their skills, or band 7 pharmacists looking for more opportunities to further develop their Leadership skills in readiness for career progression. &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This role will be a combination of medicines optimisation in the ward setting, as well as leading on CQC style audits for services outside of the in-patient setting (such as Dental, District Nursing, DAART and Minor Injury Units) and overseeing service improvement through action plans.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;In addition, you will education and training to nursing staff and allied health professionals regarding the use of medicines and medicines safety.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The successful applicant will have the confidence to lead on this project work, have the self-assurance to work alone, have excellent people skills and be keen to develop new skills. You must be registered as a pharmacist with the General Pharmaceutical Council and hold an MPharm or equivalent.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will be supported by the Accountable Officer. Induction training will be provided.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This post requires regular travel throughout Shropshire.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Interview Date: Thursday 19th November 2020 via Microsoft Teams.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/127016.jpg", "name": "Shropshire Community Health NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127016"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Shrewsbury", "postalCode": "SY3 8XL"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.7074", "longitude": "-2.79305"}}, "title": "Clinical Pharmacist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250057", "validThrough": "2020-11-13T23:59:59+0000"}