{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Band 5"}}, "datePosted": "2020-10-07T11:41:22+0100", "description": "&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Tameside Hospital – Bank Registered Nurse&lt;/strong&gt;&lt;/span&gt;&lt;br /&gt;&lt;strong&gt;Job Title and Grade:&lt;/strong&gt; Bank Registered Nurse – Band 5&lt;br /&gt;&lt;strong&gt;Location/Trust:&lt;/strong&gt; Tameside Hospital&lt;br /&gt;&lt;strong&gt;Pay Rates (hourly):&lt;/strong&gt; &lt;br /&gt;Days: £15.66 &lt;br /&gt;Saturdays/Nights: £20.35 &lt;br /&gt;Sundays/Bank Hols: £25.05&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;The Role:&lt;/strong&gt;&lt;br /&gt;Are you a registered nurse looking to gain ward experience?&lt;br /&gt;Do you have experience in a medical setting but not on a ward?&lt;br /&gt;Are you interested in joining the NHSP Gateway Project to gain ward experience?&lt;br /&gt;If you answered yes, then we would love to hear from you!&lt;br /&gt;&lt;br /&gt;Tameside and Glossop Integrated Care NHS Trust (T&amp;G ICFT) has been on a fantastic improvement journey. Within just 3 years, they’ve gone from being rated as ‘Inadequate’ by the CQC to being rated as ‘Good’ (with some services rated as ‘Outstanding’), which is a huge achievement, and are on a continuous mission to be rated as ‘Outstanding’ across all areas. This has been, and will be achieved, through the values where ‘everybody matters’&lt;br /&gt;&lt;br /&gt;T&amp;G ICFT is a fantastic place to work. A small but friendly and ambitious organisation, living by their values which are demonstrated through their behaviours every day. Passionate about excellent patient care, embracing a culture where staff are listened to and patients come first. Every day these values drive the behaviour and actions for every person in the organisation. Their values and behaviours aren&#39;t just words on a fancy poster; they embody everything they stand for as an NHS organisation.&lt;br /&gt;&lt;br /&gt;We’re looking for Band 5 Registered Nurses to join the Staff Bank in order to be part of this continuing mission and ambition to become outstanding - and we’d like you to join them on this journey by becoming part of #TeamTameside.&lt;br /&gt;&lt;br /&gt;You will need to be available to work on a 6 month placement where support will be offered from our Registered Nurses who have ample ward experience. They will guide and assess you.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;strong&gt;Skills/Responsibilities:&lt;/strong&gt;&lt;br /&gt;To apply for this post, you will:&lt;br /&gt;• Comply with NMC Professional Registration and keep up to date with current nursing practices&lt;br /&gt;• Undertake nursing assessment and evaluation to enable development of appropriate plans of care based on the needs of the individual&lt;br /&gt;• Be proficient in the delivery of care to patients&lt;br /&gt;• Ensure safe administration of drugs in accordance with NMC and CHS policies&lt;br /&gt;• Ensure accurate records are kept in accordance with CHS policy and NMC guidelines&lt;br /&gt;&lt;br /&gt;In return for your hard work commitment NHS Professionals (NHSP) can offer you some fantastic benefits: –&lt;br /&gt;• Competitive Pay Rates - work this week, get paid next week!&lt;br /&gt;• Dedicated consultants&lt;br /&gt;• Flexible working options after successfully completing placement&lt;br /&gt;• Free DBS and free training&lt;br /&gt;• Build holiday allowance&lt;br /&gt;• Support when you need it – 24/7 365 days – Call us anytime on 03332 407 552&lt;br /&gt;• Stakeholder pension scheme&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;Who are NHS Professionals?&lt;/strong&gt;&lt;br /&gt;NHS Professionals (NHSP), owned by the Department of Health and Social Care (DHSC), works in partnership with hospital trusts to provide a bank of highly skilled temporary workers who want to work flexibly within theNHS.&lt;br /&gt;Working through the NHSP bank means Trusts don’t have to rely on expensive agencies. Right now, we have over 130,000 members registered on our bank from various roles, grades and specialities, saving the NHS over £70 million each year. This money is then reinvested back into the NHS.&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "NHS Professionals - Flexible Workers", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121069"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Tameside General Hospital", "postalCode": "OL6 9RW"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4919", "longitude": "-2.07155"}}, "title": "Bank Registered Nurse, Gateway", "url": "https://www.jobs.nhs.uk/xi/vacancy/916216285", "validThrough": "2021-06-30T23:59:59+0100"}