{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 to £51,668 pa based on full time hours"}}, "datePosted": "2020-10-19T09:15:12+0100", "description": "&lt;p&gt;We are looking for an experienced, enthusiastic and highly motivated pharmacist to join our friendly medicines management team as the Principal Pharmacist for our Portsmouth and South East Hampshire Division which provides community and mental health services. As Principal Pharmacist you will lead and develop clinical pharmacy services within the division with support from a team of two pharmacists and four pharmacy technicians. This post will be based at Elmleigh Adult Mental Health Unit in Havant and will provide regular clinical pharmacist input to this unit.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will join our progressive and forward thinking medicines management team which is spread out across Hampshire with colleagues based primarily in community hospitals or mental health inpatient units. We also have a small dispensary at Lymington New Forest Hospital. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The post is for 37.5 hours per week with &lt;strong&gt;no late nights, on call or weekend working commitments&lt;/strong&gt;.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Southern Health is one of the largest Foundation Trusts in the UK and was rated as ‘good’ by CQC in 2020. The Trust is a progressive integrated care organisation bringing community and mental health services together in one trust across Hampshire and the wider health economy. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Hampshire has a beautiful coastline, countryside, market towns and heritage that you would expect from a quintessentially English county. It is a great place to work and live with excellent opportunities for outdoor pursuits and those living here benefit from an exceptional quality of life. There are good transport links, trains to London and the north, airports at Bournemouth and Southampton, ferries to the Isle of Wight and to the continent from nearby ports.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further information please contact:&lt;/p&gt;\n&lt;p&gt;Vanessa Lawrence, Deputy Chief Pharmacist&lt;/p&gt;\n&lt;p&gt;Tel 07776 130608&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing Date for Applications: 8th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview Date: 16th November 2020&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Southern Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120646"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Elmleigh AMH Unit, Havant", "postalCode": "PO9 2JJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8565", "longitude": "-.975569"}}, "title": "Principal Pharmacist - Portsmouth and South East Hampshire", "url": "https://www.jobs.nhs.uk/xi/vacancy/916231584", "validThrough": "2020-11-08T23:59:59+0000"}