{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Lindridge Pay scale"}}, "datePosted": "2020-10-26T16:45:43+0000", "description": "&lt;p&gt;WE ARE CURRENTLY RECRUITING FOR DAY NURSES&lt;/p&gt;\n&lt;p&gt;Lindridge is one of the region’s premier care home facilities, currently holding one of the top review scores for carehomes in Hove on carehome.co.uk. With turbulent times ahead for some providers within the independent care home world, we offer the security of working in a home which is an integrated part of the business managed by Sussex Partnership NHS Foundation Trust.&lt;/p&gt;\n&lt;p&gt;Nurses employed by Lindridge are supported by the Trust’s Nursing Directorate and are able to benefit from the training and development provided by the Trust as well as a number of NHS benefits.&lt;/p&gt;\n&lt;p&gt;At Lindridge we provide exceptional care in peaceful, modern surroundings to ensure our Service Users enjoy the best possible quality of life. To enable us to provide this level of care, we are looking for professional, reliable, caring qualified nurses who want to make a real difference to people’s lives.&lt;/p&gt;\n&lt;p&gt;We offer specialist nursing support to adults of all ages with complex physical health needs, as well as end of life and dementia care, within a beautifully appointed environment.&lt;/p&gt;\n&lt;p&gt;An experienced nurse with a thirst to use your expertise to full potential, why not join our incredible team?&lt;/p&gt;\n&lt;p&gt;Demonstrating excellent clinical skills; you will have proven experience in enabling there to be the best solutions for people in your care, engaging with other multidisciplinary team members to achieve these outcomes.&lt;/p&gt;\n&lt;p&gt;You are skilled at being the primary interface with families and other professional colleagues, instilling confidence in your ability to deliver safe, effective, personalised care.&lt;/p&gt;\n&lt;p&gt;You demonstrate excellent communication (including written) and leadership skills; you are experienced in managing, coaching and supporting a team.&lt;/p&gt;\n&lt;p&gt;We are looking for ambitious and innovative senior nurses to join and lead our growing team, with a passion and commitment to delivering and supporting the health and social needs of service users within our care and local communities&lt;/p&gt;\n&lt;p&gt;You will be expected to engage with professional development programs appropriate for your role (such as the Palliative care foundation course/physical assessment course)&lt;/p&gt;\n&lt;p&gt;You will be required to work autonomously in all aspects of care delivery. This is an ideal opportunity for any experienced nurse who wants to develop their clinical knowledge and practice within the community&lt;/p&gt;\n&lt;p&gt;In return for your skills we can offer:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Excellent, competitive salary&lt;/li&gt;\n&lt;li&gt;Full induction and training programme&lt;/li&gt;\n&lt;li&gt;NHS Pension contributions&lt;/li&gt;\n&lt;li&gt;Flexible Working patterns&lt;/li&gt;\n&lt;li&gt;Child care vouchers&lt;/li&gt;\n&lt;li&gt;Excellent training and development opportunities with Personalised career path ladders to ensure fulfilling career development&lt;/li&gt;\n&lt;li&gt;Free uniform&lt;/li&gt;\n&lt;li&gt;NHS Discounts&lt;/li&gt;\n&lt;li&gt;Employee Assistance Programme&lt;/li&gt;\n&lt;li&gt;The opportunity to work with passionate healthcare professionals&lt;/li&gt;\n&lt;li&gt;Revalidation support&lt;/li&gt;\n&lt;li&gt;Free DBS&lt;/li&gt;\n&lt;li&gt;Paid breaks&lt;/li&gt;\n&lt;li&gt;Recognition schemes including personal bests and annual National Care Home Awards&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Anne Morris&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;anne.morris@sussexpartnership.nhs.uk&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121074.jpg", "name": "Sussex Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121074"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Lindridge Care Home, Hove", "postalCode": "BN3 7JW"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8416", "longitude": "-.192157"}}, "title": "Registered Nurse - Day&#39;s", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243483", "validThrough": "2020-11-09T23:59:59+0000"}