{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683"}}, "datePosted": "2020-10-26T11:53:49+0000", "description": "&lt;p&gt;Applications are invited for the position of Consultant in Intensive Care Medicine and anaesthesia at the Royal Devon and Exeter Hospital. One posts is available. We are seeking an enthusiastic and committed individual to join our existing team of 10 similarly equipped consultants.&lt;/p&gt;\n&lt;p&gt;Our 15 bedded Unit is soon to see a significant expansion with the planned building of a brand new 14 bedded purposed built, full specification Intensive Care Unit. With an ‘outstanding’ rating from the CQC, this increase in the workforce will help to ensure that we continue to deliver the highest standard of care. The Trust is absolutely committed to its support of the Critical Care team.&lt;/p&gt;\n&lt;p&gt;The unit is a long-standing contributor to the ICNARC database, with impressive outcomes and a low SMR. The department has a very strong research ethos, contributing to a variety of local, regional and national studies and is involved in several national trials for which despite our size we have been large recruiters.&lt;/p&gt;\n&lt;p&gt;The main hospital site is in the historical Cathedral city of Exeter that has abundant family amenities and beautiful surrounding countryside. It is situated in the middle of the South West Region with easy access to the countryside and coast of Devon and Cornwall, with some of the country’s finest surf spots and coastal and hill walks. It is well served by rail, road and air links, only 2 hours by train from London. Good educational facilities such as the University of Exeter and good Ofsted rated schools are available locally. Our Community sites are equally well positioned and are a good place to work.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt; Enjoy a good quality of life in the South West and be part of our caring workforce.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For more information regarding this post, please contact our Clinical Lead for Intensive Care Medicine ,Adam Reuben or Clinical Director for Critical Care, Quentin Milner on 01293 402474&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121044.jpg", "name": "Royal Devon and Exeter NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121044"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Exeter", "postalCode": "EX2 5DW"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7167", "longitude": "-3.50669"}}, "title": "Consultant in Intensive Care and Anaesthesia", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242299", "validThrough": "2020-12-06T23:59:59+0000"}