{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44780", "minValue": "37638", "unitText": "YEAR", "value": "£37,638 - £44,780 pa inc"}}, "datePosted": "2020-11-02T16:01:13+0000", "description": "&lt;p&gt;&lt;strong&gt;Band 6 Sister/Charge Nurse Interventional Radiology &amp; Diagnostic Imaging at St Mary’s Hospital, &lt;/strong&gt;&lt;strong&gt;Praed Street, Paddington, London W2&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for a highly motivated individual who is passionate about working in this innovative and fast paced environment. Do you have 2 years or more experience in a critical care setting and at least one years’ experience in Radiology Nursing? Do you enjoy the technical aspects of nursing and are enthusiastic about providing high quality of patient care? Can you work effectively with multi-professional teams and demonstrate excellent written and verbal communication skills?&lt;/p&gt;\n&lt;p&gt;If the answer is &lt;strong&gt;YES&lt;/strong&gt; then this is the role is for you!&lt;/p&gt;\n&lt;p&gt;We offer an exciting opportunity for an experienced Radiology Nurse to take up the Band 6 Sister / Charge Nurse role within Imaging at St Mary’s Hospital.&lt;/p&gt;\n&lt;p&gt;St Mary’s hospital is situated in the bustling and vibrant district of Paddington in the City of Westminster with easy access to all amenities; such as the West End and other attractions close by. It is also one of London’s oldest and most Illustrious medical institutions and is a specialist center for Major Trauma, Vascular, Hepato-biliary, Gastro-Enterology and Paediatric Medicine.&lt;/p&gt;\n&lt;p&gt;St Mary’s hospital has a world renowned reputation for research, advanced robotics and image guided surgery.&lt;/p&gt;\n&lt;p&gt;The band 6 sister / charge nurse will play an integral part in leading the team according to our trust values and ensuring the delivery of high quality patient care within this innovative environment. With such a wide variety of specialist services there is ample opportunity to gain valuable managerial skills; providing a firm foundation for your career. The successful candidate will have a unique opportunity to make a difference to this service.&lt;/p&gt;\n&lt;p&gt;Our small, supportive nursing team offers a unique combination of technical and high dependency nursing skills. The team works in conjunction with radiologists, radiographic staff and anaesthetists providing care for complex patients across all imaging modalities including Angio, CT, Ultrasound, MRI, and Recovery.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What can we do for you?&lt;/strong&gt;We provide a comprehensive orientation program along with in house training, foundation courses, coaching and leadership training. You will build on scrub, circulating and recovery skills. You will gain valuable experience in Endovascular work, microwave ablation, MRgFUS fibroids, Prostate embolisations. You will have the support of a clinical educator in a friendly and supportive team environment. We can also offer the opportunity to rotate to all three sites as part of your development.&lt;/p&gt;\n&lt;p&gt;If you are looking to further your nursing career; enjoy working in a busy and innovative environment, possess excellent communication and organisational skills; keen to work alongside, multi-professional teams, then this could be just the job you have been searching for.&lt;/p&gt;\n&lt;p&gt;Come and join us, we can see it in you!&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Trust reserves the right to close this vacancy prior to the closing date should we receive 50 applications prior to the advertised closing date.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are committed to equal opportunities and improving the working lives of our staff and will consider applications to work flexibly, part-time or job share. Please talk to us at interview about the flexibility you may need.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Sr Ana Jurman on ana.jurman@nhs.net 0203 31 21723, or CNE Yvonne Bower yvonne.bower@nhs.net , 0203 332 1723. Interview Date: To be arranged&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123032.jpg", "name": "Imperial College Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123032"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Trustwide, London", "postalCode": "W2 1NY"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5171", "longitude": "-.174187"}}, "title": "Band 6 Sister/Charge Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252745", "validThrough": "2020-11-15T23:59:59+0000"}