{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Band 7"}}, "datePosted": "2020-11-04T09:02:05+0000", "description": "&lt;p&gt;&lt;strong&gt;Hurley Group NHS GP Partnership&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Pharmacist posts: Clinical Pharmacist&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Salary Scale: Band 7&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Hurley Group is an NHS organisation that runs a number of practices and urgent care centres across London. We have been providing patient-centred care since 1969, working within some of the UK’s most deprived communities.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Kings College Hospitals NHS Foundations Trust, along with The Hurley Group, have developed an integrated and innovative approach to medicines optimisation and improved community medicines management.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We have an excellent opportunity available for enthusiastic and motivated Clinical Pharmacist to join our team. Working within this team, you would have the opportunity to work alongside GP Practices within the Hurley Group.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This role is a split role working 2 days a week at Kings College Hospital NHS Foundation Trust and 3 days a week at The Hurley Group.&lt;/p&gt;\n&lt;p&gt;This role will be to support the medicines management aspects of this initiative through working within the general practice setting, and the remote online setting. This will involve working with eConsult to process patient queries as well as face to face appointments. Most of this work will be done in the eHub, a central hub that processes econsultations across 14 primary care sites in London. The eHub utilises remote prescribing via EPS v2 enabling fewer visits for patients to their GP practice and the role will involve developing this new and innovative service.&lt;/p&gt;\n&lt;p&gt;This role will be part of the general practice team to provide specialist advice to patients, and undertake full patient centered medication reviews to proactively manage people with complex polypharmacy, particularly the elderly and those with multiple conditions.&lt;/p&gt;\n&lt;p&gt;We are a large central London practice with excellent access to transport links. Our population is hugely interesting and diverse with some inner city areas and some affluent areas. Our team is hugely supportive of each other and many members of staff have worked with us for years.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Applications are welcomed from applicants with a disability. We can make reasonable adjustments and offer support and advice in a variety of ways throughout the application process. Equality of opportunity is our policy.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;All applications for this post need to be made online&lt;/li&gt;\n&lt;li&gt;Please note that our vacancies may close before the advertised closing date if sufficient suitable applicants are received.&lt;/li&gt;\n&lt;li&gt;All shortlisted applicants will be contacted by via email. If you have not been contacted within 4 weeks of the closing date you should assume that you have not been shortlisted.&lt;/li&gt;\n&lt;li&gt;Please ensure that you read and understand the Job Description and Personal Specification attached to the role. Your Statement in Support should reflect the requirements specified as your application will be judged against these criteria.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Closing date: 18th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview date&lt;/strong&gt;:  &lt;strong&gt;W/C 30th November 2020&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central Advertising - General Practitioners", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130654"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "London", "postalCode": "SE5 9RS"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4684", "longitude": "-.09228"}}, "title": "Rotational Pharmacist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255141", "validThrough": "2020-11-18T23:59:59+0000"}