{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Dependent on experience"}}, "datePosted": "2020-11-04T20:32:19+0000", "description": "&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Job Title: Healthcare Assistant - Nights &lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Department: Hospice at Home&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Salary: Dependent on experience - &lt;/span&gt;&lt;span&gt;plus unsocial enhancements and mileage &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Working hours: Full and Part-time hour’s available, hours to be worked over a seven night week&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Application review date: 22&lt;/span&gt;&lt;span&gt;nd &lt;/span&gt;&lt;span&gt;November 2020 &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Interview date: 4&lt;/span&gt;&lt;span&gt;th &lt;/span&gt;&lt;span&gt;December 2020 &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Do you work in healthcare and need a change are you passionate and committed to providing the best possible care to patients in their own homes? Or would you like a new career in healthcare.&lt;/p&gt;\n&lt;p&gt;We have a fantastic opportunity for the right individual to join our innovative and forward thinking Hospice at Home team. The Hospice at Home Health Care Assistant team provides an exceptionally high standard of care and emotional support, day and night, to imminently dying patients and families, enabling patients to remain in their own homes to die when that is their preference. We will also support care home staff to care for patients in the last weeks of life whose chosen place of care is within the care home setting.&lt;/p&gt;\n&lt;p&gt;The successful candidate may have previous experience in health care, either in an in-patient setting or working in the community, and a minimum qualification of Care Certificate in Health and Social care is desired. However, we are able to offer in house training, to the right candidate, to achieve a recognised qualification in care and support to further develop skills.&lt;/p&gt;\n&lt;p&gt;Palliative/Hospice experience is desirable but not essential. Good communication and team-working skills and an empathetic disposition are essential.&lt;/p&gt;\n&lt;p&gt;Company benefits:&lt;/p&gt;\n&lt;p&gt;To reward the hard work of our fantastic staff, St Giles Hospice offers an excellent benefits package as per the below.&lt;/p&gt;\n&lt;p&gt;- 27 days’ annual leave plus bank holidays (rising to 35 days with service)&lt;/p&gt;\n&lt;p&gt;- Contributory pension scheme&lt;/p&gt;\n&lt;p&gt;- Free car parking&lt;/p&gt;\n&lt;p&gt;- Training &amp; Development opportunities as well as progression within the organisation&lt;/p&gt;\n&lt;p&gt;About us:&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;St Giles Hospice is a registered charity with a CQC rating of Outstanding&lt;/span&gt;&lt;/span&gt;&lt;span&gt;&lt;span&gt;, &lt;/span&gt;&lt;/span&gt;&lt;span&gt;&lt;span&gt;providing high-quality medical and nursing care for local people living with cancer and other serious illnesses, as well as offering support for their families and helpers. Care is offered in a variety of ways according to the individual’s needs and is offered out in the community as well as from 3 sites, an inpatient unit at Whittington, with other day unit facilities at Sutton Coldfield, and Uttoxeter. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;We receive funding from the NHS but primarily we rely on fundraising activities and legacies, together with trading activities (Shops, Lottery and other trading) to support our work. We employ more than 400 people across a broad range of roles – from direct patient care to fundraising and administration as well as support from over 1500 volunteers to provide our services.&lt;/p&gt;\n&lt;p&gt;Further details:&lt;/p&gt;\n&lt;p&gt;To find out more or have an informal chat please contact Debra Varnam, Clinical Lead for Hospice at Home, 01543 434525.&lt;/p&gt;\n&lt;p&gt;This post is subject to a Disclosure and Barring Service (DBS) check&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;We may review applications before the application review date, however, if you apply after the application review date, your application may not be considered. We will accept applications until we have successfully filled the role&lt;/span&gt;&lt;/span&gt;&lt;span&gt;&lt;span&gt;. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;All correspondence in response to applications will be sent via email. Due to the number of applications received, it is not always possible to respond to every application. Therefore, applicants who do not receive a response within 14 days of the review date should assume that they have been unsuccessful.&lt;/p&gt;\n&lt;p&gt;St Giles Hospice, Fisherwick Road, Whittington, Lichfield, WS14 9LH. Registered charity 509014 Company limited by guarantee 1430090&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/130216.jpg", "name": "St Giles Hospice", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130216"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Sutton Coldfield", "postalCode": "WS14 9LH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6712", "longitude": "-1.763"}}, "title": "Healthcare Assistant - Nights", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256873", "validThrough": "2020-11-22T23:59:59+0000"}