{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "18005", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 pro rata, per annum"}}, "datePosted": "2020-11-05T15:38:53+0000", "description": "&lt;p&gt;&lt;strong&gt;North Tees &amp; Hartlepool Solutions&lt;/strong&gt; is an NHS owned company of North Tees and Hartlepool NHS Foundation Trust. &lt;strong&gt;North Tees &amp; Hartlepool Solutions&lt;/strong&gt; provides a range of Estates, Facilities, Supplies and Procurement services to North Tees and Hartlepool NHS Foundation Trust. The company is a separate legal body to North Tees and Hartlepool NHS Foundation Trust. &lt;strong&gt;The successful applicant will be an employee of the subsidiary and not the NHS.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;North Tees &amp; Hartlepool Solutions&lt;/strong&gt; offers its own Terms and Conditions of employment which differ from the national NHS Terms and Conditions. As an employee in the company you will benefit from:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A competitive salary&lt;/li&gt;\n&lt;li&gt;Excellent performance related bonus scheme&lt;/li&gt;\n&lt;li&gt;Up to 33 days annual leave plus bank holidays (dependant on service and contracted hours)&lt;/li&gt;\n&lt;li&gt;Access to a pension scheme - National Employment Savings Trust (NEST) – North Tees &amp; Hartlepool Solutions will pay a 3% contribution (this is above the minimum contribution rate at the present time)&lt;/li&gt;\n&lt;li&gt;Night shift working allowances (where appropriate)&lt;/li&gt;\n&lt;li&gt;Bank holiday working allowances (where appropriate)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;em&gt;The Disclosure and Barring Service (DBS) check will be paid for by North Tees and Hartlepool Solutions, however, should you fail to satisfactorily complete the probationary period, you will be charged for the DBS check as a deduction from your final salary.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for an individual to join our Bank services team on a fixed term contract, for an initial &lt;strong&gt;4 months &lt;/strong&gt;with scope for potential extension. North Tees and Hartlepool Solutions is seeking to appoint honest, enthusiastic, self-motivated, hardworking and committed individuals, who are able to work in a team and on their own initiative. The successful candidates will have excellent communication and organisational skills, be self motivated and able to work flexibly and without direct supervision.&lt;/p&gt;\n&lt;p&gt;You will join the Company at what is a really exciting time, as we continue to grow and expand. We have exceptionally high standards and are looking for you to contribute to and enhance our highly skilled workforce and be part of well-supported dedicated team. The post holder will have the opportunity to join NTH Solutions on our exciting journey.&lt;/p&gt;\n&lt;p&gt;The applicant will be required to assist in the provision of varied and flexible work allocation across the University Hospital of North Tees and University Hospital of Hartlepool sites and other community settings. The post will support in areas, including Portering, Domestic Services, Catering and Decontamination/Deep Cleaning. The location and allocation of work tasks may vary on a day to day that meets the needs of patients, staff, visitors and clients. &lt;strong&gt;Candidates must be flexible and have the ability to travel independently. This is a demanding post, but a rewarding one, providing opportunities to work in a variety of settings.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Recruitment services for North Tees &amp; Hartlepool Solutions are provided by the Resourcing Team, North Tees and Hartlepool NHS Foundation Trust.&lt;/p&gt;\n&lt;p&gt;This advert for a vacancy with North Tees &amp; Hartlepool Solutions appears under the authority of North Tees and Hartlepool NHS Foundation Trust.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This advert is placed by NTH Foundation Trust on behalf of North Tees and Hartlepool Solutions which is a Limited Liability Partnership operating services within NTH Foundation Trust. Please refer to the attached Terms and Conditions of Employment relating to this vacancy.&lt;/strong&gt;&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "North Tees and Hartlepool NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120670"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Various Hospital and Community Settings Across the Region", "postalCode": "TS19 8PE"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.5829", "longitude": "-1.34677"}}, "title": "Facilities Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258385", "validThrough": "2020-11-10T23:59:59+0000"}