{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51069", "minValue": "32478", "unitText": "YEAR", "value": "£32,478 - £51,069 per annum + L.W."}}, "datePosted": "2020-10-27T16:02:00+0000", "description": "&lt;p&gt;We are seeking an enthusiastic and quality driven doctor to work with us at the Royal Free – Barnet Hospital. We are looking for colleagues with interests in quality improvement and digital innovation keen to support new and innovative ways of working based on population health. You will be supported by a first class Education Centre, with a wealth of teaching, training and management opportunities. We are a fantastic place to work and welcome applications.&lt;/p&gt;\n&lt;p&gt;The Senior Clinical Fellow post is based at Barnet Hospital for 12 months (subject to satisfactory progress). If you are looking for further experience in Acute Medicine with the opportunity to develop your sub-specialty interests, then you would be well suited to this position. Clinical duties are at SpR level including participation in the medical on-call rota. This post will both increase your level of confidence and provide strong CV development. Our previous Senior Clinical Fellows have gone on to become very successful Specialist Registrars, progressing well towards becoming Consultants. &lt;br /&gt;&lt;br /&gt;Although these posts do not have Educational Approval from the Postgraduate Dean, study leave, study budget and core training with e-portfolio will be provided in the same way as for other Trainees at the same level.&lt;/p&gt;\n&lt;p&gt;This is an exciting time to be joining the trust as we are in the process of expanding the Acute Assessment Unit (AAU), creating a front door frailty area, identifying further Same Day Emergency Care (SDEC) activity and redesigning those pathways whilst supporting a thriving Medical Short Stay Unit (MSSU). Medical students from University College Medical School are attached to the hospital during term time. The first cohort of Physicians Associate Students rotated through acute medical specialties this year and we are supportive of Advanced Care Practitioner roles.&lt;/p&gt;\n&lt;p&gt;Barnet is a fantastic location close to green belt; affordable accommodation in nearby Hertfordshire; good local schools; ability to achieve a flexible enjoyable work life balance.&lt;/p&gt;\n&lt;p&gt;Our mission is to deliver world class care and expertise in our clinical services, underpinned by world class teaching and research and we will continue to measure our progress against our five governing objectives: excellent outcome, excellent patient and staff experience, excellent value for taxpayers money, being safe and meeting our external duties and building a stronger organisation.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Dr Robert Barker&lt;/p&gt;\n&lt;p&gt;Job title: Consultant Physician / Clinical Director&lt;/p&gt;\n&lt;p&gt;Email address: robert.barker1@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number: 0208 216 4486&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120624.jpg", "name": "Royal Free London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120624"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Barnet, London", "postalCode": "EN5 3DJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.651", "longitude": "-.215519"}}, "title": "Senior Clinical Fellow in Acute Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245327", "validThrough": "2020-11-10T23:59:59+0000"}