{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum pro rata"}}, "datePosted": "2020-10-30T12:16:25+0000", "description": "&lt;p&gt;Do you want to be a part of an innovative and challenging service for men with chronic histories of trauma? Does being part of a large multidisciplinary team, working within the NHS in partnership with Her Majesty’s Prison Service, stimulate your interest? If so, we are seeking to appoint several NHS band 7 Psychology posts in our team.&lt;/p&gt;\n&lt;p&gt;We believe that people traumatised earlier in life deserve the opportunity to heal these wounds. We provide an innovative, trauma focused treatment programme for male offenders within a high secure prison, who have often lost hope for their future.&lt;/p&gt;\n&lt;p&gt;Our cutting-edge treatment draws on attachment theory and incorporates sensorimotor psychotherapy and schema focused therapy. Through a combination of individual and group therapies, patients are given opportunities to heal from trauma and neglect, improve wellbeing and reduce risk.&lt;/p&gt;\n&lt;p&gt;We will support you in broadening your therapeutic skills, project management and working to achieve change in a complex system. There are opportunities to be involved in new interventions, such as Neuroptimal and virtual reality, as well as furthering your research interests through our links with Nottingham Trent University.&lt;/p&gt;\n&lt;p&gt;The roles are permanent and there is scope to work from home on a weekly basis.&lt;/p&gt;\n&lt;p&gt;You will join our diverse clinical team with a rich range of clinical and forensic experience. Flexibility, creativity, curiosity and openness to change are valued qualities within our team.&lt;/p&gt;\n&lt;p&gt;The Fens Service, HMP Whitemoor, is a high secure treatment service within the Offender Personality Disorder Pathway, which opened in 2000. The prison is located near the market town of March, which is situated 25 miles from Cambridge. A mainline rail link operates between Peterborough and London taking 50 minutes.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;“I wanted to change, I was crying out to change. You know, it was a trust element.…letting them see me warts and all….and that was the hard thing. Breaking down crying…getting the stuff out I needed to. I grew from that…if I don’t like myself, how can anyone else like myself. How can I move on if I don’t forgive myself… I’ve got to give myself a chance. ” - &lt;/em&gt;&lt;strong&gt;Words from a current service user&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Dr Victoria Vallentine - Consultant Clinical Psychologist&lt;/p&gt;\n&lt;p&gt;karen.pillinger@cpft.nhs.uk&lt;/p&gt;\n&lt;p&gt;01354 620560&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121760.JPG", "name": "Cambridgeshire and Peterborough NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121760"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Fens Unit OPDP, HMP Whitemoor, March, Cambridgeshire", "postalCode": "PE15 0PR"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5746", "longitude": ".08179"}}, "title": "Specialist Clinical or Forensic Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250115", "validThrough": "2020-11-15T23:59:59+0000"}