{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 £82,096 -£110,683 p.a excl. LW"}}, "datePosted": "2020-10-28T16:30:53+0000", "description": "&lt;p&gt;Applications are invited for a full time Locum Consultant Colorectal Surgeon for a 12 month fixed term duration. This consultant post will be expected to provide a comprehensive service across both sites at Epsom and St Helier NHS Trust working on 10 programmed activities (PA’s) and an emergency on call commitment.&lt;/p&gt;\n&lt;p&gt;The successful candidate will work with nine other surgeons to provide an emergency service to a catchment area of approximately 450,000.They will contribute to the General Surgical on call rota 1:10.&lt;br /&gt;&lt;br /&gt;This is an exciting opportunity to develop new models of care; with the new Surgical Admissions Unit, which recently opened in late 2018 and continue to work with the existing team to increase the profile of Colorectal Surgery at Epsom and St Helier NHS Trust.&lt;br /&gt;&lt;br /&gt;You must be fully registered with the GMC and hold Licence to Practice and be on the Specialist Register, or within six months of attaining your CCT or equivalent at interview stage.&lt;br /&gt;&lt;br /&gt;The postholder will have regular contact with vulnerable adults and/or children (0-18 years) and therefore, this post is subject to the Rehabilitation of Offenders Act (Exceptions Order) 1975 and as such it will be necessary for a submission for Disclosure to be made to the Disclosure and Barring Service to check for any previous criminal convictions.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Mr Nick West&lt;br /&gt;Job title Clinical Lead Surgery&lt;br /&gt;Email address nicholas.west@nhs.net&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121992.jpg", "name": "Epsom and St Helier University Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121992"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Epsom and St Helier, Epsom and St Helier", "postalCode": "SM5 1AA"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3801", "longitude": "-.183166"}}, "title": "Locum Consultant Colorectal Surgeon", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247387", "validThrough": "2020-11-11T23:59:59+0000"}