{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum + 5% HCAS"}}, "datePosted": "2020-10-28T08:53:29+0000", "description": "&lt;p&gt;&lt;span&gt;Surrey Downs Health &amp; Care is an innovative partnership between the three GP Federations, community trust and acute trust, Surrey Downs Health and Care is delivering true transformational change for adult community services across Surrey Downs to the benefit of patients and the local healthcare system. Our delivery model is formed around a shared vision and innovative use of the wealth and diversity of both the clinical and managerial experience that the partnership brings and as such it will provide a truly holistic, person-centred service that no one partner could provide on its own.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are recruiting for dedicated and motivated Band 5 Staff nurses to join our community nursing team across the Surrey Downs area. The opportunity is for an experienced, newly qualified or return to practice qualified Staff Nurse.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Posts are available across Leatherhead, Dorking, East Elmbridge, Banstead &amp; Tattenham and Epsom localities. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Community Team visit patients in their own home as well as care homes. There are excellent opportunities for training and the team has experienced District Nurses and Team Leaders who will ensure that you have the necessary support for your personal development. The community nursing service works over a 7 day week (8.00am to 6.30pm) and includes weekend and bank holiday working.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Individuals will be expected to deliver and maintain a high standard of clinical and professional Nursing Care and to assist in the delivery of all aspects of individualised patient care.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;If you want:&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;•To be an integral member of a dedicated team&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;•Part or Full time work&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;•A flexible working culture&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;•To join a forward thinking, innovative organisation which puts its patient’s first&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;•To contribute to the provision of high quality care within your local community then we want to hear from you!&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;If you would like an informal visit to the team or have any queries please contact Emma Alderman, Operational Manager, &lt;/span&gt;&lt;span&gt;emma.alderman@nhs.net&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;While this post remains within CSH, the post is accountable to Surrey Downs Health &amp; Care. This will not impact on any of your terms of employment.&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123532.JPG", "name": "CSH Surrey", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123532"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Surrey Downs Area", "postalCode": "KT22 8SD"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2951", "longitude": "-.320264"}}, "title": "Band 5 - Staff Nurse - Eligible for Golden Hello Incentive", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245767", "validThrough": "2020-11-11T23:59:59+0000"}