{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "103896", "minValue": "79957", "unitText": "YEAR", "value": "£79,957 - £103,896 per annum"}}, "datePosted": "2020-10-15T16:30:46+0100", "description": "&lt;p&gt;&lt;strong&gt;Consultant Community Paediatrics (1 post) &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;100-MED-GGH-103-A&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary £79,957 - £103,896 per annum&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking to recruit a motivated Consultant in Community Paediatrics with a Clinical Lead Role option. This is a replacement post and you will join colleagues in a dynamic and forward looking, innovative Child and Adolescent Health department, integrating community and acute care. All special interests in the field of community paediatrics are welcome.&lt;/p&gt;\n&lt;p&gt;You will enjoy excellent conditions of employment, whilst building your future in one of the best locations in the UK. The Women and Children’s Health Directorate provides services for children, young people, and women within the Hywel Dda Health Board. The Paediatric team operates with a full senior nursing team. The Directorate aims to provide fully integrated secondary children’s services to flexibly meet the health needs of local children. Following reconfiguration of our service in West Wales, we operate one centralised SCBU (250 admissions/ year, retrieval by the neonatal transport service for intensive care), with acute paediatrics delivered in each district general hospital site.&lt;/p&gt;\n&lt;p&gt;Hywel Dda University Health Board is one of seven acute Health Boards in Wales serving a population of 384,000 with over 9,500 staff.&lt;/p&gt;\n&lt;p&gt;Hywel Dda University Health Board is an integrated health body, ensuring the delivery of high quality primary, community, mental health and secondary care services. It is responsible for the health and wellbeing of people across Carmarthenshire, Ceredigion and Pembrokeshire. It also provides a range of services for people living in south Gwynedd and Powys. Integrated health boards are a key first step in creating a world class NHS in Wales.&lt;/p&gt;\n&lt;p&gt;Primary care and community services are delivered through: 55 GP practices, 51 Dental practices, 100 Community pharmacies, 52 Optometry premises, 8 Community hospitals, 11 Health centres. Our in-hospital services are currently delivered through: 4 Hospitals (Bronglais, Glangwili, Prince Philip, Withybush.&lt;/p&gt;\n&lt;p&gt;The Health Board is fully committed to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Work-life balance, job-sharing and flexibility&lt;/li&gt;\n&lt;li&gt;Training &amp; Education including a successful Consultant Development &amp; Mentoring scheme&lt;/li&gt;\n&lt;li&gt;Medical Appraisal &amp; Revalidation for over 800 doctors&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;You will enjoy excellent conditions of employment, whilst building your future in one of the best locations in the UK. West Wales is beautiful, sharing rugged coastlines with misty mountains. Outdoor sports are easy to pursue, whilst the amenities of urban centres such as Swansea and Cardiff are not too far away. The pace of life can be fast or slow, with a diverse range of people sharing an envious work-life balance across the region, with excellent quality schools, and reasonable property prices contribute to low living costs and high quality of life.&lt;/p&gt;\n&lt;p&gt;The Health Board runs a successful Consultant Development and Mentoring programme for newly appointed Consultants aimed at developing you as a senior leader to enable you to effectively contribute to Hywel Dda and its future direction.&lt;/p&gt;\n&lt;p&gt;South West Wales provides a wonderful lifestyle opportunity, and is renown to be one of the most beautiful places in the UK. Some of our major sites are near coastal areas, from the beautiful beaches of Pembrokeshire to the spectacular mountains of Ceredigion, and offer excellent quality schools, an abundance of outdoor activities such as surfing, mountain biking, fishing, sailing, hiking and walking in a natural and clean environment, whilst enjoying working and living in one of the most beautiful locations in the UK. Reasonable property prices and excellent state schools contribute to low living costs and a high quality of life. There are also good road and rail connections to Cardiff and London.&lt;/p&gt;\n&lt;p&gt;Please ensure that you read the person specification carefully and that you meet all the essential criteria prior to applying. We welcome pre-interview visits.&lt;/p&gt;\n&lt;p&gt;Please ensure that you include the e-mail addresses of your referees in your application form to enable us to contact them. We will communicate with you via NHS Jobs regarding your application&lt;/p&gt;\n&lt;p&gt;Further details or informal visits are encouraged to:&lt;/p&gt;\n&lt;p&gt;Dr Prem Pitchaikani, Clinical Lead for Acute Paediatrics Tel: 01267 227523&lt;/p&gt;\n&lt;p&gt;Margaret Devonald Morris SDM/SN Community Tel: 07875 767144.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123194.gif", "name": "Hywel Dda University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123194"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Glangwili hospital, Carmarthen", "postalCode": "SA31 2AF"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.8675", "longitude": "-4.28474"}}, "title": "Consultant in Community Paediatrics", "url": "https://www.jobs.nhs.uk/xi/vacancy/916229020", "validThrough": "2020-11-16T23:59:59+0000"}