{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 pa"}}, "datePosted": "2020-10-28T10:01:30+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for an experienced, enthusiastic and motivated dietitian to join the community based adult eating disorders team in Derbyshire.&lt;/p&gt;\n&lt;p&gt;You will be responsible for providing specialist dietetic input within our adult eating disorders team (0.8wte) as well as 1 day per week (0.2 wte) within the organisation’s inpatient mental health dietetics team.&lt;/p&gt;\n&lt;p&gt;You will be working closely with the multi-disciplinary eating disorder team, under the supervision of the lead eating disorders dietitian.&lt;/p&gt;\n&lt;p&gt;You will also have the opportunity to contribute towards service development and help shape the delivery of nutritional care within a mental health setting.&lt;/p&gt;\n&lt;p&gt;This role will be based at the Eating Disorders Service base in Belper, but includes county wide clinics and inpatient liaison so a vehicle and ability to travel across the county to various locations is required.&lt;/p&gt;\n&lt;p&gt;The inpatient mental health dietetics team are based at the Kingsway Hospital in Derby.&lt;/p&gt;\n&lt;p&gt;Due to pandemic restrictions, we are currently able to offer some remote working on a temporary basis on certain working days. This may vary based on need for supervision, training and inpatient coverage.&lt;/p&gt;\n&lt;p&gt;The successful applicant will be clinically supported by a friendly, experienced multi-disciplinary eating disorders team as well as a small Trust-wide dietetic team who are committed to continued professional development and training opportunities.&lt;/p&gt;\n&lt;p&gt;We are a placement provider for student dietitians and are currently involved in A,B and C placements with the University of Nottingham. The post holder will be actively involved in student training.&lt;/p&gt;\n&lt;p&gt;If you can demonstrate the willingness to learn and undertake a new challenge we look forward to hearing from you!&lt;/p&gt;\n&lt;p&gt;We welcome applications from band 5 dietitians with 2+ years of experience, looking to specialise or gain some experience in a growing and forward thinking area of dietetic practice.&lt;/p&gt;\n&lt;p&gt;If you wish to discuss this exciting opportunity further, or arrange an informal visit, please contact:&lt;/p&gt;\n&lt;p&gt;Megan Lomax, Lead Eating disorders Dietitian, 07747 006887&lt;/p&gt;\n&lt;p&gt;or&lt;/p&gt;\n&lt;p&gt;Dr. Joanna Miatt, Eating Disorders Service Manager, 01773 881467&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameMegan LomaxJob titleLead Dietitian- Eating DisordersEmail addressdhcft.eatingdisordersservice@nhs.netTelephone number01773 881467Additional contact information&lt;/p&gt;\n&lt;p&gt;Joanna Miatt, Acting Team Manager, 01773 881467&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121834.jpg", "name": "Derbyshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121834"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Unity Mill House, Belper", "postalCode": "DE56 1WN"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.024", "longitude": "-1.48577"}}, "title": "Specialist Eating Disorders Dietitian", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245946", "validThrough": "2020-11-10T23:59:59+0000"}