{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-11-02T11:01:33+0000", "description": "&lt;p&gt;Brighton and Sussex University Hospitals (BSUH) NHS Trust is a highly progressive, ambitious university teaching hospital and regional centre for a wide variety of specialist services. &lt;br /&gt;&lt;br /&gt;The Trust is keen to ensure that maximum value is extracted from all commercial activities, while maintaining an absolute commitment to patient safety and quality. &lt;br /&gt;&lt;br /&gt;This approach will look to merge best practice procurement and supply chain management from both inside and outside of the NHS, such that a truly ‘industry-leading’ service can be delivered. &lt;br /&gt;&lt;br /&gt;This role offers the right candidate an opportunity to join a team of procurement professionals that are focused on ensuring our services support managers in delivering excellent patient outcomes, whilst meeting the challenging financial targets that the NHS are facing.&lt;br /&gt;&lt;br /&gt;You will be responsible for sourcing and purchasing a range of goods and services within the Corporate and IT Category for the trust. You will have a sound knowledge of managing your own category effectively and efficiently to meet the needs of a complex stakeholder base, you will also have access to data through a number of resources. You will demonstrate the ability to turn this data into succinct and compelling actionable recommendations that will be used to maximise the service provided to stakeholders and to drive savings / Cost Improvement Plan (CIP) targets, improve procurement processes; whilst ensuring compliance with Trust Standing orders and EU regulations.&lt;br /&gt;&lt;br /&gt;Strong stakeholder engagement and management skills are essential as is a ’can do’ attitude, with a talent for ‘making it happen’.&lt;br /&gt;The successful candidate will have excellent interpersonal and customer service skills, sound organisation and time management skills, be a committed and effective team player, together with a flexible and self-motivated approach to work.&lt;br /&gt;&lt;br /&gt;This is an opportunity to make your mark, by playing a central role in enabling best value and quality services to be provided to patients and staff.&lt;br /&gt;&lt;br /&gt;To be successful in this role the following experience will be essential:&lt;br /&gt;&lt;br /&gt;• Solid procurement experience with an excellent track record of your previous achievements and savings&lt;br /&gt;&lt;br /&gt;• A good understanding of EU Procurement Directives and an understanding of the necessary steps to run a compliant tender exercise.&lt;br /&gt;&lt;br /&gt;• Excellent category management skills and excellent knowledge of the end to end procurement life cycle with strategic project experience.&lt;br /&gt;&lt;br /&gt;• The ability to engage senior stakeholders.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Steve Adeyemo Phillips - Head of Procurement&lt;/p&gt;\n&lt;p&gt;s.adeyemo-Phillips@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Brighton and Sussex University Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120968"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Sussex County Hosptial, Brighton", "postalCode": "BN2 5BE"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8195", "longitude": "-.118149"}}, "title": "Corporate Category Specialist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251692", "validThrough": "2020-11-12T23:59:59+0000"}