{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 to £110,683 pa"}}, "datePosted": "2020-10-19T10:45:19+0100", "description": "&lt;p&gt;Do you want to join our dynamic team of seven Gastroenterology Consultants and to work in a supported team of professionals to develop your career?&lt;/p&gt;\n&lt;p&gt;We are seeking one Consultant Gastroenterologists to join our expanding team and department. This post has become available due to the semi-retirement of one of our consultants.&lt;/p&gt;\n&lt;p&gt;You will join a thriving Gastroenterology service, which is expanding across Barnsley and Rotherham Hospitals in partnership offering a comprehensive range of gastroenterology and endoscopic services. The post mainly based at Barnsley Hospital but with some sessions and cover at the Rotherham site.&lt;/p&gt;\n&lt;p&gt;Consultant colleagues have interests in Endoscopy (including Endoscopic Ultrasound) Inflammatory Bowel Disease, Nutrition, and Hepatobiliary medicine. We offer diagnostic and therapeutic colonoscopy including complex EMR with opportunities for further development.&lt;/p&gt;\n&lt;p&gt;We have nurse led Hepatitis services in both localities with established community-based clinics, 4 Inflammatory Bowel Disease nurses across the two sites and a nurse led Capsule endoscopy and iron-deficiency service. A team of non-medical endoscopists support BowelScope (BoS), JAG audit and accreditation, surveillance protocols and training, as well as undertaking general endoscopy lists and gastroenterology clinics.&lt;/p&gt;\n&lt;p&gt;There are opportunities for you to develop your own interests in a variety of subspecialties including IBD, Hepatology, ERCP, EUS, Capsule endoscopy and Bowel Cancer Screening.&lt;/p&gt;\n&lt;p&gt;BFTH endoscopy unit has the latest Olympus 290 series stacks and endoscopes; whilst Rotherham has 290 series stacks and the endoscope upgrade is planned for December 2020.&lt;/p&gt;\n&lt;p&gt;The Gastroenterology team are active in a wide range of research activities including participation in many NIHR portfolio studies, and there is an exciting opportunity to expand this across both sites to become a leading centre for research in both South Yorkshire and the wider Yorkshire and Humber footprint. The departments are regularly involved in teaching upper GI endoscopy and colonoscopy both locally and nationally, as well as delivering a well-received therapeutic endoscopy-training day as part of the South Yorkshire Gastroenterology Training programme. There is also an active endoscopy nurses monthly teaching program.&lt;/p&gt;\n&lt;p&gt;All applicants should be fully registered with the General Medical Council, hold a Licence to Practice and be on the Specialist Register or within 12 months of CCT at the date of interview.&lt;/p&gt;\n&lt;p&gt;This is a full time, permanent post; however, applicant who would like to work flexibly or on Job share basis would also be considered.&lt;/p&gt;\n&lt;p&gt;Please see our job description today.&lt;/p&gt;\n&lt;p&gt;To find out more or to arrange informal visits please contact&lt;/p&gt;\n&lt;p&gt;Dr Ash Soliman Consultant Gastroenterologist and Clinical Lead for the integrated Gastroenterology Department at both Barnsley and Rotherham Hospital NHS Foundation Trust.&lt;/p&gt;\n&lt;p&gt;Telephone: 01226 432522 or 01226 432542. Mobile 0795 769 1364.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Closing date: 20th November 2020&lt;/p&gt;\n&lt;p&gt;Interview date: 15th December 2020&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120802.png", "name": "Barnsley Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120802"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Barnsley", "postalCode": "S75 2EP"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5583", "longitude": "-1.49958"}}, "title": "Consultant Physician specialising in Gastroenterology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916231848", "validThrough": "2020-11-22T23:59:59+0000"}