{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "22500", "minValue": "22500", "unitText": "YEAR", "value": "up to £22500 per annum DOE"}}, "datePosted": "2020-10-23T10:16:57+0100", "description": "&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Ihelp to make a difference!&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An opportunity has arisen for a Pharmacy Technician to join Practice Plus Group on a full time basis in the Isle of Wight.&lt;br /&gt; &lt;br /&gt; This is an exciting opportunity to develop your skills in an ever changing environment, working with a vulnerable and often segregated community who may not have had previous access to healthcare.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;This is your opportunity to make a difference from day one!&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This role is based at HMP Isle of Wight. Working in an HMP environment is a great place to utilize your skills where no two days are ever the same. It’s a closed community where you’ll be in direct and sometimes constant contact with services users with varying physical health, mental health and substance misuse issues.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;About the Job&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As a Pharmacy Technician, you will assist with the provision and delivery of an integrated, safe, legal, high quality prison pharmaceutical service, taking into consideration, at all times, the need to maintain a high level of security.&lt;br /&gt; &lt;br /&gt; You will be required to support the delivery of Pharmacy Services, which will be part be of a comprehensive healthcare package, based on the prison service’s needs. As a Pharmacy Technician, you will be an integral member of the Pharmacy Team, which forms part of the wider cluster of Healthcare Services. Practice Plus Group policies and procedures and statutory frameworks governing patient care in a prison setting, will be used in order to deliver the highest standard of care to clients in line with National Guidelines.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Job Requirements:&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will hold NVQ Level 3, BTEC or equivalent qualifications and must have a current registration with the General Pharmaceutical Council. You will also have relevant post-registration experience working within a multi-disciplinary team. Please apply and your application will be reviewed by the recruiter, who will review and contact you to discuss further.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Further job information:&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The salary for this position is 17500-22500 FTE per annum DOE.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt; For informal discussions and visits, please contact:&lt;br /&gt; &lt;br /&gt; Mark Mursell – dispensary manager, on (01983) 635352, or mark.mursell@practiceplusgroup.com&lt;br /&gt; &lt;br /&gt; For general enquiries about working for Practice Plus Group in Prison Health Services in HMP Isle of Wight, please contact Gemma McMaster - Service Manager on 01983 556741 - or e mail gemma.mcmaster@practiceplusgroup.com&lt;br /&gt; &lt;br /&gt; Please note that offers of employment is subject to receipt of satisfactory references, enhanced DBS check and prison vetting.&lt;br /&gt; &lt;br /&gt; At Practice Plus Group, we actively promote diversity and equal opportunities.&lt;br /&gt; &lt;br /&gt; Please note that we reserve the right to close this role once a sufficient number of applications have been received.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Practice Plus Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130136"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Isle of Wight", "postalCode": "PO30 5RS"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7121", "longitude": "-1.30498"}}, "title": "Pharmacy Technician- HMP Isle of Wight", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240007", "validThrough": "2020-11-06T23:59:59+0000"}