{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-10-28T15:01:35+0000", "description": "&lt;p&gt;We are currently looking to recruit a qualified RMN to join our mental health liaison team. The post will also include opportunities to rotate between the Assessment Service, Home Treatment Team and Acute Adult in-patient services.&lt;/p&gt;\n&lt;p&gt;You will become part of a developing service, providing mental health assessment and care within the general hospitals in Swansea and Neath Port Talbot.&lt;/p&gt;\n&lt;p&gt;The mental health liaison team provides responsive mental health assessment and support to the emergency department and inpatient wards for patients from age 18 upwards, including older adults.&lt;/p&gt;\n&lt;p&gt;If you would like to be part of an exciting PLAN accredited multi disciplinary service, and have a track record of enthusiasm and a commitment to the development of nursing practice and service development, then we are very keen to hear from you.&lt;/p&gt;\n&lt;p&gt;You will hold a registered mental health nursing qualification and be able to demonstrate post-registration experience at Band 5, or above. You will need to provide evidence of continual professional development.&lt;/p&gt;\n&lt;p&gt;You will hold a sound working knowledge of common mental health disorders, the Mental Health Act and Mental Capacity Act. A sound knowledge of the interface between physical and mental health is essential as well as experience of working with older adults, in any setting.&lt;/p&gt;\n&lt;p&gt;You must have very good communication and interpersonal skills. You must also be confident and motivated, flexible and be able to show initiative in an environment which can be demanding. There will also be a teaching, education and support role, assisting non-mental health staff to respond to mental health needs more effectively in the acute hospital setting.&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; English and/or Welsh speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Clare Pressdee&lt;/p&gt;\n&lt;p&gt;Job title: Liaison Psychiatry Manager&lt;/p&gt;\n&lt;p&gt;Email address: clare.pressdee@wales.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number: 01792 703312&lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;Rebecca Cochrane, Clinical Nurse Specialist&lt;/p&gt;\n&lt;p&gt;Devlyn Evans, Clinical Nurse Specialist&lt;/p&gt;\n&lt;p&gt;01792 703312&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123207.jpg", "name": "Swansea Bay University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123207"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Morriston Hospital, swansea", "postalCode": "SA6 6NL"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6847", "longitude": "-3.93527"}}, "title": "Mental Health Liaison Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247098", "validThrough": "2020-11-11T23:59:59+0000"}