{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Salary is negotiable based upon experience"}}, "datePosted": "2020-11-04T14:56:09+0000", "description": "&lt;p&gt;&lt;strong&gt;About The Role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We have an exciting, new opportunity for a Dietician join our Primary Care Network, supporting our 7 GP practices across the Clacton On Sea area to assist in re-shaping Primary Care across our communities.&lt;/p&gt;\n&lt;p&gt;The experienced Dietician will undertake advanced health advice to patients to learn about their health goals, dietary needs, preferences and restrictions.&lt;/p&gt;\n&lt;p&gt;This role will be working autonomously, but will have the support of a multi-professional primary care team made up of doctors, nurses, clinical pharmacists, occupational therapists, physician associate and pharmacy technician.&lt;/p&gt;\n&lt;p&gt;Please see the attached job description for further information.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;We have the right to close the vacancy earlier than the closing date, if we reach the maximum number of applications.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;This role is also being advertised on the Essex Primary Care Careers website, please complete only one application, duplications will not be considered.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;NO AGENCIES PLEASE&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About The Candidate&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The appropriate individual will be a qualified Dietician with BSc in Nutrition &amp; Dietetics (or equivalent) with a registration with the British Dietetic Association.&lt;/p&gt;\n&lt;p&gt;You will have strong experience ofworking in Nutrition &amp; Dietetics within a healthcare setting.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be able to advise patients on special dietary requirements (i.e. food allergies, coeliac disease, diabetes etc.) as well as educating health professionals and the public about nutrition.&lt;/p&gt;\n&lt;p&gt;You will have strong experience and knowledge of working with different patient groups and needs across a diverse population. You will have excellent communication skills in addressing and providing health advice to patients to learn about their health goals and dietary needs, preferences, and restrictions.&lt;/p&gt;\n&lt;p&gt;You will be used to working within a multi-disciplinary team.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the Surgery&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;T&lt;/em&gt;&lt;em&gt;horpe and Ranworth PCN is comprised of 7 practices covering around 45,000 patients.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;Supporting your work life balance and professional development is important to us, so we will be happy to discuss any requirements for flexible working and offer the following benefits:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Competitive salary based on experience&lt;/li&gt;\n&lt;li&gt;NHS Pension&lt;/li&gt;\n&lt;li&gt;25 day annual holiday ( pro rata for part-time) plus bank holidays&lt;/li&gt;\n&lt;li&gt;Supportive and friendly environment&lt;/li&gt;\n&lt;li&gt;Flexible working hours&lt;/li&gt;\n&lt;li&gt;Peer support&lt;/li&gt;\n&lt;li&gt;CPD Support with training and development&lt;/li&gt;\n&lt;/ul&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/135914.JPG", "name": "Essex Primary Care", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=135914"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Clacton on Sea", "postalCode": "CO15 2NB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7806", "longitude": "1.11792"}}, "title": "PCN Dietician (30 hours per week)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256312", "validThrough": "2020-11-20T23:59:59+0000"}