{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 £45,753 - £51,668 per annum"}}, "datePosted": "2020-11-05T09:01:19+0000", "description": "&lt;p&gt;We are excited to have the opportunity to recruit four new HCPC registered Practitioner Psychologists to join our growing Psychology and Psychological Therapies team working with people with dementia and older people.&lt;/p&gt;\n&lt;p&gt;You will work alongside a team including our Lead Psychologist, 3 other Principal Psychologists (community and inpatient based), a Psychological Therapist, and an Assistant Psychologist, as well as a little time with Professor Ken Laidlaw. The posts currently being advertised represents the next step in a plan of ongoing service development. We feel we have a lot to offer candidates with the potential to make a positive contribution. This can include discussing development towards accreditation in a specific modality and development in your own particular interests.&lt;/p&gt;\n&lt;p&gt;At this time, we are looking for four psychologists to be embedded in our community MDTs for older people and people with a diagnosis of dementia. You will contribute to the psychology and psychological therapies service which we started to roll out across the Trust at the end of 2019 following a successful pilot. There will also be the opportunity to contribute to the provision of our neuropsychological assessment service which is greatly appreciated by referrers.&lt;/p&gt;\n&lt;p&gt;Our friendly team are committed to continuing professional development and self-care. We have strong links with the Clinical Psychology training course at Plymouth University, contributing to the Older Adult teaching programme and having Trainees on placement. We are also expecting to take the new Trainee Clinical Associates in Psychology on placement in the not too distant future. We have developed a Trust wide Psychology Intern programme, offering yearlong placements to undergraduate students nationwide. Besides becoming a member of the CC&amp;D psychology team, you will be encouraged to make links with Psychologists working in services across the Trust e.g. through attending psychology professionals’ meetings. You will also be encouraged to maintain a healthy work-life balance!&lt;/p&gt;\n&lt;p&gt;Cornwall is a beautiful and picturesque county which offers an outstanding quality of life and provides many opportunities for outdoor activities, with its sailing waters, surfing beaches and rugged coastal pathways for walking, running and cycling. There is a thriving arts and theatre scene as well as an interesting variety of eating places, including nationally renowned restaurants. The major route in and out of the county is the recently improved A30 which connects with the M5 motorway at Exeter. The rail service has daily passenger and sleeper services and there are airports at Newquay and Exeter with daily connections to many cities throughout the UK and abroad.&lt;/p&gt;\n&lt;p&gt;We are looking for highly motivated people with excellent interpersonal and workload management skills and a genuine passion for working with our client group. If you would like to contribute to the development of a supportive psychology team committed to providing high quality, fair, and consistent services, we would love to hear from you!&lt;/p&gt;\n&lt;p&gt;We welcome applications from psychologists qualifying in October 2021 (preceptorships considered) as well as those with post-qualification experience. Calls and visits are also very much welcomed.&lt;/p&gt;\n&lt;p&gt;These are full time posts, part-time/job share can be considered.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Dr Rebecca Read&lt;/p&gt;\n&lt;p&gt;Lead Psychologist for Complex Care and Dementia&lt;/p&gt;\n&lt;p&gt;cft.ccdppt@nhs.net&lt;/p&gt;\n&lt;p&gt;01208 834300&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120947.png", "name": "Cornwall Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120947"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Community based, Various across Cornwall", "postalCode": "PL31 2QN"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.472", "longitude": "-4.74269"}}, "title": "Principal Psychologist - Band 8a", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256989", "validThrough": "2020-11-19T23:59:59+0000"}