{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Band 7"}}, "datePosted": "2020-10-16T11:31:51+0100", "description": "&lt;p&gt;Connect Healthcare are delighted to invite a Development Nurse into Connect Healthcare’s core team, predominantly working with the &lt;em&gt;Lead&lt;/em&gt; Development Nurse to promote training, development and education for the non- medical workforce across the primary care networks of Rotherham. This post provides an exciting opportunity for the post holder to strive for access to educational programmes and funding in order to expand the knowledge, competence and clinical skills of our workforce, thus ensuring that the organisations values of improving the quality of care, equity of service, and standardisation of practice provision across Rotherham is achieved and sustained in line with national and local guidelines.&lt;/p&gt;\n&lt;p&gt;The Development nurse’s role will embody the objectives of the GPN 10 point plan including; Celebrating and raising the profile of General Practice Nursing, promoting GPN as a first line destination career in addition to extending leadership and educational roles.&lt;/p&gt;\n&lt;p&gt;Connect Healthcare RotherhamCICis a GP federation made up of 30 practices as members. It is led by and for GPs with a small staff of managers and administrators. The team at Connect are overseen by a Board of Directors who makes strategic decisions about our contracts, projects and finance.&lt;/p&gt;\n&lt;p&gt;The purpose of Connect Healthcare Rotherhamis toprovide services, strategic advice and representation to and on behalf of the majority of primary care practices in the NHS RotherhamClinical Commissioning Group area.&lt;/p&gt;\n&lt;p&gt;Connect Healthcare work to retain and establish contracts to deliver local services for the people of Rotherham and provide the link between numerous organisations to provide seamless services for our patients. By working together we can achieve greater efficiency within general practice by reducing the duplication of work and benefiting from economies of scale.&lt;/p&gt;\n&lt;p&gt;The federation has a reputation of promoting the development of clinical and non-clinical staff to ensure we attract new colleagues and retain existing ones, whilst championing new roles and models of care to adapt to the ever-changing needs of Rotherham’s patient population in the current climate.&lt;/p&gt;\n&lt;p&gt;This is a fixed term for 12 months with scope to extend further.&lt;/p&gt;\n&lt;p&gt;Interviews - TBC&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Previous applicants need not apply.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Connect Healthcare CIC", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=135174"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Rotherham", "postalCode": "S65 3HD"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4419", "longitude": "-1.31796"}}, "title": "Primary Care Development Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916229918", "validThrough": "2020-11-06T23:59:59+0000"}