{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 pa"}}, "datePosted": "2020-11-03T12:47:20+0000", "description": "&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Infection Prevention &amp; control Practitioner - Band 6 - Care Homes Team 22.5 hpw Fixed term 1 Year&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Could you help West Suffolk Hospital to deliver the best quality and safest care to our local community?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;An exciting opportunity has arisen for a motivated, experienced Registered Nurse or Allied Health Professional to be part of the Suffolk-wide response to COVID-19, providing infection prevention and control (IPC) support to our colleagues in care homes and other non-NHS care settings.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Two posts are available, each at 0.6 whole time equivalent – this may be worked as 3 full days or the hours can be spread flexibly across the working week.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The posts are at band 6 for a fixed term contract of 12 months, so would be ideally suited to a secondment opportunity; we also welcome external applicants and band 5 Nurses/AHPs for whom this could be a development opportunity. This might represent a part-time post, or if the post-holder is full-time, their remaining hours could be worked in their substantive role. Line management for the posts would remain within the Trust, but professional support and direction would be provided by the IPC Nurse Adviser at the CCG.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The posts involve working across the health economy, interacting with colleagues in the CCG and Local Authority who support care homes , to identify and support care settings with cases and outbreaks of COVID-19, as well as with other infections which may cause problems in the winter months, such as norovirus or flu. This would involve reactive support visits as well as delivering training sessions - all training materials will be provided. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The post-holders will also support a network of IPC link practitioners in the care homes, who will be a key point of communication from each location.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;These secondments will provide the post-holders with the opportunity to develop skills and experience in teaching, audit, surveillance, data analysis and cross-organisational working, and to enhance their knowledge of infection prevention and control. They would provide an ideal stepping stone for someone who is interested in a career in this specialty, or transferable skills for a step-up to a managerial position. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;If you have the necessary skills, experience and qualities to help us to put patients first, please contact &lt;strong&gt;Sharon Basson, Head of Nursing Community and Integrated Services &lt;/strong&gt;on &lt;strong&gt;01284 713000 or 07970 421903 or Heather Dakin, Infection Prevention and Control Advisor for Care Settings on 07929 795501 &lt;/strong&gt;for an informal discussion or to arrange a visit.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h2&gt;&lt;strong&gt;**Relocation package of up to £2000 available for the successful candidate. Please refer to our Removal and Accommodations Expenses’ Policy under ‘Additional Documentation’**&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;strong&gt;If you are an overseas applicant and need to complete the IELTS exam to be able to register with the NMC then the Trust will fund 1 attempt at the exam. If required the Trust will fund the cost of one additional IELT / OET from Level 6.5 to Level 7 / OET grade C+ to grade B.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;**In order to improve efficiency, all correspondence relating to this vacancy, &lt;span style=&quot;text-decoration: underline;&quot;&gt;including invitations to interview will be by email only&lt;/span&gt;, via NHS Jobs. Would you therefore please ensure you check your emails on a regular basis*&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;In submitting an application form, you authorise West Suffolk NHS FT to confirm any previous NHS service details via the Inter Authority Transfer (IAT) process, should you be appointed to the post. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;CAR PARKING&lt;/strong&gt; - This post &lt;strong&gt;does not &lt;/strong&gt;entitle you to apply to park on the Hospital site. The Trust offer parking off site at the Bury St Edmunds Rugby Club, which is serviced by a regular shuttle bus to and from the Hospital. Details of the bus timetable can be found in the on-line starter pack.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;If required to work on a weekend, the restriction does not apply. Parking is allowed on site Saturday and Sunday provided a day ticket (£2.10) is clearly displayed.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For posts that include “on call” duties successful candidates will need to complete an application form for access through the barriers from the car park office.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;To view the Job Description and Person Specification for this position, please click on the Job Description link (below). You should use the Additional Information section of your application to state how you meet the requirements of the Person Specification.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The successful candidate for this post will be required to apply for a Disclosure &amp; Barring Service (DBS) Disclosure at &lt;strong&gt;Enhanced&lt;/strong&gt; level.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt; For Band 1 and Band 2 posts, the cost of the DBS Disclosure will be met by the Trust. However, any employees at Band 1 and Band 2 who leave the Trust within six months of commencing their post will have a £10 administration fee deducted from their final salary. For posts at Band 3 and above, the cost of the Disclosure will be met by the appointed employee and deducted in instalments from their salary over a period of three months. If the employee leaves the Trust within three months of commencing their post, any outstanding payments will be deducted from their final pay.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;All applicants should click on the link entitled “How will my application be processed?” prior to submitting their application form.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The closing date for this vacancy may change if we receive a strong response. Please ensure that you apply for any post you are interested in as soon as possible.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;**Recommend a friend or family member and earn cash! &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Do you have a friend or family member you would recommend to join us? Or do you know someone who wants to return to practice in the NHS? If you recommend a nurse (band 5 or 6) or operating department practitioner, you could receive a £1,000 thank you. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If the person you refer is appointed into a permanent position you will receive £500 when they commence and a further £500 after their first &lt;/strong&gt;&lt;strong&gt;12 month anniversary.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please contact the recruitment team if you require further info!&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "West Suffolk NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120941"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bury St. Edmunds", "postalCode": "IP33 2QZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.2317", "longitude": ".709205"}}, "title": "Infection Prevention &amp; Control Practitioner - Band 6 - Care Homes Team", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254046", "validThrough": "2020-11-17T23:59:59+0000"}