{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Dependent on experience"}}, "datePosted": "2020-11-02T13:03:36+0000", "description": "&lt;p&gt;If you are an experienced theatre practitioner looking to be part of an organisation that is passionate about providing first class patient care, we would like to hear from you. We are looking for a Scrub Practitioner with orthopaedic experience to join our team.&lt;/p&gt;\n&lt;p&gt;Our unfaltering dedication to quality is something we are very proud of and we are constantly striving to do things better for our patients. All of our Hospitals have been rated as “Outstanding” or “Good” by the Care Quality Commission which means that you can be sure you are part of a team providing safe, reliable and patient-focused care.&lt;/p&gt;\n&lt;p&gt;About the role&lt;br /&gt;You will be working as part of a friendly, welcoming and expert multidisciplinary Theatre Team supported by our experienced Theatre Manager, Trevor Money. Your knowledge and experience of working with an orthopaedic team will be key in this role.&lt;/p&gt;\n&lt;p&gt;You will be a part 1 registered NMC Nurse or an HCPC registered Operating Department Practitioner with experience of being a scrub practitioner in a theatre. As well as being up to date with current research and developments in theatre practise you will have a sound knowledge of Health and Safety/Risk management within the operating department. You will be responsible for ensuring the continual cleanliness of the theatre and equipment. This role will enable you to develop and execute the correct procedures for ordering, receiving and transfer of blood and blood products as well as blood conservation.&lt;/p&gt;\n&lt;p&gt;It goes without saying privacy and confidentiality are key throughout the team and you will act as an advocate for the patient in the intra-operative phase and be responsible for “total patient” care in the perioperative phase.&lt;/p&gt;\n&lt;p&gt;Working at Practice Plus Group&lt;br /&gt;As a bank team member you have flexibility to choose the shifts that work for you around your other commitments. When you’re part of the Practice Plus Group team, you don’t just have a job. You have a career. We work with you to help you grow in your role and take your career in the direction you want to go. If you want to join our permanent team, we’ll support you. If you just want to stay as a bank practitioner, that’s fine too. We’ll help you be the best you can be.&lt;/p&gt;\n&lt;p&gt;We want our team members to feel motivated and rewarded so we offer a competitive rates. &lt;br /&gt;To apply for the role click on the link below. If you have any questions contact martyn.kingsbury@practiceplusgroup.com in our friendly resourcing team, or call 01189 521 921. Martyn will also be happy to arrange an informal call with Trevor, our Theatre Manager should you wish to speak with him ahead of making a formal application.&lt;/p&gt;\n&lt;p&gt;We will contact all shortlisted candidates but please note Practice Plus Group retain the right to remove the advert prior to the closing date if a suitable candidate is appointed. Our employment offers are subject to receipt of satisfactory pre-employment checks. At Practice Plus Group, we actively promote diversity and equal opportunities. Applicants must have the right to work in the EU.&lt;/p&gt;\n&lt;p&gt;We are one of the UK largest independent sector healthcare providers and work in close partnership with the NHS to deliver more than 50 services throughout the UK. We provide high quality specialist care and excellent results for more than 50,000 patients each year.&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "Practice Plus Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130136"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Ilford", "postalCode": "IG3 8YY"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5805", "longitude": ".112133"}}, "title": "Bank Theatre Scrub Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252169", "validThrough": "2020-11-06T23:59:59+0000"}