{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 £45,753 - £51,668 per annum"}}, "datePosted": "2020-10-21T15:01:06+0100", "description": "&lt;p&gt;Are you a pharmacist with experience working in an Aseptic Unit, Clinical Trials or with Advanced Therapy Medicinal Products? Would you like the opportunity to develop your career in one of the largest teaching hospitals in the country, with one of the largest research portfolios? Then look no further!&lt;/p&gt;\n&lt;p&gt;This is a new role in a supportive, friendly and expanding team. It will give you the opportunity to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Be the Deputy Accountable Pharmacist for the Clinical Trials Aseptic Services Unit. This is one of the only units in the country dedicated to the supply of injectable IMPs. You will (alongside the Accountable Pharmacist) be responsible for the management, leadership and coordination of this challenging and ever changing service.&lt;/li&gt;\n&lt;li&gt;Gain invaluable experience in the design, build and commissioning of a replacement Clinical Trials Aseptic Services Unit that we are looking to build on one of the Oxford sites.&lt;/li&gt;\n&lt;li&gt;Act as the Lead Pharmacist for Advanced Therapy Investigational Medicinal Products (ATIMPs) for the Trust, ensuring we are meeting the technical, professional, best practice, and regulatory requirements for these products, and potentially contributing to the development of these guidelines.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;This is a varied and challenging role, and you will have the support of an experienced team. If this sounds like a role you would be interested in, then please don’t hesitate to get in contact. We’re more than happy to discuss further, answer any questions you may have and arrange a visit to show you around.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing date: 8th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameClaire ChurchJob titleAccountable Pharmacist Clinical Trials Aseptic Services UnitEmail addressclaire.church@ouh.nhs.ukTelephone number01865 235774&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Oxford University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120889"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Churchill Hospital, Oxford", "postalCode": "OX3 7LE"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7503", "longitude": "-1.21469"}}, "title": "Deputy Accountable Pharmacist and Clinical Trials ATMP Lead Pharmacis", "url": "https://www.jobs.nhs.uk/xi/vacancy/916237006", "validThrough": "2020-11-08T23:59:59+0000"}