{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615"}}, "datePosted": "2020-11-06T13:46:21+0000", "description": "&lt;p&gt;Staff Nurse Acute Cardiac Unit Pilgrim Hospital, Boston&lt;/p&gt;\n&lt;p&gt;2.28 FTE posts x 37.5 hours per week (part time considered)&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the Department… &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Our 16 bed Acute Cardiac Unit comprises 16 monitored beds, usually divided equally between both male/female patients. Our Acute Cardiac Unit treats and cares for a variety of cardiac patients and works closely in partnership with the Lincolnshire Heart Centre, Nottingham city hospital and Glenfield hospital in Leicester. Patients are identified for admission directly admitted from A&amp;E, IAC and various medical and surgical wards within the hospital. As part of our extensive team we also work closely with other disciplinary members that include the Acute cardiac practitioners, consultant cardiologists, cardiac physiologists, inpatient and community heart failure nurse specialists.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the Role….&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Acute Cardiac Unit provides an attractive working environment and we pride ourselves in providing outstanding care for adults with acute and chronic cardiac conditions. Our practice involves strong teamwork and ensuring that current evidence based guidelines are followed when delivering patient care. This includes delivering best practice, treatments, investigations, referrals and follow up care in the community. We ensure that ULHT trust values are upheld by delivering compassionate, safe care and are always striving for excellence in rural healthcare.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What we’re looking for…..&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for two enthusiastic band 5 staff nurses who are keen to learn and willing to work to a high standard. You must be able to communicate at all levels and be a strong patient advocate. You must be able to work under pressure whilst still providing high standards of care. We offer training for extended skills that will allow you to build on your confidence, clinical practice and provide evidence based practice. You will also have the opportunity to gain your Advanced Life Support certificate. We need caring individuals who will respect their patients and colleagues and be compassionate. You must be flexible with shift patterns and who are able to work as part of a team. You will be able to drive the service forward whilst ensuring that effective, evidence based care is practiced.&lt;/p&gt;\n&lt;p&gt;Situated in Boston, Pilgrim Hospital provides a full range of clinical services and hosts the vascular centre for the Trust. The site has recently been enhanced by the building of a new clinical unit for the provision of maternity and gynaecology services. The hospital continues to be recognised for its hyper acute stroke services and has excellent services for patients who have a fractured hip.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameSophie RudgeJob titleACU Ward SisterEmail addresssophie.rudge@ulh.nhs.ukTelephone number01205 445524Additional contact information&lt;/p&gt;\n&lt;p&gt;Ward Sister: Rachel Pickering- Telephone Number: 01205 445524&lt;/p&gt;\n&lt;p&gt;Deputy Sister: Chelsea Tomlin- Telephone Number: 01205 445524&lt;/p&gt;\n&lt;p&gt;Deputy Sister: Emma Spence- Telephone Number: 01205 445524&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121077.jpg", "name": "United Lincolnshire Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121077"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Pilgrim Hospital Boston, Boston", "postalCode": "PE21 9QS"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.991", "longitude": "-.009786"}}, "title": "Staff Nurse - Acute Cardiac Unit - Pilgrim Hospital, Boston", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259979", "validThrough": "2020-11-20T23:59:59+0000"}