{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "50000", "minValue": "50000", "unitText": "YEAR", "value": "£50,000"}}, "datePosted": "2020-10-28T10:38:29+0000", "description": "&lt;p&gt;With the advanced development of Primary Care Health Networks (PCNs) in Tower Hamlets, the Tower Hamlets GP Care Group are looking for a highly motivated, innovative person to join its Network One (covering the Bethnal Green, Globe Town, Spitalfields and Weavers Field area) General Practice Teams as a First Contact Physiotherapist&lt;strong&gt;.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; As part of this new and exciting patient facing role you will be working in local GP practices as part of a multi-disciplinary team using, your expert knowledge of Musculoskeletal (MSK) issues to: &lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Work with the PCN based multi-disciplinary Key Team&lt;/li&gt;\n&lt;li&gt;Provide clinical expertise and advice on MSK issues&lt;/li&gt;\n&lt;li&gt;Progress and request investigations to facilitate diagnosis and choice of treatment regime&lt;/li&gt;\n&lt;li&gt;Develop integrated and tailored care programmes in partnership with patients and provide a range of first line treatment options, including self-management and referral to rehabilitation focused services, social prescribing provision and health coaching initiatives.&lt;/li&gt;\n&lt;li&gt;Work with partners in Network Two to develop the locality’s Post-Covid-19 Programme, focusing on CFS and MUS post Covid-19 recovery.&lt;/li&gt;\n&lt;li&gt;Sit on the North West Locality Living Well Committee, and work closely with Primary and Secondary Care Musculoskeletal Services&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The successful candidate will ideally have a minimum of three years’ experience working as a senior MSK physiotherapist and have knowledge and experience of a wide range of approaches for the management of complex MSK conditions. Ability to work collaboratively with in a Network of GP Practices will be essential&lt;/p&gt;\n&lt;p&gt;Personal Professional Development support will be secured from partner organisations.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Tower Hamlets GP Care Group CIC", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132874"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Tower Hamlets", "postalCode": "E1W 3DP"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5115", "longitude": "-.049233"}}, "title": "Network First Contact Physiotherapist (FCP)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246127", "validThrough": "2020-11-11T23:59:59+0000"}