{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum"}}, "datePosted": "2020-10-29T13:01:24+0000", "description": "&lt;p&gt;Applications are invited for &lt;em&gt;one&lt;/em&gt; substantive Consultant Oncologist post , which is a joint post with Buckinghamshire Healthcare NHS Trust and Oxfordshire University Hospitals NHS Foundation Trust.&lt;/p&gt;\n&lt;p&gt;The post is mainly based at Stoke Mandeville Hospital and Wycombe Hospital, with Clinical Oncology rights at Oxford Churchill Hospital.&lt;/p&gt;\n&lt;p&gt;Buckinghamshire Healthcare NHS Trust (BHT)&lt;/p&gt;\n&lt;p&gt;Bucks Healthcare comprises 3 hospitals: Stoke Mandeville Hospital, Wycombe Hospital and Amersham Hospital. The post holder’s duties will be primarily based in Stoke Mandeville Hospital but may involve cross-site working at the Wycombe Hospital.&lt;/p&gt;\n&lt;p&gt;Oxford University Hospitals NHS Foundation Trust (OUHFT)&lt;/p&gt;\n&lt;p&gt;OUHFT comprises 4 hospitals: John Radcliffe Hospital (JR), Churchill Hospital, Nuffield Orthopaedic Centre (NOC), Horton General Hospital in Banbury (HGH). The Oxford component of the post will be based at the Oxford Cancer Centre on the Churchill site.&lt;/p&gt;\n&lt;p&gt;Acute Oncology is based at Stoke Mandeville hospital where inpatients are managed by the acute Medical and Surgical specialties. There is a team of 4 nurses covering the triage lines and daily ward rounds. There is a 16 bed ward with 12 side rooms for haematology and some acute oncology patients which is staffed by chemo trained nurses. Each tumour site is well supported by CNSs and discussions are underway with the deanery for a rotational Medical Oncology Registrar post.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be expected to cover Breast, Lung and Acute Oncology.&lt;/p&gt;\n&lt;p&gt;There will also be opportunities to take up leadership roles in audit, research, chemotherapy, clinical governance and/or acute oncology. From 2020 the department will be receiving medical students from Buckingham Medical School. There will be an opportunity to provide teaching and also to be block lead for their training.&lt;/p&gt;\n&lt;p&gt;AAC Consultant Interview Date - Tuesday 26 January 2021&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;For further information about this post and to make arrangements to visit the department please contact Dr Sheryl Sim, Consultant Oncologist sheryl.sim@nhs.net or Dr Helen Eagleton, Divisional Chair for Specialist Services helen.eagleton@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number: 01296 316555&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Buckinghamshire Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120887"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Buckinghamshire", "postalCode": "HP21 8AL"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7983", "longitude": "-.802734"}}, "title": "Consultant Clinical Oncologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248437", "validThrough": "2020-11-23T23:59:59+0000"}