{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "90000", "minValue": "90000", "unitText": "YEAR", "value": "£90,000"}}, "datePosted": "2020-10-23T15:06:45+0100", "description": "&lt;p&gt;&lt;strong&gt;We have exciting new opportunities for a Specialty Doctor (Specialty Doctors) to join our team across the Scottish Residential Services.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;This is a full-time position providing psychiatric care to service users at Wallace Hospital, 3 residential/nursing homes in Dundee and 1 in Dunblane.&lt;/p&gt;\n&lt;p&gt;Cygnet Wallace Hospital is a 10 bed specialist high dependency complex care service providing assessment and treatment for individuals with learning disabilities, with or without autistic spectrum disorder, as well as complex needs and behaviours. The specialist residential/nursing services offer care and support in a structured and therapeutic environment for adults with learning disabilities and complex needs.&lt;/p&gt;\n&lt;p&gt;The post holder will be a specialty doctor working under the supervision of a consultant psychiatrist to oversee and maintain the care of all inpatients and residents as required.  The post holder will also have responsibility for auditing the medical services rendered at the ward and ensuring their good quality in accordance to GMC standards of good medical practice and other relevant professional guidelines. &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The post will include on call responsibilities on a 1 in 4 basis  &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;(The post holder will be the responsible clinician and will oversee and maintain the care of all ward inpatients as required).    The post holder will also have responsibility for contributing to the audit and clinical governance processes for the medical services rendered at the ward and ensuring their good quality in accordance to GMC standards of good medical practice and other relevant professional guidelines.  (Moreover, the post holder will have responsibility for upholding the Company’s policies and procedures and protecting the Company’s interests as appropriate.)&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;strong&gt;We are looking for people who have...&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Full GMC registration and an MBBS (or equivalent) medical qualification&lt;/li&gt;\n&lt;li&gt;Relevant experience within a Learning Disabilities environment is desirable&lt;/li&gt;\n&lt;li&gt;The ability to demonstrate sound clinical judgment / experience in making clinical decision and managing risk and knows when to seek help&lt;/li&gt;\n&lt;li&gt;Excellent verbal / written communication skills along with the ability to interview, assess and treat patients and write clear comprehensive medical notes&lt;/li&gt;\n&lt;li&gt;Proven record of CPD (Continued Professional Development)&lt;/li&gt;\n&lt;li&gt;The ability to work as part of a multi-disciplinary team&lt;/li&gt;\n&lt;li&gt;Desirable: Royal College of Psychiatrists membership (MRCPsych) or equivalent&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;br /&gt;&lt;strong&gt;In return, we will offer you...&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Salary of £90,000&lt;/li&gt;\n&lt;li&gt;Support from an onsite Consultant Psychiatrist, Medical Director and multi-disciplinary team&lt;/li&gt;\n&lt;li&gt;Medical indemnity cover&lt;/li&gt;\n&lt;li&gt;CPD support and study leave&lt;/li&gt;\n&lt;li&gt;Active participation in clinical governance&lt;/li&gt;\n&lt;li&gt;Free Meals&lt;/li&gt;\n&lt;li&gt;Generous annual leave entitlement&lt;/li&gt;\n&lt;li&gt;Contributory pension scheme&lt;/li&gt;\n&lt;li&gt;Learning and development&lt;/li&gt;\n&lt;li&gt;30 days annual leave + bank holidays&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The opportunity to progress to Consultant level through our CESR programme:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A formulated programme to assess your educational needs and to help you achieve the competencies necessary to help you progress to Consultant level.&lt;/li&gt;\n&lt;li&gt;The opportunity to rotate within the wards/services to gain experience across various subspecialties.&lt;/li&gt;\n&lt;li&gt;An assigned educational supervisor who will review your progress weekly and oversee your educational development.&lt;/li&gt;\n&lt;li&gt;Support with MRCPsych exams.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Requirements&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;Please note: successful candidates will be required to undergo an enhanced DBS check.&lt;br /&gt;&lt;br /&gt;Are you seeking a new and rewarding challenge where you can make a positive change?&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/129977.png", "name": "Cygnet Health Care", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=129977"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Dundee", "postalCode": "DD3 9AG"}, "geo": {"@type": "GeoCoordinates", "latitude": "56.4887", "longitude": "-3.00544"}}, "title": "Specialty Doctor - Learning Disabilities", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241042", "validThrough": "2020-11-27T23:59:59+0000"}