{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "16994", "minValue": "16994", "unitText": "YEAR", "value": "£10.11 per hour"}}, "datePosted": "2020-10-08T11:53:04+0100", "description": "&lt;p&gt;About The Role Positive Behaviour Support Worker &lt;br /&gt; Job description This is a graduate-level post, ideally for those with either Psychology or Health &amp; Social Care degree &lt;br /&gt; This an exciting opportunity to join our Positive Behaviour Support team within Cedar House. This role requires you to act as a positive and therapeutic role model for the assessment and support of our patients. &lt;br /&gt; To enhance your knowledge in this role you will be supported to complete the BILD CAPBS Coaches Programme, which involves 3 days training, a 6 month project followed by a final completion day, and the Functional Behaviour Assessment programme, which involves 2 days training, a 6 week project followed by a final completion day. &lt;br /&gt; You will be directly supporting individuals with learning disabilities and/or autism, mental health problems and complex behaviours, providing a high level of expertise, advice and support to staff on the implementation of Positive Behaviour Support. &lt;br /&gt; You will provide training and development of all staff regarding positive behaviour management. This role offers a real opportunity to have a positive impact on the lives of our patients. &lt;br /&gt; You will undertake functional behaviour assessments and develop and implement positive behaviour support plans as part of a wider MDT, with a focus on quality of life and well-being. &lt;br /&gt; You will also regularly conduct restrictive practice audits to ensure that our patients are supported in the least restrictive way. &lt;br /&gt;&lt;br /&gt; Additionally, you will attend multi-disciplinary meetings, and conduct debriefs and reflective practice. &lt;br /&gt; This is a new role to Cedar House and we envisage that it will become a significant and beneficial part of our patients’ care and support. In the future there is a potential that this role will develop into a community outreach service, providing training and support to community services. &lt;br /&gt;This role will be 10.5hrs and the rest of hours you will be working in the ward as a Senior Support Worker. About You&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please take a look at our progressive and rewarding benefits package &lt;br /&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Thorough induction and on site training&lt;/li&gt;\n&lt;li&gt;Regular supervision and appraisal&lt;/li&gt;\n&lt;li&gt;Clear pay structure, with competitive rates&lt;/li&gt;\n&lt;li&gt;Annual increments in salary based on professional development and appraisal system&lt;/li&gt;\n&lt;li&gt;Generous annual leave entitlement&lt;/li&gt;\n&lt;li&gt;Sick pay of 4 weeks full pay and 4 weeks half pay&lt;/li&gt;\n&lt;li&gt;The opportunity to participate in a company contributory pension scheme with up to 3% matching contributions&lt;/li&gt;\n&lt;li&gt;Maternity leave at 3 month’s full pay and 3 month’s half pay&lt;/li&gt;\n&lt;li&gt;2 weeks paid paternity leave&lt;/li&gt;\n&lt;li&gt;Shared parental leave, matching the maternity leave benefit&lt;/li&gt;\n&lt;li&gt;Death in service benefit equivalent to 2 x salary&lt;/li&gt;\n&lt;li&gt;A range of staff discounts&lt;/li&gt;\n&lt;li&gt;Opportunity to train to become a nurse through our ‘grow our own’ nurses programme&lt;/li&gt;\n&lt;li&gt;Employee Assistance Programme (EAP)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We welcome applications from everyone irrespective of ethnic origin, gender, age, gender identity, sexual orientation, religion, marital status, disability or social background. This is a great opportunity for someone to make a difference.&lt;/p&gt;\n&lt;p&gt;For a more detailed job spec please take a look at our Website where you can also read some inspiring stories and find out why working at Huntercombe really sets us apart from the rest.&lt;/p&gt;\n&lt;p&gt;Social Care&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/130001.jpg", "name": "The Huntercombe Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130001"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Barham, Canterbury, kent", "postalCode": "CT4 6PW"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2019", "longitude": "1.17601"}}, "title": "Positive Behaviour Support Practitioner / Senior Support Worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916218146", "validThrough": "2020-11-11T23:59:59+0000"}