{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum pro rata"}}, "datePosted": "2020-10-27T16:30:53+0000", "description": "&lt;p&gt;&lt;strong&gt;Emergency Medicine Locum Consultant&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Fixed Term - 12 Month Post&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Homerton University Hospital, Homerton Row, London E9 6SR&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking to appoint a Locum Consultant in Emergency Medicine. The locum post is to start from as soon as possible for a period of 12 months in the first instance. The Trust has a track record of tailor-making job plans to optimize individuals’ professional development and we would actively encourage those who are waiting for FRCEM results to apply.&lt;/p&gt;\n&lt;p&gt;This post is at Homerton University Hospital, based in Hackney, East London; an exciting and challenging place with a diverse and richly multicultural population. We were rated as the first ‘Outstanding’ Emergency Department following CQC inspection and we are looking to expand our Consultant posts with people that wish to join our dynamic team.&lt;/p&gt;\n&lt;p&gt;These posts will join the current 11 consultant body which consists of Adult Emergency Medicine Consultants, a Paediatric Emergency Medicine Consultant and a Paediatrician with Subspecialty training in Paediatric Emergency Medicine.&lt;/p&gt;\n&lt;p&gt;The Emergency Department saw over 129,000 new patients in 2019/20; over 18,000 children were seen in the Children’s Assessment Area (CEA). There is an ENP led Minor Injuries Unit and a GP led Primary and Urgent Care Centre which is under the leadership of the Emergency Department.&lt;/p&gt;\n&lt;p&gt;Homerton University Hospital is a Foundation Trust and teaching hospital in East London. We are in the middle of Hackney – a diverse and interesting inner city area. It is a Trauma Unit within the North East London trauma Network and was the designated hospital for the 2012 Olympic Games.&lt;/p&gt;\n&lt;p&gt;The Emergency Department has trainees (Senior and Core level) and non-training posts in Emergency Medicine, with a recent expansion in our junior tier of Doctors. We have an excellent record of developing training programmes and getting non trainees through the equivalent training required in order to enable them to become Consultants.&lt;/p&gt;\n&lt;p&gt;The posts offer ample opportunities for the individual to assist in their specific area of interest, which may include teaching, training and exam preparation, musculoskeletal medicine, Paediatric Emergency medicine, Simulation, Critical Care, Ultrasound, Safety and Governance, Trauma, Geriatric medicine, Observation medicine and Ambulatory Care.&lt;/p&gt;\n&lt;p&gt;For further information, please contact: Dr Claire Charley, Clinical Lead claire.charley@nhs.net&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120604.jpg", "name": "Homerton University Hospital NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120604"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Homerton University Hospital NHS Foundation Trust, Homerton", "postalCode": "E9 6SR"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5506", "longitude": "-.046072"}}, "title": "Locum Consultant in Emergency Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245427", "validThrough": "2020-11-18T23:59:59+0000"}