{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890"}}, "datePosted": "2020-11-04T15:29:47+0000", "description": "&lt;p&gt;&lt;strong&gt;Band 6 Mental Health Professionals (RMN / RNLD / Social Worker / OT) &lt;/strong&gt;&lt;strong&gt;- &lt;/strong&gt;&lt;strong&gt;HMP Bullingdon &amp; HMP Huntercombe&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Incentives Package Available &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If you already work in a prison environment, you’ll know how rewarding it is to be able to improve the lives of this often vulnerable and disadvantaged population.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If not, please do talk to us about we can support you to take this leap and to start really making a difference.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;THE ROLE&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Inclusion Services (part of MPFT) in Oxfordshire are expanding and we are delighted to be offering a range of opportunities to join our very special teams at HMP Bullingdon &amp; HMP Huntercombe.&lt;/p&gt;\n&lt;p&gt;HMP Bullingdon is a Category B adult male remand centre, and HMP Huntercombe is a Category C adult male establishment holding a solely foreign national population from the age of 21 years +&lt;/p&gt;\n&lt;p&gt;Post holders will join the established multi-disciplinary team comprising Consultant Psychiatrist, Psychologist, RMNs and Psychosocial Recovery Workers. We also work collaboratively with other agencies both in and outside the prison to meet the needs of our service users who present with a wide range of mental health and substance misuse disorders. As a Care Co-ordinator, responsible for the management of your own caseload, you will assess, care plan, deliver evidence based interventions and review care. You will practice within the framework of the multi-disciplinary team and Care Programme Approach.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;YOU&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking forsomeone who shares our values, who believes that our service users should receive compassionate care of the highest quality and who has the ability to support and inspire the whole team. You will already be able to demonstrate a high degree of professional resilience and show commitment to engage fully in supervision, as we know that working in a prison environment can be challenging as well as rewarding.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;OUR OFFER&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;In return for your passion and commitment, you can expect the following from us:&lt;/p&gt;\n&lt;p&gt;• Monthly operational management and caseload supervision&lt;/p&gt;\n&lt;p&gt;• Clinical supervision to support specialist skills development&lt;/p&gt;\n&lt;p&gt;• The benefits of working in a MDT&lt;/p&gt;\n&lt;p&gt;• CPD opportunities and support for professional and therapeutic activities.&lt;/p&gt;\n&lt;p&gt;• Opportunity to contribute to the development of others through mentoring and facilitating mental health awareness training for non- clinical staff.&lt;/p&gt;\n&lt;p&gt;• Directorate wide Development Days and the genuine support of colleagues working in prisons across the country&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;To discuss further, please contact Helen Broad - Clinical Lead on 07967 838064 or Rebecca Byrne - Team Manager on 01869 353425&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/132074.png", "name": "Inclusion", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132074"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Oxfordshire", "postalCode": "RG9 5SB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.588", "longitude": "-1.01951"}}, "title": "Senior Mental Health Professional", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256432", "validThrough": "2020-11-20T23:59:59+0000"}