{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum plus Outer HCAS"}}, "datePosted": "2020-11-02T10:52:44+0000", "description": "&lt;p&gt;An excellent opportunity has arisen for an Commissioning Manager for Children and Young People to join the Integrated Children’s Commissioning team in Greenwich. We are looking to recruit an enthusiastic and highly motivated Commissioning Manager whose main purpose is to enable, promote and support the effective commissioning of high quality services for Children and Young People, supporting the implementation of Children and Young People’s programmes/initiatives including CYP Mental Health within Greenwich. The post holder should have an in-depth understanding of the Children Young peoples’ Health and Social needs.&lt;/p&gt;\n&lt;p&gt;You will be expected to provide comprehensive support to the Head of CYP of Integrated Commssioning for Children and Young People which includes:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Develop partnership working between the Royal Borough of Greenwich, NHS trusts, voluntary sector organisations, other agencies and service providers to ensure that national and local priorities are delivered on time and within budget.&lt;/li&gt;\n&lt;li&gt;Influence, persuade and negotiate at the appropriate level in order to ensure that key objectives and deliverables are achieved.&lt;/li&gt;\n&lt;li&gt;Day to day financial management of the CYP budget including Non-Contract Activity&lt;/li&gt;\n&lt;li&gt;Drafting business cases and service specifications for service development.&lt;/li&gt;\n&lt;li&gt;Chairing meetings and leading on Children and Young People’s transformation initiatives.&lt;/li&gt;\n&lt;li&gt;Coordinating returns to NHSE/I and STP/SEL returns.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Organisational Context&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;NHS South East London Clinical Commissioning Group is the statutory body responsible for commissioning healthcare services to south east London’s 1.9 million residents of the boroughs of Bexley, Bromley, Greenwich, Lambeth, Lewisham and Southwark.&lt;/p&gt;\n&lt;p&gt;The CCG buys services from hospitals, ambulance service and community service providers.&lt;/p&gt;\n&lt;p&gt;South East London CCG covers all GP practices in the area and is overseen by a governing body, which is responsible for making decisions about healthcare. The governing body includes GPs, nurses, a hospital doctor and other healthcare professionals and patient representatives. This is supported by other prime committees including Borough Based Boards which will have delegated responsibility for commissioning local services.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NHS South East London CCG", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128195"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Woolwich Centre, 35 Wellington St, Woolwich, London", "postalCode": "SE18 6ND"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4893", "longitude": ".065404"}}, "title": "Children and Young People&#39;s Commissioning Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251662", "validThrough": "2020-11-16T23:59:59+0000"}