{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-11-02T09:31:22+0000", "description": "&lt;p&gt;Critical Care is excited to be able to advertise for a Full time Practice Development Nurse. We are seeking to recruit an enthusiastic, motivated individual to join our existing team.&lt;/p&gt;\n&lt;p&gt;The successful applicant will have completed an Intensive Care or equivalent module, and should currently be able to practice as an assessor to support students and new staff. Ideally they will have completed a degree pathway or be working towards this.&lt;/p&gt;\n&lt;p&gt;The PDN’s role will be fully supported, with opportunities for personal development whilst managing the development of others, undertake appraisals, hold the surgical staffing bleep and working flexibly between the clinical, teaching, management and administration aspects of the role. The successful applicant should be confident in the use of computers and in time will be expected to assist with the maintenance of our paperless patient record.&lt;/p&gt;\n&lt;p&gt;As PDN you will be expected to organise training programmes to meet development needs and support the staff in the environment of Critical Care with knowledge and skills. Further to this, lead trials and training on medical equipment, initiating changes in practice, maintain strong links with the Critical Care Network and with other PDNs both locally and nationally. Ensuring the units staff are compliant with Mandatory Training requirements and support students during their placements is an essential part of the role.&lt;/p&gt;\n&lt;p&gt;The Critical Care Unit has 13 beds plus a further 3 beds that can be used if patient admissions exceed 13. We provide care for emergencies, trauma, general elective surgery, paediatrics and medical patients.&lt;/p&gt;\n&lt;p&gt;At interview you will be expected to give a short presentation. Presentation details will be given on invitation to interview.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Natalie English Senior Sister/Ward Manager&lt;/p&gt;\n&lt;p&gt;natalie.english@qehkl.nhs.uk 01553 613877&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "The Queen Elizabeth Hospital King's Lynn NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120938"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Critical Care Queen Elizabeth Hosiptal, Kings Lynn", "postalCode": "PE30 4ET"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.7568", "longitude": ".447015"}}, "title": "Practice Development Nurse - Critical Care", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251422", "validThrough": "2020-11-16T23:59:59+0000"}