{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-11-06T12:01:24+0000", "description": "&lt;p&gt;The Home Based Treatment Team in Bolton are a recently Royal College of Psychiatrists accredited service that provide a viable alternative to in-patient care in the community. We are seeking a highly motivated and ambitious band 5 mental health nurse, seeking to progress their career by gaining invaluable experience and skills in an acute community setting.&lt;/p&gt;\n&lt;p&gt;The role will require the successful the applicant to work with service users with a short-term focus on recovery from mental health issues utilising community resources. The service focuses on a recovery/ holistic model of assessment and treatment, which includes assessment and care planning of services users acute mental health needs, while supporting family and carers. &lt;br /&gt;&lt;br /&gt;There is a strong focus on care planning and providing psychological interventions in the form of MAPS (maximising access to psychosocial interventions). The team implements safe and effective discharge planning which includes expediting referrals to other services or to the care of GP’s which are discussed daily via the Multi Disciplinary Team meeting with a focus on strong and supportive leadership. We value our staff members and provide ongoing in house training with our psychologist and consultant psychiatrist.&lt;br /&gt;&lt;br /&gt;If you are a dynamic, motivated and forward thinking practitioner who wants to work in a busy and fast paced service within urgent care then this opportunity will be of interest to you. You would be required to provide psychologically informed nursing interventions, engage in therapeutic risk decision making with good understanding of safeguarding who understand how psychological formulation informs the provision of care. You would work as part of a multi disciplinary team and deliver treatment via the recovery model to service users and their family and carer’s as a co-worker within a dedicated core care team (Band 6, Band 5 and support Worker). Please read the job description and person specification before applying for the post.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameJonathan CosgroveAdditional contact information&lt;/p&gt;\n&lt;p&gt;Jonathan Cosgrove&lt;/p&gt;\n&lt;p&gt;Tel: 01204 483070&lt;/p&gt;\n&lt;p&gt;Email: Jonathan.cosgrove@gmmh.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121714.jpg", "name": "Greater Manchester Mental Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121714"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Rivington Unit, Bolton", "postalCode": "BL4 0JR"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.554", "longitude": "-2.42989"}}, "title": "Mental Health Nurse - Home Based Treatment", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259568", "validThrough": "2020-11-20T23:59:59+0000"}