{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683"}}, "datePosted": "2020-10-22T15:46:29+0100", "description": "&lt;p&gt;Lewisham and Greenwich (LGT) NHS Trust invites candidates to apply for a Consultant General Radiology post at Queen Elizabeth Hospital, Woolwich. The post aims to support the routine clinical work and to further develop the sub-specialty interests in the department. Our current needs are predominantly for support of the gastrointestinal and oncology services but all sub-specialties will be considered if it complements the skills mix of the department.&lt;/p&gt;\n&lt;p&gt;LGT NHS Trust aims to be the hospital of choice for patients and an employer of choice for staff. In order to improve all aspects of patient experience, we rely upon having a highly skilled, motivated, diverse, productive and patient focused workforce. Our staff are key to the current and future development of our services and have in recent times demonstrated their deep commitment to the trust and the community we serve. By joining us now, you can play a pivotal role in shaping a new organisation that continues to put patient care first and one that takes great pride in our place at the heart of the local community.&lt;/p&gt;\n&lt;p&gt;The Trust employs more than 6000 staff, providing healthcare throughout Lewisham and Greenwich, caring for a combined population of over 5000,000. Lewisham is a teaching hospital of the Guy’s, King’s and St Thomas’ School of Medicine with a first class reputation for undergraduate and postgraduate training. The two radiology departments are modern and spacious and both have a programme for replacement of equipment. Our latest acquisitions are the GE Evolution CT scanner and the Siemens Aera 1.5T MRI scanner.&lt;/p&gt;\n&lt;p&gt;We are looking for highly motivated and enthusiastic individuals to join a team of consultants keen to develop new skills and innovative ways of working and further strengthen the Imaging Services at Lewisham and Greenwich NHS Trust.&lt;/p&gt;\n&lt;p&gt;The successful candidate will also contribute to the postgraduate and undergraduate teaching.&lt;/p&gt;\n&lt;p&gt;The posts are full time, attracting 10 programmed activities and the successful candidate will need contribute to the general radiology on-call rota at either site. Consideration will be given to a part time appointment for those unable or not wishing to work full time.&lt;/p&gt;\n&lt;p&gt;All applicants must have full GMC registration and hold a Licence to Practise. They must possess a recognised medical degree and will have been awarded a CCT in Diagnostic Radiology and relevant subspecialty or be within six months of CCT by the date of the interview, and/or be on the GMC Specialist Register.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDr Fatima ShahJob titleClinical Director Imaging UHLEmail addressfatima.shah1@nhs.netTelephone number020 3192 6571Additional contact information&lt;/p&gt;\n&lt;p&gt;To arrange to visit the departments and to discuss your application further, interested candidates should contact:&lt;/p&gt;\n&lt;p&gt;Mr Martin Baghurst, tel: 020 3192 6835 or 077480 24471, email m.baghurst@nhs.net&lt;/p&gt;\n&lt;p&gt;or Fatima Shah, tel: 020 3192 6571, email fatima.shah1@nhs.net;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121183.jpg", "name": "Lewisham and Greenwich NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121183"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Medical Staff - Radiology QEH, London", "postalCode": "SE18 4QH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4791", "longitude": ".051174"}}, "title": "Consultant Radiologist, General Radiology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916239209", "validThrough": "2020-11-11T23:59:59+0000"}