{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 Per annum"}}, "datePosted": "2020-10-14T12:31:40+0100", "description": "&lt;p&gt;&lt;strong&gt;THIS POST IS FIXED TERM/SECONDMENT UNTIL NOVEMBER 2021 DUE TO MEET THE NEEDS OF THE SERVICE &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;IF YOU ARE INTERESTED IN APPLYING FOR THE SECONDMENT POSITION, YOU MUST OBTAIN PERMISSION FROM YOUR CURRENT LINE MANAGER PRIOR TO APPLYING FOR THIS POST. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Band 6 Health Visitor posts has arisen within Cwm Taf Morgannwg University Health Board. An exciting opportunity has arisen to recruit a Health Visitor to work effectively within multi-agency settings to deliver the Healthy Child Wales programme promoting the health and wellbeing of children and families within Rhondda Cynon Taf. The post holder will be a dynamic, motivated individual to support the provision of effective and efficient service. You will be expected to hold a SCPHN qualification or be imminently awaiting a successful result. Therefore Health Visiting students currently working or being hosted within the University Health Board are welcomed to apply.&lt;/p&gt;\n&lt;p&gt;The post holder, as well as being a qualified Health Visitor, will possess excellent clinical skills with a pro- active approach to evidence based practice. You will be a team player displaying excellent interpersonal skills with clear and precise communication with team members/colleagues and the ability to embrace new challenges. A comprehensive Induction Programme will be offered to the successful candidate, as will continued professional and personal development with regular appraisals and on-going appropriate training and education.&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; Welsh and/or English speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt;Closing Date: 22/11/2020.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Susan Royal Jones&lt;/p&gt;\n&lt;p&gt;Job title: Deputy Senior Nurse- Health Visiting&lt;/p&gt;\n&lt;p&gt;Email address: Susan.RoyalJones@wales.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number: 07771 784 392&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123872.png", "name": "Cwm Taf Morgannwg University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123872"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Ferndale Medical Centre, Ferndale", "postalCode": "CF43 4XX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6621", "longitude": "-3.4484"}}, "title": "Health Visitor Flying Start - Ferndale Medical Centre", "url": "https://www.jobs.nhs.uk/xi/vacancy/916226228", "validThrough": "2020-11-22T23:59:59+0000"}