{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "58558", "minValue": "52643", "unitText": "YEAR", "value": "£52,643 - £58,558 per annum inc hcas"}}, "datePosted": "2020-10-28T16:30:51+0000", "description": "&lt;p&gt;We are seeking to appoint an exceptional Deputy Matron who will work alongside our Matron within Private Care services at the Royal Marsden Hospital, Chelsea Ambulatory areas and Cavendish Square.&lt;/p&gt;\n&lt;p&gt;The successful Deputy Matron will provide effective, visible and accessible clinical leadership and operational management for the nursing staff of Private Care whilst ensuring that the service is fully integrated into the trust’s corporate governance strategic framework. They will be expected to ensure that Private care has a positive and effective relationship with all wards and departments across the trust. The post will line manage senior nursing staff and support them to develop and manage their teams and service.&lt;/p&gt;\n&lt;p&gt;Chelsea private care ambulatory areas include a busy medical day unit and outpatient department. Cavendish Square will be an exciting new centre opening early 2021, in the heart of London’s most respected healthcare district. As a specialist cancer centre, The Royal Marsden Private Care will have the clinical expertise, facilities and technology to provide leading private care service. Our multidisciplinary teams, consisting of world-leading cancer experts will provide our patients with personalised care.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be an experienced and credible nurse leader with the ability to motivate and inspire staff to deliver the highest possible clinical and professional standards. You will be a clinical role model and will be passionate about providing continuous service improvement and patient-centred care at the highest standard. You will possess relevant professional qualifications plus additional specialist management knowledge, acquired through training and experience.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Rebecca Bourne, Private Care Matron&lt;/p&gt;\n&lt;p&gt;Email address : rebecca.bourne@rmh.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "The Royal Marsden NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123033"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Marsden Chelsea Hospital, Chelsea", "postalCode": "SW3 6JJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4909", "longitude": "-.172788"}}, "title": "Deputy Matron - Chelsea &amp; Cavendish Square", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247386", "validThrough": "2020-11-08T23:59:59+0000"}