{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "29651", "minValue": "29651", "unitText": "YEAR", "value": "£29,651 per annum"}}, "datePosted": "2020-10-30T09:14:14+0000", "description": "&lt;p&gt;If you are looking to join an energetic and vibrant organisation that truly makes a difference to people’s lives on a daily basis we would like to hear from you. We are looking for a Registered Nurse to join our team. As part of our professional, friendly and compassionate team you will do everything you can to ensure the patient’s treatment is of the highest standard.&lt;/p&gt;\n&lt;p&gt;Our focus at all times is on ensuring that our patients receive high quality treatment quickly, in clean and comfortable surroundings. Our wards boast great nurse to patient ratios and the Practice Plus Group Hospital, Emersons has been rated Good by the CQC, putting it at the top of the regulator’s quality ratings.&lt;/p&gt;\n&lt;p&gt;If you are a practitioner outside of the local area we would welcome your application and there is a very generous relocation package available to support you.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will be part of a close knit collaborative team who pride themselves in providing the highest standard of care to our patients and their families. Our Outpatients team is comprised of experienced nurses and healthcare assistance supported by our welcoming Outpatients Manager, Julia. As well as undertaking basic duties you will function as a clinical practitioner being responsible for the delivery of patient care, managing and organising a work load on a daily basis. All of our work is planned so you will be able to plan your week with ease knowing your work schedule won’t change.&lt;/p&gt;\n&lt;p&gt;You will liaise with the wider Practice Plus Group medical team to ensure the patient’s treatment is carried out whilst maintaining the principles of patient confidentiality.&lt;/p&gt;\n&lt;p&gt;Your sound clinical and preoperative knowledge combined with your ability to solve problems and think both literally and laterally will enable you to coach and support others in your team. We encourage sharing of best practice across our site to develop your skills and take advantage of our excellent clinical leadership knowledge.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Working at Practice Plus Group&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;When you’re part of the Practice Plus Group team, you don’t just have a job. You have a career. We work with you to help you grow in your role and take your career in the direction you want to go. If you want to move up the ladder, we’ll support you. If you just want to stay in your role, that’s fine too. We’ll help you be the best you can be.&lt;/p&gt;\n&lt;p&gt;We want our team members to feel motivated and rewarded. So we offer a competitive package of pay and benefits. We also recognise the value of a healthy work-life balance – so we always try to be flexible, helping you fit your working life around your home life.&lt;/p&gt;\n&lt;p&gt;To apply for the role click on the link below. If you have any questions contact Glenn Coles in our friendly resourcing team, glenn.coles@practiceplusgroup.com or call 01189 521 951.&lt;/p&gt;\n&lt;p&gt;We will contact all shortlisted candidates but please note Practice Plus Group retain the right to remove the advert prior to the closing date if a suitable candidate is appointed. Our employment offers are subject to receipt of satisfactory pre-employment checks. At Practice Plus Group, we actively promote diversity and equal opportunities. Applicants must have the right to work in the EU.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are one of the UK largest independent sector healthcare providers and work in close partnership with the NHS to deliver more than 50 services throughout the UK. We provide high quality specialist care and excellent results for more than 50,000 patients each year.&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Practice Plus Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130136"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Emersons Green", "postalCode": "BS16 7FH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5033", "longitude": "-2.48431"}}, "title": "Outpatients Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249427", "validThrough": "2020-11-26T23:59:59+0000"}