{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum pro rata"}}, "datePosted": "2020-10-23T12:12:33+0100", "description": "&lt;p&gt;Part Time 22.5 hours per week &lt;/p&gt;\n&lt;p&gt;This is an outstanding opportunity for an enthusiastic, motivated and talented Pharmacist to join the proactive pharmacy team providing clinical pharmacy services to the Paediatric wards at Morriston Hospital and working as Medication Safety Officer. The hospital is located on the edge of the Gower peninsula (with its cliffs, great beaches and surfing). &lt;br /&gt;&lt;br /&gt;We have an exciting opportunity for a motivated and enthusiastic clinical pharmacist to join our patient-focused and progressive Paediatric &amp; Medication Safety Pharmacy Teams. The paediatric clinical pharmacy team is an integral part of the multidisciplinary child health service. The successful candidate will have the opportunity to lead &amp; provide a patient-oriented pharmacy service to the various paediatric wards including tertiary cleft palate service, tertiary paediatric Burns and Plastics, and shared-care Oncology and Haematology services, outpatients and in pharmacist-led clinics within the Children’s services. Children’s outpatient services provide a range of specialities including gastroenterology, neurology, endocrinology, respiratory, and rheumatology. This will allow the development of deeper knowledge, expertise, clinical and non-clinical skills under the direction of our experienced lead practitioners.&lt;/p&gt;\n&lt;p&gt;The role will also involve supporting delivery of the Medication Safety agenda for the Health Board. This will involve leading on developing, delivering, and evaluating defined areas of safe medication practices across the Health Board. You will be involved in promoting and supporting local medication incident reporting and learning, implementing Patient Safety Solutions from Welsh Government, leading audits related to medication safety. You will work with the Medication Safety Officer for the Health Board and be a member of the Welsh Medication Safety Network.&lt;br /&gt;&lt;br /&gt;Our team endeavours to provide a comprehensive, highly skilled service to clinical areas. This approach contributes to an improvement in the quality of prescribing and clinical care for the patient. The Medication Safety Group advises the Medicines Management Board on practices and interventions to ensure safety in the use of medicines and reduce potential risks to patients.&lt;br /&gt;&lt;br /&gt;We are seeking a friendly, enthusiastic, motivated and talented pharmacist to join our team. You will have excellent interpersonal and communication skills combined with good time management and organisational skills.&lt;br /&gt;&lt;br /&gt;Support and mentoring will be provided to the successful candidate by team members to ensure that you fulfil your potential in the exciting and challenging role. &lt;br /&gt;&lt;br /&gt;Experience of tutoring clinical diploma and pre-registration pharmacists will be welcome but is not essential.&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; English and/or Welsh speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt;This is a part time position - 22.5 hours per week&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further information or enquires please contact Lisa Thomas, Patient Services Lead Pharmacist, 01792 703366 .&lt;/p&gt;\n&lt;p&gt;Jatinder Parmar, Senior Medication Safety Officer 01797 704015&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123207.jpg", "name": "Swansea Bay University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123207"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Morriston Hospital, Swansea", "postalCode": "SA6 6NL"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6847", "longitude": "-3.93527"}}, "title": "Lead Clinical Pharmacist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240453", "validThrough": "2020-11-08T23:59:59+0000"}