{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pa plus HCAS"}}, "datePosted": "2020-10-23T10:15:44+0100", "description": "&lt;p&gt;An exciting opportunity has arisen for a full time Band 5 Staff Nurse within the neuro rehab team in Rosemary ward and General Rehabilitation in Jasmin Team at Clayponds Hospital.&lt;/p&gt;\n&lt;p&gt;Are you a band 5 Staff Nurse, wanting to expand and develop your skills and knowledge?&lt;/p&gt;\n&lt;p&gt;We are looking for an innovative, motivated and enthusiastic Nurses to work in our skilled and friendly MDT in west London. There is free parking and therapy garden on site and opportunities to learn from band 7 experts.&lt;/p&gt;\n&lt;p&gt;The successful candidate would be part of a supportive and friendly Nursing team including Occupational Therapists, Speech and Language Therapists, Dieticians, Psychology, Therapy Technicians, as well as part of a bigger MDT of our Doctors and Pharmacists.&lt;/p&gt;\n&lt;p&gt;Rosemary ward and Jasmin Ward are an integral part of the wider Intermediate Care team. This includes Magnolia Ward Admission Avoidance and P2/P3, Rapid Response Admission Avoidance team, P1 Team (D2A) and End Of Life (EOL).&lt;/p&gt;\n&lt;p&gt;Both wards consist of 25 in-patient bed. Patients have access to a variety of equipment in a large unique gym space and additional specific designated ADL rooms. Patients receive specialist therapy input until they are able to return their to preferred discharge destination (where appropriate) with support from our excellent community teams as needed.&lt;/p&gt;\n&lt;p&gt;The team is passionate about training and education. The successful candidate will have the opportunity to actively participate in regular in-service training and complete CPD courses as appropriate.&lt;/p&gt;\n&lt;p&gt;Our staff are central to delivering the service vision and we are keen to recruit high calibre staff who will be offered the support required to fulfil their roles as well as being provided with the training and experience to further their skills and build a career of which they can be proud.&lt;/p&gt;\n&lt;p&gt;Within the inpatient setting you will be working as part of an MDT with a focus on frailty and CGA models of care led by geriatricians and senior Nurses and Therapists.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Our Mission&lt;br /&gt;&lt;/strong&gt;“Promoting hope and wellbeing, together”&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Our Vision&lt;br /&gt;&lt;/strong&gt;Our vision is to be an outstanding healthcare provider, committed to improving quality, and caring with compassion.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Our Values&lt;br /&gt;&lt;/strong&gt;As a member of West London, you can expect to be a respected member of staff at all times. We work to a set of Trust Values and uphold these in all of our interactions. Our Values are like our moral compass, reminding us of the things that matter most when we are caring for people in need. Our Trust Values are:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Togetherness Responsibility Excellence Caring&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you feel you are a person who lives our Trust Values then we’d like to meet you! You can watch videos on our website which shows what our Trust Values mean across our organisation:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Rewards&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We offer an extensive reward package to our staff alongside an exciting and fulfilling career with our Trust. Some of the benefits you can enjoy when you join our team are:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A competitive relocation package meaning you can claim up to £8k in expenses when moving over 40 miles to join the Trust.&lt;/li&gt;\n&lt;li&gt;Up to 33 days annual leave as well as the opportunity to buy even more days or sell some leave days that you don’t need.&lt;/li&gt;\n&lt;li&gt;As a member of staff you will be able to request up to six shifts off work per rota&lt;/li&gt;\n&lt;li&gt;Childcare vouchers&lt;/li&gt;\n&lt;li&gt;Support towards career development and promotion opportunities within the Trust.&lt;/li&gt;\n&lt;li&gt;A supportive environment to develop clinical skills.&lt;/li&gt;\n&lt;li&gt;Access to a comprehensive online library of training, development, and resources.&lt;/li&gt;\n&lt;li&gt;Discounted gym membership – from £10 per month at our on-site gym! (St Bernard’s site)&lt;/li&gt;\n&lt;li&gt;Staff discounts at high street retailers.&lt;/li&gt;\n&lt;li&gt;Paid DBS application upon offer.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What has Ealing got to offer?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Multiple green spaces and parks.&lt;/p&gt;\n&lt;p&gt;Easy and quick access to central London.&lt;/p&gt;\n&lt;p&gt;Great Transport links including Heathrow Airport and the new Elizabeth line.&lt;/p&gt;\n&lt;p&gt;Ealing has a vibrant atmosphere with excellent pubs and restaurants.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We welcome enquiries about this role before or during your application process. If you would like to know more about this opportunity and working at West London NHS Trust, please contact:&lt;/p&gt;\n&lt;p&gt;Christine Wendam at 02082323350&lt;/p&gt;\n&lt;p&gt;If you wish to have a discussion about other career opportunities within Ealing Community Partners email:&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Peter Wilde&lt;/p&gt;\n&lt;p&gt;Service Manager Intermediate Care&lt;/p&gt;\n&lt;p&gt;Peter.wilde@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122793.png", "name": "West London NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122793"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Clayponds Hospital, SOUTHALL", "postalCode": "UB1 3EU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5067", "longitude": "-.351054"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916239990", "validThrough": "2020-11-06T23:59:59+0000"}