{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24214", "unitText": "YEAR", "value": "£24,214 - £30,615 gross per annum"}}, "datePosted": "2020-11-04T13:01:14+0000", "description": "&lt;p&gt;Perinatal Community Mental Health Service&lt;/p&gt;\n&lt;p&gt;Band 5 Mental Health Nurse&lt;/p&gt;\n&lt;p&gt;We are looking to recruit two Band 5 Mental Health Nurses to join the Perinatal Community Mental Health Team. These are substantive full-time posts. One post will be based in the East areas (Great Yarmouth and Waveney) whilst the other post will be based in the Norwich Central area and North Norfolk.&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity and offers you a chance to progress with your career.&lt;/p&gt;\n&lt;p&gt;The Perinatal Community Mental Health services provide prevention, detection and management of mental health problems that complicate pregnancy and the postpartum year. These include new-onset problems, recurrences of previous problems in women who have been well for some time and in women with existing mental health problems who become pregnant.&lt;/p&gt;\n&lt;p&gt;Promoting the relationship with the infant and its emotional, physical well-being and development are central to the care provided by perinatal mental health services.&lt;/p&gt;\n&lt;p&gt;The Perinatal Community Mental Health service offers an exciting opportunity to work within a specialist multi-disciplinary setting, working closely with key partners in health, social care and other sectors. The service offers a wide range of MDT clinical assessments and treatments, specific specialist perinatal therapeutic individual and group interventions. We promote a strong service user led participation culture as well as supporting partners and families.&lt;/p&gt;\n&lt;p&gt;As a Band 5 Mental Health Nurse, you will jointly assess and identify treatment plans for women during their pregnancy up until their discharge from the service. You will be responsible for monitoring and supporting women, babies and families in their home environments, to work alongside care coordinators, lead professionals and other therapists. You will be offering stabilisation and other interventions to service users. You will contribute to clinical records, risk assessments and other core processes. You will take part in service development projects, assist with group sessions and take part in team activities.&lt;/p&gt;\n&lt;p&gt;This is an opportunity to develop new skills and knowledge. The service provides education and training opportunities.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Mandy Kirby, Mental Health Practitioner: mandy.kirby@nsft.nhs.uk / 01603 786781&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121326.png", "name": "Norfolk and Suffolk NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121326"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Kingfisher Ward, Norwich", "postalCode": "NR6 5BE"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6596", "longitude": "1.25089"}}, "title": "Community Mental Health Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255954", "validThrough": "2020-11-18T23:59:59+0000"}