{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157"}}, "datePosted": "2020-11-02T10:45:58+0000", "description": "&lt;p&gt;The Northern Care Alliance NHS Group was created by bringing together staff and services from two NHS Trusts, Salford Royal NHS Foundation Trust and The Pennine Acute Hospitals NHS Trust. The sheer size, scale and potential of our combined service is huge. Together, we’ve a wealth of skills and resources to share and tap into and, a wide range of career paths for you to develop and explore. If you want to join a team of over 19,000 NHS experts in delivering high-quality, local care across Salford, Oldham, Bury and Rochdale and beyond – &lt;strong&gt;come and take your place with us. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are looking for new colleagues to join us in our newly created get me working team within the IT Service Desk. Our get me working team have a singular focus on making sure that we are doing everything possible to get colleagues access to whatever they need from IT quickly and simply, whether it’s their very first day with the Trust, they’ve changed role, or they just need something new. As a member of this team you’ll need a relentless focus on customers’ needs and an analytical approach to continuous improvement. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are looking for someone who has experience managing system accounts, IT purchasing, configuring and deploying end user devices and can provide excellent customer service. The successful candidate will also need to have analytical skills to help drive continual improvement in the team and be continually checking if we are meeting the customers&#39; needs.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;By joining the NCA group , you’ll become part of a very ambitious and forward-thinking team and will play your part in helping the organisation work towards its ambition of becoming the safest organisation in the NHS.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Please be advised that whilst this post is based at North Manchester General all new starters to Corporate posts within the Northern Care Alliance will be employed by Salford Royal NHS Foundation Trust and be on a Salford Contract.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;In line with the Trust’s Single Equality Scheme we welcome applications from everyone irrespective of ethnic origin, disability, age, gender, gender identity, sexual orientation, disability, nationality, religion, marital status, social background or trade union membership. However, as members of ethnicity minority groups and individuals with disabilities are currently under-represented at this level of post, we would encourage applications from members of these groups. Appointment will be based on merit alone.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;All communications to applicants will be via the email address provided on your application form and all further correspondence will be through email, therefore please ensure that you regularly check your emails after the closing date for this post. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Richard Nuttall&lt;/p&gt;\n&lt;p&gt;Service Desk Manager&lt;/p&gt;\n&lt;p&gt;Richard.Nuttall@pat.nhs.uk&lt;/p&gt;\n&lt;p&gt;0161 604 5678&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121715.jpg", "name": "Salford Royal NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121715"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "North Manchester Care Organisation, Manchester", "postalCode": "M8 5RN"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5167", "longitude": "-2.22866"}}, "title": "Get me Working Officer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251643", "validThrough": "2020-11-16T23:59:59+0000"}