{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum, pro rata"}}, "datePosted": "2020-10-27T12:31:51+0000", "description": "&lt;p&gt;&lt;strong&gt;Are you a dynamic, passionate and motivated Clinical Nurse Specialist looking for your next challenge? &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are excited to offer the opportunity for a band 6 clinical nurse specialist to join our ambitious and driven team.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Do you want to work in the highly acclaimed and respected Beacon Centre, where you can pride yourself on the exemplary standards of service you and your team deliver? &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Beacon Centre provides cancer care to the population of Somerset of approximately 500,000. It has received a number of accolades since opening in 2009 for the high quality care delivered. These include CHKS ISO 9001 accreditation, Macmillan Quality Environment Mark, Investors in People Gold and Customer Service Excellence award. In the 2018 National Cancer Patient Experience Survey, the Beacon Centre was ranked third overall which is an excellent reflection of the patient centred care delivered.&lt;/p&gt;\n&lt;p&gt;The Macmillan acute haemato-oncology team was established in 2013 and is well respected across Musgrove Park Hospital supporting patients admitted as an emergency with treatment or disease related toxicity/ symptoms. Since establishing the service, the multi-professional team has been shortlisted for a Health Service Journal award in recognition of its quality improvement project- neutropenic sepsis alert cards and transforming door to needle antibiotic administration time. We are committed to sharing best practice and have had a number of publications and presentations accepted.&lt;/p&gt;\n&lt;p&gt;Since 2016, to meet the objective of reducing length of stay and admission avoidance, the nursing team set up the cancer helpline, a dedicated telephone triage service supporting patients undergoing anti-cancer treatment in the community, with tangible results. In recognition of this the team made it through to the national final, Macmillan professional awards 2019, in the quality improvement category.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Do you want a varied role that helps you further develop your clinical and leadership skills? &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This new post will enable us to deliver further nurse-led telephone triage across the county to include patients under the care of Yeovil District Hospital. The role will include telephone triage, clinical reviews of patients across Musgrove Park hospital, supporting the non-specialist teams overseeing their care. A commitment to deliver formal and informal education and training, by way of supporting our colleagues is an essential component of the role. You will need to possess excellent team working and communication skills and have the ability to assess and manage potentially complex clinical situations.&lt;/p&gt;\n&lt;p&gt;You will be supported in your practice and there will be opportunities for you to undertake additional specialist training as per the service specification.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Would you like to feel supported and valued whilst caring for others?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As well as taking pride in caring for our patients, we also prioritise taking care of our employees! You will be part of a compassionate and friendly team who understand the challenges that arise when caring for cancer patients and the importance of supporting one another through these. You will be offered regular clinical supervision and access to health &amp; well-being services.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Would you like to work in one of the most desirable places within the UK?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This post is based in the heart of Somerset where you can soak up all that the idyllic countryside has to offer with our areas of outstanding beauty and stunning coastlines. You get to enjoy these perks whilst still only being a stone’s throw away from bustling city centres like Bristol, Bath and Exeter and only two hours away from London.&lt;/p&gt;\n&lt;p&gt;There are excellent educational facilities in the area and, when compared to other regions, house prices are reasonable. You get to experience the best of both in Somerset, the countryside and the cosmopolitan – there is truly something for everyone!&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If you are passionate about delivering high quality care to patients and the idea of being apart of our innovative service excites you, then we would love to hear from you! &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further information about the role please do not hesitate to contact Katherine Michaels or Anna Stephens, band 7 CNS, acute haemato-oncology- Katherine.michaels@tst.nhs.uk; anna.stephens@tst.nhs.uk&lt;/p&gt;\n&lt;p&gt;Hours of work - Full time 37.5 hours per week&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Somerset NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121360"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Musgrove Park Hospital, Taunton", "postalCode": "TA1 5DA"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.012", "longitude": "-3.11979"}}, "title": "Acute Haemato-Oncology Clinical Nurse Specialist (Band 6)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244513", "validThrough": "2020-11-08T23:59:59+0000"}