{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 plus Outer London HCAS"}}, "datePosted": "2020-11-06T08:17:00+0000", "description": "&lt;p&gt;&lt;span&gt;&lt;strong&gt;Occupational Therapist - Band 6&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity for a highly motivated individual to join our new Rehabilitation service which will be situated in Somerset Villa on the Chase Farm site in Enfield. Somerset Villa is a 13 bedded Unit offering rehabilitation assessment &amp; treatment. The service is an integral part of the local adult mental health care pathway and works in partnership with key stakeholders.&lt;/p&gt;\n&lt;p&gt;You will be part of a specialist multidisciplinary team who will provide intensive input to service users developing individualised care programmes to prepare service users for successful step down to a range of accommodation &amp; supported housing in the community. The principles of coproduction &amp; delivery of Values Based Practice are key to the delivery of the service.&lt;/p&gt;\n&lt;p&gt;The post will involve delivery of the OT provision for the unit, focusing on developing independence, managing behaviour, developing skills for life, community integration and managing risk issues. The OT will work collaboratively with other health professionals and will work closely with the psychologist on the ward to plan, assess and treat those staying at the unit. The OT will run a range of therapeutic groups and individual sessions using meaningful activity to meet the needs of the service user. Experience of group work is essential. Another element will be to carry out regular functional assessments to contribute to multidisciplinary team care planning, formulation and risk assessment.&lt;/p&gt;\n&lt;p&gt;You will also be part of the OT Therapy Team who provide Occupational Therapy provision built around the Model of Human Occupation to the acute wards and the rehab unit. We run a therapeutic group treatment programme across the wards and the team consists of Occupational Therapists, OT Technicians, Support and Activity workers, a Drama Therapist and an Exercise and Fitness Instructor. We also work in partnership to provide groups with, a Dietician, a Psychologist and activity workers from the charity - Enfield Mental Health Users.&lt;/p&gt;\n&lt;p&gt;We are looking for an experienced Occupational Therapist who enjoys working in a dynamic and challenging environment and who will be able to deliver high quality patient care &amp; focussed outcomes. You must be able to work flexibly and efficiently within the MDT and OT team and have excellent communication skills. Experience of a previous supervisory role within a team is desirable.&lt;/p&gt;\n&lt;p&gt;Barnet Enfield and Haringey Mental Health NHS Trust wishes to encourage people who have experienced mental health problems to apply for any post within the Trust for which they meet the person specification.&lt;/p&gt;\n&lt;p&gt;Previous experience working in a rehabilitation setting will be an advantage.&lt;/p&gt;\n&lt;p&gt;Please see personal specification for details of required experience and qualifications. Candidates who are called for interview will be required to bring a portfolio of evidence to support competencies in relevant skills. The clinical area provides considerable opportunity for personal and professional development.&lt;/p&gt;\n&lt;p&gt;We strongly recommend an informal visit which can be arranged by contacting Mrs Kate Cartmell, Team Lead Occupational Therapist on 0208 702 5553&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameKate CartmellJob titleOT Team Lead for Inpatient TherapiesEmail addresskate.cartmell@nhs.netTelephone number02087025553&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Barnet Enfield and Haringey Mental Health Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120621"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "- Complex Rehab Ward, Enfield", "postalCode": "EN2 8JL"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6663", "longitude": "-.103613"}}, "title": "Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258886", "validThrough": "2020-11-30T23:59:59+0000"}