{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 pro rata"}}, "datePosted": "2020-11-03T12:30:57+0000", "description": "&lt;p&gt;Are you a Nurse Prescriber?&lt;/p&gt;\n&lt;p&gt;Would you like to work in a small and supportive team where everyone is valued?&lt;/p&gt;\n&lt;p&gt;Would you love to enjoy genuinely satisfying and meaningful therapeutic relationships with service users?&lt;/p&gt;\n&lt;p&gt;Are you interested in ADHD and autism? Or have you ever thought &quot;I wish I knew more about ADHD and autism&quot;?&lt;/p&gt;\n&lt;p&gt;We want the right person to join our service - if any of the above applies, read on&lt;/p&gt;\n&lt;p&gt;What we are looking for&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;a full-time Clinical Nurse Specialist / nurse prescriber on a one year fixed term basis or secondment (for our Brighton service*)&lt;/li&gt;\n&lt;li&gt;a colleague who has an understanding of ADHD or who has a genuine interest in learning more about ADHD (and associated conditions)&lt;/li&gt;\n&lt;li&gt;someone who has enthusiasm to learn (however experienced) and to be part of a team&lt;/li&gt;\n&lt;li&gt;someone who likes to manage their diary and enjoy autonomy as a practitioner - whilst having the reassurance of knowing what is expected from their role and activity (always knowing there are colleagues available for reflection)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;What we can offer&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;an opportunity to really learn about a much-misunderstood condition (ADHD) - to develop any existing understanding you have and to feel confident and competent in your specialism. You can also learn about autism and tics and Tourette&#39;s&lt;/li&gt;\n&lt;li&gt;a well-defined role as a nurse prescriber - using these skills and knowledge every day with fantastic clinical outcomes&lt;/li&gt;\n&lt;li&gt;Robust and meaningful supervision - managerial and clinical. You will receive regular medical supervision alongside your NMP peers as well as one-to-one nursing supervision with the lead Clinical Nurse Specialist. Our Team Leader will help you stay on track with your caseload. We have weekly practitioner meetings for wellbeing and team building and a weekly MDT meeting for case discussion and reflection. We keep meetings focused, positive and productive&lt;/li&gt;\n&lt;li&gt;A highly skilled and committed team who are passionate about our work. We have very close links to ongoing innovative research and we use this to improve our care. We have a team of &quot;experts by experience&quot; who challenge and encourage us to get better. We have a strong culture of co-production. We love sharing our knowledge and insights with our colleagues in other services.&lt;/li&gt;\n&lt;li&gt;Flexible work solutions - including remote working (commuting is so 2019)*&lt;/li&gt;\n&lt;li&gt;A caseload that makes you think; helps you redefine human potential and feel truly glad you became a nurse (we are unashamedly proud of the people who use our services)&lt;/li&gt;\n&lt;li&gt;Working within a team that has a high reputation within Sussex Partnership NHS Foundation Trust&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Although this post is advertised as only fixed term; we are actively working with our commissioners in order for us to extend this to a permanent position.&lt;/p&gt;\n&lt;p&gt;We would love to chat with you (we always want to talk about our service). Don&#39;t worry if you are not sure - we won&#39;t hold you to anything. Just call or email Frankie Evans on 07920139483 or email francesca.evans@sussexpartnership.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121074.jpg", "name": "Sussex Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121074"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Brighton (But can work virtually and not need to travel to base), Brighton", "postalCode": "BN13 3EP"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8412", "longitude": "-.411136"}}, "title": "Nurse Prescriber (Non-medical)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253994", "validThrough": "2020-11-17T23:59:59+0000"}