{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 pa"}}, "datePosted": "2020-10-28T12:15:29+0000", "description": "&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Band 5 Staff Nurse&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We have opportunities for band 5 Staff Nurses to work in our frailty assessment unit at Birmingham Heartlands Hospital.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for newly qualified and experienced nurses with excellent clinical skills that have an interest in the health care of older adults to join our team. The wards share all the excellent benefits that UHB has to offer, including an IT system that is of excellent standard which assist the nursing team in being able to assess the patient holistically within minutes. We are looking for dynamic and motivated nurses who are able to excel in a very busy environment, catering for a diversity of patients with acute and chronic medical and nursing needs, inclusive of patients with Dementia and Delirium.&lt;/p&gt;\n&lt;p&gt;The trust has an excellent in house training facility to assist all staff to reach their career goals. Practice development nurses and clinical educators are on hand to assist with any queries and assistance in building up practice with skills required. The ward takes a proactive part in helping ensure that staff attends training to help them develop the skills they need, to ensure they provide the highest standard of care to their patients.&lt;/p&gt;\n&lt;p&gt;The post holder will be required to work flexibly across days, nights and weekends.&lt;/p&gt;\n&lt;p&gt;Successful candidates will be expected to work very closely with a multi-disciplinary team inclusive of Occupational Therapists, Physiotherapists, Doctors, Social Workers, pharmacists and Nurses.&lt;/p&gt;\n&lt;p&gt;Previous acute medical experience is an advantage but all applicants will be considered as long as they are willing to learn and all successful applicants will have a structured and supported induction period and will be able to access ongoing training and support from within our clinical training and education team.&lt;/p&gt;\n&lt;p&gt;If you want to work within a positive and supportive team and have the opportunity to develop professionally then frailty assessment unit at Birmingham Heartlands Hospital is for you. Please don’t hesitate to contact us for more information or to arrange an telephone conversation for the post.&lt;/p&gt;\n&lt;p&gt;For more information, please call Denesha Connolly 0121 424 1851&lt;/p&gt;\n&lt;p&gt;Closing date: 19/11/2020&lt;br /&gt;Interview date: 08/12/2020&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120989.jpg", "name": "University Hospitals Birmingham (Heartlands, Good Hope, Solihull)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120989"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Birmingham", "postalCode": "B9 5SS"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4802", "longitude": "-1.82996"}}, "title": "Band 5 - Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246493", "validThrough": "2020-11-19T23:59:59+0000"}