{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19750", "minValue": "19750", "unitText": "YEAR", "value": "Up to £19,750 - Dependent on Experience"}}, "datePosted": "2020-11-02T16:02:45+0000", "description": "&lt;h1&gt;&lt;strong&gt;Break into prison healthcare!&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;Are you looking for a new challenge in an environment where no two days are the same?&lt;br /&gt; &lt;br /&gt; Patient care is at the centre of what we do and we are looking for an enthusiastic, hardworking and committed Health Support Worker who wants to make a difference to our patient’s lives.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h1&gt;&lt;strong&gt;Make a difference from day one!&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;Prisons are challenging, yet rewarding places for healthcare professionals to work. If you are a Health Support Worker and want a role where you can develop your existing skills and learn something new every day in an environment that never stands still, then this is it!&lt;br /&gt; &lt;br /&gt; As a healthcare provider, we recognise the fact that prisoners are a socially excluded group with complex healthcare needs that can often be associated with poor outcomes. We believe in putting the patient first, regardless of the environment or their history. We are the market leader, providing care to over 30,000 patients in over 40 prisons across the country.&lt;br /&gt; &lt;br /&gt; Our core values are; everyone makes a difference, patients are at the heart of everything we do and together we make things better. If you share these values and have transferable skills we want to meet you!&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h1&gt;&lt;strong&gt;What can we offer you?&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;As a Healthcare Support Worker you’ll be an integral part of the healthcare team by bringing your top notch skills and passion for care. With plenty of proven experience, you could be involved in anything from health promotion clinics and observations, the provision of social/personal care; to supporting the nursing and pharmacy teams in primary care.&lt;br /&gt; &lt;br /&gt; Flexible and adaptable? That&#39;s great!&lt;br /&gt; We&#39;re looking for someone just like you to be part of our team.&lt;br /&gt; &lt;br /&gt; If you have a passion for bringing new ideas to the table then we’re here to listen on how we can improve and continue to develop our healthcare service within the prison environment.&lt;br /&gt; &lt;br /&gt; There are great opportunities for training and development and the opportunity to work with interesting patients and learn new skills.&lt;br /&gt; &lt;br /&gt; This is a full-time role working 37.5 hours a week. The salary for this role is up to £19,750 - dependent on experience.&lt;/p&gt;\n&lt;h1&gt;&lt;br /&gt; &lt;strong&gt;Next steps&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;If you are shortlisted, you will be contacted by the Internal Recruiter for this role. They will submit your CV to the hiring manager and in turn will arrange an interview for you to attend at either HMP Highpoint if suitable for the role.&lt;br /&gt; &lt;br /&gt; For more information or to arrange an informal visit please contact us on the details provided.&lt;br /&gt; &lt;br /&gt; Please note that this role is subject to Practice Plus Group Terms &amp; Conditions and offers of employment are subject to satisfactory receipt of references, enhanced free DBS check and prison vetting.&lt;br /&gt; &lt;br /&gt; At Practice Plus Group we actively promote diversity and equal opportunities.&lt;br /&gt; &lt;br /&gt; &lt;strong&gt;&lt;em&gt;Please note that we reserve the right to close this advert earlier than stated if a sufficient number of applications have been received.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Practice Plus Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130136"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Newmarket", "postalCode": "CB8 9YG"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.137", "longitude": ".51069"}}, "title": "Healthcare Support Worker - HMP Highpoint", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252752", "validThrough": "2020-11-16T23:59:59+0000"}