{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "49325", "minValue": "43712", "unitText": "YEAR", "value": "£43,712 up to 49,325 pa inc HCAS"}}, "datePosted": "2020-11-03T13:16:21+0000", "description": "&lt;p&gt;We have a fantastic opportunity at Epsom and St Helier University Hospitals NHS Trust for a registered pharmacist to work in our out patient dispensary providing a high quality service to patients who have been seen either in a face to face or a virtual consultation.&lt;/p&gt;\n&lt;p&gt;COVID 19 has created many challenges to the way in which we deliver out-patient services and you will be involved in supporting a range of innovative developments that are being implemented to keep our patients safe while providing quick and easy access to their medicines.&lt;/p&gt;\n&lt;p&gt;The role is focused on delivering an efficient and accurate dispensing service to out-patients.&lt;/p&gt;\n&lt;p&gt;You will support the Principal Pharmacist, Out Patient Services and Clinical Trials and have the opportunity to develop your management skills.&lt;/p&gt;\n&lt;p&gt;You will need excellent interpersonal and communication skills and the ability to organise and prioritise your work and that of others.&lt;/p&gt;\n&lt;p&gt;You will be involved in the dispensing and management of Clinical Trials and the regular production of KPIs.&lt;/p&gt;\n&lt;p&gt;The post includes participation in the late duty, weekend, bank holiday and on-call rotas.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameSue WrightJob titleDeputy Chief Pharmacist, Operational and Patient ServicesEmail addresssue.wright26@nhs.netTelephone number02082964033 (Mondays and Tuesdays) and 01372 735337 (Wednesdays, Thursdays and Fridays)&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121992.jpg", "name": "Epsom and St Helier University Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121992"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St Helier, Carshalton", "postalCode": "SM5 1AA"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3801", "longitude": "-.183166"}}, "title": "Senior Pharmacist, Out Patient Services and Clinical Trials", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254115", "validThrough": "2020-11-17T23:59:59+0000"}