{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum"}}, "datePosted": "2020-11-04T10:01:46+0000", "description": "&lt;p&gt;Are you an experienced pharmacist seeking new challenges? If so then this is a fantastic opportunity to enhance your existing skills.&lt;/p&gt;\n&lt;p&gt;We are looking for a keen and committed pharmacist with excellent communication skills and clinical pharmacy knowledge to join our multi-disciplinary teams as Specialist Clinical Pharmacists. This post will be an exciting challenge for someone who is highly motivated and keen to develop their clinical and professional skills. You will have the opportunity to work across Mental Health and Learning Disability in-patient units.&lt;/p&gt;\n&lt;p&gt;We would prefer Independent Prescribing Pharmacists. If you are not already an independent pharmacist prescriber, you will be supported to gain this qualification.&lt;/p&gt;\n&lt;p&gt;The ability to work flexibly and be able to travel across Hull and East Riding would be an advantage.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Why work for us?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Humber Teaching NHS Foundation Trust provides a broad range of community and inpatient mental health services, community services (including therapies), learning disability services, healthy lifestyle support and addiction services to approximately 600,000 people. The Trust has been rated Good by the Care Quality Commission. The Trust is also proud to be HSJ Award winners of Provider of the Year 2019.&lt;/p&gt;\n&lt;p&gt;We employ approximately 2,800 staff across more than 79 sites at locations throughout Hull, the East Riding of Yorkshire, Whitby and Scarborough. We deliver Mental Health Services, Specialist Services for Children, Forensic Services, Community and Learning Disability Services, as well as having eight GP Practices across the locality.&lt;/p&gt;\n&lt;p&gt;Humber Teaching NHS Foundation Trust - a multi-specialty health and social care teaching provider. We aim to be a leading provider of integrated health services, recognised for the care compassion and commitment of our staff and known as a great employer and a valued partner.&lt;/p&gt;\n&lt;p&gt;The Trust works closely with our academic partners, including Hull York Medical School (HYMS) and Hull University, nurturing and developing a workforce of doctors, nurses and other health and social care professionals of the future.&lt;/p&gt;\n&lt;p&gt;At Humber we believe our people are our greatest asset and therefore we are committed to developing, growing and rewarding our workforce. As an employee at Humber you will benefit from pay in line with Agenda for Change, NHS pension, training and development, annual appraisal, generous annual leave entitlement and flexible working options to enable you to achieve a healthy work/life balance.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Humber Teaching NHS Foundation Trust serves the populations of Hull, the East Riding of Yorkshire and North Yorkshire. Within North Yorkshire, Scarborough, Ryedale and Whitby areas boast a wide array of diverse property from coastal cottages to riverside apartments, with access to excellent schools and further and higher education providers. There is beautiful scenery across the locality, including picturesque seaside towns, Market towns, woodland areas, moorland and world heritage sites including castles, and Abbeys. Local events include food festivals, Gothic weekends, Victorian weekends, cycling events, Armed Forces and Lifeboat weekends.&lt;/p&gt;\n&lt;p&gt;The region has excellent transport connections with train services from Hull to York, Leeds, and London&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Jackie Stark, 07702 366 583, email jackie.stark@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120910.png", "name": "Humber Teaching NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120910"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Trust HQ, Willerby Hill, Willerby", "postalCode": "HU10 6LW"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.752", "longitude": "-.433726"}}, "title": "Specialist Clinical Pharmacist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255301", "validThrough": "2020-11-18T23:59:59+0000"}