{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62001", "minValue": "53168", "unitText": "YEAR", "value": "£53,168 - £62,001 Per Annum"}}, "datePosted": "2020-10-30T10:02:24+0000", "description": "&lt;p&gt;You can expect a warm welcome at Milton Keynes University Hospital, our staff are friendly and welcoming. We listen to each other and work together to embed our Trusts values and behaviours.  At MKUH we appreciate our staff and reward them with an outstanding benefits package including:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Free on-site parking&lt;/li&gt;\n&lt;li&gt;Free tea and coffee&lt;/li&gt;\n&lt;li&gt;Great flexible working opportunities&lt;/li&gt;\n&lt;li&gt;Discounted gym membership&lt;/li&gt;\n&lt;li&gt;Lease car scheme&lt;/li&gt;\n&lt;li&gt;Generous annual leave and pension scheme&lt;/li&gt;\n&lt;li&gt;On site nursery (chargeable)&lt;/li&gt;\n&lt;li&gt;Extensive staff health and well-being programme&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Milton Keynes University Hospital NHS Foundation Trust, in partnership with the University of Buckingham, is a University Teaching Hospital; we conduct research and teaching on site to improve the care of our patients. The hospital is undergoing significant investment, and we are proud to be rated good by the CQC. Visit our website to catch up on our latest news.&lt;/p&gt;\n&lt;p&gt;We are seeking an experienced, motivated and independently minded leader who can act on their own initiative, adopting a values led ‘can do’ style within a climate of constant change to develop and manage the day to day operations and performance within Theatres. You will provide leadership and set an expectation of continuous improvement throughout the Theatres department.&lt;/p&gt;\n&lt;p&gt;You will act as a role model and mentor to clinical staff providing advice and support to others to promote good practice. The Theatre Operational Manager will encourage, develop and enhance the skills and knowledge of others. You will ensure that Clinical Governance and Risk management are embedded within daily practice and promote best evidence-based practice within own scope of practice.&lt;/p&gt;\n&lt;p&gt;The Theatre Operational Manager will play a pivotal role in taking theatres through a period of growth and transformation&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Have a minimum of 3/4 years Theatre experience and / or leadership within a healthcare setting.&lt;/li&gt;\n&lt;li&gt;An excellent level of emotional intelligence and understanding the importance / role of Human Factors play in the operating department&lt;/li&gt;\n&lt;li&gt;Experience in transformational leadership and previous managerial experience as you will play a pivotal role in taking theatres through a period of growth and sustainable change.&lt;/li&gt;\n&lt;li&gt;High standards and attention to detail in particular in relation to IPC practices.&lt;/li&gt;\n&lt;li&gt;Communication/organised/role model and display excellent patient care.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;For more information or to discuss the post please contact Jennifer Kearney, Associate Director of Clinical Services, Surgery on 01908 996298.&lt;/p&gt;\n&lt;p&gt;Interviews will be scheduled for either 18th November or 25th November.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120888.png", "name": "Milton Keynes University Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120888"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Surgery Division Triumvirate (Dept), Milton Keynes", "postalCode": "MK6 5LD"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.0264", "longitude": "-.735774"}}, "title": "Theatre Operational Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249629", "validThrough": "2020-11-13T23:59:59+0000"}