{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 pa - pa pro rata if part time"}}, "datePosted": "2020-10-16T15:32:04+0100", "description": "&lt;p&gt;The Specialised Supported Living Service is passionate about supporting adults with learning disabilities, who put the people we support first. We are seeking to recruit great support workers. Our main priority for this role is to find people with the right values, behaviours and attitudes – could that be you?&lt;/p&gt;\n&lt;p&gt;Our values are :&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are Caring. &lt;/strong&gt; We treat everyone with respect and kindness.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We have Integrity&lt;/strong&gt;. When we promise something, we don’t let people down.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We keep it simple. &lt;/strong&gt;We make it easy for the people we serve to achieve their goals.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If you do share our values we want you!&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The duties are varied and no two days are the same. The people we support are individuals and deserve to be treated as such. However as a general guide duties may include support with personal care such as bathing and domestic tasks such as cooking and cleaning as well as support with leisure activities. Most importantly we want you to make a difference to peoples lives.&lt;/p&gt;\n&lt;p&gt;The Specialised Supported Living Service supports adults in sixteen locations across Leeds. There are full time and part time vacancies&lt;/p&gt;\n&lt;p&gt;Successful candidates will have completed the Health and Social Care Level 2 NVQ/diploma or equivalent.&lt;/p&gt;\n&lt;p&gt;This post requires shift work as we provides support over a 24/7 basis. You must be able to work a variety of shifts including nightshifts, weekends and public holidays.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;In return for your skills and commitment will you receive-&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;A competitive progressive salary&lt;/p&gt;\n&lt;p&gt;Enhancements for unsocial hours worked&lt;/p&gt;\n&lt;p&gt;Comprehensive induction, training and development to increase your existing skill set&lt;/p&gt;\n&lt;p&gt;Individual Personal Development Plan and Career Progression&lt;/p&gt;\n&lt;p&gt;Excellent pension scheme available&lt;/p&gt;\n&lt;p&gt;27- 33 days annual leave, plus statutory bank holidays (pro rata)&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Refer a Friend&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Trust is offering a £500 bonus to substantive LYPFT staff that refer a friend for one of our permanent health support worker roles in the Supported Living Service.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;How it works &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you refer a friend who goes on to be appointed into a permanent Health Support Worker post in our Supported Living Service, you’ll receive a payment of £250 when they start and a further £250 when they’ve been in post for 12 months.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What to do&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Refer your friends to the vacancies on the NHS Jobs website so they can apply for a vacancy in the normal way. We will be in touch from there if they are successful in securing a role with us!&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Gill Galea&lt;/p&gt;\n&lt;p&gt;gill.galea@nhs.net&lt;/p&gt;\n&lt;p&gt;0113 85 50520&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122192.jpg", "name": "Leeds and York Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122192"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "All areas of Leeds, Leeds", "postalCode": "LS7 4JT"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8267", "longitude": "-1.52649"}}, "title": "Support Worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916230904", "validThrough": "2020-11-08T23:59:59+0000"}