{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "competitive salary plus benefits"}}, "datePosted": "2020-10-12T15:07:01+0100", "description": "&lt;p&gt;BMI Healthcare is the UK’s largest provider of independent healthcare.With a network of hospitals across the country, our aim is to attract the best nursing, theatre and allied healthcare professionals in addition to employing outstanding non-clinical and support staff who underpin everything we do.Being part of the wider BMI Healthcare group also offers the prospect for great career progression with opportunities throughout the UK.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;BMI Ridgeway Hospital in Wroughton, Swindon&lt;/strong&gt;is located within the North Wessex Downs, Area of Outstanding Natural Beauty with easily accessible transport links. We are a 45-bed hospital, a mix of main ward and day-care, with 3 operating theatres and a network of other departments supporting these areas.&lt;/p&gt;\n&lt;p&gt;Our physiotherapy department has the largest gymnasium in the BMI hospital group, an Aquatic Therapy pool, 6 individual private treatment cubicles and a Hand Therapy unit. We provide Pilates group sessions. We are a specialist centre for Women’s health.&lt;/p&gt;\n&lt;p&gt;We are proud to be a warm and friendly hospital with a real family atmosphere. Being apart of The Ridgeway Hospital means that you belong to a network of 58 hospitals and clinics across the UK and Scotland. We perform more complex surgery than any other private healthcare provider in the country.As a part of this network you will have access to a number of development opportunities and will work closely with a team of experienced professionals across the business. We have a professional working relationship with our consultants who are keen to discuss patient cases, offer their time to us for our CPD requirements and business growth plans.&lt;/p&gt;\n&lt;p&gt;We are seeking an experienced and motivated physiotherapist to join our team of clinicians in the Physiotherapy Department;&lt;strong&gt;the role is 30 hours and will cover a flexible working pattern.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will demonstrate good clinical skills and have a comprehensive knowledge of musculo-skeletal out-patients as well as orthopaedic post-operative patients and take an active role in our exciting teaching opportunities and development of physiotherapy assistants, supporting the hospitals to embed a culture of constant training and development from within.&lt;/p&gt;\n&lt;p&gt;A willingness to learn and teach others with a flexible approach is essential to maintain the excellent standards the hospital has.&lt;/p&gt;\n&lt;p&gt;We have an opportunity for a Physiotherapist to join their team of staff in thePhysiotherapy department.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;The ideal applicant should meet the following criteria:&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Degree in BSc Physiotherapy with preferably 2-3 years’ experience in MSK out-patients&lt;/li&gt;\n&lt;li&gt;Registered with the HCPC as a physiotherapist&lt;/li&gt;\n&lt;li&gt;Knowledge of Chartered Society of Physiotherapy Codes of Professional Conduct, Ethics and Performance and their implications for practice.&lt;/li&gt;\n&lt;li&gt;Knowledge of the Care Standards Act and Care and Quality Commission Requirements.&lt;/li&gt;\n&lt;li&gt;Maths, English GCSE at grades A to C or equivalent functional skills level 2 evidence.&lt;/li&gt;\n&lt;li&gt;Proficient in the use of a PC, including the use of software and systems&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Duties of this role include:&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Support the Physiotherapy team to deliver care that helps improve the health of the individual and wider community.&lt;/li&gt;\n&lt;li&gt;Support the team in demonstrating compassion through effective relationships based on empathy, respect and dignity.&lt;/li&gt;\n&lt;li&gt;Develop own competence to deliver effective care and treatments through improving clinical/technical knowledge / skill, and expertise.&lt;/li&gt;\n&lt;li&gt;Communicate appropriately with others involved in the care of the patient.&lt;/li&gt;\n&lt;li&gt;Act as an advocate for safeguarding patients, demonstrate courage to speak up when there are concerns about care.&lt;/li&gt;\n&lt;li&gt;Demonstrate commitment to improving care and the patient experience.&lt;/li&gt;\n&lt;li&gt;To facilitate the daily running of the pharmacy department, providing a safe and effective medicines management service to all patients, staff, consultants and customers.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Please see attached role profile for further detailed information on the responsibilities and accountabilities of this vacancy.&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Salary &amp; Benefits:&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The FTE salary for this exciting role is up to £31,875 per annum with an actual salary of £25,500.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;BMI Healthcare is committed to being a national living wage employer and offer a competitive starting salary alongside access to a wide range of employee benefits, including:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;BMI Healthcare Private Medical Scheme&lt;/li&gt;\n&lt;li&gt;Staff Pension Scheme&lt;/li&gt;\n&lt;li&gt;25 days holiday per annum&lt;/li&gt;\n&lt;li&gt;Free Parking&lt;/li&gt;\n&lt;li&gt;Discounted Gym Membership&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Interested?&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For an informal chat or more information please contact&lt;strong&gt;Mark Liefhebber on 01793 816053.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Safeguarding&lt;/span&gt;&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;BMI Healthcare is fully committed to safeguarding the welfare of all children and young people, and vulnerable adults by taking all reasonable steps to protect them from harm. All staff will receive appropriate training and induction so that they understand their roles and responsibilities and are confident about carrying them out.&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "BMI Healthcare", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=131874"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Swindon", "postalCode": "SE1 8ND"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5067", "longitude": "-.106401"}}, "title": "Physiotherapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916222917", "validThrough": "2020-11-15T23:59:59+0000"}