{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-10-28T16:00:58+0000", "description": "&lt;p&gt;We are delighted to be advertising this unique opportunity for a motivated and enthusiastic mental health nurse to join our community mental health team, covering the Newcastle-under-Lyme area of Staffordshire.&lt;/p&gt;\n&lt;p&gt;The team work within a motivated, supportive and enthusiastic Directorate. The is an existing post within our team, and the role will involve working as a mental health nurse, within our multi-disciplinary team, alongside doctors, psychologists, nurses, occupational therapists, support time recovery (STR) and health care support workers and our admin team.&lt;/p&gt;\n&lt;p&gt;The role will include supporting the management team, as well as being part of the developing, leading and delivering of specific treatment pathways and helping to maintain high standards within the delivery of the service. This is an exciting time for our team as we continuously develop more effective therapy based pathways, with a focus on recovery for our service users and the move towards locality based working. You will lead and work alongside our current mental health nurses and occupational therapists to develop these group and individual recovery focussed pathways. You will receive help and support from an extremely supportive and experienced team.&lt;/p&gt;\n&lt;p&gt;The Newcastle Adult Community Mental Health Team operates from its main base on the Bradwell Hospital Site which serves an identified catchment area within Newcastle and surrounding areas. Our centre is staffed from 9am until 5pm Monday to Friday.&lt;/p&gt;\n&lt;p&gt;The community mental health teams exist to support clients with identified Mental Health conditions using the CPA process of care delivery. Your role will involve you taking responsibility for a specific client group with nursing and mental health needs, using the CPA process to support this. This will involve you taking the role of care coordinator for selected individuals, where appropriate. You will assist clients through the Mental Health pathway on their journey to their recovery, visiting them in their own homes or other accommodation; so the ability to travel is essential. The role will require the delivery of a range of treatment interventions, care planning and risk managing, with the support of the multi-disciplinary team.&lt;/p&gt;\n&lt;p&gt;The community teams are embarking on a challenging journey of change and the appointed individual will need to be innovative, compassionate and motivated, have a passion to deliver individualised, person centred care and can make a positive contribution to service development. This is an opportunity to join our Community Mental Health Teams as we enter a time of modernisation and development of our services to meet the needs of local people. Support and interventions are delivered that are recovery focused and promote independence and resilience, and deliver high quality outcomes for service users and carers.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Kerrie Parton, Team Manager 03007900237 kerrie.parton@combined.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120881.jpg", "name": "North Staffordshire Combined Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120881"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Stoke-on-Trent", "postalCode": "ST5 7TL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.0387", "longitude": "-2.239"}}, "title": "Community Mental Health Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247292", "validThrough": "2020-11-11T23:59:59+0000"}