{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum"}}, "datePosted": "2020-11-02T14:31:26+0000", "description": "&lt;p&gt;The post holder has managerial and leadership responsibility for the effective operational running of all the Learning Disability Inpatient Services (inpatient and community), including Supporting the care closer to home repatriation programme. The Learning Disability Clinical Site Manager will have managerial responsibility for the effective operational running of a diverse portfolio that includes all learning disability inpatient beds, and leading the care closer to home repatriation. . The post holder will work with the Local multi-disciplinary leadership leads ensuring that patient flow is maximised, over the seven day period and plan contingencies for periods of high activity to ensure all teams are sufficiently staffed to support the learning disability system. In partnership with patients and their families define a person centered recovery approach to their care and treatment to facilitate a timely, safe, discharge. They will work with partners to realise the ambition of the North Wales Learning Disability Strategy, utilising a range of community assets to develop alternatives to admission and ensure there is a robust community treatment offer to treat people closer to home and expedite discharge where appropriate. The post holder will be experienced in learning disability assessment and treatment and have a good working knowledge of all clinical guidelines relevant to the setting. The post holder will practice within a legal and ethical framework as set out in relevant professional, legal and BCUHB policies and procedures. They will have a passion for driving the quality agenda and support the workforce to deliver quality standards within a financial and performance framework.&lt;/p&gt;\n&lt;p&gt;JOB PURPOSE&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To ensure the effective operation of the whole whole learning disability pathway&lt;/li&gt;\n&lt;li&gt;. To manage the whole learning disability pathway which consists of all ward environments, and this also includes the divisions out of area learning disability patients.&lt;/li&gt;\n&lt;li&gt;To ensure effective performance management and professional and clinical leadership of the workforce.&lt;/li&gt;\n&lt;li&gt;To ensure services are cost effective and delivered within budget.&lt;/li&gt;\n&lt;li&gt;To deliver effective leadership and learning disability clinical expertise to the Ward managers and the out of area learning disability patients&lt;/li&gt;\n&lt;li&gt;To be the learning disability clinical link for acute Services in East / West / Centre.&lt;/li&gt;\n&lt;li&gt;To lead change management in the implementation of service development strategies.&lt;/li&gt;\n&lt;li&gt;To create a culture in which innovative ideas and strategies can flourish and provide vision and inspiration to enable staff to deliver care more effectively.&lt;/li&gt;\n&lt;li&gt;To deliver robust financial management in line with BCUHB SFI’s and budget responsibility, including the realistic Cost Improvement Programmes.&lt;/li&gt;\n&lt;li&gt;To ensure services meet Welsh Government quality and performance management standards.&lt;/li&gt;\n&lt;li&gt;To represent BCUHB at external meetings with stakeholders when required.&lt;/li&gt;\n&lt;li&gt;Responsible for the management of complaints, workforce investigations and safeguarding alerts at the discretion of the Clinical Operational Manager and Head of Nursing within the prescribed timescales.&lt;/li&gt;\n&lt;li&gt;Ensuring robust mechanisms are in place for the investigation, monitoring and corrective action; including the development, dissemination and review of action plans within the service.&lt;/li&gt;\n&lt;li&gt;Responsible for and have delegated authority for planning effective roster management, organising, implementing and managing the delivery of nursing services to agreed activity levels, within budget, in line with the BCUHB Policies and Procedures and NMC Code of Professional Standards and Guidance.&lt;/li&gt;\n&lt;li&gt;Ensure that the BCUHB Governance, Human Resources and Financial Management are implemented and adhered to.&lt;/li&gt;\n&lt;li&gt;The post holder will be expected to participate in the on call rota.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; Welsh and/or English speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt;Closing Date: 16/11/2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact: Jonathan CrabbClinical Operational Manager - LD In Patients and ECRSJonathan.Crabb@wales.nhs.uk03000 852992&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123196.JPG", "name": "Betsi Cadwaladr University Local Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123196"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bryn Y Neuadd Hospital, Llanfairfechan", "postalCode": "LL33 0HH"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.2519", "longitude": "-3.98515"}}, "title": "Learning Disabilities Clinical Site Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252442", "validThrough": "2020-11-16T23:59:59+0000"}