{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "73664", "minValue": "63571", "unitText": "YEAR", "value": "£63,571/£73,664"}}, "datePosted": "2020-10-27T14:47:26+0000", "description": "&lt;p&gt;&lt;strong&gt;This new and exciting opportunity&lt;/strong&gt; has arisen within the Families, Young People and Children Directorate for the post of Head of Nursing FYPC and LD. We welcome interest from nurses from a wide range of specialities and would welcome those who have a particular interest in applications from nurses with experience in children’s nursing and/or mental health.&lt;/p&gt;\n&lt;p&gt;We require an enthusiastic, committed and motivated individual to provide inspirational leadership to our nursing workforce and lead on the quality and governance agenda within the directorate. The post holder, working at a strategic level, will require political astuteness, resilience and have a leadership style that reflects the Trust’s values. They will be a strong advocate for the nursing profession and service users and their families / carers to ensure they receive evidence-based, safe and effective care. The post holder will be expected to work with autonomy to provide highly professional and specialist advice to colleagues and the leadership team.&lt;/p&gt;\n&lt;p&gt;The post holder will work in our Senior Leadership Team and with the Executive Director and Deputy Director for Nursing, AHPs and Quality. This &lt;strong&gt;new and exciting role&lt;/strong&gt; will provide strong professional leadership for the nursing profession and lead the quality and clinical governance agenda. We welcome applicants with a drive for encouraging innovation and quality improvement across our services and health and social care system. This post provides an exciting opportunity to develop talent in our staff, promote inclusivity and ensure services develop genuine partnerships with families, children and young people. This post holder will be central to actively contributing to the delivery of the Trust’s quality agenda and lead on ensuring high standards of care to achieve the best possible outcomes for children and families across Leicester, Leicestershire and Rutland.&lt;/p&gt;\n&lt;p&gt;For an informal discussion about this role please contact Anne Scott on 07827 821759.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Leicestershire Partnership Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120650"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Leicester", "postalCode": "LE4 8PQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6765", "longitude": "-1.10301"}}, "title": "Head of Nursing FYPC and LD", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245054", "validThrough": "2020-11-24T23:59:59+0000"}