{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "63751", "minValue": "63751", "unitText": "YEAR", "value": "£63,751 (Pro-rata)"}}, "datePosted": "2020-11-02T15:38:03+0000", "description": "&lt;p&gt;&lt;strong&gt;About the role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;In this Clinical Lead, Agenda for Change role, you will join a wide ranging pool of clinicians from different professions, with the opportunity to guide and influence a team of Clinical Informaticians within and across NHS Digital maintaining a strategic overview of all areas of responsibility.&lt;/p&gt;\n&lt;p&gt;You will play a key role in shaping the safe delivery of national programmes to provide clear benefits for citizens and patients, and support clinicians to provide better care.&lt;br /&gt;&lt;br /&gt;Please note this role is available as a secondment or as a Fixed Term Contract for 12 months.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;strong&gt;As a Clinical Lead you will be responsible for:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;guiding and influencing the NHS Digital Clinical Governance Framework, working across services, programme and projects.&lt;br /&gt;&lt;br /&gt;&lt;/li&gt;\n&lt;li&gt;providing highly specialised clinical informatics advice and expertise to both clinical and non-clinical staff across assignments and organisations.&lt;br /&gt;&lt;br /&gt;&lt;/li&gt;\n&lt;li&gt;effective engagement with key stakeholders, professional communities and system users to ensure high quality clinical input into NHS Digital activities.&lt;br /&gt;&lt;br /&gt;&lt;/li&gt;\n&lt;li&gt;promoting the importance of clinical inputs, service user and patient inputs at all stages of clinical informatics projects and services.&lt;br /&gt;&lt;br /&gt;&lt;/li&gt;\n&lt;li&gt;leading investigations into significant incidents, and deliver clinical insights to reviews and lessons learnt.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;br /&gt;&lt;strong&gt;About you&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;Some of the key skills and experience you&#39;ll bring:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Registered and regulated health or care professional with high level specialist knowledge in a key area of practice, e.g. secondary care, pharmaceutical practice.&lt;br /&gt;&lt;br /&gt;&lt;/li&gt;\n&lt;li&gt;Master’s degree or equivalent level of knowledge gained through experience and be able to demonstrate expertise in a number of health care settings.&lt;br /&gt;&lt;br /&gt;&lt;/li&gt;\n&lt;li&gt;Evidence of continuous professional development.&lt;br /&gt;&lt;br /&gt;&lt;/li&gt;\n&lt;li&gt;Substantial post registration NHS/Social Care experience.&lt;br /&gt;&lt;br /&gt;&lt;/li&gt;\n&lt;li&gt;A trained and accredited clinical safety clinician with current application in practice.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;What we offer&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;In addition to a competitive salary with planned, transparent progression you can look forward to the following benefits:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Flexible working opportunities&lt;/li&gt;\n&lt;li&gt;27 days annual leave entitlement increasing with service&lt;/li&gt;\n&lt;li&gt;Buy and sell annual leave scheme&lt;/li&gt;\n&lt;li&gt;Contributory Pension (with a 20.6% contribution from us toward the cost of your pension)&lt;/li&gt;\n&lt;li&gt;A range of NHS Discounts covering, for example, shops, restaurants, gym, mobile phones and insurance&lt;/li&gt;\n&lt;li&gt;Employee benefit schemes which include Season Ticket Loan and Car Lease&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Please note this role has a London weighting allowance which is 20% of your salary subject to a minimum payment of £4,473 and a maximum payment of £6,890.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About us&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;We &lt;strong&gt;are &lt;/strong&gt;the national information and technology partner to the health and care system. Our task is to build and run excellent digital products and services that NHS and care staff across the country can rely on every day.&lt;br /&gt;&lt;strong&gt;&lt;br /&gt;Next steps&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Online video interviews are due to take place weeks commencing &lt;strong&gt;30th November&lt;/strong&gt;&lt;strong&gt;.&lt;/strong&gt; Applicants who are shortlisted will be contacted by email and invited to interview.&lt;/p&gt;\n&lt;p&gt;To view further information please see the attached role profile and to apply for the role click ‘Apply for job’ below.&lt;/p&gt;\n&lt;p&gt;We are unable to accept speculative CVs, all applications must be made through NHS Digital’s career site.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;If you have previously interviewed for this role (or a similar one) with NHS Digital and been unsuccessful, we encourage you to obtain feedback from your initial application to support your future career as we will not accept any further applications for a period of six months.&lt;/em&gt;&lt;/p&gt;", "employmentType": "OTHER", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121299.jpg", "name": "NHS Digital", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121299"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Leeds or London", "postalCode": "LS1 6AE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7953", "longitude": "-1.54374"}}, "title": "Clinical Lead, Agenda for Change, Band 8c", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252671", "validThrough": "2020-11-15T23:59:59+0000"}