{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 pa"}}, "datePosted": "2020-10-29T14:00:27+0000", "description": "&lt;p&gt;&lt;span&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Hospice at Home Nurse Co-ordinator&lt;/span&gt; &lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Band 6 -Part Time&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Location/Base Gateshead TBC&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Do you have the drive and passion for developing services and leading a team?&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Gateshead Care Partnership have introduced a new Hospice at Home Service. The new service comprises of a dedicated team of experienced support workers with support from Administration Assistants which is led by Band 6 Nurse Coordinator’s. This is part of Gateshead NHS Foundation Trust Community Business Unit and will has links to the Macmillan Team who are hospital and community based.&lt;/p&gt;\n&lt;p&gt;An opportunity has arisen to expand the Band 6 provision in the team.&lt;/p&gt;\n&lt;p&gt;The Hospice at Home service is a joint venture with streamlined interfaces between different care settings. The team provided high levels of personalised care to patients who wish to die at home.&lt;/p&gt;\n&lt;p&gt;The Band 6 Coordinator will maintain the delivery of high standards of clinical practice that hold patients and their families at the center to ensure that they receive safe, quality care that gives them a good experience. They shall work with Macmillan to ensure the team are delivering the six principles of End of Life care.&lt;/p&gt;\n&lt;p&gt;They are responsible for a designated case-load of complex patients referred to the service for domically end of life care and will ensure the day to day coordination of the Hospice at Home team. They assess patients referred to the service and facilitate urgent response to patient need in order that the patient can remain at home or have rapid discharge from hospital.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;You must be a Registered Healthcare Professional have substantial post registration experience gained within a relevant healthcare setting. Essential to this role is an understanding of community healthcare service provision, experience of managing a team and a passion for palliative care. In addition, you must have excellent communication, planning and networking skills, the ability to prioritise a busy workload and proficiency in the use of Microsoft Microsoft Office. Flexible working on occasions maybe required to meet with the workforce. The successful applicants will be subject to an enhanced DBS Check and must be eligible &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Contact name for informal discussion :&lt;/p&gt;\n&lt;p&gt;Tracey Cowper, Clinical Operational Manager, 0191 4977711&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121054.PNG", "name": "Gateshead Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121054"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Gateshead", "postalCode": "NE9 6SX"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.9389", "longitude": "-1.58106"}}, "title": "Hospice at Home Macmillan Nurse Co-ordinator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248609", "validThrough": "2020-11-12T23:59:59+0000"}