{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 - £19,337 Pro Rata Per Annum"}}, "datePosted": "2020-10-28T15:01:17+0000", "description": "&lt;p&gt;This is an exciting opportunity for enthusiastic individuals looking for a new challenge in health care, or someone looking at expanding on skills. You will assist with providing a range of cardiac and respiratory investigations on patients in our busy department at Bassetlaw Hospital, Worksop. These tests include electrocardiography, fitting and removal of ambulatory ECG/respiratory devices, spirometry as well as general administrative work.&lt;/p&gt;\n&lt;p&gt;A minimum of three GCSE’s or equivalent at grade 4 or above (grade C or above) are essential, including English Language, Maths and a Science subject. As the post involves a high level of patient contact you should have experience of working in a patient centred role within a hospital/healthcare environment along with a relevant healthcare focused level 2 qualification. It is vital you are computer literate as the post involves data input and retrieval. You should also have effective communication skills with the ability to multi-task and work as part of a team. You will be enthusiastic, professional, compassionate and competent with a willingness to contribute ideas to provide the very best patient-centred care.&lt;/p&gt;\n&lt;p&gt;You will be expected to study for an SCST Certificate in Electrocardiography. and ARTP Certificate in Spirometry.&lt;/p&gt;\n&lt;p&gt;Previous experience of working in a Cardio-Respiratory Department or other healthcare environment would be an advantage.&lt;/p&gt;\n&lt;p&gt;Although based primarily at Bassetlaw Hospital there will be an expectation to cover across sites. Working hours will be subject to review as the service develops, therefore a flexible approach is essential.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Mrs C Wright - Deputy Principal Clinical Physiologist, claire.wright37@nhs.net, (01909) 572761&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Doncaster and Bassetlaw Teaching Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120925"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bassetlaw Hospital, Worksop", "postalCode": "S810BD"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3177", "longitude": "-1.1099"}}, "title": "Cardio-Respiratory Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247085", "validThrough": "2020-11-11T23:59:59+0000"}