{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 Per Annum + 5% HCAS"}}, "datePosted": "2020-10-28T16:15:59+0000", "description": "&lt;p&gt;A post has been created for a permanent band 6 full time, enthusiastic Physiotherapist to join our integrated acute inpatient therapy team at Princess Alexandra Hospital Trust.&lt;/p&gt;\n&lt;p&gt;This will be a specialist post within our ED, Short Stay assessment wards, Frailty unit and the new Medical and Surgical assessment centre. The Medical and Surgical Assessment Centre will be a two-storey extension adjacent to the emergency department (ED) at the front of the hospital and next to Charnley Ward. This will improve the facilities available for our patients ahead of the completion of the new hospital&lt;/p&gt;\n&lt;p&gt;You will be supervised my our band 7 team lead physiotherapist, working alongside 2 other band 6’s and supporting our Band 5’s, Band 4’s and assistants.&lt;/p&gt;\n&lt;p&gt;You will be responsible for a clinical caseload involving complex case management and facilitating challenging discharges. You will work as part of an integrated therapy team providing an 8am – 8pm service.&lt;/p&gt;\n&lt;p&gt;You will be required to complete a twilight shift once a week and participate in the weekend and on call rotas (if you are not respiratory competent, training will be provided).&lt;/p&gt;\n&lt;p&gt;The Therapy service at the Princess Alexandra Hospital NHS Trust is an expanding, forward thinking and highly regarded service and this post offers excellent personal and professional development opportunities within an established and supportive team. We are working on initiatives to develop our services both through internal processes and through external links, having closer working relationships with our neighboring trusts through the STPs.&lt;/p&gt;\n&lt;p&gt;We need staff at to be integral part of the team, by&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Having a flexible approach to work&lt;/li&gt;\n&lt;li&gt;Being able to use own initiative, and thinking ‘outside the box’&lt;/li&gt;\n&lt;li&gt;Being a problem solver and able to both work independently, and motivate others&lt;/li&gt;\n&lt;li&gt;Taking responsibility&lt;/li&gt;\n&lt;li&gt;Being able to demonstrate a highly specialist knowledge and skill relating to the rotation&lt;/li&gt;\n&lt;li&gt;Supervising junior staff and students, enabling them to grow &amp; develop&lt;/li&gt;\n&lt;li&gt;Demonstrating a range of continuing professional development&lt;/li&gt;\n&lt;li&gt;Having an understanding of the changes within the NHS, the likely effects on the Physiotherapy Service and how physiotherapists can influence change&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameJennie HonourJob titleTeam Lead PhysiotherapistEmail addressjennifer.honour@nhs.netTelephone number01279 827199&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121503.PNG", "name": "The Princess Alexandra Hospital NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121503"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Princess Alexandra Hospital NHS Trust, Harlow", "postalCode": "CM20 1QX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7713", "longitude": ".086331"}}, "title": "Band 6 Physiotherapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247341", "validThrough": "2020-11-11T23:59:59+0000"}