{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 to £21,142 pa"}}, "datePosted": "2020-10-27T12:59:21+0000", "description": "&lt;p&gt;Skegness CMHT has an exciting opportunity for a senior healthcare support worker to join their team.&lt;/p&gt;\n&lt;p&gt;The CMHT provides assessment, care and treatment within the community for patients of working age with a severe and enduring mental illness diagnosis. As a senior healthcare support worker you would be expected to support recovery, promote independence and facilitate achievement of goals whilst working alongside the wider multi-disciplinary team, consisting of care coordinators, psychologists, doctor’s and peer support workers.&lt;/p&gt;\n&lt;p&gt;As a senior healthcare support worker some of your responsibilities will be required to support the patients to;&lt;br /&gt;• Regain and maintain their independence and confidence by supporting them to gain new skills.&lt;br /&gt;• To support recovery to live as independently as possible to reach their optimal mental health. &lt;br /&gt;• To build and maintain therapeutic relationships whilst maintaining boundaries. &lt;br /&gt;• To support patients to access the community such as to local groups and workshops as well as to medical appointments&lt;br /&gt;• To support patients to complete activities of daily living including personal care, budgeting, cooking and to do so independently or with appropriate social care packages in place.&lt;/p&gt;\n&lt;p&gt;You will also be involved in running activity and support groups at Holly Lodge, support facilitation of EFA group alongside psychology colleagues and have opportunities to support the running of the physical health clinic to ensure parity of esteem alongside physical health conditions.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be provided with a local induction on commencement of their role. There is monthly clinical supervision provided to all staff to aid development, knowledge and support. Regular management supervision will be provided and opportunities for continuing professional development within LPFT.&lt;/p&gt;\n&lt;p&gt;If you would like any further information or would like to meet to discuss this opportunity please contact Rachel Bradley, Team Manager on 01754 800200 option 2.&lt;/p&gt;\n&lt;p&gt;Please refer to the job description and person specification for additional information about this role.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120663.jpg", "name": "Lincolnshire Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120663"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Holly Lodge, 9 The Meadows, Lincoln Lane, Skegness", "postalCode": "PE25 2JA"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.1506", "longitude": ".317996"}}, "title": "Senior Health Care Support Worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244622", "validThrough": "2020-11-10T23:59:59+0000"}