{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 pa"}}, "datePosted": "2020-11-05T13:01:28+0000", "description": "&lt;p&gt;Buckinghamshire Healthcare NHS Trust is delighted to announce an opportunity for a part time (22.5 hours per week) Community Healthcare Assistant in the Rapid Response &amp; Intermediate Care (RRIC) team based in Winslow.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Do you have experience of working in Health and Social Care?&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Do you have a Level 3 Diploma in Health and Social Care (or equivalent)?&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Do you want a job where you can make a difference?&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This role involves working with Therapists and Nurses to support people to be as independent as they can in their own home in order to prevent unnecessary hospital admission and to support discharge from hospital. The team provides urgent assessments, rehabilitation and intermediate care to patients in their home environment. The post holder will work alongside colleagues following support plans to empower and enable patients to recover from illness or injury, maximise their independence and provide support to those at the end of life. We pride ourselves on the high quality compassionate care our team provides across the county.&lt;/p&gt;\n&lt;p&gt;These are some of the things our patients have said about us:&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;“Everyone was really supportive and helpful and gave me the confidence to manage things.”&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;“Somebody there to give me a boost and regain independence and confidence.”&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;“Great service. Very supportive and encouragement to achieve goals.”&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;“Very kind and supportive, given me the confidence to get back outside walking.”&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;Applicants must have previous experience working in a health or social care environment and working with a multidisciplinary team. Applicants must have a Level 3 Diploma in Health and Social Care or equivalent (e.g. NVQ Level 3 in Health and Social Care). This role requires excellent communication skills and the ability to work with a range of health professionals, patients and informal carers.&lt;/p&gt;\n&lt;p&gt;The community teams work shift patterns 7 days a week across a 24 hour period (with a dedicated night team) ensuring the delivery of services which can respond to the patients’ needs as and when required. The successful candidates will be expected to work shift patterns to cover the RRIC service hours which are between 8 am – 9 pm with regular rostered weekend working. &lt;br /&gt;&lt;br /&gt;Applicants must hold a valid driving licence and have access to a vehicle for work.&lt;/p&gt;\n&lt;p&gt;As an integrated organisation we are able to consider developmental opportunities across acute, community and specialist areas offering unique career development opportunities fully supported by our local health education institutes.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Helen Hallett, RRIC Clinical Lead North&lt;/p&gt;\n&lt;p&gt;Tel: 01296 711307 email: h.hallett@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Buckinghamshire Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120887"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Winslow Health Centre, Winslow", "postalCode": "MK18 3DP"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.9451", "longitude": "-.882053"}}, "title": "RRIC Community Healthcare Assistant - Winslow", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257761", "validThrough": "2020-11-19T23:59:59+0000"}