{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "32145", "minValue": "26152", "unitText": "YEAR", "value": "£26,152 - £32,145 pa, pro rata, incl HCAS"}}, "datePosted": "2020-10-24T08:00:52+0100", "description": "&lt;h2&gt;Staff Nurse - Elstead Short Stay Frailty Unit&lt;/h2&gt;\n&lt;p&gt;&lt;strong&gt;Band 5: £26,152 - £32,145 pa, pro rata, incl HCAS&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Permanent/Ful Time/Part Time&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for an enthusiastic, committed staff nurse who would like to join our new, dynamic and approachable team with a strong multi-disciplinary ethos.  Elstead ward is a 30 bedded short stay frailty unit recently opened here in the Division of Access and Medicine with a plan for extending with an additional AEC bed.&lt;/p&gt;\n&lt;p&gt;Specialising in care of the older frail person, Elstead is a short stay, 72 hour assessment and admission unit. We take direct admissions from ED, as well as transfers from EAU. We have a dynamic and enthusiastic team, centralised around holistic patient care with a multidisciplinary approach, focusing on timely CGAs (comprehensive geriatric assessments) and ensuring the patient receives the right care, in the right place, at the right time.&lt;/p&gt;\n&lt;p&gt;We are seeking to recruit Registered Nurses to work within the unit, who are passionate about older peoples care.   We can offer supportive and friendly environment where dedicated multidisciplinary teams deliver progressive and dynamic care for the Older Person.&lt;/p&gt;\n&lt;p&gt;No experience required, we will offer trainings needed. There will be opportunities for training and developing skills and knowledge in caring for older patients, dementia care and working with other members of multidisciplinary care.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If you would like any further information or wish to arrange a visit to the ward then please contact the Matron Laura Treacy on extension 6870 or Sr. Grace Angeles (Senior Sister) at extension 4085&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120970.jpg", "name": "Royal Surrey NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120970"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Guildford, Surrey", "postalCode": "GU2 7XX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.241", "longitude": "-.607442"}}, "title": "Staff Nurse - Band 5 - Elstead Ward", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241534", "validThrough": "2020-11-15T23:59:59+0000"}