{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Bank"}}, "datePosted": "2020-10-28T13:26:43+0000", "description": "&lt;p&gt;&lt;strong&gt;Main Duties and Responsibilities&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Responsibility to patient/client care&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Carries out complex standardised and non- standardised Hand Therapy assessments of physical &amp; functional ability, cognition, home situation and psychosocial issues.&lt;/p&gt;\n&lt;p&gt;Gains valid informed consent &amp; has the capacity to work within a legal framework with patients who lack the capacity to consent to treatment&lt;/p&gt;\n&lt;p&gt;Provides highly specialised Hand Therapy, including wound care, manual therapy and specialised splinting, in multiple settings according to patient need.&lt;/p&gt;\n&lt;p&gt;Works in areas where the environment may have artificial lighting, variable temperatures, poor ventilation and ergonomics.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Works with the possibility of exposure to body fluids, unpleasant smells, infections &amp; exposure to verbal or physical aggression, including patients displaying highly emotional and confrontational behaviours&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Sensitively deals with distressing or emotional circumstances regarding patient care e.g. communicating news of poor prognoses such as chronic pain management or life long disability or conveying news of realistic outcomes following injury or surgery&lt;/p&gt;\n&lt;p&gt;Provides education to patients, carers, relatives and other health care professionals in the management of the patient’s condition&lt;/p&gt;\n&lt;p&gt;Monitors, reviews and modifies treatment plans/goals to measure progress and ensure effective outcomes under the guidance of more experienced therapists as required&lt;/p&gt;\n&lt;p&gt;Reponsible for the safe manual handling of patients during mobility &amp; functional transfer&lt;/p&gt;\n&lt;p&gt;Provides one to one patient care or group work depending on individual requirements&lt;/p&gt;\n&lt;p&gt;Works as a sole practitioner in clinic locations as required&lt;/p&gt;\n&lt;p&gt;Respects the individuality, values, cultural &amp; religious diversity of patients &amp; contributes to the provision of a service sensitive to their needs&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Analysis and Judgement&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Demonstrates specialised clinical reasoning skills &amp; knowledge of evidenced based practice to underpin patient care&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Applies a good level of understanding of complex disability issues &amp; provides specialised advice, training, support &amp; information to patients and carers regarding aspect of Hand Therapy.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Demonstrates an ability to triage patients within the Hand Therapy service according to clinical need.&lt;/p&gt;\n&lt;p&gt;Identifies complex patient presentations and seeks assistance from senior team members as appropriate.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Communication&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Provides specialised information &amp; recommendations to the MDT with regard to patient management &amp; contributes to the MDT on issues surrounding patient management.&lt;/p&gt;\n&lt;p&gt;Liaises with other MDT professionals, other statutory organisations such as PCTs, Social Services, Housing, Education, and voluntary organisations effectively and as appropriate&lt;/p&gt;\n&lt;p&gt;Conforms to the Services’ standards of documentation and assists in the development of written information patient information&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Responsible for maintaining effective communication channels both within the hospital, eg. Consultants, the MDT, senior colleagues and managers, as well, as external agencies e.g. community services, statutory /voluntary organisations in relation to specific patient cases&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Responsible for providing proficient communication with patients and others in challenging situations e.g. patient with communication difficulties&lt;/p&gt;\n&lt;p&gt;Promotes the role of Hand Therapist within the MDT&lt;/p&gt;\n&lt;p&gt;With support, provides reports for legal purposes as required&lt;/p&gt;\n&lt;p&gt;Provides formal and informal teaching to more junior team member&lt;/p&gt;\n&lt;p&gt;The job description is not intended to be exhaustive and it is likely that duties may be altered from time to time in the light of changing circumstances and after consultation with the post holder.&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "University College London Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120731"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "University College London Hospital", "postalCode": "NW1 2BU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5249", "longitude": "-.136987"}}, "title": "Bank Senior Hand Therapist OT/PT Band 6", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246763", "validThrough": "2020-11-27T23:59:59+0000"}