{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "33660", "minValue": "33660", "unitText": "YEAR", "value": "Up to £33660 - depending on experience"}}, "datePosted": "2020-10-19T07:53:13+0100", "description": "&lt;p&gt;&lt;strong&gt;Break into prison healthcare!&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Practice Plus Group are the Health in Justice Market leader, providing healthcare services to offenders across the country. Our model of care is our Wellbeing Approach – an integrated, comprehensive approach in recognition of the fact prisoners are a socially-excluded group with healthcare needs which are complex and often associated with poor outcomes. It adopts the premise no single health/wellbeing factor can be taken in isolation of other motivational issues which might impact a person’s care.&lt;/p&gt;\n&lt;p&gt;To ensure the continued quality of care at HMP YOI Doncaster, we’re looking for a Substance Misuse Nurse to join our team.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the Job&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As a Substance Misuse Nurse, you must be able to carry out comprehensive assessments, initiate and review individual recovery plans and confidently communicate the full range of treatment options available to service users. You must have an understanding and commitment to recovery and a person centred approach. Across everything you do, you’ll maintain accurate records and provide the kind of helpful, empathetic support that will make every patient feel at ease.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Job Requirements&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As an RGN/RMN 1 with valid NMC registration and preferably RCGP 1-2 in Substance Misuse, you’ll have experience of working with substance misusers, with the ability to work autonomously; with sound clinical/substance misuse knowledge. We’ll want to see evidence of your continued professional development, and a real passion for taking your skills even further.&lt;/p&gt;\n&lt;p&gt;It goes without saying that you’ll have a solid understanding of health and safety, along with exemplary record keeping skills. Self-motivated, you’ll show plenty of initiative when it comes to handling a wide range of situations. Beyond that, you should have a flexible approach and the ability to achieve changing priorities.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Additional Information&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is a full-time role, working 37.5 hours per week. The salary for this role is up to £33,660 per annum - dependent on experience. We also welcome part-time and bank applications.&lt;/p&gt;\n&lt;p&gt;Please note that this role is subject to Practice Plus Group Terms &amp; Conditions and offers of employment are subject to receipt of satisfactory references, enhanced DBS check and prison vetting.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Practice Plus Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130136"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Doncaster", "postalCode": "DN5 8UX"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5259", "longitude": "-1.14584"}}, "title": "Substance Misuse Nurse - HMP YOI Doncaster", "url": "https://www.jobs.nhs.uk/xi/vacancy/916231465", "validThrough": "2020-11-16T23:59:59+0000"}