{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 to 110,683 per annum"}}, "datePosted": "2020-10-23T12:01:25+0100", "description": "&lt;p&gt;LOCUM CONSULTANT IN ACUTE MEDICINE&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;London North West Healthcare NHS Trust is seeking to appoint enthusiastic and passionate Consultants in Acute Medicine to join our dynamic and innovative team. This is an exciting and unique opportunity to work in a fast-paced and well-supported environment where delivering excellent patient care is at the heart of our service. We are seeking two colleagues to join the team based at Northwick Park Hospital, initially on a locum basis.&lt;/p&gt;\n&lt;p&gt;London North West University Healthcare NHS Trust is one of the largest integrated care Trusts in the country bringing together hospital and community services across the boroughs of Brent, Harrow and Ealing. Our 9,000 staff serve a diverse population of approximately 850,000. The Trust was established in October 2014 following the merger of The North West London Hospitals NHS Trust and Ealing Hospital NHS Trust and has an annual budget of over £640 million.&lt;/p&gt;\n&lt;p&gt;Northwick Park is a Major Acute Hospital with a busy medical take and an established reputation for patients presenting with a very wide range of medical conditions with a high degree of acuity. Recognition of the vital role that is played by Acute Medicine has seen the Trust make a substantial investment in the service. This will enable the department to develop three Acute Medical Unit wards (on a phased approach) with patients remaining under the care of the acute team for their duration on the unit. In addition the team runs the award-winning Ambulatory Emergency Care Unit and the well-established Medical High Dependency Unit. Participation in HDU will be optional dependent on previous experience and competencies.&lt;/p&gt;\n&lt;p&gt;The post holders will join six acute medicine consultants, fourteen acute/specialty consultants and thirty-three specialty medical consultants who together are responsible for providing the acute and general internal medicine service at Northwick Park Hospital.&lt;/p&gt;\n&lt;p&gt;The Trust is a cross site organisation and in some areas this may ultimately lead to cross site working where there is a demonstrable benefit for patients and/or staff. Any changes in working patterns would be reflected through the appropriate formal job planning process.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Sarah Ingham, General Manager on 07876590703 or via email at sarah.ingham1@nhs.net&lt;/p&gt;\n&lt;p&gt;Dr Rachel Tennant, Clinical Director for Acute Medicine on 07748635874 or via email at rachel.tennant@nhs.net&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120623.png", "name": "London North West University Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120623"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Northwick Park Hospital, London", "postalCode": "HA1 3UJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5751", "longitude": "-.322459"}}, "title": "Locum Consultant in Acute Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240430", "validThrough": "2020-11-22T23:59:59+0000"}