{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pa pro rata"}}, "datePosted": "2020-10-22T09:00:35+0100", "description": "&lt;p&gt;&lt;span&gt;&lt;span&gt;With a strong emphasis on the sharing of health and care information across the community, UHBW’s digital vision is for all staff to have access to the information they need, when they need it, without having to look for a piece of paper, wait for a computer or ask the patient again. Our recognition as a &#39;Global Digital Exemplar&#39; brings the resources to realise this vision, by implementing digital technologies that will help us to transform the way we work and how we relate to our colleagues, patients and partner organizations. We are now looking for an enthusiastic health informatics professional to join our Digital Services team as a Business Intelligence SQL Developer to help us deliver on these information driven goals for improving patient care. Our ambitions as a Global Digital Exemplar to make UHBW one of the country’s leading digital hospitals within a health and care community that has embraced integrated digital working at a fundamental level.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Amongst your skills and expertise you will have experience with SQL, a proven record of working with data and improving data quality. You will also need to be extremely well organized, energetic and enthusiastic, and a good team player. If this is you, and you like the idea of helping to make digital happen in Bristol and Weston, we look forward to hearing from you.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameMatthew RogersJob titleHead of Business and Clinical Intelligence SystemsEmail addressmatthew.rogers@uhbw.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120778.png", "name": "University Hospitals Bristol and Weston NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120778"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southwell Street, Bristol", "postalCode": "BS2 8EJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.46", "longitude": "-2.59923"}}, "title": "Business Intelligence SQL Developer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916237635", "validThrough": "2020-11-08T23:59:59+0000"}