{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 to £24,157 per annum/pro-rata"}}, "datePosted": "2020-11-04T10:15:56+0000", "description": "&lt;p&gt;The Oxford Cognitive Health Clinical Research Facility (CRF) was established in 2011, specifically designed to support research studies primarily in areas of mental health and neurosciences. A variety of research studies are currently utilising the facility from National Institute of Health Research (NIHR) and other grant funded studies through to commercial clinical trials. Studies include observational cohort studies through to CTIMPs, covering a wide variety of disease indications from healthy volunteers to those suffering from specific conditions such as schizophrenia, depression and dementia.&lt;/p&gt;\n&lt;p&gt;OHFT has succeeded in being awarded significant funding from the National Institute for Health Research (NIHR) to support infrastructure for experimental medicine, including renewed funding for the CRF and a new Biomedical Research Centre (BRC) in partnership with the University of Oxford.&lt;/p&gt;\n&lt;p&gt;We are looking for an enthusiastic Research Nursing Assistant / Nurse Associate to join our team at the NIHR Oxford Cognitive Health Clinical Research Facility (CRF), at the Warneford Hospital site. The successful candidate will work collaboratively with the wider multi-disciplinary team to support clinical trials and research studies undertaken within the CRF.&lt;/p&gt;\n&lt;p&gt;Your portfolio will have a mental health focus and your role will involve supporting research protocol delivery tasks including recruitment, information and monitoring of study participants, collection and processing of biological samples (including blood and tissue samples) and accurate data collection and management, under the supervision of a Clinical Research Nurse.&lt;/p&gt;\n&lt;p&gt;The role requires the post-holder to develop and maintain a working knowledge of study protocols and their application in practice, enabling them to deliver research activity in compliance with the local, national and international research regulations. This post would suit someone with a background in healthcare. Clinical experience within the field of mental health is desirable, but not essential.&lt;/p&gt;\n&lt;p&gt;This role provides opportunities for professional development and gaining experience and knowledge in the field of mental health and neuroscience clinical research. This includes training in cognitive/psychiatric/neuropsychological assessments, lab processes, ECGs, and venepuncture. As a development role, this post would be ideal for those interested in choosing a career pathway in clinical research.&lt;/p&gt;\n&lt;p&gt;The ability to work confidently under supervision is essential.&lt;/p&gt;\n&lt;p&gt;For further information, please contact Claudia Hurducas, CRF Manager / Research Delivery Manager, claudia.hurducas@oxfordhealth.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Oxford Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122233"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Clinical Research Facility, Warneford Hospital, Oxford", "postalCode": "OX3 7JX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7508", "longitude": "-1.2223"}}, "title": "CRF Research Nursing Assistant / Nurse Associate", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255327", "validThrough": "2020-11-18T23:59:59+0000"}