{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-11-03T14:30:47+0000", "description": "&lt;p&gt;Contract: Fixed term 12 months&lt;/p&gt;\n&lt;p&gt;Hours per week: 37.5&lt;strong&gt;&lt;br /&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This post is offered as fixed term for 12 months or as a secondment to internal members of staff at York Teaching Hospital. If you are seeking a secondment, you must seek permission from your current line manager.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for an experienced and dynamic Specialist Nurse, with excellent knowledge and clinical skills to join our existing Rapid Diagnostic Centre Team.&lt;/p&gt;\n&lt;p&gt;You will be responsible for the assessment and triage of patients referred into the Rapid Diagnostic Centre/Serious Non Specific Vague Symptoms Cancer Pathway. The post holder will work closely with the lead clinician in receiving new patients referred from GP’s, and use advanced nursing knowledge to competently assess and triage each patient. The post holder must possess excellent communication skills, and be able to confidently support patients with suspected and/or diagnosed cancer throughout the RDC pathway.&lt;/p&gt;\n&lt;p&gt;The post holder should be someone who is passionate about cancer services and delivering improved patient outcomes. They will be expected to work collaboratively with other MDT members, and actively contribute to the development of this growing service. It is expected that the successful applicant will be able to demonstrate relevant experience and post qualification training appropriate to this post. You will support the Lead SNSS CNS and Clinical Lead to continue to shape and deliver the RDC service throughout the York, Scarborough and Ryedale District.&lt;/p&gt;\n&lt;p&gt;The post offers an excellent and exciting opportunity to develop clinical leadership expertise, and will allow scope for personal and professional development within a friendly and supportive environment.&lt;/p&gt;\n&lt;p&gt;The post holder will be based at Scarborough Hospital, but expected to work across sites at York Hospital on an agreed rota. There may also be opportunities to work remotely.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;oanne Clark&lt;/p&gt;\n&lt;p&gt;joanne.clark@york.nhs.uk&lt;/p&gt;\n&lt;p&gt;07812512039 Monday - Friday only&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;It&#39;s not just the area that&#39;s a great draw. In addition, as a member of our team you’ll have access to one of the most generous and comprehensive pension schemes in the UK, a minimum of 27 days annual leave (on top of Bank Holidays) and an award-winning package of staff benefits (see link on the right).&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "York Teaching Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120856"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Scarborough", "postalCode": "YO12 6QL"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.2817", "longitude": "-.434723"}}, "title": "Specialist Nurse for Rapid Diagnostic Centre/Vague Symptoms Pathway", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254350", "validThrough": "2020-11-17T23:59:59+0000"}