{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005-£19,337 PA pro rata"}}, "datePosted": "2020-11-05T11:16:26+0000", "description": "&lt;p&gt;&lt;strong&gt;Band 2 Nursing Assistant &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Specialist Ambulatory Surgery and Diagnostics Central Treatment Suite at UHNS Full/Time Part Considered .&lt;br /&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for innovative Band 2 Nursing Assistant in Central Treatment Suite at UHNS.&lt;/p&gt;\n&lt;p&gt;The successful applicants will be expected to have previous experience of working in a relevant clinical environment. These roles involve work subject to COSHH regulations and a high level of manual handling Phlebotomy skills essential&lt;/p&gt;\n&lt;p&gt;The University Hospital of North Midlands NHS Trust is one of the largest Hospital Trusts in the country. Its 10,000 workforce provide a full range of emergency treatment, planned operations and medical care from the two hospitals in Stafford and Stoke on Trent.&lt;/p&gt;\n&lt;p&gt;Both the Royal Stoke University Hospital in Stoke and the County Hospital in Stafford are going through exciting positive development and change, at the moment.&lt;/p&gt;\n&lt;p&gt;“The surgical division encompasses Critical Care, Theatres and recovery, Central Treatment Suite, day case surgery, SAU (Surgical Assessment Unit) and SACU (Surgical Ambulatory Care Unit) and inpatient wards across both sites. The directorates within the division comprise a vast complement of surgical specialities: general surgery, gynaecology, urology, upper GI, colorectal, bariatric surgery, vascular surgery, ENT, breast, plastic surgery, ophthalmology, oral and maxillo-facial surgery.&lt;/p&gt;\n&lt;p&gt;Critical care is a dedicated 40 bedded state of the art facility and because the Trust is one of the 3 Major Trauma Centres in the West Midlands our team provides care for seriously ill patients across a range of medical and surgical specialities including neurosurgery and cardiothoracic. We also have a Surgical Special Care Unit (SSCU) which admits elective and emergency surgical patients requiring level 2 care.&lt;/p&gt;\n&lt;p&gt;The surgical division prides itself on having dedicated, enthusiastic, highly skilled and quality driven staff; we believe all our wards are welcoming, clean, organised and happy places to work. We have a dedicated education nurse who will support you as you become a member of the team, helping you to complete any competences and will provide you with access to any education sessions and a bespoke surgical division induction programme. Patient safety is our priority and we strive to provide safe and high quality patient care. If you are dynamic and have the passion and drive to achieve excellence in patient care the division look forward to welcoming you.&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Are you interested in becoming a Nursing Assistant and deliver first class patient care?&lt;/li&gt;\n&lt;li&gt;Are you compassionate, reliable, motivated and ready for a challenge?&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;If so, we are looking to recruit motivated and enthusiastic Nursing Assistants to join our dynamic and friendly teams and provide safe and supportive care to patients, relatives and their loved ones. In this post you would be responsible for providing fundamental elements of patient care as directed by the qualified nursing/midwifery team to ensure our patients receive the highest standard of dignified and respectful care, in accordance with their care plans. We are looking for people who are compassionate and feel passionately about providing a level of care they would wish for their family and friends.&lt;/p&gt;\n&lt;p&gt;These posts are linked to the Career Development Pathway.&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Successful applicants who fulfil the essential qualifications/skills on the person specification/job description will be offered a Band 2 Nursing Assistant substantive post.&lt;/li&gt;\n&lt;li&gt;Successful applicants who do not fulfil the essential qualifications/skills on the person specification will be offered a role as a Nursing Assistant on the Apprentice Pathway (On successful completion of training you will move to Band 2). Both posts will be subject to terms and conditions.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The successful applicants will either be based at Royal Stoke University Hospital or County Hospital, Staffordshire (maybe required to work at either Hospital). As provision of care is a 24 hours, 7 days a week career, you will be required to work shifts, including nights, weekends and bank holidays. Enhancements will be paid for unsocial hours.&lt;/p&gt;\n&lt;p&gt;The successful candidates on the Apprentice Pathway will be required to complete a training competency package, which involves completion of the Care Certificate and enrolment onto the CQF/NVQ Level 2 qualification in care, of which you will receive 1 day/week study leave and peer mentorship during this period, all whilst being paid a competitive salary. Pay increase to Band 2 is subject to completion of Care Certificate, specific competencies and subject to satisfactory sign off from the Ward manager.&lt;/p&gt;\n&lt;p&gt;Appointments to the post will commence at the lowest salary point, respectively, unless confirmed otherwise by HR Employment Services.&lt;/p&gt;\n&lt;p&gt;Please note that the application process for these posts will close when sufficient applications are received.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please contact Phyllis Dunn Clinical Lead Nurse on 01782672769 or 0178267271&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Phyllis Dunn CLN&lt;/p&gt;\n&lt;p&gt;Sylvia Haysted Deputy&lt;/p&gt;\n&lt;p&gt;Angela Johnson Deputy&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University Hospitals of North Midlands NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122653"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "UHNM, Newcastle-under-Lyme", "postalCode": "ST4 6QG"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.004", "longitude": "-2.21487"}}, "title": "Nursing Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257417", "validThrough": "2020-11-08T23:59:59+0000"}