{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615"}}, "datePosted": "2020-10-26T17:03:09+0000", "description": "&lt;p&gt;&lt;strong&gt;Cognitive Behaviour Therapy Trainee &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Children and Young Peoples Improving Access to Psychological Therapies (CYP IAPT)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours: One-year fixed-term training post. &lt;/strong&gt;Full Time only (due to University course commitments).&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location: &lt;/strong&gt;Shropshire – Telford and Shrewsbury.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This is a one-year fixed term training post forRegistered Mental Health Nurses Social Workers, Allied Health Professionals, and Psychological Therapists with post registration experience to work as Trainee-CBT Practitioner in our exciting new partnership Bee u service &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This post includes both working with in the Bee U service and committing to all aspects of the Post-Graduate Diploma course in Cognitive Behavioural Therapy (CBT). The training is run in collaboration with the University of Derbyshire as part of Children and Young People Improving Access to Psychological Therapies (CYP-IAPT)&lt;br /&gt; &lt;br /&gt; The successful candidates will be working as Community Mental Health Practitioner within the Bee U service for the duration of the one year course and would split their time between training and carrying out direct clinical work in service. After the fixed term training contract ends applicants would be encouraged to apply for any vacant posts within the services or local partner agencies. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The CBT course provides a thorough and robust cognitive behavioural theoretical base with particular focus on the protocols with the soundest evidence. In addition to providing practical, intensive and detailed skills training to facilitate skill development to a defined standard of competency, the course will aim to increase trainees’ knowledge base of theory and research in CBT and to promote a critical approach to the subject. It will aim to equip trainees to become skilled, creative and independent CBT practitioners who appropriately value and adhere to treatment protocols with fidelity. We provide a BABCP level 2 postgraduate diploma in CBT.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;The training involves teaching blocks as well as weekly teaching and supervision days at the University of Derbyshire. Applicants must be willing to travel owever training may be provied online due to the current pandemic.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Course Entry requirements&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Postgraduate Diploma in Evidence-Based Psychological treatments for C&amp;YP (CBT route)&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Academic &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Relevant Honours Degree graded at 2.2 or above &lt;strong&gt;&lt;em&gt;or&lt;/em&gt;;&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;Successful completion of pre-entry essay, which is marked at Masters level, prior to acceptance on training programme.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;span&gt;Professional &lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Core profession as defined by BABCP. , &lt;strong&gt;&lt;em&gt;or&lt;/em&gt;&lt;/strong&gt;;&lt;/li&gt;\n&lt;li&gt;Completion of KSA (Knowledge, Skills and Attitudes) portfolio.&lt;/li&gt;\n&lt;li&gt;Membership of the BABCP if undertaking the KSA route.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;NOTE: &lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;span&gt;Applicants must have a relevant degree and/&lt;em&gt;or&lt;/em&gt; a core profession.&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Students cannot be accepted onto any training programme if they are currently undertaking studies elsewhere or registered with another university.&lt;/span&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The clinical work involves being part of a multi-disciplinary team and successful candidates will carry their own caseload of CBT training cases. Workplace supervision will be provided weekly in addition to supervisory support at University.&lt;/p&gt;\n&lt;p&gt;Please note in this instance the course is not optional; there will be a joint interview with the University of Derbyshire / CYP IAPT Midlands collaborative to appoint to this role. The role are dependent on meeting all course requirements.&lt;/p&gt;\n&lt;p&gt;All applicants will need to be available to start the training in January2021&lt;/p&gt;\n&lt;p&gt;For further information please contact&lt;/p&gt;\n&lt;p&gt;Sherryn Ravenscroft&lt;/p&gt;\n&lt;p&gt;Sherryn.ravenscroft@mpft.nhs.uk&lt;/p&gt;\n&lt;p&gt;0300 124 0093&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Midlands Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121040"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Shropshire", "postalCode": "SY1 4RQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.7275", "longitude": "-2.71977"}}, "title": "Trainee Cognitive Behaviour Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243541", "validThrough": "2020-12-06T23:59:59+0000"}