{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 gross per annum"}}, "datePosted": "2020-10-29T13:42:35+0000", "description": "&lt;p&gt;Rose Ward at the Julian Hospital is looking to recruit a Staff Nurse to support patients with a dementia diagnosis and complex mental health and physical health needs.&lt;/p&gt;\n&lt;p&gt;Would you like to enjoy the support of a robust management team consisting of a CTL ward manager and two already in post experienced Charge Nurses?&lt;/p&gt;\n&lt;p&gt;Would you like to join and support a team that has consistently received &quot;Good&quot; ratings from the CQC inspections over the previous three years?&lt;/p&gt;\n&lt;p&gt;Would you like to become involved with the many project groups that all our staff are involved with to promote the standards that we expect which support our patients, families and carers?&lt;/p&gt;\n&lt;p&gt;Are you looking to develop your leadership skills, undertaking on the job training as well as completing a Band 6 development portfolio? Our line management profile is consistently 100% every month as we believe supporting our staff is key to job role satisfaction. Feeling valued with autonomy and respect.&lt;/p&gt;\n&lt;p&gt;Would you like to regularly feel that you have made a positive difference to our patients, their families and carers?&lt;/p&gt;\n&lt;p&gt;Do you understand the complexities of dementia related illness and the physical health needs of patients that we support? We will ensure that you receive the training and time to update yourself with this necessary knowledge base that is unique to this field of nursing.&lt;/p&gt;\n&lt;p&gt;If the answer to any of the above is &#39;yes&#39; then please apply or contact us for a tour around our ward which we are very proud of. See for yourselves the excellent standards of care that we provide.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Benefits &lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Benefits included with this role are:-&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;NHS pension&lt;/li&gt;\n&lt;li&gt;a comprehensive in house &amp; external training programmes&lt;/li&gt;\n&lt;li&gt;career progression&lt;/li&gt;\n&lt;li&gt;starting annual leave of 27 days per annum increasing to 33 days pa based on length of service (plus paid bank holidays)&lt;/li&gt;\n&lt;li&gt;staff physio service&lt;/li&gt;\n&lt;li&gt;NHS discounts and many more.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We are working hard to maintain usual recruitment process however please be aware that we may ask you to be interviewed via MS Teams rather than in person. Please also bear with us as we endeavour to recruit as many people as we can in unprecedented times.&lt;/p&gt;\n&lt;p&gt;Please find attached our Job Description and Person Specification for more detail on your Key Accountabilities, then if you feel you have what it takes to make a difference in your local communities, click APPLY!&lt;/p&gt;\n&lt;p&gt;Interviews are to be confirmed, candidates may only be given a minimum of 3 days’ notice, please note this date is provisional and may be subject to change. You will be contacted via email and invited to book a time. These emails may go to your SPAM, so please keep checking all your emails if applying.&lt;/p&gt;\n&lt;p&gt;Please visit our Facebook and Twitter page @NSFTjobs&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact: Name: Mark Lee Job title: Clinical Team Leader Email address: mark.lee@nsft.nhs.uk Telephone number: 01603978322&lt;/p&gt;\n&lt;p&gt;CTL Mark Lee - 01603878322&lt;/p&gt;\n&lt;p&gt;CN Axl Redwine / CN Kirsty Robins - 01603978305&lt;/p&gt;\n&lt;p&gt;Ward Admin - 01603 978305&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121326.png", "name": "Norfolk and Suffolk NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121326"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "HAMMERTON COURT, NORWICH", "postalCode": "NR2 3TD"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.633", "longitude": "1.26303"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248529", "validThrough": "2020-11-15T23:59:59+0000"}