{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 pa"}}, "datePosted": "2020-11-02T14:45:22+0000", "description": "&lt;p&gt;An opportunity has arisen to join the Neurosurgery, Pain, Anaesthesia, Critical Care &amp; Neuropathology Divisional Management Team at The Walton Centre NHS Foundation Trust as an Operational Service Manager.&lt;/p&gt;\n&lt;p&gt;Permanent 37.5 hrs per week&lt;/p&gt;\n&lt;p&gt;The Walton Centre is the UK’s only standalone neurosciences NHS Trust, delivering a range of specialist services to a population of 3.5 million people across Merseyside, Cheshire, Lancashire, the Isle of Man and North Wales. It was named as one of the top 100 healthcare employers by the HSJ and Nursing Times and has received and Outstanding rating by CQC in 2016 and again in 2019.&lt;/p&gt;\n&lt;p&gt;The purpose of this role to provide management support across a broad range of day to day operational activities within the division. Support the Divisional Manager in the delivery of divisional objectives and performance targets.&lt;/p&gt;\n&lt;p&gt;We are looking for an experienced, highly motivated and credible operational manager who is an effective team player and an excellent communicator. You will provide leadership for junior members of staff within the Division, actively supporting the day to day running of the Division in addition to contributing to improvement projects and ensuring the Division is able to develop and deliver strategic and operational objectives.&lt;/p&gt;\n&lt;p&gt;As a key member of the Divisional Management Team, you will work in partnership with the Service Managers for Neurosurgery and Pain and associated clinical staff to ensure that all key objectives are delivered. You will have a proven ability to engage teams, forge strong relationships across the nursing, medical and allied health professions throughout the Division to continually improve operational performance.&lt;/p&gt;\n&lt;p&gt;You will be supported to continue your professional development, and undertake suitably appropriate training and qualifications, as well as gaining experience in specialist areas, enhancing your skillset and preparing you for future development opportunities.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits please contact:&lt;/p&gt;\n&lt;p&gt;Emma Denby 0151 556 3670 emma.denby@thewaltoncentre.nhs.uk or&lt;br /&gt;Rebekah Phillips 0151 556 3671 rebekah.phillips@thewaltoncentre.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120725.JPG", "name": "Walton Centre NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120725"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Liverpool", "postalCode": "L9 7LJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4665", "longitude": "-2.93093"}}, "title": "Operational Service Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252470", "validThrough": "2020-11-16T23:59:59+0000"}