{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 pa Pro Rata"}}, "datePosted": "2020-10-28T08:45:00+0000", "description": "&lt;p&gt;&lt;strong&gt;‘Best OT Team I have ever worked with’ &lt;/strong&gt;(Comment from previous staff)&lt;/p&gt;\n&lt;p&gt;An opportunity has arisen for an experienced Occupational Therapist to join our innovative and friendly in-patient team at Leighton Hospital, for a fixed term period.  We are looking for an enthusiastic and well-rounded HCPC registered Occupational Therapist with experience of working in the NHS. You will be required to work across the in-patient wards, including stroke, rehabilitation, Emergency Department, medical wards and orthopaedics.   Previous experience of working within these areas is preferable, as is completion of band 5 rotations across a variety of settings. &lt;/p&gt;\n&lt;p&gt;The candidate should be self-motivated with excellent communication skills and the ability to work both autonomously and within the Occupational Therapy team and wider MDT.&lt;/p&gt;\n&lt;p&gt;Organisation and time management skills are key to efficiently managing caseloads. You will provide a patient centred approach to care, under pinned by sound clinical knowledge in evidence based assessment and management of a variety of conditions.&lt;/p&gt;\n&lt;p&gt;You will be expected to mentor/supervise newly qualified occupational therapists, assistants and students, therefore appropriate Clinical Educator and Clinical Supervision experience is preferable.&lt;/p&gt;\n&lt;p&gt;The occupational therapy team is a friendly and supportive team with a structure in place to support supervision and professional development. Staff are encouraged to contribute to service development through participation in audit and service improvement projects both on a uni-disciplinary and interdisciplinary basis.&lt;/p&gt;\n&lt;p&gt;Full or part time working will be considered.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What we offer in return:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;On commencing the role you will have a full induction. We offer regular supervision, setting individual objectives, promoting self-analysis/reflection and development. All staff irrespective of their post will be given equal opportunity to undertake a full variety of CPD to support and develop them in their role.&lt;/p&gt;\n&lt;p&gt;Service development and innovation is strongly encouraged alongside participation in audit and research. Flexible working environment and paid annual leave entitlement.&lt;/p&gt;\n&lt;p&gt;You will have a recognised degree in Occupational Therapy, HCPC registration, a full UK driving licence and access to a vehicle, or be able to demonstrate means of meeting the travel requirements of this post.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Clear reasoning for wishing to work for the Occupational Therapy Service should be detailed in the application.&lt;/p&gt;\n&lt;p&gt;Appointment to the post will be subject to successful interview, references, CRB and Occupational Health checks.&lt;/p&gt;\n&lt;p&gt;Should you wish to know more about the post then please do not hesitate to contact Nicky Walker in the Occupational Therapy department on 01270 612346/273015&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121460.jpg", "name": "Mid Cheshire Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121460"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Leighton Hospital, Crewe Middlewich Road Crewe Cheshire CW1 4QJ", "postalCode": "CW1 4QJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.1177", "longitude": "-2.47586"}}, "title": "Clinical Specialist Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245748", "validThrough": "2020-11-11T23:59:59+0000"}