{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 pa, based on full time hours"}}, "datePosted": "2020-10-26T12:30:37+0000", "description": "&lt;p&gt;&lt;strong&gt;As we continue to develop and invest in our extraordinary CAMHS Services, become part of our journey to help young people recover and overcome adversity.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We have recently opened Austen House our new, 14 bed, low secure hospital for children and adolescents with mental health needs. The new hospital is located at Tatchbury Mount in Calmore, Southampton.&lt;/p&gt;\n&lt;p&gt;Austen House helps to meet the national shortage of beds for young people with specialist mental health needs and will mean that patients living in the south of the country will be able to access treatment closer to home, preventing them and their families having to travel long distances to receive the care they need.&lt;/p&gt;\n&lt;p&gt;As a staff nurse you will be a vital part of our multi-disciplined team helping us to deliver high standards of care to the young people we care for. Your day will be very varied and include supporting our young people through completion of nursing assessments, evaluation of care, contributing to ward reviews, training and development of junior staff and ensuring a high standard of nursing care is maintained through supervision. This post is also available to newly qualified staff and you will be offered a comprehensive preceptorship when you come to join us&lt;/p&gt;\n&lt;p&gt;We understand how important work life balance is and we know happy staff makes for outstanding care. Let us know if you require flexible working and we will always do our best to accommodate you.&lt;/p&gt;\n&lt;p&gt;If you are career driven we are here to support you. We have a competency based approach to clinical training and development, ensuring you are able to develop your skills in a safe and effective way.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;*********£2,500 ‘Golden Hello’ Payment**********&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Awarded with this vacancy! Apply now and if you are successfully recruited you will receive £2,500- does not apply to current HIOW NHS Staff&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Click the link at the side to view our CAMHS video and discover more about the extraordinary work we do&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Southern Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120646"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "SOUTHAMPTON", "postalCode": "SO40 2TA"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.9316", "longitude": "-1.52542"}}, "title": "Mental Health Nurse/ Learning Disability Nurse/ Paediatric Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242426", "validThrough": "2020-11-09T23:59:59+0000"}