{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "26000", "minValue": "26000", "unitText": "YEAR", "value": "Up to £26,000 per annum DOE"}}, "datePosted": "2020-10-19T11:34:35+0100", "description": "&lt;h2&gt;&lt;strong&gt;Bank yourself a new or additional position!&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;strong&gt;Are you looking for some additional working hours or to gain experience working in a custodial setting? Have you ever thought about working within a prison?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Then this is the opportunity for you.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are currently looking for a Bank Pharmacy Technician within HMP YOI Swinfen Hall, working as a Bank Pharmacy Technician offers you flexibility and workplace variety. You would also be assisting the wider permanent team, covering for planned and unplanned absences.&lt;/p&gt;\n&lt;p&gt;Practice Plus Group are Health in Justice Market leader, providing healthcare services to offenders across the country. Our model of care is our Wellbeing Approach – an integrated, comprehensive approach in recognition of the fact prisoners are a socially-excluded group with healthcare needs which are complex and often associated with poor outcomes. It adopts the premise no single health/wellbeing factor can be taken in isolation of other motivational issues which might impact a person’s care.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h2&gt;&lt;strong&gt;Want to know more about HMP YOI Swinfen Hall?&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;HM Prison Young Offenders Institute Swinfen Hall is a Category C and Young Offenders Prison situated just outside Lichfield. It is easily accessed from Birmingham and Staffordshire. The Prison has ‘green’ feel to it with trees and green areas within the perimeter.&lt;/p&gt;\n&lt;p&gt;The Patient group consists of young men aged 18 to 28. The Healthcare service is based on a community model. GP, Nursing team and Pharmacy technician, working with mental Health and Substance misuse services staff. Additionally Dental, Podiatry and Physio clinics are delivered on site.&lt;/p&gt;\n&lt;p&gt;One of the key focuses is to engage the Patients with Healthcare services, and educate them in positive relationships with Health staff to promote well being.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h2&gt;&lt;strong&gt;What will you be doing?&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;A Pharmacy Technician at HMP YOI Swinfen Hall will work closely with the existing primary care team including the GP, Clinical Lead and nursing team in the delivery of a high quality pharmacy service to the prison population.&lt;br /&gt; &lt;br /&gt; Working on the prison wings, you can expect to be involved in everything from medicine management, dispense medications, screening drug charts and more. You can expect to provide medicines management services to assist and support the primary care team to deliver effective clinical intervention and provide pharmacy related information to patients, prison officers and other healthcare professionals ensuring that the level of advice given is appropriate. The role requires the ability to administer medication and manage processes whereby patients are supported to manage their own in-possession medications effectively.&lt;/p&gt;\n&lt;p&gt;The Pharmacy Technician will also assist with the implementation and development of pharmacy support to all wings in the prison which includes, where appropriate, counselling of patients on the correct use of medication.&lt;/p&gt;\n&lt;p&gt;The Pharmacy Technician hours run from Monday to Friday between 07:30-17:30, with the opportunity for weekend hours when required. Bank hours can range from a few hours per week to full days.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h2&gt;&lt;strong&gt;What do we need from you so you can do the job?&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will hold NVQ Level 3, BTEC or equivalent qualifications and have current registration with the General Pharmaceutical Council (GPhC) to be considered for this role. You will also have relevant post-qualification experience working within a pharmacy environment and multi-disciplinary team.&lt;br /&gt; &lt;br /&gt; You’ll be able to demonstrate assessment skills, including undertaking of risk assessments and have sound patient counselling skills, treating patients with respect and dignity at all times, adopting a culturally sensitive approach.&lt;br /&gt; &lt;br /&gt; If you are self-motivated and able to work autonomously as well as showing plenty of initiative when it comes to handling a wide range of situations, then this could be the right role for you!&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h2&gt;&lt;strong&gt;Next steps&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;If you are shortlisted, you will be contacted by Amelia Smith, the Internal Recruiter for this role.&lt;/p&gt;\n&lt;p&gt;Amelia will submit your CV to the hiring manager and then will arrange an interview for you to attend at HMP YOI Swinfen Hall if the hiring manager feels that you are suitable for the job.&lt;/p&gt;\n&lt;p&gt;For any queries or for an informal conversation about this opportunity please call Samantha Owen (Clinical Lead) on 01543 484036. &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h2&gt;&lt;strong&gt;More information&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;br /&gt; The rate of pay is a flat rate of up to £14.57 per hour, working ad hoc shifts as and when required. Hours for this department run from Monday to Friday between 07:30-17:30, with the opportunity for weekend hours when required. Offered bank hours can range from a few hours per week to full days.&lt;br /&gt; &lt;br /&gt; &lt;em&gt;Please note that this role will close early once a sufficient number of applications have been received.&lt;/em&gt;&lt;br /&gt; &lt;br /&gt; Please note that this role is subject to Practice Plus Group Terms &amp; Conditions and offers of employment are subject to satisfactory receipt of references, enhanced DBS check and prison vetting (arranged locally by site).&lt;br /&gt; &lt;br /&gt; At Practice Plus Group, we actively promote diversity and equal opportunities.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Practice Plus Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130136"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Lichfield", "postalCode": "WS14 9QS"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6506", "longitude": "-1.80101"}}, "title": "Bank Pharmacy Technician - HMP YOI Swinfen Hall", "url": "https://www.jobs.nhs.uk/xi/vacancy/916232057", "validThrough": "2020-11-12T23:59:59+0000"}