{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 to £110,683 pa"}}, "datePosted": "2020-11-02T12:30:28+0000", "description": "&lt;p&gt;&lt;strong&gt;University Hospitals Plymouth NHS Trust&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Derriford Hospital&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Post Title: Locum Consultant Cardiologist &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Contract: 12 months, fixed term contract &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please apply via NHS Jobs, uploading your CV.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This post is a 12 month fixed term Locum Consultant Cardiologist appointment by University Hospitals Plymouth NHS Trust. This post is required to support the provision 1 in 7 duty rota for the non-interventional cardiology service and also to meet the demand for increased growth in cardiology. Applicants will need a CCT in Adult Cardiology or equivalent and extensive audited experience in percutaneous coronary intervention (for additional information see detailed person specification in the job description).&lt;/p&gt;\n&lt;p&gt;This post is also intended to enhance the delivery of secondary cardiology care, including outpatient services to the local population in Devon and Cornwall Line with a basic 10 PA job plan and potential to negotiate additional PAs relating to specific sub-speciality interests strategic objectives of the Cardiology Service. This could potentially include contributions to the further development of the pacing/electrophysiology, imaging, and/or heart failure services.&lt;/p&gt;\n&lt;p&gt;The post holder will be expected to contribute towards the Directorate’s educational and audit programme which include a monthly CME/audit meeting and weekly teaching sessions for junior staff. University Hospitals Plymouth NHS Trust has been central to the successful development of the Peninsula Medical School, with outstanding teaching facilities on site and a strong commitment to undergraduate teaching of both medical and dental students including tertiary care modules in conjunction with Plymouth University.&lt;/p&gt;\n&lt;p&gt;The successful candidate will also be encouraged to participate in the Directorate’s expanding research programme supported by a well-developed research support team including dedicated research nurse practitioners and a strong commitment to transitional research and innovation within the Trust.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Undergraduate Medical Education&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Plymouth University Peninsular School of Medicine and Dentistry (PUPSMD) has been praised by the GMC for its innovative approach to undergraduate medical education. The curriculum is based around problem based learning and has been highly ranked by our graduates in how they felt prepared for postgraduate medicine. Your role will include important opportunities to engage with undergraduate education, in both the hospital environment and the school itself, to continue this vital job of producing tomorrow’s doctors and allied health care professionals&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120815.jpg", "name": "University Hospitals Plymouth NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120815"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "PLYMOUTH", "postalCode": "PL6 8DH"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.4167", "longitude": "-4.11371"}}, "title": "Locum Consultant Cardiologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252041", "validThrough": "2020-11-16T23:59:59+0000"}