{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "28988", "minValue": "26365", "unitText": "YEAR", "value": "£26,365 - £28,988"}}, "datePosted": "2020-11-05T14:16:25+0000", "description": "&lt;h1&gt;Therapy Technical Instructor&lt;/h1&gt;\n&lt;h1&gt;Wandsworth Community Neuro Team&lt;/h1&gt;\n&lt;p&gt;Grade: AFC Band 4&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours:&lt;/strong&gt; 37.5 (full time)&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location:&lt;/strong&gt; St John’s Therapy Centre, Battersea, SW London&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;An experienced rehabilitation practitioner is required to complete our &lt;strong&gt;Community Neuro Team&lt;/strong&gt;. Based at St John’s Therapy Centre in Battersea. The successful applicant will work within a well-established multidisciplinary team of skilled clinicians (Occupational Therapy, Physiotherapy, Speech and Language Therapy, Clinical Neuropsychology, Neuronavigator/Neuro Case Manager and Clinical Nurse Specialist) to deliver high quality neurorehabilitation and disability management to patients with a variety of neurological conditions living in the community.&lt;/p&gt;\n&lt;p&gt;This clinical role involves independently assessing and managing a caseload of patients with a range of acquired and progressive neurological conditions. As such, the successful applicant will have sufficient clinical experience and initiative to independently provide patient centered community rehabilitation and associated administration.&lt;/p&gt;\n&lt;p&gt;Rehabilitation includes activities such as prescribing and monitoring exercise programmes that enable patients to become independent in their chosen daily activities such as personal care and domestic tasks, swallowing therapy etc. There is a mix of working with people in their own homes, the therapy centre or other community settings. The successful applicant would see patients on an individual basis and will lead or co-facilitate groups.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Please note that the Therapy Technical Instructor role works predominantly within Physiotherapy, Occupational therapy and Speech and Language therapy. The service has separate Psychology and Administrative Assistant roles.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;Personal development is actively supported via clinical supervision, annual Personal Development Plans, and in-service training. All our staff are fully supported by the Clinical Team Leader.&lt;/p&gt;\n&lt;p&gt;As this is a community post, it would be preferable that you are a car owner/driver or be an active cyclist.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameRachel SibsonJob titleClincial Team LeadEmail addressrachel.sibson@stgeorges.nhs.ukTelephone number020 8812 4060&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "St George's University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121185"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St John&#39;s Therapy Centre, Battersea, Wandsworth, London", "postalCode": "SW11 1SW"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4603", "longitude": "-.179609"}}, "title": "Therapy Technical Instructor", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258077", "validThrough": "2020-11-15T23:59:59+0000"}