{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 pa"}}, "datePosted": "2020-11-03T07:50:20+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;em&gt;Brief Description of the Role: &lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are excited to be able to offer the opportunity for an experienced theatre nurse or ODP to join our theatre team as Team Leader. You must be driven and committed to the delivery of high quality, safe surgical practice and passionate about leading and developing theatre staff and teams.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This is an exciting time to join our team as we consolidate our working in a new Care Group structure, which offers the opportunity to support the development and continuous quality improvement of the new Clinical Business Unit.&lt;/p&gt;\n&lt;p&gt;We have been awarded an overall CQC rating of Good following our recent inspection so you would be joining a high performing team and would be expected to influence and drive improvement within your area.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Bradford Teaching Hospitals Foundation Trust has a reputation for delivering high quality healthcare and offers a wide range of theatre specialties including Head and Neck surgery, Trauma and Orthopaedics, Vascular, Breast, Urology, Gynaecology and General Surgery. We have just appointed our second cohort of ODP apprentices which is a fantastic opportunity to develop our own staff and work with our team and clinical practice educators to support and shape the learning and development of future theatre practitioners.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Through the West Yorkshire Association of Acute Trusts (WYAAT) five local Trusts have agreed an ambitious programme to create a shared single vascular service to provide safe, effective, patient focused care across West Yorkshire in the form of the West Yorkshire Vascular Service (WYVaS). This dynamic and ambitious move will make us one of 2 arterial centres in West Yorkshire and one of the largest vascular services in the country.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The successful candidates will have a proven track record in the delivery of safe, quality and effective care to patients in the peri-operative environment.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You must be able to demonstrate commitment to developing the service, show evidence of clinical leadership and multidisciplinary team working with excellent communication skills and be enthusiastic and have a positive attitude to change.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will have clear organisational skills and be flexible in your response to the needs of the service and demands of the department. The role involves teaching, assessing &amp; mentoring staff within the department, so a recognised teaching and assessing qualification is essential.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;If you think you have the experience, commitment and enthusiasm to lead a team in theatres and want to know more, contact Matron Wendy Hartley, 07791 190366.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We can offer staff gymnasiums on both hospital sites, excellent pension scheme and advice on childcare.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing Date: 17.11.20 (This date may change dependent on the response)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120952.JPG", "name": "Bradford Teaching Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120952"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bradford", "postalCode": "BD9 6RJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8059", "longitude": "-1.79488"}}, "title": "Theatres Team Leader", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253114", "validThrough": "2020-11-17T23:59:59+0000"}