{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 pa"}}, "datePosted": "2020-10-30T13:22:17+0000", "description": "&lt;p&gt;A fantastic career opportunity awaits you here in our Chemotherapy Day Unit, delivering care to both haematology and oncology patients. We are looking for nurses with a genuine interest in developing their knowledge and skills in administration of Systemic Anti-Cancer Therapy (SACT) within an acute cancer care setting.&lt;/p&gt;\n&lt;p&gt;Cancer treatments are rapidly evolving making this an exciting field of nursing.&lt;/p&gt;\n&lt;p&gt;Our forward thinking, multi-professional team place great focus on the patients and their families to ensure that their treatment is delivered in a highly professional, safe and holistic manner.&lt;/p&gt;\n&lt;p&gt;Previous experience within this unique and dynamic field of nursing is desirable but not essential as your educational needs will be tailored to meet your requirements through a robust programme of induction and training. This will include completing competencies i.e. the UK Oncology Nurses Society Passport in addition to a SACT university accredited module.&lt;/p&gt;\n&lt;p&gt;Our friendly, compassionate and dedicated staff provide an environment which will support your growth both professionally and clinically. This will allow you to care for patients and their families in delivering excellent treatment to a high standard throughout their cancer journey.&lt;/p&gt;\n&lt;p&gt;Are you ready to embrace this challenging and diverse role which is both rewarding and fulfilling?&lt;/p&gt;\n&lt;p&gt;Informal visits are encouraged.&lt;/p&gt;\n&lt;p&gt;Please contact Helen Bond or Hayley Beer, Senior Sisters&lt;/p&gt;\n&lt;p&gt;Monday - Friday 08.00 - 18.00 on 01225 824852&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121339.png", "name": "Royal United Hospitals Bath NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121339"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bath", "postalCode": "BA1 3NG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3917", "longitude": "-2.3912"}}, "title": "Staff Nurse - Band 5", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250343", "validThrough": "2020-11-15T23:59:59+0000"}