{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 pa"}}, "datePosted": "2020-10-21T15:00:25+0100", "description": "&lt;p&gt;Staff Nurse &lt;strong&gt;Band 5 - £24,907- £30,615 pa plus RRP to be paid every 6 months&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Great Oaks Mental Health Services are looking to recruit full time 37.5 hours per week Staff Nurses on a permanent basis to join our warm and friendly team on Mulberry Ward, Adult Inpatient services.&lt;/p&gt;\n&lt;p&gt;Twenty four hour / seven day cover is required with shifts comprising of early, late, and night shifts on a rota basis.&lt;/p&gt;\n&lt;p&gt;We appreciate the remarkable jobs all of our staff do. Thanks to their care, compassion and commitment, we have a reputation as a high performing Trust where patients are first and foremost at the center of all our care delivery.&lt;/p&gt;\n&lt;p&gt;To join our remarkable team we are looking for an enthusiastic and motivated nurse who wants to participate and contribute to achieving excellent standards of quality care for our patients. In return for this commitment we will support and develop your potential and skills through regular supervision and professional development in this busy and fulfilling role within our friendly Trust.&lt;/p&gt;\n&lt;p&gt;We also offer a comprehensive preceptorship programme for newly qualified nurses.&lt;/p&gt;\n&lt;p&gt;Mulberry ward is a 19 bedded ward that caters for people over the age of 18. The ward is a forward thinking ward that has implemented new ways of working. Supervision and PDRs are offered on a regular basis and staff are supported. We are currently working through an inpatient accreditation scheme that will evidence the skilled care and excellence practice we embrace. The ward has a full MDT including psychologist, pharmacy technicians, OT, psychiatrists to name a few.&lt;/p&gt;\n&lt;p&gt;The successful applicants will possess a RMN/RMNH/RLD qualification; have excellent communication skills, to be responsible for the assessment, development, implementation and evaluation of programmes of care. To take charge of the Ward on a regular basis and to act up in the absence of the Clinical Lead and/or Ward Sister, to provide a positive clinical lead to junior staff.&lt;/p&gt;\n&lt;p&gt;For more information about the post, please contact: Amy Harwood, Ward Manager. Tel. no. 01724 382085 or email: amy.harwood1@nhs.net&lt;/p&gt;\n&lt;p&gt;We reserve the right to close down this advert early should there be a high number of applicants.&lt;/p&gt;\n&lt;p&gt;PLEASE NOTE WE WILL CONTACT YOU VIA EMAIL ABOUT YOUR APPLICATION THEREFORE PLEASE CHECK YOUR EMAIL ACCOUNT&lt;/p&gt;\n&lt;p&gt;It is important that you check your NHS jobs account regularly. To access emails from us, log into your account and view &#39;My Applications&#39; however some emails have been known to end up in &#39;JUNK MAIL/SPAM BOX&#39; so please ensure you check this folder as well as your INBOX so you don&#39;t miss any important communication regarding your application.&lt;/p&gt;\n&lt;p&gt;If you have not received confirmation of an interview date within 6-8 weeks of your application, please assume on this occasion that you have been unsuccessful.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Rotherham Doncaster and South Humber NHS Foundation Trust is committed to our responsibilities for safeguarding and promoting the welfare of children, young people and adults at risk as outlined in Working Together to Safeguard Children 2015 and Care Act 2014.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;We are committed to recruiting candidates who share the commitment to safeguarding, and therefore we apply robust recruitment and selection procedures to ensure that the people selected are right for the job, and that all candidates are appropriately screened prior to appointment and periodically during their employment&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;DBS disclosures are mandatory before commencement of employment within the Trust. Therefore, if you are in a position that is deemed a regulated adult and/or child care role, you will not be able to start your employment until we have received a satisfactory DBS clearance.&lt;/p&gt;\n&lt;p&gt;Safeguarding Policies for the Trust can be accessed via the document links.&lt;/p&gt;\n&lt;p&gt;The Trust is committed to equal opportunities in employment and welcomes applications from all sections of the community in order to maintain a workforce as diverse as the population it serves.&lt;/p&gt;\n&lt;p&gt;The first 6 months of employment with the Trust will be a probationary period which may be extended by the Trust for a further 6 months.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121483.jpg", "name": "Rotherham Doncaster and South Humber NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121483"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Scunthorpe", "postalCode": "DN16 2JX"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.567", "longitude": "-.638608"}}, "title": "Staff Nurse (Band 5) RRP £2,600", "url": "https://www.jobs.nhs.uk/xi/vacancy/916236996", "validThrough": "2020-11-18T23:59:59+0000"}