{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum pro rata if part time"}}, "datePosted": "2020-09-30T09:24:00+0100", "description": "&lt;p&gt;Salisbury NHS Foundation Trust is proud of its commitment to the health and wellbeing of all its employees.&lt;/p&gt;\n&lt;p&gt;To support our service, we are excited to recruit an Occupational Health Advisor on a temporary nine month contract. The Occupational Health Advisor will be required to work three days/week, managing a diary case load of no more than 7 management referrals per day (or the equivalent).&lt;/p&gt;\n&lt;p&gt;We pride ourselves on quality and therefore offer a one hour appointment to undertake a management referral to ensure the assessment and report is of a high quality. The role will be predominantly case management but it will also consist of pre-employment assessments and vaccination assessments. It would be desirable for the candidate to be able to deliver the administration of vaccinations and venepuncture but not essential. Knowledge of vaccination regimes is however essential for assessing NHS staff. You will therefore require previous occupational health experience in the NHS.&lt;/p&gt;\n&lt;p&gt;This role is being offered to support our current clinical team as a result of increased demands due to the pandemic. You will be required to work autonomously but you will be working within a friendly, enthusiastic, helpful in house multi disciplinary team and you will be fully supported at all times.&lt;/p&gt;\n&lt;p&gt;We promise a supportive and enthusiastic team, focused on our values of putting people first and promoting health, safety and wellbeing so if you would like to work within this fantastic team and service, please apply.&lt;/p&gt;\n&lt;p&gt;For further details regarding this role, or to arrange an informal visit to the Department, please contact&lt;/p&gt;\n&lt;p&gt;Lisa McLuckie - Head of Health and Wellbeing on 01722 336262 ext 5640 or via email – Lisa.McLuckie@nhs.net&lt;/p&gt;\n&lt;p&gt;or&lt;/p&gt;\n&lt;p&gt;Karen Westall Occupational Health Advisor&lt;/p&gt;\n&lt;p&gt;karen.westall@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120765.jpg", "name": "Salisbury NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120765"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "salisbury NHS Foundation Trust, Salisbury", "postalCode": "SP2 8BJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.0439", "longitude": "-1.78981"}}, "title": "Occupational Health Advisor", "url": "https://www.jobs.nhs.uk/xi/vacancy/916205680", "validThrough": "2020-11-10T23:59:59+0000"}