{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "140000", "minValue": "90000", "unitText": "YEAR", "value": "£90,000 - £140,000"}}, "datePosted": "2020-10-16T16:48:50+0100", "description": "&lt;p&gt;As an experienced Consultant Psychiatrist you will have expert knowledge of working with people with mental health conditions, supporting them to build a brighter future.&lt;/p&gt;\n&lt;p&gt;This is a fantastic opportunity to join Elysium Private Health in Brighton, where you will work 37.5 hours a week alongside an established team to deliver care to people with mental health needs and mild to moderate acuity levels in an outpatient setting.&lt;/p&gt;\n&lt;p&gt;You will be responsible for providing assessments, diagnosis, treatmentsandprescribing and monitoring medication.You will have MRC Psychiatry or equivalent with full registration, licensed and specialist registered or within six months of obtaining your CCT on the date of the Advisory Appointment Committee. Elysium Private Health is located in Brighton, a seaside city in East Sussex, it is approximately63 miles from Central London and is commutable from Crawley, Eastbourne, Horsham, Worthing and surround areas. Working for Elysium Healthcare you give you access to a large and supportive peer group of like-minded professionals.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;To be successful in this role, you will need:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Full GMC Registration&lt;/li&gt;\n&lt;li&gt;Recent experience with acute Psychiatry&lt;/li&gt;\n&lt;li&gt;Experience in a similar setting&lt;/li&gt;\n&lt;li&gt;MRCPsych or equivalent&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What you will get&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Annual Salary of £90,000 - £140,000 (depending on experience)&lt;/li&gt;\n&lt;li&gt;The equivalent of 33 days annual leave – plus your birthday off!&lt;/li&gt;\n&lt;li&gt;Free meals and parking&lt;/li&gt;\n&lt;li&gt;Wellbeing support and activities&lt;/li&gt;\n&lt;li&gt;Career development and training&lt;/li&gt;\n&lt;li&gt;Pension contribution&lt;/li&gt;\n&lt;li&gt;Life Assurance&lt;/li&gt;\n&lt;li&gt;Enhanced Maternity Package&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;There is also a range of other benefits including retail discounts and special offers, car leasing without a credit check, holiday financing and much more.&lt;/p&gt;\n&lt;p&gt;Developing you regularly to ensure you’re on the cutting edge and at the top of your game is important to us. You’ll have access to excellent CPD and career development opportunities, plus access to a large peer group of enthusiastic and high-caliber consultants.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;A&lt;/strong&gt;&lt;strong&gt;bout your next employer&lt;/strong&gt; &lt;br /&gt;You will be working for an established, stable and agile company with a unique approach to the delivery of care. With a network of over 70 services across England and Wales, providing four services including: Mental Health, Neurological, Learning Disabilities &amp; Autism, Children &amp; Education, there is an opportunity for you to grow and move with Elysium. &lt;br /&gt;Elysium Healthcare follows safer recruitment of staff for all appointments. It is a requirement that all staff understand it is each person’s individual responsibility and are committed to promoting and safeguarding the welfare of service users. Candidates will be subject to an Enhanced DBS disclosure.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Elysium Healthcare", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133794"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Brighton", "postalCode": "BN3"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8392", "longitude": "-.176918"}}, "title": "Consultant Psychiatrist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916231186", "validThrough": "2020-11-16T23:59:59+0000"}