{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51724", "minValue": "32896", "unitText": "YEAR", "value": "£32,896 - £51,724"}}, "datePosted": "2020-10-27T14:47:00+0000", "description": "&lt;p&gt;&lt;strong&gt;Clinical Fellow in Interventional Cardiology (Specialty Registrar Higher level) –&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are searching for individuals who share our values, which are that:&lt;/p&gt;\n&lt;p&gt;• We care about the people we serve and the people we work with&lt;/p&gt;\n&lt;p&gt;• We trust one another&lt;/p&gt;\n&lt;p&gt;• We respect each other&lt;/p&gt;\n&lt;p&gt;• We take personal responsibility&lt;/p&gt;\n&lt;p&gt;• We treat people with kindness&lt;/p&gt;\n&lt;p&gt;• We act with integrity&lt;/p&gt;\n&lt;p&gt;Applications are invited for a full time (40 hours a week) Clinical Fellow in Interventional Cardiology based at the University Hospital of Wales. The post is available as soon as possible and will provide an excellent opportunity to gain valuable experience in all aspects of Interventional Cardiology. The post is available until 3rd August 2021 with a possibility of extension thereafter.&lt;/p&gt;\n&lt;p&gt;The department undertakes approximately 1750 coronary interventions and 3000 diagnostic cardiac catheterisations per annum. The 3 catheter labs are equipped with pressure wire, rotablation, laser, OCT and intravascular ultrasound. A number of our operators have an interest in CTO, bifurcation PCI and intravascular imaging. University Hospital Wales is one of the top 3 centres in the UK in terms of volume of transradial procedures. There is an active primary PCI programme with 520 cases performed per annum. The pattern of disease locally is particularly severe and is reflected in CCAD statistics such as mean number of vessels treated /case (1.33 at UHW vs. 1.22, UK), number of lesions/case (1.804 at UHW vs. 1.53, UK), 1.92 stents per case and 93% DES usage. There is an active TAVI implantation programme.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are looking for a candidate who is proficient in simple and moderately complex PCI (post CCT) who wish to further their training in all aspects of complex PCI (LMS PCI, PCI in MVD, vein graft PCI, bifurcation, rotablation, laser and CTO angioplasty). We expect the candidate to be involved in teaching and training of junior cardiology trainees, develop and contribute towards ongoing clinical research projects and actively recruit in ongoing registries and RCTs.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are a teaching Health Board with close links to Cardiff University. The University boasts a high-profile teaching, research and development role within the UK and abroad. Together we are training the next generation of medical professionals.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Although these posts are full-time, consideration will be given to applicants who require flexible working arrangements.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;References will be required to cover a minimum of three years of previous employment and/or training&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;In view of Border Immigration Agency regulations, all applicants must state their current immigration status including expiry dates.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDr Sean GallagherJob titleConsultant CardiologistEmail addressSean.Gallagher2@wales.nhs.ukTelephone number029 20743381Additional contact information&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Informal visits to be arranged by appointment.&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123193.jpg", "name": "Cardiff and Vale University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123193"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "University of Wales Hospital, Cardiff", "postalCode": "CF14 4XW"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5068", "longitude": "-3.18937"}}, "title": "Clinical Fellow (Higher) in Interventional Cardiology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245048", "validThrough": "2020-11-10T23:59:59+0000"}