{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 pa"}}, "datePosted": "2020-10-29T13:01:20+0000", "description": "&lt;p&gt;&lt;strong&gt;What is Acute &amp; Emergency Care?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Acute and Emergency Care Services are comprised of the following departments: Accident &amp; Emergency (A&amp;E), Urgent Treatment Centre (UTC), Same Day Emergency Care (SDEC), as well as additional acute assessment areas. These are clinical areas where there is an increased risk of exposure to infections, including but not limited to COVID19.&lt;/p&gt;\n&lt;p&gt;A&amp;E provides care for those in the community / care homes with life-threatening emergencies, as well as minor injuries.&lt;/p&gt;\n&lt;p&gt;The Urgent Treatment Centre provides fast medical treatment and advice for patients which are urgent but do not require a visit to A&amp;E. They can also be used when you are unable to wait for an appointment with your GP.&lt;/p&gt;\n&lt;p&gt;SDEC is the provision of same day care for emergency patients who would otherwise be admitted to hospital. When a patient comes to hospital, an SDEC service means patients with various medical concerns can be assessed, diagnosed, treated and safely discharged home the same day, rather than being admitted. Some of these patients may need to be admitted or return the next day for further treatment.&lt;/p&gt;\n&lt;p&gt;The division has recently expanded its remit to include further acute assessment wards / areas.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We have a vacancy for a Band 3 Acute &amp; Emergency Care Administrator. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Units comprise of Consultants working alongside Advanced Clinical Practitioners, Junior Doctors, Nurses, Emergency Department Technicians, Clinical Support Workers, and Administrative Staff.&lt;/p&gt;\n&lt;p&gt;All areas of Acute &amp; Emergency Care are currently 7 days per week, 24 hours a day. A Band 3 Acute &amp; Emergency Care Administrator is rostered to work across all areas, with a combination of all shift patterns. The service areas and operating hours are subject to change based on service demand and developments.&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for Administrators to join our ever expanding and dynamic departments. The role will involve registering patients who self-present to the hospital, directed by 111 or arrive by ambulance, as well as completing coding and conforming to data quality. In addition, the role will involve undertaking administrative tasks such as filing etc. set by the Senior Team. We are looking for an individual who is highly motivated and can use their own initiative. It is important that you are adaptable and enjoy working as part of a team, as well as having the ability to work independently. Communication with patients, relatives, external organisations and fellow staff members is an essential quality for this role.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;A secondment would be considered for internal candidates.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Previously unsuccessful applicants need not apply.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further information please contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Michelle Canzano – Admin Team Manager for Acute &amp; Emergency Care Services&lt;/p&gt;\n&lt;p&gt;01234 355122 Ext 5599&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120819.jpg", "name": "Bedfordshire Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120819"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bedford Site, Bedford", "postalCode": "MK42 9DJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1289", "longitude": "-.471708"}}, "title": "Band 3 Acute &amp; Emergency Care Administrator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248435", "validThrough": "2020-11-07T23:59:59+0000"}