{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-11-05T15:16:20+0000", "description": "&lt;p&gt;An opportunity has arisen for an experienced Biomedical Scientist to join our well established Cellular Pathology team. We are looking for an enthusiastic and dynamic experienced HCPC Biomedical Scientist to lead the Histology team. The Candidate is required to have the IBMS specialist portfolio (or equivalent) and experience in leading a team.&lt;/p&gt;\n&lt;p&gt;CWPS is one of the largest networked pathology service providers in the country; our vision is to provide a safe and responsive pathology service through innovation and efficiency. Services are fully UKAS accredited.&lt;/p&gt;\n&lt;p&gt;Formed in 2008, CWPS is a managed network of laboratories hosted by University Hospitals Coventry &amp; Warwickshire NHS Trust (UHCW). In addition to the host Trust CWPS provides services to South Warwickshire NHS Foundation Trust (Warwick), George Eliot Hospital Trust (Nuneaton) and Queens Hospital (Burton), as well as the surrounding CCGs, with the Histology laboratories based at UHCW and SWFT.&lt;/p&gt;\n&lt;p&gt;Successful candidate will work in SWFT Laboratory and report to the Discipline Manager at UHCW and attend regular network meetings across sites. The candidate will be responsible for all areas of this routine histology lab including the main lab, working with the dissection lead to manage the dissection team and our specialist OSNA team for breast cancer diagnostics. Previous experience in training in histology, specimen dissection A-C and OSNA is desirable. See the Pan Pathology job description for more generic details. The role includes working with other section leads in Cellular pathology- Training, Performance, Immunohistochemistry and Quality to provide a high quality timely service for our patients.&lt;/p&gt;\n&lt;p&gt;The ideal candidate will match the criteria set out within the Pathology Section Manager person specification however, applicants who do not yet have a Masters Degree, FIBMS or equivalent are still encouraged to apply if they can demonstrate they have sufficient knowledge and experience as outlined in the Trainee Section Manager person specification, and are willing to achieve a Masters level qualification. These applicants will be supported to complete the Masters Level IBMS Higher Specialist Diploma in Leadership &amp; Management.&lt;/p&gt;\n&lt;p&gt;The Successful candidate will be appointed at Band 6 until they complete the diploma and associated competencies upon which they shall progress to the Band 7 Section Manager Post.&lt;/p&gt;\n&lt;p&gt;The successful candidate shall also be supported to supplement their knowledge and skills by completing a core set of courses included within the Internal Management Toolkit&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameClare WoodJob titleCellular Pathology ManagerEmail addressclare.wood@uhcw.nhs.ukTelephone number02476966817&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University Hospitals Coventry and Warwickshire NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120793"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Warwick, Warwick", "postalCode": "CV34 5BW"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.29", "longitude": "-1.5832"}}, "title": "Biomedical Site lead Histology - South Warwickshire Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258297", "validThrough": "2020-11-19T23:59:59+0000"}