{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum pro rata"}}, "datePosted": "2020-11-02T11:01:49+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for a Band 5 Registered Nurse to join our compassionate, friendly and forward thinking team. Steffan Ward is a busy 19 bedded acute medical ward which specialises in Gastroenterology, Oncology and Haematology. Due to the nature of our specialities we build a close however professional relationship with our patients as some of the medical conditions are chronic and require re-admission to our ward.&lt;/p&gt;\n&lt;p&gt;About our specialities&lt;/p&gt;\n&lt;p&gt;Gastroenterology is the branch of medicine that looks at diseases of the oesophagus (gullet), stomach, small and large intestines (bowel), liver, gallbladder and pancreas. As a registered nurse on Steffan ward you will be involved in preparing patients for their diagnostic tests and procedures to investigate the gastrointestinal system to assist with diagnosing and treating the patient.&lt;/p&gt;\n&lt;p&gt;Oncology is a branch of medicine that specializes in the diagnosis and treatment of cancer. It includes medical oncology (the use of chemotherapy, hormone therapy, and other drugs to treat cancer), radiation oncology (the use of radiation therapy to treat cancer), and surgical oncology (the use of surgery and other procedures to treat cancer). We do not currently have an oncologist based with us in Glangwili, however we liaise very closely with oncologist in Singleton. We also work very closely with the chemotherapy unit here in Glangwili who support our oncology patients with their treatment.&lt;/p&gt;\n&lt;p&gt;Haematology is the study of the blood and blood-forming tissue. We have haematologist based in Glangwili that diagnose and monitor patients with disorders of the blood and bone marrow. We also liaise with Cardiff and have an excellent multidisciplinary rapport.&lt;/p&gt;\n&lt;p&gt;We also specialise in palliative care and have a close multidisciplinary relationship with palliative teams, Macmillan and other clinical nurse specialist that support our patients holistically.&lt;/p&gt;\n&lt;p&gt;We are looking for highly motivated individuals to work within our dynamic working environment with a passion in caring for palliative and acutely ill patients.&lt;/p&gt;\n&lt;p&gt;You must have:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Good communication/interpersonal skills, high levels of commitment and dedication, caring attitude and the ability to work as part of a team are essential.&lt;/li&gt;\n&lt;li&gt;A desire to develop your experience and work alongside a team of staff as well as a passion for excellent patient care and outcomes.&lt;/li&gt;\n&lt;li&gt;The ability of doing things differently and challenging the status quo.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;If you have an interest in the above and meet the criteria come and apply for this brilliant opportunity to learn new skills and experiences whilst expanding your knowledge so far.&lt;/p&gt;\n&lt;p&gt;We are a warm, friendly team of professionals who work closely with all members of the multidisciplinary team to provide high quality, holistic driven, evidence-based care to all our patients. We abide strongly by the Hywel Dda’s values and behaviours framework and are proud of our workforce and value the contribution that members of our staff make to our patients and the organisation. You will be required to demonstrate competence in assessing, planning and evaluating the care needs of a group of patients with support from your ward manager, colleagues and educator team.&lt;/p&gt;\n&lt;p&gt;Our Trust is a great choice for people who want to develop their career in an ambitious and dynamic environment; we also offer an excellent benefits package which includes onsite childcare facilities, various salary sacrifice schemes and a generous annual leave entitlement.&lt;/p&gt;\n&lt;p&gt;We welcome informal discussions with those considering an application and would actively encourage you to speak to one of our Sisters to learn more about working for us.&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; English and/or Welsh speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt;Interviews to be held on 23/11/2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameAmy JamesJob titleSisterEmail addressamy.james4@wales.nhs.ukTelephone number01267 227950&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123194.gif", "name": "Hywel Dda University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123194"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Steffan Ward, Glangwili General Hospital, Carmarthen", "postalCode": "SA31 2AF"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.8675", "longitude": "-4.28474"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251703", "validThrough": "2020-11-16T23:59:59+0000"}