{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142"}}, "datePosted": "2020-10-30T14:44:49+0000", "description": "&lt;p&gt;We are looking for a dynamic, self-motivated and enthusiastic person with a ‘can do’ attitude. You will play a key part in delivery high quality, effective and efficient administrative services to the Deputy Director and other Senior Managers as and when required. Your main duties will include organising and facilitating relevant meetings, preparing the agenda and taking minutes as well as co-ordinating the On Call Manager rota for Coastal West Sussex and the parking permits allocation.&lt;/p&gt;\n&lt;p&gt;You must have excellent communication skills, the ability to manage competing demands and deadlines, great organisational skills and a desire to provide brilliant administrative support.&lt;/p&gt;\n&lt;p&gt;You must have a helpful and flexible attitude and a willingness to work as part of a team, as well as the ability to work alone. You must be able to use your initiative and be able to produce high quality materials and help manage office systems effectively and efficiently. You will deal with people at all levels internally and externally.&lt;/p&gt;\n&lt;p&gt;Your base will be at at Swandean in Worthing, but as the team is working remotely whenever possible you will be working from home too. You may also be required to travel across sites at times.&lt;/p&gt;\n&lt;p&gt;As part of our commitment to quality and professionalism we ensure that all our new staff undertakes a thorough induction programme with us when they commence their new roles.&lt;/p&gt;\n&lt;p&gt;For further details please contact&lt;/p&gt;\n&lt;p&gt;Naomi Creasey at naomi.creasey2@sussexpartnership.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121074.jpg", "name": "Sussex Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121074"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Swandean, Worthing", "postalCode": "BN13 3EF"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8424", "longitude": "-.41189"}}, "title": "Secretary", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250617", "validThrough": "2020-11-13T23:59:59+0000"}