{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum (plus HCAS)"}}, "datePosted": "2020-10-22T15:00:56+0100", "description": "&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are looking to recruit an enthusiastic Occupational Therapist (OT) to work within Redbridge Early Intervention in Psychosis Team. We work with 14 to 65 year olds who are experiencing their first episode of a psychotic nature. We follow an EIP model of practice and work with a client centre approach. This OT post has the luxury of working with other OT’s and STR workers in the team. EIP works very much within a recovery focus approach and is very well suited to an OT professional with and important focus on employment, education and training and social inclusion. We also have an IPS worker in the team to support with employment outcomes. There is an opportunity for OT specific work across team to provided group interventions.&lt;/p&gt;\n&lt;p&gt;It is important to us that the successful candidate is an experienced professional, possessing a good knowledge of working with adults, their carers and family. Is committed to developing and promoting evidence-based best practice, and be conversant with adult mental health interventions, the evolving needs of our service users, their carers and family.&lt;/p&gt;\n&lt;p&gt;As an OT you will be a registered with HCPC and have an understanding of how multidisciplinary teams need to function and be passionate about delivering quality services.&lt;/p&gt;\n&lt;p&gt;The post is full time, offering excellent opportunities to develop special professional interests; share expertise and work closely with colleagues. Training, good support and partnership working is offered. Close relationships also exist with multi-agency partners and specialist services.&lt;/p&gt;\n&lt;p&gt;We are a borough based Early Intervention in psychosis teams operational working hours are Monday to Friday 9am to 5pm, with some flexibility when required to engage with our service users. We are commitment to Agile working across the NELFT sites in accordance with trust policy and guidance.&lt;/p&gt;\n&lt;p&gt;As minimum criteria all staff employed by the Trust should have a basic competency for numeracy and literacy equivalent to NVQ level 2. If you are shortlisted for this post, you will be required to undertake an assessment for these skills prior to interview. Candidates who pass the assessment will then be invited to interview&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;For the main responsibilities of the post are:&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;To act as care coordinator to clients referred to the service, in accordance with Care programme Approach (CPA) policy. Undertake comprehensive assessment of health and social needs together with the service users implement a plan of care and intervention to meet these needs, ensuring regular reviews are in place for evaluation of the care plan.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;To provide OT specific assessments, following MOHO model and assessments to support with housing applications and where possible care planning. To provide an OT perspective to clinical discussions in zoning meeting, complex case reviews and discussion with other team members.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;To provide carer assessments to ensure carers and family are included and supported and in care planning. To participate in carer focused education, family intervention approaches, support programmes and carers groups providing information about relevant legislation and carer’s rights. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Within the CPA process monitor and assess the physical health of service users with mental illness in line with Trust policy and national guidelines&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;To facilitate and implement the Trust and Local Authority requirements in relation to safeguarding children and guidance legislation within the Care Act 2014. To adhere to the requirements of the Safeguarding Adults policy.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;ul&gt;\n&lt;li&gt;Current OT registration&lt;/li&gt;\n&lt;li&gt;Proven experience of working with people with complex and severe mental health needs – including psychosis&lt;/li&gt;\n&lt;li&gt;To demonstrate a good understanding of the EIP model to work with clients to achieve positive outcomes in relation to their functioning and occupation.The main responsibilities of the post:&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Operating as a care Co-ordinator for a group of clients, under the supervision of the Clinical Team Lead.&lt;/li&gt;\n&lt;li&gt;Providing OT specific assessments e.g. ADL assessments, when required for clients of REIP, separate to you care co coordinator caseload.&lt;/li&gt;\n&lt;li&gt;Providing high quality evidence-based and individualised mental health care to a clearly defined group of clients, relatives and carers&lt;/li&gt;\n&lt;li&gt;Working and acting as a key member of the multi-disciplinary team, supporting each client in the achievement of planned outcomes&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NELFT NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120606"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "HASS Seven Kings Aldeborough Road North, Redbridge", "postalCode": "IG2 7SR"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5797", "longitude": ".100086"}}, "title": "Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916239040", "validThrough": "2020-11-19T23:59:59+0000"}