{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "151290", "minValue": "21281", "unitText": "YEAR", "value": "Competitive-  £12.66 and £90 overnight respite."}}, "datePosted": "2020-11-04T12:06:06+0000", "description": "&lt;p&gt;&lt;strong&gt;Shared Lives Carer&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Competitive rate: support hours up to £12.66 and £90 overnight respite.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Bath and North-East Somerset&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Are you looking for flexible NHS bank opportunities to fit around your lifestyle? Do you want to decide when and where you work, and where currently 94% of those using our services would recommend us to care for their friend or family? If so, this could be the place for you.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Feel Valued&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As well as the attractive hourly rates of pay you’ll benefit from:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Flexible hours either full time or part time, allowing you to achieve the best work / life balance&lt;/li&gt;\n&lt;li&gt;Free statutory and mandatory training, as well as access to a range of courses and e-learning to develop further skills, continuing your professional development&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The B&amp;NES Shared Lives Scheme is looking for creative and committed people across the area. Formal caring qualifications are not a requirement as training will be provided by the service. This is an incredibly flexible role and really suited to someone who wants to have a good work life balance.&lt;/p&gt;\n&lt;p&gt;Shared Lives carers’ support individuals living with learning disabilities, autism, dementia, a physical disability, mental health difficulties or other health or sensor disability, or an older person with support needs in the carers homes.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Feel Proud&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Carers in the service have said ….&lt;/p&gt;\n&lt;p&gt;“Being a Shared Lives carer is the best job I’ve ever had, it’s so flexible and it fits in with my life.”&lt;/p&gt;\n&lt;p&gt;“I can see and feel I am really making a difference.”&lt;/p&gt;\n&lt;p&gt;“I don’t feel it’s like a job at all, I really enjoy everyone I spend time with and they are as much a part of my life as I am theirs.”&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We’d love to hear from you if you’d like more information. Please call Suzannah Cook the Registered Manager on 0300 2470077&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Or email&lt;/strong&gt;bathnes.sharedlives@virgincare.co.ukfor more information.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Virgin Care&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We’re committed to equal opportunities and welcome a broad diversity of talent to apply. We reserve the right to cease any advertising prior to the published closing date for a role that receives a high number of applications.&lt;/p&gt;\n&lt;p&gt;As a Disability Confident Committed company, we work in partnership with the Department of Work and Pensions (DWP) to provide facilities, work environment adjustments and technical solutions to make our business an inclusive place for all.&lt;/p&gt;\n&lt;p&gt;Virgin Care Limited, its subsidiary companies and the Virgin Care LLPs are part of the Virgin Group and provide publicly funded health and social care services. If you would like to know a little more about how we use your information, please see our website’s privacy policy.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "Virgin Care", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127354"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Radstock", "postalCode": "BA3 3LL"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2891", "longitude": "-2.4317"}}, "title": "Bank Shared Lives Carer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255754", "validThrough": "2020-11-25T23:59:59+0000"}