{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-11-03T13:16:24+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for Band 5 Social Worker to join our enthusiastic social work team. This post is within Mental Health team covering the North locality of Northumberland.&lt;/p&gt;\n&lt;p&gt;As a Band 5 Social Worker, you will have access to excellent and regular formal and informal supervision, annual appraisals, support and guidance to promote your personal and professional development. If necessary you will be supported to complete your Assessed and Supported Year in Employment (ASYE) as part of the job role.&lt;/p&gt;\n&lt;p&gt;The successful candidate will manage a caseload of clients who have a diagnosis of mental disorder. Cases will be allocated depending on levels of need, complexity and risk. Initiating and implementing plans for adults, you will collaborate with a range of external services to access any resources required to meet the needs you have identified.&lt;/p&gt;\n&lt;p&gt;As you work to provide a comprehensive assessment, you will benefit from a good balance of autonomy and support. You will be responsible for the day-to-day management of your caseload but will always have regular supervision and the full support of your Team Manager and Senior Practitioners. The team are based in Alnwick and Berwick.&lt;/p&gt;\n&lt;p&gt;It is essential that you have a clear understanding of the Care Act and the Local Authorities statutory duties. We are committed to protecting and promoting the welfare of vulnerable adults and expect all staff to share this commitment.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Essential Criteria&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Degree in Social Work (or equivalent)&lt;/li&gt;\n&lt;li&gt;Experience of social work with adults&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The successful post holder must be able to role model compassionate and inclusive leadership in order to shape the creation of a collective leadership culture within the Trust.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Closing date: 17th November 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Nicola Brennan&lt;/p&gt;\n&lt;p&gt;Team Manager&lt;/p&gt;\n&lt;p&gt;nicola.brennan@northumbria-healthcare.nhs.uk&lt;/p&gt;\n&lt;p&gt;01670 629222&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Northumbria Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120801"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Adult Social Care, Alnwick Fire Station, Alnwick", "postalCode": "NE66 2ER"}, "geo": {"@type": "GeoCoordinates", "latitude": "55.3971", "longitude": "-1.68819"}}, "title": "Social Worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254117", "validThrough": "2020-11-17T23:59:59+0000"}