{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62001", "minValue": "53168", "unitText": "YEAR", "value": "£53,168 - £62,001 per annum"}}, "datePosted": "2020-10-29T11:17:30+0000", "description": "&lt;p&gt;&lt;strong&gt;Highly Specialist &lt;/strong&gt;&lt;strong&gt;Clinical Psychologist 3.5 days&lt;/strong&gt;&lt;br /&gt;Psychological Therapies Service, Broomfield Hospital, Chelmsford.&lt;br /&gt;Band 8B&lt;br /&gt;&lt;br /&gt;We have an exciting opportunity to join the Psychological Therapies Service representing the discipline of psychology in the service’s senior team, which is lead by a Consultant Clinical Psychologist, supported by a Senior Psychotherapist, Senior Counsellor and this current role. As well as being involved in many aspects of the management and service development for the Psychological Therapies Service, the postholder will also provide a specialist clinical psychology service to the staff and adult patients of the Burns service located at the hospital and which is part of the regions internationally renowned St Andrews Centre for Plastics and Burns. This post is for 3.5 days. Please see the job description for more details on the responsibilities and opportunities of this post.&lt;/p&gt;\n&lt;p&gt;The Psychological Therapies Service is a well established and valued hospital based psychological service, offering treatment for both child and adult inpatients and outpatients from a wide range of medical specialities. We are a vibrant, friendly and supportive multidisciplinary team which includes psychotherapists, counsellors, clinical and counselling psychologists, mental health liaison staff and administrators. We prioritise supporting our staff and their development by providing both individual and group supervision as well as regular team discussions.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;We are looking for highly experienced, skilled and committed individual, who is resilient and adaptable, and able to meet the challenge of this complex work. We require a candidate who is able to work on their own initiative, as well as in a team with a displayed interest in the link between physical and psychological health.&lt;/p&gt;\n&lt;p&gt;Interview will be in two stages to give candidates a clear idea of the post and for us to experience them in both group and individual settings. The Stage 1 Group interview will be on Monday 23rd November 2020.&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Dr Mandy Giles, Service Manager &amp; Consultant Clinical Psychologist 01245 51 6874&lt;br /&gt;Psychotherapy.Counselling@meht.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameMandy GilesJob titleHead of Psychological Therapies ServiceEmail addressPsychotherapy.Counselling@meht.nhs.ukTelephone number01245 516874&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121033.jpg", "name": "Mid and South Essex NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121033"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Broomfield, Chelmsford", "postalCode": "CM1 7ET"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7746", "longitude": ".465452"}}, "title": "Highly specialist Clinical psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248071", "validThrough": "2020-11-12T23:59:59+0000"}