{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19768", "minValue": "19768", "unitText": "YEAR", "value": "£11.76 Per Hour"}}, "datePosted": "2020-10-22T11:31:14+0100", "description": "&lt;p&gt;&lt;strong&gt;Would you like the opportunity to join our dynamic and innovative Specialist Substance Misuse Service?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Surrey and Borders Partnership Trust are looking for a temporary Data Administrator who thinks analytically, has good attention to detail, can problem solve, has excellent organisation skills and is comfortable working in a fast-paced, collaborative environment. Do you cover all the bases? If yes, we would love to hear from you. This is a great opportunity to start ASAP on a temp basis for 3 months and then leading to a potentiallypermanent position. Working Monday to Friday 9-5pm.&lt;/p&gt;\n&lt;p&gt;The role is working at i-access, a surrey-wide Drug and Alcohol service that aims to tackle substance misuse and dependency by offering help and hope to those that seek treatment and recovery. We are part of Surrey and Borders Partnership NHS Foundation Trust - a leading provider of high quality care in specialist mental health, learning disability and drug and alcohol services for people of all ages serving a population of 1.3 million across 140 services. Working as part of our countywide Business Support Team you will provide efficient and responsive data and administrative support within our multi-disciplinary service. You will be responsible for co-ordinating the Brief Intervention Treatment Pathway activity including electronic diary management, data reporting and internal and external communication functions.&lt;/p&gt;\n&lt;p&gt;Main Duties&lt;/p&gt;\n&lt;p&gt;Responsible for co-ordinating the Brief Intervention Treatrment Pathway activity including electronic diary management, data reporting and internal and external communication support functions.&lt;/p&gt;\n&lt;p&gt;To support the accurate and complete recording of the client information held on the EPR to conduct quality control audits and to ensure data collection requirements are being adhered to.&lt;/p&gt;\n&lt;p&gt;To report on service delivery and to document the findings succinctly&lt;/p&gt;\n&lt;p&gt;Update information onto the clinical database. Maintain an excellent working knowledge of the clinical database and ensure that data quality is maintained at a consistently high level. Run and process reports to monitor business processes and treatment outcomes.&lt;/p&gt;\n&lt;p&gt;To process discharges from treatment.&lt;/p&gt;\n&lt;p&gt;To work with Senior Managers to address new or changed data collection requirements.&lt;/p&gt;\n&lt;p&gt;To attend training and assist in the roll out of new guidelines/statistical requirements across Substance Misuse Teams.&lt;/p&gt;\n&lt;p&gt;To assist in developing new reports and analyses as required by Senior Managers.&lt;/p&gt;\n&lt;p&gt;Provision of a professional reception service, demonstrating a high degree of tact, diplomacy and confidentiality as the first point of contact for service users, carers, health professionals and 3rd party organizations.&lt;/p&gt;\n&lt;p&gt;To ensure robust processes for data collection and effective validation are in place.&lt;/p&gt;\n&lt;p&gt;Responsible for the management of team email systems and social media communication channels ensuring actions are taken within agreed timescales.&lt;/p&gt;\n&lt;p&gt;Assist with operating the referral, appointment, and discharge systems using the electronic calendar and tracking systems to achieve commissioned targets.&lt;/p&gt;\n&lt;p&gt;Responsible for drafting non-clinical letters, typing clinical and administrative documents in agreed formats and within specified timescales. Ensure documents produced are of high quality in terms of presentation and accuracy and that confidentiality is consistently maintained&lt;/p&gt;\n&lt;p&gt;Scanning and uploading documents to the EPR&lt;/p&gt;\n&lt;p&gt;Minute taking at multi-disciplinary team meetings and other meetings as required. Responsible for booking venues, preparing Agendas and ensuring that actions arising from the meeting are dealt with as appropriate&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;In return for your hard work commitment NHS Professionals (NHSP) can offer you some fantastic benefits:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Competitive Pay Rates - work this week, get paid next week!&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;First choice of placements at over 50 NHS Trusts in England&lt;/p&gt;\n&lt;p&gt;Dedicated consultants&lt;/p&gt;\n&lt;p&gt;Flexible working options&lt;/p&gt;\n&lt;p&gt;Free DBS and free training&lt;/p&gt;\n&lt;p&gt;Build holiday allowance&lt;/p&gt;\n&lt;p&gt;Support when you need it – 24/7 365 days&lt;/p&gt;\n&lt;p&gt;Stakeholder pension scheme&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Who are NHS Professionals?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;NHS Professionals (NHSP), owned by the Department of Health and Social Care (DHSC), works in partnership with hospital trusts to provide a bank of highly skilled temporary workers who want to work flexibly within the NHS.&lt;/p&gt;\n&lt;p&gt;Working through the NHSP bank means Trusts don’t have to rely on expensive agencies. Right now, we have over 130,000 members registered on our bank from various roles, grades and specialities, saving the NHS over £70 million each year. This money is then reinvested back into the NHS&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "NHS Professionals - Non-Clinical", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121070"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Guildford", "postalCode": "GU2 7LX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2351", "longitude": "-.584444"}}, "title": "Data Administration", "url": "https://www.jobs.nhs.uk/xi/vacancy/916238144", "validThrough": "2020-11-06T23:59:59+0000"}