{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £37,890 Pro rata"}}, "datePosted": "2020-11-05T13:46:16+0000", "description": "&lt;p&gt;&lt;strong&gt;This is a Band 6 post but we would welcome Band 5 applicants looking for a development opportunity.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is an excellent opportunity for an enthusiastic Band 6 Speech and Language Therapist with a genuine interest in stroke rehabilitation to fully integrate into our dynamic and innovative interdisciplinary team. We are based at the Woodfield Stroke Rehabilitation Unit at Bodmin Community Hospital, in central Cornwall. We have 9 dedicated stroke beds and are therapy and nursing led.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Relocation Expenses of up to 3K are available for this post&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are passionate about providing great therapy and supporting our patients to achieve their full potential. Speech and Language Therapy continues to be a vital component of our Inter Disciplinary Team model of practice. The post holder will be able to demonstrate their skills and lead and advise on all aspects of communication, capacity and dysphagia management. Although we place a firm emphasis on 1 to 1 therapy we actively promote opportunities for collaborative working across the professions. You also have a skilled, full time B3 Speech and Language Therapy assistant to support you in your role.&lt;/p&gt;\n&lt;p&gt;This is a great opportunity for somebody seeking to invest in their career and develop their skills, expertise, and individual approach to Speech and Language Therapy for patients in a stroke rehabilitation setting. You must enjoy working in an established, supportive and well-staffed team to deliver holistic patient centred care. We have excellent therapy resources and actively encourage participation and creative thinking!&lt;/p&gt;\n&lt;p&gt;This is an autonomous post within the Woodfield Stroke Unit. However, you will have access to professional support, supervision and CPD through our established network of Adult SLTs across both the community and acute trusts. These take place in the form of 1:1 and group supervisions, Stroke SLT specific meetings and CPD and county-wide SLT CPD days. We strongly encourage shared learning between teams, including shadowing other services to build relationships and share experiences.&lt;/p&gt;\n&lt;p&gt;As a team we provide a six day service and cover all bank holidays – the post holder must have the flexibility to contribute to this roster. The team delivers therapy across core hours of 8am – 6pm with staggered start and finish times in order to cover and support the mealtime service. The post holder must also have a current driving licence as there is a small local community caseload to be served.&lt;/p&gt;\n&lt;p&gt;This is a Specialist Band 6 post however we would also welcome applications from those who are keen to develop into a Band 6 role but proven experience in stroke care is essential. The Band 5 job description will apply for short listing purposes and in this respect, if we appointment to a Band 5 position progression to a Band 6 (inc pay) is dependent upon completion of required competencies within a mutually agreed timescale. &lt;strong&gt;&lt;em&gt;Full time hours are available. &lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Professional and Specialist supervision and support is in place from within the Trust’s SLT service and the Cornwall stroke pathway and there are many opportunities for additional training and CPD&lt;/p&gt;\n&lt;p&gt;If you have any questions, would like more information, or would like to arrange for an informal visit then please do contact any of us. We would love to hear from you&lt;/p&gt;\n&lt;p&gt;Robert Downie – Therapy Lead at Woodfield, Tel 01208 251371, or email Robert.downie1@nhs.net&lt;/p&gt;\n&lt;p&gt;Jennifer Lloyd – SLT Professional Lead, Tel: 07979800514 or email jenniferlloyd@nhs.net&lt;/p&gt;\n&lt;p&gt;Penny O’Brien – Clinical lead SLT, Acute stroke. Tel: 01872 252470 or email: Penny.O’Brien2@nhs.net&lt;/p&gt;\n&lt;p&gt;Cornwall is a beautiful and fulfilling place to live, with opportunities to make the most of the stunning coastline or moors. Summers are vibrant and full of entertainment and winters allow you to have whole beaches to yourself Attractive relocation packages are available to assist you in relocating to this beautiful area of the country!&lt;/p&gt;\n&lt;p&gt;If you are looking to work somewhere that is unconditionally respectful to all people and their families, that value their staff as individuals and continuously strive to be the best service it can be then this post could be the job for you&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Jan Showell, or Therapy Team Lead Robert Downie on 01208 251371&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120947.png", "name": "Cornwall Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120947"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bodmin Hospital, Bodmin", "postalCode": "PL31 2QT"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.4683", "longitude": "-4.74305"}}, "title": "Specialist Speech and Language Therapist (developmental opportunity)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257953", "validThrough": "2020-11-19T23:59:59+0000"}