{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "43772", "minValue": "37570", "unitText": "YEAR", "value": "£37,570-£43,772 per annum"}}, "datePosted": "2020-10-23T13:01:07+0100", "description": "&lt;p&gt;THIS IS A 6 MONTH SECONDMENT - INTERNAL CANDIDATES ONLY&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for us to recruit to a Band 7 post to lead our friendly Patient Escort team at both QMC and the City Campus, You will be working across campus 5 days a week&lt;/p&gt;\n&lt;p&gt;We are looking for a dynamic and motivated person with the appropriate experience and skills to work closely with the existing team structure and demonstrate the skills to support further development of these expanding services. You will need to demonstrate the ability to be able to work flexibly in diverse clinical environments. The successful applicant will have a high level of self-management skills including time management, prioritisation and organisation.&lt;/p&gt;\n&lt;p&gt;Excellent communication and interpersonal skills are essential to build on the network required for the role. You will also be able to demonstrate that you have successfully lead change previously and evidence of delivering initiatives and new ways of working.&lt;/p&gt;\n&lt;p&gt;You must be committed to a high standard of patient care and safety. You will have a flexible attitude to work and be able to work as part of a mulitdisciplinary team. Theatre experience / knowledge is essential. and support network is in place for the successful candidate.&lt;/p&gt;\n&lt;p&gt;All persons appointed to the post are required to hold registration with their appropriate professional regulatory body and to comply with their professional code of conduct. Evidence of on-going registration will be required.&lt;/p&gt;\n&lt;p&gt;Hours of work are 37.5 worked over 5 days and may include unsociable and out of hours shifts plus on-calls. There will also be the opportunity for the successful candidate to maintain some clinical shifts.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameRebecca ChambersAdditional contact information&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Rebecca.chambers@nuh.nhs.uk&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Theatre Matron&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "OTHER", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122234.jpg", "name": "Nottingham University Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122234"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "City Campus, Nottingham", "postalCode": "NG5 1PB"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9893", "longitude": "-1.16006"}}, "title": "Team Leader - Theatre Patient Escort- INTERNAL APPLICANTS ONLY", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240637", "validThrough": "2020-11-06T23:59:59+0000"}