{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "39681", "minValue": "32933", "unitText": "YEAR", "value": "£32,933 - £39,681 pa inc HCA"}}, "datePosted": "2020-10-27T11:46:59+0000", "description": "&lt;p&gt;West Hertfordshire NHS Trust has exciting opportunities for experienced and inspirational midwives to join our team. Following the National Maternity review ‘Better Births,’ it is clear that models of care where women know the midwife who is caring for them throughout their journey, have a positive impact on improving safety, clinical outcomes, as well as a better birth experience. This will also have an impact on reducing pre-term births, hospital admissions, and the need for intervention during labour.&lt;/p&gt;\n&lt;p&gt;In partnership with women, you will support informed decisions regarding place of birth, whether that is at home, in our midwife led birthing unit or consultant led obstetric unit, and develop mutually respectful relationships with both women and colleagues. This ensures that all women have access to the optimal birth environment in accordance with their choice and in line with evidence based practice. Midwives are consequently supported and enabled to practice in the optimal environments for all elements of midwifery care for all women (and their families) to enjoy a normal birth experience. You should be an experienced midwife, able to provide antenatal, intrapartum and postnatal care in line with the continuity of carer pathway.&lt;/p&gt;\n&lt;p&gt;You will provide a full range of health education, social care and advice to women, liaising with multi-disciplinary/agency groups are to continually improve maternity care for childbearing women and their families, being responsive to the needs of the women and obtain user views as appropriate. Supporting student midwives and junior members of staff as we guide and encourage them through their professional development, as well as receiving excellent senior midwife led support to ensure you fulfil your own personal potential. As our most valuable asset, we understand that that happy fulfilled staff will offer their best, and we aim to achieve this through development and fairness, within a supportive team approach.&lt;/p&gt;\n&lt;p&gt;The successful applicants will receive a comprehensive orientation programme and are assured that they will receive appropriate support.&lt;/p&gt;\n&lt;p&gt;West Hertfordshire Hospitals NHS Trust provides acute healthcare services to a population of approximately half a million people living in the West Hertfordshire and the surrounding areas. The Trust provides a range of more specialist services to a wider population, serving residents of North London Bedfordshire, Buckinghamshire and East Hertfordshire.&lt;/p&gt;\n&lt;p&gt;As an employer of over 4000 people we are one of the biggest employers in the area and see around a million patients each year.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;By email:- johanna.arundel@nhs.net Ward Manager for the birthing centre&lt;/p&gt;\n&lt;p&gt;Gemma.cree@nhs.net Ward Manager for postnatal ward (Katherine)&lt;/p&gt;\n&lt;p&gt;zowie.guminska@nhs.net Ward Manager for Antenatal (Victoria/MDAU/ANC)&lt;/p&gt;\n&lt;p&gt;hamdi.abdulle1@nhs.net Ward Manager for Delivery Suite&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "West Hertfordshire Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120820"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Watford General Hospital, Watford", "postalCode": "WD18 0HB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6491", "longitude": "-.404449"}}, "title": "Band 6 -  Midwife - Continuity of Carer, WACS", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244320", "validThrough": "2020-11-10T23:59:59+0000"}