{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Competitive"}}, "datePosted": "2020-10-30T14:08:24+0000", "description": "&lt;p&gt;&lt;strong&gt;Job Introduction&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Turning Point have been providing drug and alcohol services in the South West of England for over two decades. We aim to increase the number of substance misusing clients entering and successfully completing treatment, reduce substance related harm and improve the quality of life for our clients, their families and communities. We are now seeking to recruit an enthusiastic, dynamic and passionate Independent doctor to join our multi-disciplinary team offering comprehensive specialist clinical prescribing services and a range of psychosocial interventions across hub and satellite locations across Somerset/Wiltshire and Swindon.&lt;/p&gt;\n&lt;p&gt;As a doctor in the service you will provide safe, effective and evidence based care and interventions to service users. You will have experience of working in the substance misuse field and play a key role in the on-going delivery of high quality clinical interventions. You will work closely with the management team, clinical team, local healthcare professionals and key stakeholders to provide holistic care packages for service users throughout their recovery.&lt;/p&gt;\n&lt;p&gt;Turning Point is a recovery focused organisation. Our staff and volunteers are committed to helping our service users to improve their health &amp; wellbeingand to become free from dependency.&lt;/p&gt;\n&lt;p&gt;Turning Point is committed to safeguarding children, young people and vulnerable adults. All post holders are subject to a satisfactory Disclosure and Barring Service check.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Role Responsibility&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Turning Point participates in both the training of ST4-6 in addiction Psychiatry as well as clinical placements for trainee GP’s. There are numerous teaching opportunities.&lt;/p&gt;\n&lt;p&gt;Turning Point is committed to the on-going professional development of all our staff and we offer regular structured supervision, a well-developed monthly CPD program and full support with appraisals and revalidations. Through joining Turning Point, you will receive a warm welcome, peer support, extensive training, regular supervision and the chance to thrive in a lively and aspirational service.&lt;/p&gt;\n&lt;p&gt;We offer the option to participate in research.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Ideal Candidate&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Expressions of interest are sought from all grades of doctor, from Consultant Addiction Psychiatrist, Specialist Addiction Doctors, GP with special interest in Addictions as well as less experienced GPs and staff grade level doctors.&lt;/p&gt;\n&lt;p&gt;The successful candidate will have:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Experience in addiction medicine proportionate to grade.&lt;/li&gt;\n&lt;li&gt;Currently registered GMC&lt;/li&gt;\n&lt;li&gt;Previous experience of providing safe, effective and evidence based assessment, care and interventions for substance users&lt;/li&gt;\n&lt;li&gt;The legal right to work in the UK&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;In addition to the above we are seeking to appoint an individual who can also bring Turning Point’s core values to the role:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;We believe that everyone has the potential to grow, learn and make choices&lt;/li&gt;\n&lt;li&gt;We all communicate in an authentic and confident way that blends support and challenge&lt;/li&gt;\n&lt;li&gt;We are here to embrace change even when it is complex and uncomfortable#&lt;/li&gt;\n&lt;li&gt;We treat each other and those we support as individuals however difficult and challenging&lt;/li&gt;\n&lt;li&gt;We deliver better outcomes by encouraging ideas and new thinking&lt;/li&gt;\n&lt;li&gt;We commit to building a strong and financially viable Turning Point together&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;About us&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Why Turning Point?&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As a leading health and social care provider with more than 300 locations across England, we take real pride in the services we offer.&lt;/p&gt;\n&lt;p&gt;Across the varied regions, sectors and settings we operate within, our organisation is held together by a shared vision – and our people are connected by the same values. These include belief in potential, confidence in communication, embracing positive change and always treating each other as individuals.&lt;/p&gt;\n&lt;p&gt;We run all of our services on a not-for-profit basis; instead, we invest every penny back into our services and people. We never stop believing in change for the better, and we work constantly to improve the lives of the people we support.&lt;/p&gt;\n&lt;p&gt;Our people bring our vision to life. So, if you are enthusiastic, motivated and committed to support others to fulfilling their potential, here at Turning Point, we don&#39;t just offer you a job – we offer you a career.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What Benefits Will I Receive?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Of course, we know it&#39;s not about the money. But that doesn&#39;t mean we don&#39;t reward our people for their invaluable work with a benefits package that includes:&lt;/em&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Comprehensive opportunities to learn and develop, with silver accreditation from&lt;em&gt;Investors in People&lt;/em&gt;&lt;/li&gt;\n&lt;li&gt;33 days’ paid holiday a year, increasing with each year of service up to 35 days. Plus the option to purchase additional holidays&lt;/li&gt;\n&lt;li&gt;Flexible benefit options including cycle to work schemes and season ticket loans&lt;/li&gt;\n&lt;li&gt;Competitive pension and life assurance schemes&lt;/li&gt;\n&lt;li&gt;Employee assistance programme and access to online health and wellbeing support&lt;/li&gt;\n&lt;li&gt;Flexible working patterns to support work-life balance&lt;/li&gt;\n&lt;li&gt;Access to a wide range of discounts, including cinema tickets, grocery and high-street shopping and gym memberships&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We reserve the right to close this advert early if we are able to appoint to the vacancy before the advertised closed date.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Turning Point", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=131034"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Swindon/Wiltshire", "postalCode": "SN1 1SQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.559", "longitude": "-1.78286"}}, "title": "Speciality Doctor - Impact", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250481", "validThrough": "2020-11-30T23:59:59+0000"}