{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-10-29T08:15:57+0000", "description": "&lt;p&gt;Educational Mental Health Practitioner or Children&#39;s Wellbeing Practitioner – Band 5&lt;/p&gt;\n&lt;p&gt;In line with the government’s priority to increase access and availability of mental health and wellbeing support for children and young people, the new Education Mental Health Practitioner (EMHP) role is an opportunity to deliver evidence-based early interventions for children and young people, working across both educational settings and healthcare sectors.&lt;/p&gt;\n&lt;p&gt;Are you a qualified EMHP or about to qualify? Or are you a qualified Children&#39;s Wellbeing Practitioner? Are you passionate about delivering low intensity psychological interventions to children, young people, parents and carers?, if so then this is an exciting opportunity to be a key part of a team of people delivering interventions into schools and other settings in the Coventry and South Warwickshire area, You will have successfully completed or be about to successfully complete your EMHP training or CYPIAPT CWP training.&lt;/p&gt;\n&lt;p&gt;South Warwickshire is a large geographical area and you will need access to an independent means of transport and be willing to work flexibly across the day to provide support into schools and other educational establishments. You will undertake assessments of children and young people and deliver evidence based interventions in either group or individual situations, you will also provide training and consultation to schools and other agencies about mental health in children and young people and support schools on identifying specific areas of need.&lt;/p&gt;\n&lt;p&gt;Whilst in post you will receive clinical and line management supervision and have the support of the team around you.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Please note interviews are currently taking place through Microsoft Teams, this can be downloaded either through the App Store or Google Play for use on your phone/tablet. &lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further information please contact Chris Heydon Service Manager – 01926 881640 or email christine.heydon@covwarkpt.nhs.uk or Helen Rogers - Team Leader 07979245677 helen.rogers@covwarkpt.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Coventry and Warwickshire Partnership Trust (CWPT)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121204"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Orchard House, Leamington Spa", "postalCode": "CV31 1JQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.2848", "longitude": "-1.52344"}}, "title": "Education Mental Health Practitioner MHST - Band 5", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247628", "validThrough": "2020-11-12T23:59:59+0000"}