{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 £110,683 per annum per annum"}}, "datePosted": "2020-10-18T19:38:58+0100", "description": "&lt;p&gt;&lt;strong&gt;Appointment of a Substantive Consultant in Geriatric Medicine with a Special Interest in Frailty&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Rotherham NHS Foundation Trust is seeking to appoint an enthusiastic Consultant Geriatrician with a special interest in frailty. Applicants will have wide experience in geriatric medicine and have excellent team-working skills, with the abilities and professional skills to lead service developments throughout the Trust. This is a great opportunity to be involved in innovative service development and quality improvement within a forward thinking integrated care organisation.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;How We’ll Look After You&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;We will support the successful applicant to maximize their potential with a series of excellent benefits and opportunities: We will invest in your training and support you to pursue a successful and fulfilling career and encourage the development of &lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;your&lt;/span&gt;&lt;/strong&gt; sub-speciality interest.&lt;/li&gt;\n&lt;li&gt;Generous relocation and educational support packages are available. &lt;strong&gt;&lt;em&gt;Please contact the department for details&lt;/em&gt;&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;As a family friendly Trust we offer an onsite nursery to support our employees.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;The Department&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will join a fantastic multidisciplinary team, led by Dr Hafiz and colleagues. The department has expanded steadily and has become extremely effective in providing acute and rehabilitative care to frail, older medical admissions.&lt;/p&gt;\n&lt;p&gt;The post holder will be a key member of the team and will be integral to our newly designed frailty team, as we expand and develop the service. You will lead a team of multi-disciplinary staff in providing comprehensive geriatric care for frail patients over the age of 75, who present to the hospital. As part of a multidisciplinary team, you will be committed to delivering nationally and locally agreed clinical and quality targets.&lt;/p&gt;\n&lt;p&gt;You will work within an inpatient bed base that covers 3 wards and has an additional rehabilitation ward. You will be supported by 3 frailty nurse specialists, 2 Parkinson’s nurse specialists, 2 Registrars, 1 associate specialist, 2 GPVTS and 9 Trainees.&lt;/p&gt;\n&lt;p&gt;There is a strong commitment to high quality education and you will be encouraged to support in undergraduate and postgraduate teaching. As a clinical and educational supervisor you will shape future generations of physicians. The team are committed to, in addition to Grand Round presenting, dedicated Wednesday Geriatrics teaching sessions.&lt;/p&gt;\n&lt;p&gt;The post holder will also be expected to participate in the emergency out of hours General Medicine on call Rota.&lt;/p&gt;\n&lt;p&gt;The HCOP department at Rotherham is home to a friendly, diverse and accommodating team who are passionate about patient centered care and interdisciplinary working. We will welcome new colleagues and support them in all aspects of their role.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;“Patients’ time is the most valuable currency in healthcare. Let’s make every minute count”&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Area&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Rotherham is surrounded by beautiful countryside and picturesque villages, and situated within easy access of transport links, the Peak District National Park, and major urban centres, such as Sheffield and Leeds.&lt;/p&gt;\n&lt;p&gt;Housing in the area and surrounding areas is plentiful and good value compared to the national average. Satisfactory and affordable accommodation is also available on the hospital site.&lt;/p&gt;\n&lt;p&gt;There are several “outstanding” schools in the local area and coaches also run from Rotherham to several highly-regarded independent schools nearby.&lt;/p&gt;\n&lt;p&gt;An information pack detailing transport links, schools and a number of other useful local guidance can be requested from the department. We will cater this pack to individuals, with specific queries, upon request.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Informal enquiries are welcomed, please contact: &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Prospective candidates are encouraged to visit the department. For further information or to arrange a visit please Dr Hafiz (ahmed.hafiz@nhs.net) or via his secretary on 01709 424765 or Ben Vasey, Deputy General Manager, 01709 427343 (benjamin.vasey@nhs.net)&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "The Rotherham NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=131814"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Rotherham", "postalCode": "S60 2UD"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4144", "longitude": "-1.34257"}}, "title": "Consultant In Healthcare for Older People", "url": "https://www.jobs.nhs.uk/xi/vacancy/916231441", "validThrough": "2020-12-19T23:59:59+0000"}