{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-10-28T14:46:08+0000", "description": "&lt;p&gt;&lt;span&gt;An opportunity has arisen for a band 5 nurse to join the team at Alexander House, Locked Rehabilitation service for adult males with intellectual developmental disabilities detained under MHA. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This statement should identify what makes the Trust/Department stand out as an employer of choice. For example:&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Nottinghamshire Healthcare is one of the country’s leading mental health and learning disability service providers, employing over 6000 staff to provide these services over more than 100 sites. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Alexander house provides 24-hour care to adult males with mild to moderate intellectual developmental disabilities (IDD), who are detained under the Mental Health act. We offer a service that focuses on person centered working to promote a safe, secure and therapeutic environment where individuals can flourish and progress towards an improved quality of life.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The unit provides a multi-disciplinary team approach, supporting patients with all aspects of their individual treatment and recovery care pathway from admission through to discharge.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are looking for a band 5 staff nurse with a genuine interest in working with people who present with a complex range of IDD, Mental Health and/or Risk Issues associated with offending behaviours. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are looking for nurses who have skills in risk management and an understanding of person centered approaches. You will have the ability to work therapeutically with this client group, utilising clear, evidence driven approaches. Using your knowledge and experience you will contribute to assessment, formulation, implementation and evaluation of individual client’s needs. You will need to have skills in developing monitoring and evaluating care plans and risk management plans. You will play an active role in MDT discussions and provide leadership and guidance to junior members of staff.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will be a named nurse and act as a care coordinator and performs tasks associated with this role including liaising with families/carers external agencies and professionals involved in their care.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Clinical and managerial supervision will be provided with the opportunity to engage in reflective practice. Further training and continual professional development opportunities will be offered.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The post will involve working shift patterns, including long days, evenings and weekends (unsocial hours)&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameFiona DennisJob titleManagerEmail addressFiona.dennis@nottshc.nhs.ukTelephone number01623 404621Additional contact information&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Fiona Dennis, Unit Manager Alexander House on 01623 404621.&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120975.jpg", "name": "Nottinghamshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120975"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Mansfield", "postalCode": "NG18 5QJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.1414", "longitude": "-1.20591"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247044", "validThrough": "2020-11-11T23:59:59+0000"}