{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "49036", "minValue": "49036", "unitText": "YEAR", "value": "£49,036"}}, "datePosted": "2020-10-30T14:16:55+0000", "description": "&lt;p&gt;Locum Appointment of Service Specialty Trainee 4+&lt;/p&gt;\n&lt;p&gt;An exciting opportunity for a LAS ST4+ post has become available at the CQC rated ‘Outstanding’ trust, Hertfordshire Partnership University NHS Foundation Trust.&lt;/p&gt;\n&lt;p&gt;The post will be based at Kingfisher Court in Hertfordshire, and is available until February 2021 (with the possibility of an extension).&lt;/p&gt;\n&lt;p&gt;This post would be at aimed at ST4-6 level (i.e. 3-5 years post qualification/post foundation level) and whilst this is not an approved training post we would mirror the training opportunities given to those in training posts and the successful applicant will work alongside and share on-call duties with our Senior Trainees.&lt;/p&gt;\n&lt;p&gt;Access to supervision is excellent and post holders will be supported in maintaining their training portfolio.&lt;/p&gt;\n&lt;p&gt;Study Leave opportunities are available at HPFT, as well as in house training which are available for both our Trainee Doctors and Trust Grade Doctors.&lt;/p&gt;\n&lt;p&gt;The successful candidate will need to be able to communicate well with professionals and relatives; prioritise their workload and work effectively within a Multidisciplinary team.&lt;/p&gt;\n&lt;p&gt;Hertfordshire Partnership University NHS Foundation Trust welcomes applications from individuals who are welcoming, kind, professional, respectful and professional.&lt;/p&gt;\n&lt;p&gt;Hertfordshire is a good place to live, with exceptional schools and excellent transport links to Central London.&lt;/p&gt;\n&lt;p&gt;Eligibility: Candidates should be fully registered with the GMC and have a license to practice, as well having significant experience and a real interest in psychiatry, please note the Trust is not able to provide sponsorship to obtain GMC registration.&lt;/p&gt;\n&lt;p&gt;Occupational Health &amp; Disclosure &amp; Barring of Service Checks (DBS): The appointment will be subject to clearance from the Occupational Health Department and the DBS.&lt;/p&gt;\n&lt;p&gt;References: Any offer of appointment will be subject to the receipt of satisfactory references one of which must be from current employer and which cover the last three years of employment and/or education.&lt;/p&gt;\n&lt;p&gt;Part time or job sharing applicants are also welcome to apply.&lt;/p&gt;\n&lt;p&gt;**Please note should sufficient applications be received HPFT reserve the right to close this vacancy at any time, we always encourage all interested applicants to apply at their earliest convenience to avoid disappointment**&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120841.png", "name": "Hertfordshire Partnership University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120841"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Kingfisher Court, Radlett, Hertfordshire", "postalCode": "WD7 9HQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7047", "longitude": "-.305165"}}, "title": "LAS ST4+ in Psychiatry", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250525", "validThrough": "2020-11-15T23:59:59+0000"}