{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "107668", "minValue": "79860", "unitText": "YEAR", "value": "£79,860 - £107,668 per annum"}}, "datePosted": "2020-10-01T08:16:51+0100", "description": "&lt;p&gt;Online applications are invited to apply for a full time or part time Consultant posts in Anaesthetics.&lt;/p&gt;\n&lt;p&gt;We are welcoming applications from candidates keen to work within a forward thinking and innovative team here at Southampton General Hospital.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;ABOUT THE TEAM&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are seeking to appoint whole time equivalent Consultant Anaesthetists to increase the provision of Anaesthetic services across our theatres and pre-assessment clinics.&lt;/p&gt;\n&lt;p&gt;We require the services of Anaesthetists in hepato-biliary surgery, thoracic surgery, interventional neuro-radiology, neuro-surgery, obstetric anaesthesia, endoscopy, breast surgery, spinal surgery, and orthopaedic surgery. Candidates would be expected to provide a small amount of pre-assessment clinic work linked to their interests. There are opportunities for pre-hospital care (Helicopter Emergency Medical Services) as described below.&lt;/p&gt;\n&lt;p&gt;There will be an on-call commitment, for either the neuro theatres on call rota, or the general on call rota, by agreement.&lt;/p&gt;\n&lt;p&gt;This large department offers all major specialties and there are opportunities for the successful applicant to request a wide variety of work, subject to mutual agreement with the Care Group Lead and the needs of the Trust.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;WHAT YOU’LL DO&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The job plan would include approximately 5 all day lists per fortnight. One of these is expected to be a long list, to include an evening session.&lt;/p&gt;\n&lt;p&gt;There is likely to be a pre-assessment clinic in addition, usually 1 in 4 weeks, as agreed at job planning, and linked to a regular operating list.&lt;/p&gt;\n&lt;p&gt;All Consultants are asked to work up to 20% of their lists as flexible lists, covering the leave of others in the specialties they know best. This allows the expertise to be maintained in specialty lists when Consultants are on leave.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;WHAT WE’RE LOOKING FOR&lt;br /&gt;&lt;/strong&gt;Applicants should have the below as a requirement;&lt;/p&gt;\n&lt;p&gt;· Full GMC registration.&lt;/p&gt;\n&lt;p&gt;· FRCA or equivalent.&lt;/p&gt;\n&lt;p&gt;· CCT in anaesthesia&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;ADDITIONAL INFORMATION &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Individuals wishing to apply must be fully registered with the General Medical Council (GMC) and should be either already on or within 6 months of eligibility to be included on the specialist register of the GMC.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be employed under the terms and conditions of service for Consultants (England) 2003.&lt;/p&gt;\n&lt;p&gt;Interview date TBC&lt;/p&gt;\n&lt;p&gt;Job Reference: 188-MT0326-MEDICAL This vacancy closes on or before: 12/11/2020&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;WHAT WE CAN OFFER YOU&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As one of the largest acute teaching Trust’s in England, we can offer learning and development opportunities to help you achieve the career you aspire to. We believe you deserve the best possible surroundings in which to do your job and we want to support you in doing your job to the best of your ability.&lt;/p&gt;\n&lt;p&gt;As a Trust, we support flexible working and will consider requests taking into account the needs of the service. You’ll have an opportunity to discuss this at interview. Our LiveWell and inspire programme offers opportunities, support and advice, including smoking cessation services, exercise and activity classes, and support for mental health.&lt;/p&gt;\n&lt;p&gt;UHS employees are able to access a huge range of NHS discounts, are entitled to a minimum of 35 days paid holiday (pro rata) on appointment, can access on-site nursery facilities (subject to availability), and we offer a generous pension scheme.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;ABOUT OUR TRUST AND SOUTHAMPTON&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;UHS is rated ‘Good’ by the CQC and in the latest national NHS Staff Survey, we were in the top 10 acute trusts for staff engagement and for staff recommending the hospital as a place to work or receive care.&lt;/p&gt;\n&lt;p&gt;Southampton is an attractive place to live and work situated on the south coast, with an international airport and only an hour on the train from central London. The New Forest National Park and the beaches of the Jurassic coast are also right on our doorstep. The city offers living costs 20% lower than those in London, 13 schools rated outstanding by Ofsted and 13 nearby green spaces to enjoy.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;FOR FURTHER INFORMATION OR TO APPLY&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you’re interested in applying for this role, we’d encourage you to get in touch using the contact information at the bottom of this advert with any questions or if you would like to arrange an informal visit. Alternatively, if you’re ready to apply, please follow the link below to complete an application.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Dr Lucy White&lt;/p&gt;\n&lt;p&gt;Consultant Anaesthetist&lt;/p&gt;\n&lt;p&gt;lucy.white@uhs.nhs.uk&lt;/p&gt;\n&lt;p&gt;02381 206837&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121042.gif", "name": "University Hospital Southampton NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121042"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southampton General Hospital, Southampton", "postalCode": "SO16 6YD"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.933", "longitude": "-1.4351"}}, "title": "Consultant In anaesthetics", "url": "https://www.jobs.nhs.uk/xi/vacancy/916207507", "validThrough": "2020-11-12T23:59:59+0000"}