{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-10-14T11:31:43+0100", "description": "&lt;p&gt;This is an exciting opportunity for a motivated, dynamic, inspirational and experienced Family Therapist to join the service. We would welcome applications from people who are suitably qualified and hold an active registration with the UKCP.&lt;/p&gt;\n&lt;p&gt;Following significant investment from the Welsh Government in 2016, Cwm Taf CAMHS has expanded its Psychological Therapy Service. Treatment modalities offered include Systemic Family Therapy, alongside CBT, EMDR, Clinical and Counselling Psychology&lt;/p&gt;\n&lt;p&gt;This is a post within a flourishing multi-disciplinary Network covering Cwm Taf and Abertawe Bro Morgannwg University Health Board areas.&lt;/p&gt;\n&lt;p&gt;The post holder will hold a specialist caseload. The main role of the post holder will be to provide Systemic Family Therapy Interventions and provide supervision and consultation as required. The post holder will work closely with the lead for Family Therapy and Head of Psychological Therapies to contribute to the planning, coordination and delivery of the Community Psychological Therapy Service. This will include the provision of training and the development of therapeutic skills.&lt;/p&gt;\n&lt;p&gt;The team has several different disciplines which work together to think and understand a child and families presenting difficulties. The Psychological Therapies service works collectively, is highly supportive and operates using a MDT approach. We offer supervision and have a robust induction which is monitored throughout an employee’s employment. The service is highly approachable and is highly ambitious of supporting young people and staff well-being. We welcome applications from highly motivated individuals who would like to make a difference and engage with young people and families. The service delivers interventions which are evidenced based.&lt;/p&gt;\n&lt;p&gt;To succeed in this role you will need to build excellent relationships, have good communication skills, a strong eye for detail and adhere to professional standards. You must be willing to embrace new challenges and be committed to helping create innovative opportunities for developing and improving the CAMHS Service. Successful candidates must be able to establish and manage positive relationships with colleagues and partner agencies. We offer excellent CPD opportunities and are committed to developing career pathways within the service. We look forward to hearing of your interest. Please do not hesitate to contact us and discuss the post informally should you wish to do so in the first instance.&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; Welsh and/or English speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Cwm Taf Cares - &lt;/strong&gt;Our philosophy Cwm Taf Cares is at the heart of everything we do as we are committed to the health, wellbeing and development of our staff.&lt;/p&gt;\n&lt;p&gt;We provide healthcare services to people living in Swansea Bay, Neath, Bridgend, Merthyr Tydfil, Rhondda Cynon Taf county borough areas. We are ideally situated between Wales’s capital city, Porthcawl to the west, and the stunning scenery in the Beacon Beacons to the north.&lt;/p&gt;\n&lt;p&gt;Our vision is to care for our communities and patients by preventing ill-health, promoting better health, providing excellent services and reducing the need for inpatient care wherever possible through the provision of strengthened home, primary and community care.&lt;/p&gt;\n&lt;p&gt;We value the diversity of our staff and welcome applications from people from protected groups under the Equality Act 2010, this specifically includes age, gender, sexual orientation, gender identity/reassignment, race, religion, disability, pregnancy and maternity and marriage and civil partnership.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please check your email account regularly&lt;/strong&gt;. Successful applicants will receive all recruitment related correspondence via the email account registered on the application form.&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; Welsh and/or English speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Closing date: 16th November 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Elissa Lewis&lt;/p&gt;\n&lt;p&gt;Senior Family Therapist&lt;/p&gt;\n&lt;p&gt;Elissa.Lewis@wales.nhs.uk&lt;/p&gt;\n&lt;p&gt;01656 752800&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123872.png", "name": "Cwm Taf Morgannwg University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123872"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Tonteg Child &amp; Family Clinic and other Cwm Health Board Sites, Pontypridd", "postalCode": "CF38 1HE"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5726", "longitude": "-3.31702"}}, "title": "Family Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916225993", "validThrough": "2020-11-16T23:59:59+0000"}