{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 to £19,337 pa"}}, "datePosted": "2020-11-03T16:15:24+0000", "description": "&lt;p&gt;&lt;strong&gt;Health Care Support Worker opportunities&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you are caring, compassionate and enthusiastic and would like to be part of our care teams on wards supporting patients with mental health, learning disability and physical health conditions, we are looking for people with a strong value base from a broad range of backgrounds and experience.&lt;/p&gt;\n&lt;p&gt;You should have a desire to work in the NHS, be motivated and flexible as this role will require you to work a 24 hour shift pattern, which may include long days, long nights (12 hour shifts) weekends and bank holidays, plus travelling to various locations.&lt;/p&gt;\n&lt;p&gt;We will support you through a level 2 health and social care qualification while you work. You must have a good standard of education in maths and English, equivalent to a level 1 (GCSE D to G or above), and be able to provide your certificates. Please see additional information for full details&lt;/p&gt;\n&lt;p&gt;Our Trust covers a large geographical area including Barnsley, Wakefield, Dewsbury, Huddersfield and Halifax which includes inpatient, community, stroke/neuro rehabilitation and forensic services.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;You must be aged 18 or over to apply and must be able to provide certified evidence of all relevant qualifications.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will be employed on a substantive basis on 37.5 hours per week.&lt;/p&gt;\n&lt;p&gt;The starting salary will be £18,005 per annum (average pay £22,500 up to £24,500 including unsocial hours, bank etc); however relevant NHS experience will be recognised on the band 2 payscale. Progression up the scale will be subject to achievement of the qualification (if applicable) and evidence of satisfactory progression.&lt;/p&gt;\n&lt;p&gt;You will be entitled to a minimum of 27 days annual leave plus 8 days statutory bank holidays over the 12 month period.&lt;/p&gt;\n&lt;p&gt;Further details about our services can be found on the Trust’s website.&lt;/p&gt;\n&lt;p&gt;Please provide information in support of your application relating to your skills, and personal qualities. You should relate these to the essential and desirable requirements of the post. Therefore you should look at the person specification and tell us how you think you meet the criteria providing examples as necessary. The information you provide can include details of work experience, courses, hobbies or voluntary work.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;All shortlisted candidates will be invited in dial into a Skype or Microsoft Teams interview, scheduled to take place on: Thursday 26th November and/or Saturday 28th November. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If you are successful, you will be offered a start date once all of your satisfactory pre-employment checks have been completed. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You must have:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Been a resident in the UK/EU for the last three years.&lt;/li&gt;\n&lt;li&gt;Not be currently undertaking any form of formal government-funded education.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;This post will be subject to pre-employment checks, including DBS.&lt;/p&gt;\n&lt;p&gt;If you are in receipt of any benefits and you require support please speak with your local Job Centre Plus.&lt;/p&gt;\n&lt;p&gt;Informal enquires to Colin Hill, Safer Staffing Project Manager on 07768 021346 or Rebecca Miller-Andrews/Claire Hartland, Human Resources, on 07826 919152 /07881 008185.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "South West Yorkshire Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122193"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Various locaitons available trustwide", "postalCode": "WF1 3SP"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.6988", "longitude": "-1.49218"}}, "title": "Health Care Support Worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254738", "validThrough": "2020-11-15T23:59:59+0000"}