{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 to £110,683 per annum"}}, "datePosted": "2020-11-02T14:39:43+0000", "description": "&lt;h1&gt;&lt;strong&gt;Royal Brompton and Harefield NHS Foundation Trust&lt;/strong&gt;&lt;/h1&gt;\n&lt;h1&gt;&lt;strong&gt;Joint post between Royal Brompton and Harefield NHS Foundation Trust, Guy&#39;s and St Thomas&#39; NHS Foundation Trust and St George&#39;s University Hospitals&lt;/strong&gt;&lt;/h1&gt;\n&lt;h1&gt;&lt;strong&gt;Locum Consultant Cardiologist with a Special Interest in Inherited Cardiac Conditions&lt;/strong&gt;&lt;/h1&gt;\n&lt;h1&gt;&lt;strong&gt;Reference: 312-RBH-LCON-CARD-0012&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;The Royal Brompton &amp; Harefield NHS Foundation Trust is renowned nationally and internationally for excellence in diagnosis, treatment and research of patients with cardiothoracic diseases. It is the largest postgraduate specialist heart and lung centre in the United Kingdom with sites in Chelsea, London and Harefield, Middlesex. We strive to develop our staff both personally and professionally to ensure our patients get the first-class service they deserve.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Royal Brompton &amp; Harefield NHS Foundation Trust, Guy’s and St Thomas’ NHS Foundation Trust and St George’s University is seeking to appoint a full time Locum Consultant Cardiologist with a Special Interest in Inherited Cardiac Conditions. This post is for 12 months in the first instance, however renewable for a second year by mutual agreement.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This is a new position; it is a clinical academic fixed-term whole-time Locum Consultant Cardiologist in complex Inherited Cardiac Conditions. The successful applicant is expected to have additional interest and expertise in Cardiac Magnetic Resonance and Sports Cardiology. The host institution is the Royal Brompton and Harefield NHS Foundation Trust. The post-holder is expected to work collaboratively within the 3 institutions involved and other centres of excellence in these fields.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The appointee will lead and deliver outpatient Inherited Cardiac Conditions clinics and ward rounds, deliver and contribute to the development of ICC service at the Royal Brompton Hospital and GSTT/KCH, contribute to the CMR service at GSTT/KCH and Sports Cardiology at SGUL. The appointee will also collaborate within, but also beyond the ICC care group, with colleagues of other disciplines, including imaging, surgery, arrhythmias and heart failure, to provide holistic care and a seamless service for patients with complex conditions.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The appointee will set up collaborations with other centres with similar services, plan and support initiatives that will advance the quality of the health care offered by the Trust, and plan, lead, conduct and participate in research studies in the field of Inherited Cardiac Conditions, CMR and Sports Cardiology.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Applicants are required to be fully registered Medical Practitioners and must be on the GMC’s Specialist Register or be eligible for admission to the Register within six months from date of interview for the post.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Informal enquiries may be made to &lt;strong&gt;Dr Antonis Pantazis&lt;/strong&gt;, Consultant Cardiologist, Chair of ICC – a.pantazis@rbht.nhs.uk &lt;strong&gt;Dr Gerry Carr-White&lt;/strong&gt;&lt;strong&gt;, &lt;/strong&gt;Consultant Cardiologist, Lead of ICC at GSTT – gerry.carr-white@gstt.nhs.uk&lt;strong&gt;, Dr Michael Papadakis, &lt;/strong&gt;Consultant and Reader in Cardiology at SGUL – mipapada@sgul.ac.uk and/or &lt;strong&gt;Dr Vias Markides&lt;/strong&gt;, Consultant Cardiologist &amp; Divisional Director, RBH Heart Division – v.markides@rbht.nhs.uk Alternatively, please contact the Medical Recruitment team, Sophia White on 0207 351 8688 (s.white3@bht.nhs.uk).&lt;/p&gt;\n&lt;p&gt;Please apply for the position using the &quot;Apply for this job&quot; button. Please complete the online application form and include the full names, work addresses and fax numbers of three clinical referees, one of which must be your current or most recent employer.&lt;/p&gt;\n&lt;p&gt;Shortlisting details and interview arrangements will be communicated via email therefore please ensure you check your email account regularly following the closing date. In addition the Trust will be chasing up references via email so please ensure you include the email addresses and contact numbers for your referees to avoid delay in the recruitment process.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing date: Monday 16th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview date: TBC&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121402.jpg", "name": "Royal Brompton and Harefield NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121402"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "London", "postalCode": "SW3 4NP"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4889", "longitude": "-.162381"}}, "title": "Locum Consultant Cardiologist - Inherited Cardiac Conditions", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252465", "validThrough": "2020-11-16T23:59:59+0000"}