{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890"}}, "datePosted": "2020-10-13T08:55:56+0100", "description": "&lt;p&gt;Do you want an exciting and new challenge? Do you want to work within our rehabilitation services based at the Haywood Hospital?&lt;/p&gt;\n&lt;p&gt;We provide specialist multidisciplinary services to patients following trauma, illness or injury to maximise function, prevent deterioration and ensure safe discharge.&lt;/p&gt;\n&lt;p&gt;All post holders will work across the rehabilitation services in hospital and the community to provide a 7 day service.&lt;/p&gt;\n&lt;p&gt;In joining our team you will be influential in supporting both bed based and community rehabilitation with a strong focus on maximising function, prevention of deconditioning, education and prevention and lifestyle advice across a range of conditions.&lt;/p&gt;\n&lt;p&gt;We are looking for an enthusiastic and experiencedPhysiotherapist with:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Keen interest &amp; / or experience of working in rehabilitation services&lt;/li&gt;\n&lt;li&gt;Sound clinical skills in the assessment and management of patients in the acute, rehab and / or community environment&lt;/li&gt;\n&lt;li&gt;A strong commitment to developing self and others through training, supervision and mentoring&lt;/li&gt;\n&lt;li&gt;A strong commitment to working in and supporting a team&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We can offer:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A friendly, supportive and well experienced clinical team who are passionate about rehabilitation&lt;/li&gt;\n&lt;li&gt;Development of your clinical skills through supervision, training and networking opportunities across the Trust / rehabilitation services including voluntary and statutory agencies&lt;/li&gt;\n&lt;li&gt;Development of your leadership skills through training, service development projects and people management&lt;/li&gt;\n&lt;li&gt;Clear working structure through regular supervision and appraisal with In-service training and peer supervision an essential component for continued professional development&lt;/li&gt;\n&lt;li&gt;A strong rehabilitation research culture within the Trust&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Do you have a true passion for delivering positive outcomes in the field of specialist rehabiliattion ? If you would like to work alongside a dynamic multi-disciplinary team we would love to hear from you. If you would like any further general information regarding the role please contact:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Alexandra Davenport – Therapy Clinical Lead &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Alexandra.Davenport@mpft.nhs.uk&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Margurite O’Mara – Specialised Services Lead&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Margurite.O’mara@mpft.nhs.uk&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Midlands Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121040"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Haywood Hospital", "postalCode": "ST6 7AG"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.0571", "longitude": "-2.19003"}}, "title": "Band 6 Physiotherapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916223526", "validThrough": "2020-11-25T23:59:59+0000"}