{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-11-04T13:15:45+0000", "description": "&lt;p&gt;Do you want to be part of a rapidly developing service committed to improving the lives of Children, Young People and their families?&lt;/p&gt;\n&lt;p&gt;Wigan CAMHS are currently looking to recruit a full time Band 6 Senior Mental Health Practitioner.&lt;/p&gt;\n&lt;p&gt;We are seeking a highly committed Senior Nurse, Mental Health Practitioner to join our team. We will consider applications from those with experience of mental health assessments and therapeutic interventions with children and young people with mental health problems and their families . Experience of working with young people with Autistic Spectrum Conditions would also be advantageous.&lt;/p&gt;\n&lt;p&gt;In a period of exciting change and development, we are looking for experienced registered Mental Health Nurses, Social Workers or Occupational Therapists to join our multidisciplinary team in Wigan.&lt;/p&gt;\n&lt;p&gt;We are a busy, friendly service providing a range of treatment approaches to children and young people including individual, group and family work. We also work in close collaboration with partner agencies and with our children, young people and their families who are involved in all areas of the service such as recruitment of staff.&lt;/p&gt;\n&lt;p&gt;The successful candidate will have access to clinical supervision and individual line management to support your clinical work and personal well being.&lt;/p&gt;\n&lt;p&gt;If you are passionate about working with children and young people we would be keen to hear from you.&lt;/p&gt;\n&lt;p&gt;This post is subject to an enhanced with children’s and adult’s barred list Disclosure and Barring Service (DBS) Check. Successful candidates will either have a valid DBS check with the Trust or will be required to pay for the cost of the DBS Disclosure which is £47.50, the cost of which will be deducted from first salary.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Rick Barfoot (Clinical Team Manager) or Annabel Hunt&lt;/p&gt;\n&lt;p&gt;01942 775400&lt;/p&gt;\n&lt;p&gt;rick.barfoot@nwbh.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120746.jpg", "name": "North West Boroughs Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120746"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wigan", "postalCode": "WN2 2JA"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5438", "longitude": "-2.60545"}}, "title": "Senior Mental Health Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255991", "validThrough": "2020-11-17T23:59:59+0000"}