{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21415", "minValue": "21415", "unitText": "YEAR", "value": "12.74"}}, "datePosted": "2020-11-05T15:40:27+0000", "description": "&lt;p&gt;&lt;strong&gt;We are looking for someone to help provide the support for the staff in the Operation, Facilities and Estates Department.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;East and North Hertfordshire NHS Trust provide services to the local community to around 500,000 people, with the regional cancer centre supporting around 2 million people. They provide care to the community with an annual budget of around £350 million and more than 5,000 staff.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;            &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Would you like to be part of a Trust that value, recognise and celebrate staff members? Who work as a team to provide a high-level service? If yes, East and North Hertfordshire NHS Trust is the place for you.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We have long term placement opportunities available for a &lt;strong&gt;Contracts Business Support Coordinator &lt;/strong&gt;available at Lister Hospital, Stevenage, although you may be required to work on a temporary basis elsewhere within East and North Hertfordshire NHS Trust.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Responsibilities will cover several areas such as;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Assist the General Services Manager (Contracts); in effectively manage designated contracts within the division.&lt;/li&gt;\n&lt;li&gt;Support in negotiating effectively, supporting and advising General Services Manager with contracts negotiations, discussions and implementation involving where appropriate other managers within the division.&lt;/li&gt;\n&lt;li&gt;Through this role and with the support of the General Services Manager, the post holder will work with partners to propose service changes within the Estates &amp; Facilities Division.&lt;/li&gt;\n&lt;li&gt;To act as customer/client liaison and point of contact for estates department in all satellite sites. To undertake regular customer liaison duties and quality (PLACE) audits. To attend any meetings, relate to customer/client and service provider issues taking the lead to action all issues to a successful conclusion.&lt;/li&gt;\n&lt;li&gt;To act as liaison for the Trusts external clients. To attend all meetings necessary for this function, to monitor and to manage efficiently and effectively the service delivery for all facilities services at satellite sites.&lt;/li&gt;\n&lt;li&gt;Promoting best practice and marketing of the work of the department.&lt;/li&gt;\n&lt;li&gt;In liaison with the General Services Manager, advise and support on the development of structured systems for ensuring compliance with the contracting process for the Trust, including current and future monitoring arrangements.&lt;/li&gt;\n&lt;li&gt;Contribute to directorate and departmental budget planning by supporting during reviewing systems and departmental structures to identify efficiencies and to support the achievement of the financial balance and targets, within contracts.&lt;/li&gt;\n&lt;li&gt;Proactively build and manage relationships with contractors and other stakeholders, with engender openness, honesty and respect,&lt;/li&gt;\n&lt;li&gt;To communicate contracting information, including relating to contractual variances to key audiences as appropriate.&lt;/li&gt;\n&lt;li&gt;To provide administrative support to the drafting of documents to support the General Services Manager.&lt;/li&gt;\n&lt;li&gt;Support the implementation of project and service initiatives through timely and relevant information analysis and administrative support, in accordance with the agreed priorities of the General Services Manager.&lt;/li&gt;\n&lt;li&gt;To oversee and participate in monitoring the performance of internal and external contracts.  To ensure contractors / departments are complying with the service specifications in line with quality, quantity and cost and initiate measures to ensure compliance.&lt;/li&gt;\n&lt;li&gt;In conjunction with the General Services Manager maintain contact with consumers/service users by undertaking regular visits/customer satisfaction surveys and ensure that a register of compliments and complaints for the Facilities Department is maintained and action taken to deal with complaints is recorded.&lt;/li&gt;\n&lt;li&gt;To assist in the implementation, monitoring, review, rationalise and standardise Codes of Practice, Procedures and Policies as necessary for all aspects of the service. Ensuring all documentation is maintained on the central document management system.&lt;/li&gt;\n&lt;li&gt;Supporting with auditing, reviewing, proposing and implementing service improvements wherever possible in the form of operational policies.&lt;/li&gt;\n&lt;li&gt;Oversee and manage audits as required throughout the Trust, inviting key staff groups to support the annual PLACE assessment, support the training process and subsequent production / distribution of the action plan.&lt;/li&gt;\n&lt;li&gt;Ensure contracts plan are maintained and act as a primary point of contact attending ward and department meetings when required.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The working hours for this role are Monday to Friday 9.00am – 17.00 pm with a rate of pay £12.74 per hour.&lt;/p&gt;\n&lt;p&gt;In return for your hard work commitment NHS Professionals (NHSP) can offer you some fantastic benefits: –&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Competitive Pay Rates - work this week, get paid next week!&lt;/li&gt;\n&lt;li&gt;First choice of placements at over 50 NHS Trusts in England&lt;/li&gt;\n&lt;li&gt;Dedicated consultants&lt;/li&gt;\n&lt;li&gt;Flexible working options&lt;/li&gt;\n&lt;li&gt;Free DBS and free training&lt;/li&gt;\n&lt;li&gt;Build holiday allowance&lt;/li&gt;\n&lt;li&gt;Support when you need it – 24/7 365 days&lt;/li&gt;\n&lt;li&gt;Stakeholder pension scheme&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Who are NHS Professionals?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;NHS Professionals (NHSP), owned by the Department of Health and Social Care (DHSC), works in partnership with hospital trusts to provide a bank of highly skilled temporary workers who want to work flexibly within the NHS. &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Working through the NHSP bank means Trusts don’t have to rely on expensive agencies. Right now, we have over 126,000 members registered on our bank from various roles, grades and specialities, saving the NHS over £70 million each year. This money is then reinvested back into the NHS.&lt;/p&gt;\n&lt;p&gt;Register today for various flexible working options and long-term placement opportunities.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We look forward to hearing from you soon. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Disclaimer &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Please note, you will be contacted by email throughout the recruitment process, so please check your emails, including your junk/spam regularly. We regret we cannot contact everyone who is not selected for an interview, therefore if you do not hear from us within 21 days after submitting your application, please assume you have not been successful on this occasion.&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "NHS Professionals - Non-Clinical", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121070"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Stevenage", "postalCode": "SG1 4AB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.9242", "longitude": "-.211889"}}, "title": "Facilities and Contracts Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258389", "validThrough": "2020-11-19T23:59:59+0000"}