{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum"}}, "datePosted": "2020-10-15T14:15:58+0100", "description": "&lt;p&gt;Somerset NHS Foundation Trust have an exciting opportunity within our dynamic haematology department. We are inviting applications for:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;A Full Time Consultant Clinical Haematologist &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This post will be based at Musgrove Park Hospital, Taunton with provision of service at Yeovil District Hospital site. This is a replacement post for a retiring colleague.&lt;/p&gt;\n&lt;p&gt;To be eligible for this post you should have your CCT or be within 6 months of obtaining it.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About Us&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The successful candidate will join our current team of seven consultant haematologists, two SpRs, one CT1 and three CNSs to provide a high quality service in clinical and laboratory haematology. The post also requires the candidate to provide a regular clinical service at Yeovil District Hospital site shared with the rest of the consultant team. Although the retiring colleague had a subspecialisation in co-agulation there is no requirement to specialise in this aspect and the post is offered as General Haematology including malignant haematology. Subspecialisation is encouraged, as is our current practice, but this can be developed. They will take part in a 1 in 7 weekly on call rota. We would expect the candidate to take part in the lead roles in developing the service.&lt;/p&gt;\n&lt;p&gt;We provide a BCSH level 2b service in a specific 12 bed ward. We have full JACIE accreditation to provide an autologous stem cell transplantation service led by a transplant director, full time transplant CNS and data manager. The allograft service is provided by Bristol Royal Infirmary (BRI) with which we have close links, including a regular transplant MDT.&lt;/p&gt;\n&lt;p&gt;There is full CPA accredited laboratory provision including haemostasis and transfusion. Marrow reporting is performed locally with FACS and cytogenetics provided by North Bristol in its role as a SHIMDS. We provide a comprehensive Pan-Somerset haematology MDT provision serving a population of over 500,000.&lt;/p&gt;\n&lt;p&gt;We also provide a haemophilia service and a Teenage and Young Adult (TYA) service in conjunction with the regional centres based at BRI. We provide undergraduate teaching to students from Bristol and Peninsula medical schools.&lt;/p&gt;\n&lt;p&gt;Facilities for the treatment of cancer in Taunton are provided in the state of the art Beacon Centre which is able to also provide a comprehensive radiotherapy service led by the clinical oncologists. The wider directorate team includes an Acute Oncology Service, an Immunotherapy service and a TYA CNS.&lt;/p&gt;\n&lt;p&gt;The Trust also provides a nationally highly regarded Well-being service for Junior and Consultant Doctors as well as a thriving BAME network with a dedicated lead.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the Trust&lt;br /&gt;&lt;/strong&gt;Somerset NHS Foundation Trust is the first NHS trust on the English mainland to provide community, mental health and acute hospital services. We work with health and social care partners in Somerset to ensure that we deliver outstanding services that meet the needs of our population.&lt;/p&gt;\n&lt;p&gt;Our trust was formed on 1 April 2020 when Somerset Partnership NHS Foundation Trust and Taunton and Somerset NHS Foundation Trust merged. We provide community and mental health services across the whole of Somerset and acute hospital services in the north, west and centre of the county and beyond.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;In addition to joining a Cancer Centre rated as an area of Outstanding Practice by CQC (2016) you will get to experience life in the West Country with Taunton having numerous advantages to Quality of Life.&lt;/p&gt;\n&lt;p&gt;With its rural setting Somerset has low COVID prevalence but is still within 2 hrs of London.&lt;/p&gt;\n&lt;p&gt;It is straddled between areas of outstanding natural beauty and provides plenty outdoor activities being a hotspot for cycling, hiking and climbing alongside the abundance of music festivals. Taunton has easy access to some of the UK’s most desirable locations from the surfing beaches of North Devon and Cornwall, to the cosmopolitan centres of Bristol, Bath, and Exeter.&lt;/p&gt;\n&lt;p&gt;Nestled in the heart of Somerset as the County town, Taunton has a diverse range of shopping and restaurants, and boasts sporting arenas such as the County Cricket Ground, regularly hosting international fixtures, and the Taunton racecourse.&lt;/p&gt;\n&lt;p&gt;Somerset in particular also offers some of the best state and private schools in the country. Ranging from Public institutions such as Millfield, Queens College, Taunton School, Kings College, Wellington and Blundell’s, to award winning state schools such as the Richard Huish College which has been ranked in the top 10 of A-level providers nationally for the last eight years, through to secondary schools ranking in the top 5% nationally such as The Castle school.&lt;/p&gt;\n&lt;p&gt;For further information please contact Dr Deepak Mannari, Clinical Service Lead on 01823 342 294 or 01823 342 269 or you can email in deepak.mannari@SomersetFT.nhs.uk&lt;/p&gt;\n&lt;p&gt;To discuss this role in more detail, or to discuss the application process please contact Jordan Pollard, Medical Recruitment Consultant on 07765898212 or jordan.pollard@somersetft.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Further contact details :&lt;/p&gt;\n&lt;p&gt;Dr Belinda Austen, Consultant Haematologist, Pan Somerset MDT Lead - email Belinda.Austen@SomersetFT.nhs.uk. Tel 01823 342269/342294&lt;/p&gt;\n&lt;p&gt;Dr Lisa Lowry, Consultant Haematologist, Pathology Laboratory Lead. Email Lisa.Lowry@SomersetFT.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Somerset NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121360"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Musgrove Park Hospital, Taunton", "postalCode": "TA1 5DA"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.012", "longitude": "-3.11979"}}, "title": "Consultant Haematologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916228542", "validThrough": "2020-11-12T23:59:59+0000"}