{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-11-04T09:30:35+0000", "description": "&lt;p&gt;Located in the beautiful southern county of Hampshire, the Basingstoke and North Hampshire Hospital has a renowned international reputation for clinical excellence.&lt;/p&gt;\n&lt;p&gt;We are looking for enthusiastic and dynamic individuals to join our friendly and passionate team in the main theatres. Whether you are a new practitioner looking for a change or a more experienced practitioner looking for opportunities to progress and specialise in an encouraging department where you can flourish, we want to hear from you.&lt;/p&gt;\n&lt;p&gt;At Basingstoke we perform a wide range of procedures which include trauma and orthopaedics, world leading urology and gynaecology, major hepatobiliary procedures and we are one of two hospitals in the UK treating a rare and specialist appendix cancer known as Pseudomyxoma Peritonei with cytoreductive surgery and intraoperative chemotherapy. We are a highly regarded teaching hospital and regularly have visitors attending to observe our practices and techniques from all over the world.&lt;/p&gt;\n&lt;p&gt;The ‘Candover suite’ also provides high quality care to non NHS patients within the trust, with all profits re-invested back into the hospital.&lt;/p&gt;\n&lt;p&gt;We understand the importance of supporting professional development and offer a fantastic in-house development programme, with regular teaching sessions and one-to-one reviews with an emphasis on personal as well as professional support and wellbeing. We encourage extended roles such as the Surgical First Assistant and Assistant Theatre Practitioner. We provide a rich learning environment for student ODP’s and Nurses and you will help our team and the practice development lead to deliver this.&lt;/p&gt;\n&lt;p&gt;If you are a motivated individual with excellent communication skills and who is committed to providing the highest standards of patient care in a well-supported and motivated team, we want to hear from you. Due to the nature of the services we provide, we offer flexible shift patterns with our elective service currently running 5 days a week and a 7 day 24 hour emergency/trauma/maternity service.&lt;/p&gt;\n&lt;p&gt;Do you need to relocate for this role? For candidates who need to move to the area to take up this opportunity to work with us, the trust may provide single occupancy accommodation for your first 3 months of joining. The trust also covers NMC registration fees for newly qualified nurses for the first year.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Debi Chappel on ext 43449 or email Debi.Chappel@hhft.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121094.JPG", "name": "Hampshire Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121094"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Basingstoke and North Hampshire Hospsitals, Basingstoke", "postalCode": "RG24 9NA"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2806", "longitude": "-1.10986"}}, "title": "Staff Nurse - Theatres", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255187", "validThrough": "2020-11-18T23:59:59+0000"}