{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "66823", "minValue": "57990", "unitText": "YEAR", "value": "£57,990 - £66,823 pa inc pro rata"}}, "datePosted": "2020-10-16T17:01:07+0100", "description": "&lt;p&gt;&lt;strong&gt;Clinical Psychologist/Psychotherapist - 8b – Pathway Leads; 0.4 WTE (2 days a week); 3 posts available.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We have an exciting opportunity to join our Brent Integrated Psychology and Psychotherapy Service as one of our pathways leads.&lt;/p&gt;\n&lt;p&gt;Our service has recently reorganised itself to provide psychological treatment in 3 pathways – psychosis, personality disorder and complex mental health problems. Each pathway seeks to deliver evidence-based psychological and psycho-social interventions.&lt;/p&gt;\n&lt;p&gt;We welcome applications from qualified Clinical Psychologists and Psychotherapists. Applicants are required to be registered with the HCPC as a Clinical/Practitioner Psychologist or with UKCP-PP section and/or BPC.&lt;/p&gt;\n&lt;p&gt;We particularly welcome applications from individuals with experience of working with complex, challenging and high-risk presentations.&lt;/p&gt;\n&lt;p&gt;These posts would suit someone with an interest and experience in adults with a history of complex difficulties, as well as an interest in collaborating across disciplines.&lt;/p&gt;\n&lt;p&gt;The post-holders will be responsible for overseeing the pathway in terms of clinical oversight and decision making. and where appropriate, for managing staff within the pathway. The successful applicant/s will be required to contribute clinically within the stream in which they are located by providing assessment and treatment to a small caseload of complex patients. They will receive supervision and guidance from the Clinical Leads.&lt;/p&gt;\n&lt;p&gt;The post holders will work closely with the Consultant Clinical Psychologists/Consultant Adult Psychotherapist, developing the pathways and specifically the psychological provision, taking delegated responsibility and leadership from the clinical lead for the supervision and appraisal structure where appropriate. They will also be expected to work alongside the operational management structure in the team to design clinically effective care pathways compliant with Trust policy, evidence-based practice and our national and local key performance indicators.&lt;/p&gt;\n&lt;p&gt;Occasionally they will be required to represent the therapies team at meetings and/or deputise for the Consultant Clinical Psychologists/Consultant Adult Psychotherapist.&lt;/p&gt;\n&lt;p&gt;We have 3 posts available, one for each of the pathways. Each post will be 0.4 WTE (2 days a week). You may apply for more than one of the posts. &lt;strong&gt;Please state your preference for which pathway(s) you are applying in your statement of support.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Interview&lt;strong&gt; date:TBC&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDr Tracy Chotoo or Mra Melinda SchneiderAdditional contact information&lt;/p&gt;\n&lt;p&gt;Interested candidates are encouraged to contact Dr Tracy Chotoo, Consultant Clinical Psychologist on tracy.chotoo@nhs.net or Melinda Schneider, Consultant Clinical Psychologist/Adult Psychotherapist on melinda.schneider@nhs.net.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central and North West London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120736"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "15 Brondesbury Road, Kilburn, Kilburn", "postalCode": "NW6 6BX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5384", "longitude": "-.195297"}}, "title": "Clinical Psychologist/Psychotherapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916231210", "validThrough": "2020-11-15T23:59:59+0000"}