{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 to £24,157 pa"}}, "datePosted": "2020-10-20T15:00:23+0100", "description": "&lt;p&gt;We are expanding our team within our Neighbourhood Therapy teams in Barnsley and an exciting opportunity has arisen for a new Senior Therapy Assistant.&lt;/p&gt;\n&lt;p&gt;The successful applicant will work as part of a multi-disciplinary team across our Neighbourhood Teams.&lt;/p&gt;\n&lt;p&gt;Following initial assessment by a registered health care professional, you will exercise initiative and judgement in, care planning, goal setting, delivery, implementation, and evaluation of care&lt;strong&gt;, &lt;/strong&gt;working collaboratively and in partnership with others. You will contribute to enabling service users to reach their potentialand develop knowledge to promote holistic care.&lt;/p&gt;\n&lt;p&gt;You will work in close liaison with the wider MDT and other community therapy and nursing areas, therefore excellent communication and time management skills are essential.&lt;/p&gt;\n&lt;p&gt;The teams provide assessment, treatment and support within patient’s own homes, Independent Sector Care Homes and spot-purchased nursing care homes, based on patient need and dependency levels.&lt;/p&gt;\n&lt;p&gt;The use of a vehicle to undertake any necessary travel in connection with the duties of the post is essential along with the ability to work flexibly including shift work, weekends and bank holidays.&lt;/p&gt;\n&lt;p&gt;For more information please contact; Jane Illingworth If you are interested in this exciting new opportunity and would like an informal discussion regarding this role please contact Jane Illingworth 01226 644559 / jane.illingworth@swyt.nhs.uk&lt;/p&gt;\n&lt;p&gt;The post is 37.5 hours per week.&lt;/p&gt;\n&lt;p&gt;This vacancy may close early if sufficient applicants are received.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "South West Yorkshire Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122193"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Barnsley", "postalCode": "S70 3RD"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.547", "longitude": "-1.45462"}}, "title": "Senior Therapy Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916234884", "validThrough": "2020-11-11T23:59:59+0000"}