{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £24,157 pro rata"}}, "datePosted": "2020-10-30T12:31:35+0000", "description": "&lt;p&gt;We are looking for a highly motivated and enthusiastic person with medical secretarial experience to take on this very busy post as a Medical Secretary within our Specialist Medicine Care Group.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;Please note:&lt;/strong&gt;&lt;/span&gt; &lt;strong&gt;The role is for 22.5 hours per week and is a split role with part of the hours paid at Band 3 (14.37 hours) and the other part at Band 4 (8.13 hours).&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Site: The position can be passed at Scarborough or Bridlington (if Scarborough is the base, the candidate would be required to travel to Bridlington to work there on a Thursday).&lt;/p&gt;\n&lt;p&gt;Excellent administration/secretarial skills are vital as well as a good understanding of customer relations as you will be required to deal with patients, Consultants and GP&#39;s on a day to day basis.&lt;/p&gt;\n&lt;p&gt;The Medical Secretary will also be responsible for typing clinical and administrative letters, answering telephone enquires, dealing with patient referral queries and RTT validation.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be required to work well under pressure and manage their time and workload effectively. They will be required to work unsupervised and display initiative in highly pressured situations.&lt;/p&gt;\n&lt;p&gt;The post holder must hold a minimum of 4 GCSE&#39;s including Maths and English Language (minimum Grade C) or equivalent. This post also requires skills in medical terminology, word processing and audiotyping. Experience in the use of hospital based IT systems are also required.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;It&#39;s not just the area that&#39;s a great draw. In addition, as a member of our team you’ll have access to one of the most generous and comprehensive pension schemes in the UK, a minimum of 27 days annual leave (on top of Bank Holidays) and an award-winning package of staff benefits (see link on the right).&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please be advised that this vacancy may close prior to the closing date stated due to the high level of applications it may attract. If you would like to apply, please submit your application promptly to avoid disappointment.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;For further details / informal visits contact:&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Name: Briley Newham&lt;/p&gt;\n&lt;p&gt;Job title: Service Manager&lt;/p&gt;\n&lt;p&gt;Email address: briley.newham@york.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number: (01262) 423152&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "York Teaching Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120856"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Scarborough or Bridlington", "postalCode": "YO12 6QL"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.2817", "longitude": "-.434723"}}, "title": "Medical Secretary", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250183", "validThrough": "2020-11-15T23:59:59+0000"}