{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "35000", "minValue": "30000", "unitText": "YEAR", "value": "£30 - £35,000 per annum (depending on experience)"}}, "datePosted": "2020-10-23T12:19:10+0100", "description": "&lt;p&gt;This is a new and exciting, role in our growing Projects &amp; Programmes Team. We are looking for an experienced, enthusiastic and self-motivated Project Manager who enjoys working autonomously and is driven to deliver results. You will need to thrive on juggling multiple priorities in a fast-paced and changing environment. With unstinting attention to detail and a commitment to high quality delivery, every time, you will work with stakeholders across OxFed to get things done.&lt;/p&gt;\n&lt;p&gt;Right now, we are delivering a broad range of projects across education and workforce development through the Oxfordshire Training Hub (oxfordshiretraining.net) (a Training Hub hosted by OxFed). You will be part of our growing Projects and Programme team, working together with a range of other professionals to provide seamless project delivery. The role will involve directly owning a number of projects, with accountability for delivery (in scope, on time and on budget). You will also have the opportunity to actively evolve and shape new processes within the Project Management Office.&lt;/p&gt;\n&lt;p&gt;This role would suit candidates who are looking for a new challenge within Project Management and have a keen interest in NHS workforce development. If you have the aptitude to work in a fast-paced, constantly changing landscape, within a detail oriented Projects &amp; Programmes team, we would love to hear from you.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Privacy Notice attached (in other documents) must be completed.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We reserve the right to close the position once suitable applications have been received.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;No agencies please.&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "OxFed Health & Care Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=134820"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Oxford", "postalCode": "OX3 9RF"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7704", "longitude": "-1.22685"}}, "title": "Project Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240509", "validThrough": "2020-11-06T23:59:59+0000"}