{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 per annum"}}, "datePosted": "2020-10-27T19:00:15+0000", "description": "&lt;p&gt;&lt;strong&gt;Band 5 Haemodialysis Registered Nurse &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking to appoint an enthusiastic RGN to join our friendly and highly skilled nursing team. The unit has 29 Dialysis stations where our patients attend with chronic kidney disease requiring dialysis 3 times a week. We are situated approximately 1 mile away from the main Derriford site and we located in Estover. There is very easy access to the unit and parking on unit’s grounds is free of charge. &lt;/p&gt;\n&lt;p&gt;We are a nurse led unit and we take great pride in offering patient centred care to more than 150 patients from Devon and Cornwall. We are fully committed to providing a supportive learning environment for all of our nurses. Alongside learning specialist skills you will be encouraged to develop mentor students, new staff of all grades and essential management skills which will be paramount in any future career and re-evaluation. Renal is an ever developing clinical environment and we encourage staff to be actively involved in research projects. The unit has a good history of participation in nationwide nephrology conferences. &lt;/p&gt;\n&lt;p&gt;Applicants must be RN qualified with demonstrable post registration experience. . &lt;br /&gt; &lt;br /&gt; Our working hours are:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt; Monday-Saturday&lt;/li&gt;\n&lt;li&gt;Early early 06:00-14:00&lt;/li&gt;\n&lt;li&gt;Early shift 07:00– 15:00&lt;/li&gt;\n&lt;li&gt;Late  shift 12:00 – 20:00&lt;/li&gt;\n&lt;li&gt;Twilight shift 16:00 – 00:00 ( Monday, Wednesday, Friday) &lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;If you are keen to join an excellent team of staff then why not come and visit the unit and see for yourself. The successful applicant will need to be enthusiastic, visionary and self motivated with an interest in teaching and staff development. &lt;/p&gt;\n&lt;p&gt;If you would like to come and visit and see what we do please contact Manger unit Jen McDermott or Junior sister charge Diana Catrina or Dan Bates on 01752431700 &lt;/p&gt;\n&lt;p&gt;Interview date : 20th November 2020&lt;/p&gt;\n&lt;p&gt;***Preference will be given to internal Trust staff, as well as ‘Priority’ and &#39;At Risk&#39; status including NHS At Risk staff throughout Devon who are able to display recent relevant experience as dictated by the Person Specification.***&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120815.jpg", "name": "University Hospitals Plymouth NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120815"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "PLYMOUTH", "postalCode": "PL6 8DH"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.4167", "longitude": "-4.11371"}}, "title": "Staff Nurse Day Care", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245639", "validThrough": "2020-11-11T23:59:59+0000"}