{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum pro rata"}}, "datePosted": "2020-11-05T11:16:10+0000", "description": "&lt;p&gt;Western Cheshire Integrated Care Partnership are seeking an exceptional individual to take on the role of Lead MSK Therapist for a 12 month period.&lt;/p&gt;\n&lt;p&gt;The postholder is responsible for management of MSK services across the Western Cheshire patch in both the acute Countess of Chester Hospital, and in a range of community bases. The role is also responsible for management and development of the expanding First Contact Practitioner service in GP practices, and for maintaining excellent clinical standards across all MSK service areas.&lt;/p&gt;\n&lt;p&gt;The successful candidate will manage a large team of therapists and support staff, ensuring all governance and performance targets are met within the allotted resources. A key aspect of the role is to ensure strategic development of the service in line with regional and national initiatives, keeping abreast of expansion in the roles of AHPs, whilst working with acute and primary care to fully exploit the service opportunities. The ability to communicate across a range of formats is essential, along with highly evolved interpersonal and diplomatic skills.&lt;/p&gt;\n&lt;p&gt;This is a rare opportunity to work in a forward looking and dynamic environment within an established Lead Therapist group in an integrated therapy service. The role is challenging but enormously satisfying, and for the right candidate/s is a chance to shape an outstanding service to the benefit of Western Cheshire patients, families and health care colleagues.&lt;/p&gt;\n&lt;p&gt;Part time or job share will be considered for the right candidates, as will the potential to keep a clinical caseload in a specific speciality.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Alison Swanton&lt;/p&gt;\n&lt;p&gt;Associate Director of Service Delivery and Transformation&lt;/p&gt;\n&lt;p&gt;a.swanton@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Cheshire and Wirral Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121132"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Ellesmere Port Hospital / Countess of Chester, Chester", "postalCode": "CH2 1UL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.2118", "longitude": "-2.89903"}}, "title": "Lead Therapist - MSK", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257406", "validThrough": "2020-11-19T23:59:59+0000"}