{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum pro rata for pat time"}}, "datePosted": "2020-10-26T11:16:03+0000", "description": "&lt;p&gt;We are offering an exciting opportunity to join our team of pharmacists and technicians within cancer services at Sheffield Teaching Hospitals (STH). The post holder will provide clinical pharmacy services to Oncology and Haematology patients within the trust, with opportunity to utilise skills in pharmacist prescribing and pre-anticancer treatment assessment. There is an option to also specialise in palliative care.&lt;/p&gt;\n&lt;p&gt;STH provides Oncology Chemotherapy and Radiotherapy services to over 2 million patients per year primarily from South Yorkshire and North East Derbyshire. The Oncology unit at STH compromises 3 inpatient wards including a specialist teenage cancer unit, as well as 40 chair day case unit and 8 chair clinical trial unit supporting the Sheffield Experimental Cancer Medicines centre.&lt;/p&gt;\n&lt;p&gt;Cancer services at the trust are undergoing an exciting period of transformation with wholesale review of how services are delivered and renovation of the Weston Park building including the approval of a new multi-million pound pharmacy aseptic unit.&lt;/p&gt;\n&lt;p&gt;The successful applicant will be an enthusiastic pharmacist with an interest in developing their career in Cancer Services. Excellent communication and interpersonal skills and a postgraduate diploma in clinical pharmacy are required.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The post holder will participate in the weekend and bank holiday service within STH and the late night rota.&lt;br /&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Milly Finch&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Email: milly.finch@nhs.net&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;As part of the recruitment process at application stage, Sheffield Teaching Hospitals will assess applicants’ individual values and behaviours to ensure that these behaviours align with our PROUD values: Patient First, Respectful, Ownership, Unity and Deliver.&lt;/p&gt;\n&lt;p&gt;Our values are what help to make us different and ‘a Brilliant Place to Work’. We expect all our employees to share our values and demonstrate them in every aspect of their role.&lt;/p&gt;\n&lt;p&gt;You will be required to undertake an online values assessment at application stage and the results of this assessment will be used as part of the on-going selection process to assess your suitability for the post.&lt;/p&gt;\n&lt;p&gt;The deadline for completing the online assessment is midnight 14/11/2020.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The link to the assessment can be found below, the address can be copied and pasted into a search engine e.g. google:&lt;/p&gt;\n&lt;p&gt; login.talentqgroup.com/Login/SelfService/XVLZZUUHJL&lt;/p&gt;\n&lt;p&gt;If you have any queries, require any assistance to complete this assessment or have already completed it within the past 12 months, please contact the Trust Recruitment Team at &lt;strong&gt;sth.centralrecruitment@nhs.net&lt;/strong&gt;&lt;strong&gt;.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt; &lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121486.png", "name": "Sheffield Teaching Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121486"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Sheffield Teaching Hospitals, Sheffield", "postalCode": "S5 7AU"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4098", "longitude": "-1.45604"}}, "title": "Advanced Clinical Pharmacist (Oncology)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242163", "validThrough": "2020-11-09T23:59:59+0000"}