{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum + High Cost Allowance"}}, "datePosted": "2020-10-23T11:45:53+0100", "description": "&lt;p&gt;Occupational Therapist - Band 6Crisis Resolution Home Treatment Team Basildon MHU&lt;/p&gt;\n&lt;p&gt;If you are looking for a change and a new challenge this could be the opportunity you are looking for. A vacancy has arisen for a Band 6 Senior Occupational Therapist working within the Crisis Resolution Home Treatment team, based at Basildon MHU.&lt;/p&gt;\n&lt;p&gt;This post will particularly suit a motivated, experienced, treatment focussed and skilled occupational therapist, who is competent in the management of clients with a focus on utilising Occupational Therapy approaches and interventions that support recovery through this time of crisis care. We are seeking a resilient enthusiastic individual who is committed to the provision of therapy within the home treatment service. You’ll be working as part of a multi-disciplinary team, including nurses, another Occupational Therapist, support workers, psychiatrists and psychology. It is important that you are able to work autonomously with clients managing your own caseload staff whilst adopting a flexible and positive approach (there may also be some opportunity for developing group work across a care pathway).&lt;/p&gt;\n&lt;p&gt;As an individual you will have commitment to continue your own development and actively participate in providing a variety of learning opportunities for the team and service. In return we offer excellent training and development through our Workforce Development Department and within the service. Support is maintained through regular supervision and appraisal to assist you the successful candidate in setting realistic objectives enabling you in maintaining a positive attitude towards delivering quality customer care.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Benefits:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Season Ticket Loans&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;NHS discounts for staff&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Excellent Training facilities and opportunities&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;The opportunity to work bank shifts and expand knowledge and experience in other areas&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Salary Sacrifice schemes including lease cars and Cycle to Work&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Buying and Selling annual leave scheme&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Thinking of returning to practice as an Allied Health Professional (AHP)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;At EPUT we are keen to explore our local communities for Allied Health Professionals who are thinking of, or ready to return to practice. The AHPs who work in EPUT include Occupational Therapists, Podiatrists, Physiotherapists, Dietitians, Speech and Language Therapists and Art, Drama and Music Therapists. We understand that family, caring responsibilities and other personal circumstances can make it difficult to continue working as an AHP.&lt;/p&gt;\n&lt;p&gt;If your circumstances have changed and you are thinking of returning to work please contact us. We have a number of options to support you through the HCPC return to practice requirements; from completing your days of updating as a supportive employer, to paid return to practice and direct transition into a qualified role (dependent on return to the register in an agreed timescale).&lt;/p&gt;\n&lt;p&gt;Interested? Please contact glenn.westrop@nhs.net (Deputy Chief AHP) to start your journey or find out more- we look forward to hearing from you.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Diana Luckie&lt;/p&gt;\n&lt;p&gt;Head Occupational Therapist&lt;/p&gt;\n&lt;p&gt;diana.luckie@nhs.net&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120994.jpg", "name": "Essex Partnership University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120994"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Basildon Mental Health Unit, Basildon", "postalCode": "SS16 5NL"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5577", "longitude": ".450587"}}, "title": "Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240361", "validThrough": "2020-11-06T23:59:59+0000"}