{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 per annum pro rata"}}, "datePosted": "2020-11-04T10:48:35+0000", "description": "&lt;p&gt;&lt;strong&gt;We are embarking on an exciting major programme to redevelop our acute hospital site. Last year, NDHT was identified by the Government in its Health Infrastructure Plan (HIP) as one of 40 Trusts potentially eligible for a significant funding investment to transform our building and digital infrastructure. We are now beginning to develop our Strategic Outline Case, with the aim of being ready to deliver our plans in 2025-30. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity to be part of the reconfiguration of health services across the Devon system and to work with system partners to develop our estate and infrastructure to be fit for future healthcare provision.&lt;/p&gt;\n&lt;p&gt;We are looking for an experienced Programme Administrator who will provide essential support to our Programme Management to meet the needs of the different stages of the Trust Redevelopment programme. This is a challenging and unique role in contributing to the success of one of the largest work programmes the hospital has seen in recent times.&lt;/p&gt;\n&lt;p&gt;As well as providing the Programme Director and Programme Manager with core administrative support, the role will provide support to the Programme Board, ensuring the smooth operation of this key governance function. The Programme Team will be based out of a separate office location on the NDDH site, and the Programme Administrator will be responsible for the operation of all aspects of the office which will be the hub for internal and external Programme activity. Breadth and depth of experience will be the differentiators for this role.&lt;/p&gt;\n&lt;p&gt;If you are a self-starting, outgoing and confident, highly competent administrator looking to be part of local NHS transformation, then we want to hear from you.&lt;/p&gt;\n&lt;p&gt;The hours for this post are 37.5 per week.&lt;/p&gt;\n&lt;p&gt;This post is subject to formal matching. The Band is confirmed but there may need to be some revision to the JD required in the future.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing Date: 18/11/2020&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120959.jpg", "name": "Northern Devon Healthcare Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120959"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Barnstaple", "postalCode": "EX31 4JB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.0922", "longitude": "-4.05116"}}, "title": "Trust Redevelopment Programme Administrator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255462", "validThrough": "2020-11-18T23:59:59+0000"}