{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pro rata per annum"}}, "datePosted": "2020-10-15T12:31:15+0100", "description": "&lt;p&gt;Are you looking for a new challenge and would like to work with the Health Visiting service in East Kent?&lt;/p&gt;\n&lt;p&gt;We have a vacancy within the &lt;strong&gt;Shepway&lt;/strong&gt; &lt;strong&gt;District (Folkestone, Hythe and New Romney area) for a Band 5 Community Public Health Nurse.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Are you an enthusiastic and forward thinking registered nurse? Then why not apply for this Band 5 Community Public Health Nurse post with Kent Community Health NHS Foundation Trust and come and join our vibrant and forward thinking team.&lt;/p&gt;\n&lt;p&gt;The successful candidates will work as a member of the corporate Health Visiting team, with strong links to named GPs and local Children Centres.&lt;/p&gt;\n&lt;p&gt;We are looking for newly qualified or experienced, innovative nurses to join our commissioned service. You will be well supported and offered specific training for this role .&lt;/p&gt;\n&lt;p&gt;Kent Community Health NHS Foundation Trust is one of the largest healthcare providers in the country and we know how important it is to make sure our children and families are getting the right support and care.&lt;/p&gt;\n&lt;p&gt;Here are 10 great reasons to come and work for us:&lt;/p&gt;\n&lt;ol&gt;\n&lt;li&gt;We are committed to providing the best care for our clients and their families.&lt;/li&gt;\n&lt;li&gt;We listen to you, value you and embrace new ideas - we want all colleagues to contribute to the direction of the service.&lt;/li&gt;\n&lt;li&gt;We value our colleagues and are committed to your professional development - we want you, and your career, to flourish.&lt;/li&gt;\n&lt;li&gt;We offer excellent training and support further education. This role requires you to complete 2 bespoke modules at Canterbury Christchurch University to support your transition into your new post.&lt;/li&gt;\n&lt;li&gt;We operate a flexible working policy and would welcome applications full-time hours.&lt;/li&gt;\n&lt;li&gt;We offer amazing benefits to our colleagues, such as: Salary sacrifice schemes for bikes, cars and home electronics, flofit – our very own fitness programme, childcare vouchers, discounts at a number of high street retailers and a fast-track physiotherapy service.&lt;/li&gt;\n&lt;li&gt;We pledge to change the way we think and act about mental health and have invested in our time to change champions.&lt;/li&gt;\n&lt;li&gt;We believe in using quality improvement tools to &#39;cut the red tape&#39;, implement new ideas and reduce bureaucracy.&lt;/li&gt;\n&lt;li&gt;We are rated ‘OUTSTANDING’ by the Care Quality Commission.&lt;/li&gt;\n&lt;li&gt;We CARE.&lt;/li&gt;\n&lt;/ol&gt;\n&lt;p&gt;So if you are motivated, friendly, caring and ready to respond to the challenge of our growing population in Kent by providing amazing care, please come and join our team&lt;/p&gt;\n&lt;p&gt;Interviews will be held on the 20th November 2020.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Kathryn Dobrashian&lt;/p&gt;\n&lt;p&gt;Job title District Manager Health Visiting&lt;/p&gt;\n&lt;p&gt;Email address kdobrashian@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number 0300 1231240&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120633.png", "name": "Kent Community Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120633"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Westcliff House, Folkestone", "postalCode": "CT20 1SZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.0787", "longitude": "1.18018"}}, "title": "Community Public Health Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916228167", "validThrough": "2020-11-08T23:59:59+0000"}