{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 to £44,503 pa"}}, "datePosted": "2020-10-22T14:30:30+0100", "description": "&lt;p&gt;Whether your background is in pharmaceutical manufacturing or any other medical quality management or auditing field; few organisations offer the impact of NHS Blood and Transplant. You’ll work with teams the length and breadth of the country to implement ever-improving best practices. In doing so, making sure our blood, tissue and organ donations safely save millions of lives.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;As you’d expect, our quality management and compliance systems are crucial to our success. You’ll be their champion: keeping licenses up to date, helping teams follow guidelines, recording and reporting on evidence, and managing audits. Anything and everything that keeps us working in the most efficient and safest way.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Although this is an office-based position, this is also a people-centric role. We’ll expect you to meet regularly with department teams and mangers to provide support, advice and guidance, review and inspect quality systems, respond to incidents and to develop tailored solutions. You will also meet with government agencies and regulators during assessments and inspections, external customers and service providers and colleagues from other NHSBT centres.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You’ll need a background in pharmaceutical or medical quality management and, ideally, a relevant post-graduate qualification (or equivalent) would be advantageous. It’s important you’re also a consummate professional who can build strong relationships and ask the right questions while keeping an objective view of the work.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;There are Permanent and Fixed Term posts. Fixed Term is expected to be until the end of April 2021 (subject to confirmation)&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The normal working hours will be 37.5 hours per week, 7.5 hours per day, Monday to Friday.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This advert will close at 23:59 on 15th November 2020&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The interviews are expected to take place on 1st December 2020 (Subject to confirmation)&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Take charge of your career and apply now.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NHS Blood and Transplant (NHSBT)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120628"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bristol", "postalCode": "BS34 7QH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5179", "longitude": "-2.56889"}}, "title": "Assistant Quality Assurance Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916238888", "validThrough": "2020-11-15T23:59:59+0000"}