{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62001", "minValue": "53168", "unitText": "YEAR", "value": "£53,168 - £62,001 per annum"}}, "datePosted": "2020-10-30T09:15:59+0000", "description": "&lt;p&gt;An extremely exciting opportunity has arisen to recruit a highly motivated and dynamic individual to be the psychology lead for the Lancaster &amp; Morecambe Urgent Care Pathway. The UCP comprises of the Adult Crisis, Home Treatment Team and Mental Health Liaison Team, as well as the Frequent Attenders Team. These fast paced and high risk teams offer a magnitude of exciting development opportunities for the successful candidate.&lt;/p&gt;\n&lt;p&gt;These teams covering a complex locality work best as an MDT to optimise patient care. The successful candidate will be an integral part of these MDT’s, working creatively within and between teams in a systemic way to promote psychological thinking.. This new role will also see the introduction of a psychologist into the Mental Health Liaison Team and an opportunity to enhance an already robust and extremely skilled service by offering formulations, support, advice and training to one of the most front facing teams of Mental Health.&lt;/p&gt;\n&lt;p&gt;This is a new post, and it is hoped that the post-holder will work with the locality lead and service manager to help tune the role to the needs of the local population, as well as dovetail with the individual’s own development needs.&lt;/p&gt;\n&lt;p&gt;It is expected that you are able to demonstrate the attributes in the Job Description and Person Specification as a minimum.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Christiaan Morgan to discuss this exciting opportunity in more detail on: christiaan.morgan@lscft.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121124.png", "name": "Lancashire & South Cumbria NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121124"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "East Barn, Lancaster", "postalCode": "LA1 4JJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.032", "longitude": "-2.80452"}}, "title": "Principal Clinical Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249446", "validThrough": "2020-11-15T23:59:59+0000"}