{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Dependant on experience"}}, "datePosted": "2020-11-06T10:46:27+0000", "description": "&lt;p&gt;We are seeking to recruit enthusiastic Pre-registration Trainee Pharmacy Technician (Apprentice&#39;s) to join our team at St Nicholas Hospital and Carleton Clinic, Cumbria.&lt;/p&gt;\n&lt;p&gt;A pre-registration trainee pharmacy technician apprentice is employed on a fixed term Apprenticeship Agreement with the Trust for 24 months. This fixed term apprenticeship contract is designed to give you a set of competencies, work experience and a qualification that could lead to employment within the pharmaceutical sector. A high number of pre-registration pharmacy technician apprenticeship candidates have secured employment with us post qualification/24 months.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Main duties and responsibilities&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Working under the direction of registered Pharmacists and Pharmacy Technicians within multidisciplinary teams. Pre-registration trainee pharmacy technician apprentices will assist in the provision and preparation of medicines to meet the needs of all patients.&lt;/p&gt;\n&lt;p&gt;Through your working practices you will be required to apply respect and confidentiality, work well in a team, be courteous and professional, maintain a safe working environment and contribute to patient safety by working accurately when preparing and dispensing medicines.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Skills required&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will need to be hard working and an excellent team worker. Good communication is essential and you must be able to recognise and work within your own limitations.&lt;/p&gt;\n&lt;p&gt;This role is suited to those who are keenly interested in science and the treatment and physiology of common diseases and conditions.&lt;/p&gt;\n&lt;p&gt;You must be honest, punctual, reliable and have a professional attitude to work.&lt;br /&gt;&lt;br /&gt;You will need 5 GCSEs at grade 4 /C or above (or equivalent) including English, Mathematics and Dual Science, OR comprehensive pharmacy experience including NVQ Level 2 in Pharmacy Service Skills or equivalent.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Training provided&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will complete a 24 month training program and as part of your apprenticeship you will study a recognised pharmacy technician qualification with the General Pharmaceutical Council (GPHC) and will complete a portfolio of evidence to demonstrate your learning and skills in practice in accordance with the apprenticeship framework.&lt;/p&gt;\n&lt;p&gt;Successful candidates selected at interview process will be expected to undertake an assessment which be explained in the invitation to interview.&lt;/p&gt;\n&lt;p&gt;To find out more about working in our team, visit our page on the NHS Find Your Place website.&lt;/p&gt;\n&lt;p&gt;Our region offers affordable house prices and fantastic quality of life opportunities. It includes some of Britain’s most beautiful scenery and coastline, national parks and ancient heritage sites. Transport links with other UK regions are excellent. To find out more about our beautiful region, please visit local websites linked to North East England or Cumbria.com.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Janet Green, Technical Services Manager on 0191 2456606, or email contact janet.green@cntw.nhs.uk&lt;/p&gt;", "employmentType": "OTHER", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121049.jpg", "name": "Cumbria, Northumberland, Tyne and Wear NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121049"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Newcastle upon Tyne / Carlisle", "postalCode": "NE3 3XT"}, "geo": {"@type": "GeoCoordinates", "latitude": "55.0063", "longitude": "-1.63477"}}, "title": "Trainee Pharmacy Technician", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259279", "validThrough": "2020-11-20T23:59:59+0000"}