{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 pa"}}, "datePosted": "2020-11-05T10:01:18+0000", "description": "&lt;p&gt;NHS Midlands and Lancashire CSU is recruiting an Integrated Discharge Coordinator for the mental health commissioning team.&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;The IDT was established on the 4th December 2017, bringing together team members from IPA, LCFT and LCC. The IDT focussed on: facilitating more timely discharges for patients requiring ongoing packages of care; admission avoidance where community packages of care could be offered as a more appropriate alternative to admission; and the identification of suitable placements for patients with a lengths of stay of over 180 days.&lt;/li&gt;\n&lt;li&gt;To work flexibly and autonomously in conjunction with other stakeholders to ensure patients’ safe discharge from hospital&lt;/li&gt;\n&lt;li&gt;To work with other stakeholders to review/assess packages of care for patient’s subject to section 117 aftercare&lt;/li&gt;\n&lt;li&gt;To identify individual ongoing health care needs and coordinate the process of identifying and securing appropriate commissioned services, either through joint funding arrangements with the relevant Local Authority&lt;/li&gt;\n&lt;li&gt;To manage and co-ordinate NHS Funded Nursing care in relation to these clients on behalf of CCGs&lt;/li&gt;\n&lt;li&gt;To foster effective working relationships and processes with partner individuals/agencies e.g. NHS Trusts, General Practitioners, Primary Health Care Teams, Local Authority, Independent Providers and Voluntary Services&lt;/li&gt;\n&lt;li&gt;Advise and support CSU operational teams with regard to their responsibilities concerning clients with mental health needs&lt;/li&gt;\n&lt;li&gt;Support the provision of clinical supervision to RMNs in the CSU&lt;/li&gt;\n&lt;li&gt;Support the new Five Year Forward View and 10 year plan/ Mental Health agenda and be flexible to ensure that effective transformation is supported from a clinical commissioner perspective.&lt;/li&gt;\n&lt;li&gt;Ability to work across multiple sites and multiple organisations and an ambassador to system change is paramount as we work towards a single system in Lancashire for Mental Health&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NamePaul Whittle&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/128334.png", "name": "Midlands and Lancashire Commissioning Support Unit", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128334"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Jubilee House, Leyland", "postalCode": "PR26 6TR"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7076", "longitude": "-2.69456"}}, "title": "Integrated Discharge Co-ordinator – Mental Health Commissioning", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257159", "validThrough": "2020-11-15T23:59:59+0000"}