{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 p.a."}}, "datePosted": "2020-10-30T08:51:33+0000", "description": "&lt;p&gt;&lt;span&gt;An exciting opportunity has arisen within the Safeguarding Team at Solent NHS Trust for a Band 6, full time secondment for 6 months. If you are looking for a new challenge and a chance to develop specialist safeguarding practice this could be the ideal opportunity for you. We are looking for a qualified and experienced Nurse, Therapist or a Social Worker with excellent clinical/practice skills, used to working in a multi-disciplinary context. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The successful candidate will join the adult side of the Safeguarding Team and will be supported to deliver a Think Family approach to safeguarding. This will include development and delivery of safeguarding training programmes, advice and support to staff across the organisation, and will require you to develop close working relationships with members of the safeguarding children’s team. You will work in collaboration with staff across the Trust throughout Hampshire and with other agencies in order to keep adults safe. The team culture is one where learning and reflective practice are valued with regular group and individual supervision in place to support this. You will be fully supported to make the transition to this role and to develop your knowledge and skills in this exciting and important area of work. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;If you would like to discuss this role please contact Fiona Holder, Head of Safeguarding or Karen Davies, Lead Nurse for Adult Safeguarding on 0300 123 3917.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt; &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Please note that should this post attract sufficient interest, we may choose to close at an earlier date. We strongly suggest that you apply at an early stage. &lt;strong&gt;If we have not contacted you within four weeks of the closing date of this post, please presume that you have not been selected.&lt;/strong&gt; Candidates selected for interview will be contacted within 2-3 weeks; therefore you should check your emails regularly including junk mail folders.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt; &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;", "employmentType": "OTHER", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/126954.jpg", "name": "Solent NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126954"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southampton", "postalCode": "SO16 4XE"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.9252", "longitude": "-1.44603"}}, "title": "Safeguarding Facilitator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249376", "validThrough": "2020-11-17T23:59:59+0000"}