{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "28728", "minValue": "28728", "unitText": "YEAR", "value": "£17.09 per hour"}}, "datePosted": "2020-10-27T08:14:43+0000", "description": "&lt;p&gt;We are currently seeking &lt;strong&gt;Bank Staff Nurses (RMN/RNLD) &lt;/strong&gt;to join our &lt;strong&gt;Adult Mental Health, &lt;/strong&gt;at &lt;strong&gt;The Huntercombe Hospital, Eldertree Lodge &lt;/strong&gt;, located approximately 6 miles from &lt;strong&gt;Market Drayton&lt;/strong&gt; and just &lt;strong&gt;11 miles from&lt;/strong&gt;&lt;strong&gt; Stoke-on-Trent&lt;/strong&gt; and &lt;strong&gt;within one mile from the A53&lt;/strong&gt;&lt;strong&gt;.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Eldertree Lodge is a High Dependency Inpatient Rehabilitation Services for people with Learning Disabilities, that provides specialist assessments, treatments and rehabilitation for adults with intellectual disabilities, mental health needs, autistic spectrum disorders, including those with varying degrees of challenging behaviours and forensic histories. The Hospital has 46 beds spread across six wards.&lt;/p&gt;\n&lt;p&gt;The hospital is located in &lt;strong&gt;Market Drayton&lt;/strong&gt;, just &lt;strong&gt;10 miles from Stoke-on-Trent&lt;/strong&gt; and &lt;strong&gt;within one mile from the A53.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Our &lt;strong&gt;Registered Nurses &lt;/strong&gt;are highly respected and they shape how we deliver care. Our &lt;strong&gt;‘Conversation&lt;/strong&gt; &lt;strong&gt;into Action’&lt;/strong&gt; programme actively encourages everyone to get involved and drive change for the better.&lt;/p&gt;\n&lt;p&gt;Huntercombe can &lt;strong&gt;offer you a rewarding career&lt;/strong&gt; where you will be valued as a key member of our team and every day you’ll be able to &lt;strong&gt;make a difference&lt;/strong&gt; to the lives of our patients and residents, supporting and encouraging them to achieve their goals and ambitions.&lt;/p&gt;\n&lt;p&gt;When you join The Huntercombe Group as a &lt;strong&gt;Bank Registered Nurse (RMN/RNLD),&lt;/strong&gt; you will be part of a company that is &lt;strong&gt;understanding&lt;/strong&gt;, &lt;strong&gt;strives towards excellence&lt;/strong&gt;, is &lt;strong&gt;innovative&lt;/strong&gt;, &lt;strong&gt;reliable&lt;/strong&gt; and &lt;strong&gt;accessible&lt;/strong&gt; and above all &lt;strong&gt;puts people first&lt;/strong&gt;.&lt;/p&gt;\n&lt;p&gt;Most patients and residents are referred &lt;strong&gt;via NHS and local authorities&lt;/strong&gt;. We play an integral part in contributing to new models of care outlined in the &lt;em&gt;Five Year Forward View.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;As a &lt;strong&gt;Bank Registered Nurse (RMN/RNLD) &lt;/strong&gt;working in our &lt;strong&gt;Adult Mental Health Low Secure Service &lt;/strong&gt;your main duties will be:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To identify care needs of patients, planning and implementing nursing interventions and evaluating outcomes of care given&lt;/li&gt;\n&lt;li&gt;To communicate information accurately on patient care to the patient, families, internal and external professionals, including Commissioners whilst maintaining confidentiality and adhering to the principles of Information Governance&lt;/li&gt;\n&lt;li&gt;To administer drugs and checking/ preparations in accordance with Company policy and procedures and NMC guidelines.&lt;/li&gt;\n&lt;li&gt;To report and record incident and accidents in accordance with policy and procedures&lt;/li&gt;\n&lt;li&gt;To assist in the induction, development and supervision of, new and junior staff members, as required.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;To join The Huntercombe Group as a &lt;strong&gt;Bank Registered Nurse &lt;/strong&gt;you will be:-&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A Registered Nurse with current NMC registration (Mental Health, Adult, Child, Learning Disabilities) appropriate to the job&lt;/li&gt;\n&lt;li&gt;Able to maintain professional standards of practice at all times&lt;/li&gt;\n&lt;li&gt;Flexible and adaptable, well organised and able to manage time and workload effectively in line with the needs of the service&lt;/li&gt;\n&lt;li&gt;Person centred, showing empathy with a desire to make a difference&lt;/li&gt;\n&lt;li&gt;Professional in your approach to customer care&lt;/li&gt;\n&lt;li&gt;Motivated with the desire to expand your professional development and support organisational change&lt;/li&gt;\n&lt;li&gt;Able to provide demonstrable experience of working in mental health and of enhancing care&lt;/li&gt;\n&lt;li&gt;Legally entitled to work in the UK&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;In return we offer you:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A thorough induction programme tailored to the hospital where you will be working&lt;/li&gt;\n&lt;li&gt;Clear pay structure, with competitive rates&lt;/li&gt;\n&lt;li&gt;Generous annual leave entitlement&lt;/li&gt;\n&lt;li&gt;On completion of 3 months membership of the Flexi Bank arrangements you may automatically be enrolled into NEST Occupational Pension Scheme dependent upon your earnings&lt;/li&gt;\n&lt;li&gt;A range of staff discounts&lt;/li&gt;\n&lt;li&gt;Continuing Professional Development (CPD)&lt;/li&gt;\n&lt;li&gt;Support for revalidation&lt;/li&gt;\n&lt;li&gt;Professional support through Nurses forum&lt;/li&gt;\n&lt;li&gt;Employee Assistance Programme (EAP)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;span&gt;We welcome applications from everyone irrespective of ethnic origin, gender, age, gender identity, sexual orientation, religion, marital status, disability or social background. This is a great opportunity for someone to make a difference.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;An enhanced DBS (England) or PVG/Disclosure Scotland (Scotland) Disclosure will be required for all successful applicants. Costs will be met by the Company.&lt;/p&gt;\n&lt;p&gt;If you like what you have read, are dynamic, forward thinking and keen to learn, with a confident ‘CAN DO’ approach in all you do, please click &lt;strong&gt;Apply&lt;/strong&gt; now.&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/130001.jpg", "name": "The Huntercombe Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130001"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Market Drayton, STOKE-ON-TRENT", "postalCode": "TF9 4LX"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9291", "longitude": "-2.35599"}}, "title": "Bank Staff Nurse (RMN/RNLD)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243674", "validThrough": "2020-11-29T23:59:59+0000"}