{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "22482", "minValue": "22482", "unitText": "YEAR", "value": "£22,482 per annum"}}, "datePosted": "2020-10-28T11:48:33+0000", "description": "&lt;p&gt;DMC Healthcare Group is a leading provider of Primary Care Services operating GP surgeries, walk-in centres and mobile medical units across London and the South East. We offer patients a full range of NHS primary and urgent care services, including extended opening hours and support.&lt;/p&gt;\n&lt;p&gt;At DMC we believe in working together to deliver healthier outcomes for our patients and our own teams.&lt;/p&gt;\n&lt;p&gt;As a Team Leader – Service Advisors your responsibility is to provide patient and client services (mainly on the phone) and administrative leadership to the Dermatology Service Delivery team, and collaboratively work with the wider Dermatology Operations team to continuously create, improve, and maintain all processes relating to service delivery.&lt;/p&gt;\n&lt;p&gt;The role is permeant full time working 37.5 hours a week.&lt;/p&gt;\n&lt;p&gt;To be considered for the role, you must&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Have experience in appointment bookings and patient/client enquiries&lt;/li&gt;\n&lt;li&gt;Have knowledge of RTT and PTL&lt;/li&gt;\n&lt;li&gt;Have ability to demonstrate exemplary leadership skills&lt;/li&gt;\n&lt;li&gt;Have experience of working with the general public &amp; Administrative duties&lt;/li&gt;\n&lt;li&gt;Have excellent customer service, communication skills (written and oral), interpersonal skills and attention to details&lt;/li&gt;\n&lt;li&gt;Have good organizational skills and time management&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The role would be based in Iwade ME9 8TY.&lt;/p&gt;\n&lt;p&gt;If you are interested in this position then we would love to hear from you.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;As part of our employment process, you will be required to complete the appropriate level DBS check.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Equality and Diversity Statement&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The company supports the principle of Equality and Diversity in employment wholeheartedly and opposes all forms of unlawful or unfair discrimination on the grounds of age, disability, sex, gender reassignment, sexual orientation, pregnancy and maternity, race, religion or belief and marriage and civil partnerships.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Disclosure and Barring Service Check&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This post is subject to the Rehabilitation of Offenders Act (Exceptions Order) 1975 and as such it will be necessary for a submission for Disclosure to be made to the Disclosure and Barring Service (formerly known as CRB) to check for any previous criminal convictions.&lt;/p&gt;\n&lt;p&gt;This job advert may close as soon as sufficient suitable applications have been received. If interested please apply for this post as soon as possible&lt;/p&gt;\n&lt;p&gt;Your submitted application maybe imported into our preferred Third-party recruitment system. By applying for this post, you are agreeing to DMC Healthcare transferring the information within this application to its preferred applicant management system. If you are offered a job, information will also be transferred into the DMC Electronic Staff Records system.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central Advertising - Other", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130656"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Iwade", "postalCode": "ME9 8TY"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3732", "longitude": ".728026"}}, "title": "Team Leader – Service Advisors", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246433", "validThrough": "2020-11-11T23:59:59+0000"}