{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "31711", "minValue": "31711", "unitText": "YEAR", "value": "£31,711.86"}}, "datePosted": "2020-10-23T12:38:28+0100", "description": "&lt;h2&gt;York House is hiring Night Staff Nurses!&lt;/h2&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;strong&gt;Rates of pay- £31,711.86 per annum increasing to £33,153.32 after 3 years.&lt;/strong&gt;&lt;/em&gt; &lt;strong&gt;Located only 20 minutes walk from York Centre on Heslington Road, YO10 5BN, York House is hiring Night Staff Nurses to join its amazing team which supports individuals with brain injury and complex needs to achieve their personal and life goals.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you&#39;re keen to work in a unique environment, where every day is different, and you want to go home knowing that you&#39;ve have made a positive difference to the lives of our service users, we want to hear from you.&lt;/p&gt;\n&lt;p&gt;York House is a 38 bed, independent hospital offering neurobehavioural assessment, treatment and rehabilitation to adults with acquired brain injury who present with complex health needs and challenging behaviours. We offer a comprehensive range of services with input from a multidisciplinary team lead by a consultant psychologist and a consultant psychiatrist, and including clinical psychologists, nursing and support staff, physiotherapists and occupational therapists.&lt;/p&gt;\n&lt;p&gt;As a registered night nurse here at York House you will be willing to make a difference, and be confident in leading a team on a shift, and work as part of our MDT. You will have a desire to continuously learn, and disseminate to others. You will ensure you and your team are person centred, have empathy and patience. You will work in collaboration with NHS, commissioning teams, and case managers.&lt;/p&gt;\n&lt;p&gt;Preceptorship package available, with ongoing support.&lt;/p&gt;\n&lt;p&gt;Full induction training will be provided, and further specialist brain injury training will be provided as you progress through your role.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Benefits include:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;-Competitive salary&lt;br /&gt;-35 hour working week&lt;br /&gt;-Alternate weekends off&lt;br /&gt;-38 days of annual leave (inclusive of bank holidays)&lt;br /&gt;-Pension&lt;br /&gt;-Life Assurance&lt;br /&gt;-Employee Helpline&lt;br /&gt;-Perkbox Benefits&lt;br /&gt;-Sickness Scheme&lt;br /&gt;-CPD and revalidation support provided&lt;br /&gt;-Free parking&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Disabilities Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=131074"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "York", "postalCode": "YO10 5BN"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.9508", "longitude": "-1.06314"}}, "title": "Staff Nurse Nights", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240561", "validThrough": "2020-11-27T23:59:59+0000"}