{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-11-05T16:16:33+0000", "description": "&lt;p&gt;We are seeking a dedicated Clinical Team Manager to work within the field of adults with ADHD. This post is currently based within Hollins Park but will potentially be moving to a Wigan base.&lt;/p&gt;\n&lt;p&gt;The post holder will operate as part of an integrated Adult ADHD team, attending weekly multidisciplinary meetings, carrying out initial assessments, follow ups and reviews of service users as part of the shared caseload of the team.&lt;/p&gt;\n&lt;p&gt;You will be expected to be part of transition clinics run in conjunction with Paediatric services and liaise closely with GP’s.&lt;/p&gt;\n&lt;p&gt;As part of the assessment and treatment you will be expected to prescribe ADHD medication and ensure the safe management of medicines and adhere to safe practice and principles of administration in accordance with the NMC code of professional conduct and Trust medicine code&lt;/p&gt;\n&lt;p&gt;In return you will be supported by the ADHD team and receive clinical support from the Consultant Psychiatrist.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;IMPORTANT: &lt;/strong&gt;The role will involve regular travel across multiple sites in the North West Boroughs Healthcare NHS Foundation Trust catchment area. Therefore, the post holder must be able to meet the travel requirements of this post. Please indicate on your application how you meet this requirement.&lt;/p&gt;\n&lt;p&gt;This post is subject to an enhanced check with adults barred list Disclosure and Barring Service (DBS) Check. Successful candidates will either have a valid DBS check with the Trust or will be required to pay for the cost of the DBS Disclosure which is £47.50, the cost of which will be deducted from first salary.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Charlotte Ladbury - Operational Manager&lt;/p&gt;\n&lt;p&gt;charlotte.ladbury@nwbh.nhs.uk / 01942 636302&lt;/p&gt;\n&lt;p&gt;Amanda Brown – Operational Services Manager&lt;/p&gt;\n&lt;p&gt;Amanda.brown3@nwbh.nhs.uk / 01942 636304&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120746.jpg", "name": "North West Boroughs Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120746"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Atherleigh Park, Leigh", "postalCode": "WN7 1YN"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5008", "longitude": "-2.5222"}}, "title": "Clinical Team Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258529", "validThrough": "2020-11-17T23:59:59+0000"}