{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum, pro rata"}}, "datePosted": "2020-10-26T13:16:38+0000", "description": "&lt;p&gt;We are seeking an enthusiastic individual to work as a Band Deputy Ward Manager on Tazetta Suite. This is a 16 bed male acute admission ward at The Oleaster Centre.&lt;/p&gt;\n&lt;p&gt;You will require interpersonal skills and commitment to work with adults within the field of mental health as well as the ability to work on your own initiative and be a committed team player. You will be required to work with a team of Nurses, Health Care Assistants, Occupational Therapists and a Activity Worker offering supervision and development advice on a busy acute admission ward.&lt;/p&gt;\n&lt;p&gt;You will be joining a hard-working multi-disciplinary team dedicated to achieving the best outcomes for patients and Carers. You will be involved in various professional roles, supporting the day to day decisions, leadership of various individuals, projects and service developments. This will support you to embrace our philosophy of care; that the service user is at the heart of everything that we do. You will be expected to be flexible in your approach and welcome the opportunity to build on your existing experience and skills.&lt;/p&gt;\n&lt;p&gt;This position would be ideal for an enthusiastic staff nurse with a vision to develop their career and clinical and leadership expertise within an acute environment. The post would require the successful applicant to have experience within a mental health setting and have an awareness of risk management.&lt;/p&gt;\n&lt;p&gt;In return, we can offer training and development opportunities linked to your personal development plan and the opportunity to be involved in shaping the services of the future.&lt;/p&gt;\n&lt;p&gt;The successful candidate will provide leadership towards the team, and will be heavily involved in quality initiatives, and implementing change that supports the trust strategy.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Ward Manager Darren Byrne 0121 301 2139/2132&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDarren ByrneTelephone number0121 301 2139/2132&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Birmingham and Solihull Mental Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120844"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Oleaster Centre, Tazetta Suite, Birmingham", "postalCode": "B15 2SY"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4502", "longitude": "-1.94218"}}, "title": "Band 6 Deputy Ward Manager - Tazetta Suite, Oleaster Centre", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242617", "validThrough": "2020-11-08T23:59:59+0000"}