{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615"}}, "datePosted": "2020-10-27T10:53:38+0000", "description": "&lt;p&gt;&lt;span&gt;County Durham and Darlington NHS Foundation Trust is one of the largest integrated care providers in England, serving a population of around 600,000 people. We are a high performing organization with a track record of success.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We welcome applications from student nurses currently in their 3rd year of training within 6 months of qualifying.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are looking to recruit highly motivated and enthusiastic newly qualified Band 5 Nurses to join our various wards departments and teams throughout our integrated trust.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We recognize your need for on-going support and development; the Trust offers a promise of support, advice and guidance during your preceptorship period to develop your confidence as an autonomous professional and ultimately to refine your skills, values and behaviours to provide high quality care to the people in our care.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;During your preceptorship you will have access to&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;A designated preceptor&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;2 weeks supernumerary period at the point of registration.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Allocated time for development of knowledge and skills which will consist of :&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Participatory continuing professional development contact study days and eLearning linked to the your PDP&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;monthly meetings with your preceptor to discuss your development and progress in relation to your area of work.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;3 monthly meetings with your manager for further guidance and support.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;span&gt; You will be joining dynamic and energetic teams who are constantly evolving through some exciting developments in service provision.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We recognize your need for on-going support and development&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Trust welcomes all applications, regardless of age, gender, race, disability or sexual orientation. We offer a range of rewards and benefits on appointment including NHS pension, childcare vouchers, flexible working, continuous professional development, and Staff Occupational Health and a comprehensive Staff Health &amp; Wellbeing Service.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;In accordance with good practice guidelines from the Criminal Records Bureau, the successful candidates will be required to submit an enhanced application for disclosure.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Informal discussions/visits to the Department are encouraged – to arrange please contact&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Only on line applications will be accepted. Any queries please contact the Recruitment Team on 01388 455813&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120665.JPG", "name": "County Durham and Darlington NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120665"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Trustwide", "postalCode": "DL3 6HX"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.5318", "longitude": "-1.56468"}}, "title": "Newly Qualified Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244091", "validThrough": "2021-09-01T23:59:59+0100"}