{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-10-21T16:31:17+0100", "description": "&lt;p&gt;Staff Nurses are required to join our committed nursing team on Gate 19 Interventional Radiology. This is a busy department incorporating 4 Interventional Radiology labs. This area manages a wide variety of procedures which includes outpatient, inpatient and emergency cases. We are part of the major trauma and vascular service for the South West. The techniques and treatment used are continually evolving to ensure we are at forefront of patient treatment and care. There is an opportunity to assist with cases such as vascular; neuro radiology; gastrology: musculoskeletal and urology. You will be trained in scrub procedures, assisting (circulating) and caring for patients in the Interventional Radiology Labs. The work is very variable, challenging and exciting.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;WHY APPLY?&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Be a part of our dynamic Interventional Radiology Team.&lt;/li&gt;\n&lt;li&gt;A great opportunity to learn new skills and to be involved with developing new services.&lt;/li&gt;\n&lt;li&gt;Work within a multi-disciplinary team alongside Neuro Radiologists, Interventional Radiologists and Radiographers.&lt;/li&gt;\n&lt;li&gt;We offer Trust based and in house teaching with opportunities to attend external study days.&lt;/li&gt;\n&lt;li&gt;Career development - the option for bespoke rotation packages across Interventional radiology, and a well-structured and supported preceptorship programme to help you further develop.&lt;/li&gt;\n&lt;li&gt;Induction and orientation programme and a supernumerary period.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;THE ROLE – &lt;/strong&gt;Key duties will include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Bristol is consistently voted the best place to live in the UK, with vibrant local music, arts and gastronomic scenes, a wide range of modern and state of the art shopping, recreation and leisure facilities, a wealth of great local family days out, fantastic transport links for local, national and internal holidays, and a rich history.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Working with patients who will be undergoing a wide variety of Interventional procedures.&lt;/li&gt;\n&lt;li&gt;Being responsible for coordinating and providing complete care to patients and working as a part of the team as well as independently.&lt;/li&gt;\n&lt;li&gt;Working closely with members of the multidisciplinary team.&lt;/li&gt;\n&lt;li&gt;To be actively involved in their own development and supporting junior members of the team in their development&lt;/li&gt;\n&lt;li&gt;To strictly adhere to Local and Trust wide Infection Control policy and procedures.&lt;/li&gt;\n&lt;li&gt;Participate in assisting the Radiologists as the Scrub Nurse for a wide variety of procedures.&lt;/li&gt;\n&lt;li&gt;Circulating within the Lab assisting the Radiologist/Scrub Nurse by providing the appropriate equipment. Monitoring and communicating with the patient throughout.&lt;/li&gt;\n&lt;li&gt;Participate in on call duties.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;YOU:&lt;/strong&gt; The successful Staff Nurse will be:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A Registered Nurse with active NMC registration&lt;/li&gt;\n&lt;li&gt;Flexible and adaptable to the changing workload.&lt;/li&gt;\n&lt;li&gt;Team player&lt;/li&gt;\n&lt;li&gt;Experience in an Acute Hospital setting which is essential&lt;/li&gt;\n&lt;li&gt;Hardworking with the drive to go the extra mile&lt;/li&gt;\n&lt;li&gt;Evidence of ongoing professional development.&lt;/li&gt;\n&lt;li&gt;Excellent interpersonal skills with patients and multi-disciplinary team&lt;br /&gt;&lt;br /&gt;&lt;br /&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;For more information about the role, please contact:&lt;/p&gt;\n&lt;p&gt;Cait Donnelly, Senior Sister&lt;/p&gt;\n&lt;p&gt;Email: Cait.Donnelly@nbt.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120777.jpg", "name": "North Bristol NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120777"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southmead Hospital, Bristol", "postalCode": "BS10 5NB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4973", "longitude": "-2.59295"}}, "title": "Registered Nurse- Interventional Radiology Labs - Band 5", "url": "https://www.jobs.nhs.uk/xi/vacancy/916237305", "validThrough": "2020-11-30T23:59:59+0000"}