{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 per annum"}}, "datePosted": "2020-11-04T10:01:15+0000", "description": "&lt;p&gt;&lt;strong&gt;Pharmacy Technician (BAND 4)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;HMP BERWYN, WREXHAM, NORTH WALES&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;£21,892 - £24,157&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;37.5 HOURS PER WEEK&lt;/strong&gt;&lt;strong&gt; (full time and part time vacancies available)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This is an excellent opportunity to work providing pharmacy services at HMP Berwyn within a brand new, automated, pharmacy department.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;As a Band 4 Pharmacy Technician your role will be to work within the Pharmacy team whilst working with a multi-disciplinary team of health and wellbeing professionals to deliver high quality services to patients. A key role for this post will be the dispensing of medication for men to self administer and providing support and information to help them manage this. Medication will also be supplied to the house blocks for supply by healthcare staff on a daily basis.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This is a rewarding role for an individual who is an excellent communicator, confident and able to deliver a pharmacy service across Primary Care, Integrated Substance Misuse &amp; Mental Health Services. You will partake in an on-going programme of development to ensure high standards of patient care are maintained, whilst fostering effective working relationships with HMPPS, prison colleagues and other stakeholders.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This post is key to the development and delivery of high quality, evidence based health and wellbeing services to give prisoners access to interventions and support equitable to those provided by the NHS in the community.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;HMP Berwyn was developed with a strong rehabilitative culture at its heart. The key values being built into all areas are to value each other and celebrate achievements, act with integrity and always speak the truth, look to the future with ambition and hope, uphold fairness and justice in all we do, embrace welsh language and culture and to stick at it.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please note that any offer of employment will be subject to the successful receipt of enhanced DBS and prison vetting clearances.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; Welsh and/or English speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt;Closing Date: 18/11/2020&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;For further information please contact Sam Carvell – Prison Chief Pharmacy Technician, or Amber O’Brien – Lead Prison Pharmacist&lt;/p&gt;\n&lt;p&gt;Telephone number 01978 523259&lt;/p&gt;\n&lt;p&gt;E-mail: Samantha.Carvell@wales.nhs.uk, Amber.O’brien@wales.nhs.uk&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;HELPING PEOPLE CHANGE FOR THE BETTER&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123196.JPG", "name": "Betsi Cadwaladr University Local Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123196"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "HMP Berwyn, Wrexham", "postalCode": "LL13 9QE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.0335", "longitude": "-2.92813"}}, "title": "Pharmacy Technician Band 4 HMP Berwyn", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255282", "validThrough": "2020-11-18T23:59:59+0000"}