{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "39940", "minValue": "39940", "unitText": "YEAR", "value": "£23.76 P/h"}}, "datePosted": "2020-10-28T13:45:39+0000", "description": "&lt;p&gt;University College London Hospital are seeking Band 7 Speech and Language Therapists to join Bank Partners and work Monday- Friday, 9-5..&lt;/p&gt;\n&lt;p&gt;Are you an experienced therapist looking for a new challenge? Do you want to be a member of a growing adult acute SLT service in a large central London teaching hospital?&lt;/p&gt;\n&lt;p&gt;Following a successful funding bid, applications are invited for an experienced speech and language therapist with a broad range of clinical knowledge and skills, to join our friendly, supportive and hardworking team.&lt;/p&gt;\n&lt;p&gt;The successful applicant will be responsible for delivering a service across the acute medical and surgical wards at UCH. It is anticipated that after successful completion of the probationary period, the post holder will be allocated a clinical specialism that they will develop, to become the named person for that area in the team, including attendance at relevant multidisciplinary clinical governance meetings for that specialism. You will be responsible for providing a comprehensive initial assessment, including attending any relevant MDT and professional meetings, as well as planning complex discharges. You will have experience of acute hospital work, including respiratory disease, degenerative neurological illness, dementia and issues related to capacity. You will be able to demonstrate competent independent diagnosis and management of acute and chronic communication and swallowing disorders. Excellent communication and negotiation skills with the ability to work independently under pressure in a challenging environment are essential, as is the ability to work successfully in a large team. Experience of working within a community setting is desirable due to the regular liaison required with the local community SLT teams. You will also be competent in videofluoroscopy, with tracheostomy competency a desirable skill. There are opportunities to supervise junior staff as well as student SLTs as appropriate. You will be provided with strong managerial and leadership support. The SLT service offers an established supervision system and a range of opportunities for learning and participation in self and service development.&lt;/p&gt;\n&lt;p&gt;Working for UCLH Bank will provide you with an array of benefits;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;First opportunity for work placements before agency staff&lt;/li&gt;\n&lt;li&gt;Opportunities to work accross all trust hospitals gaiing invaluable expeirence&lt;/li&gt;\n&lt;li&gt;Competitive pay rates&lt;/li&gt;\n&lt;li&gt;A dedicated booking consultant available to assist with any queries and advise on suitable assignments, tailored to you&lt;/li&gt;\n&lt;li&gt;Electronic timesheet system with weekly payroll&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The successful applicant will acute hospital experience, including tracheostomy and video fluoroscopy competencies. Start date for Mid-Spetember.&lt;/p&gt;\n&lt;p&gt;If you are seeking an opportunity to further develop your skills as a Speech and Language Therapist and are interested in joining a great team of dedicated workers, please apply now and a member of our recruitment team will contact you shortly.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "University College London Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120731"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "London", "postalCode": "NW1 2PG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5257", "longitude": "-.13737"}}, "title": "Bank Speech and Language Therapist Band 7", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246801", "validThrough": "2020-11-27T23:59:59+0000"}