{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 to £24,157 per annum"}}, "datePosted": "2020-10-12T11:34:54+0100", "description": "&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;&lt;strong&gt;Are you a &lt;span style=&quot;text-decoration: underline;&quot;&gt;qualified Nursing Associate or due to qualify in the next 3 months&lt;/span&gt;&lt;/strong&gt;?&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Do you want to continue your journey of development with a dynamic, forward thinking Trust?&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The Mid Yorkshire Hospitals NHS Trust is passionate about its workforce and is invested into ensuring you join an innovative team focused on providing high quality care. If so we are looking to recruit enthusiastic, forward thinking, committed and motivated Nursing Associates with excellent communication skills to join our nursing team. The successful candidates will support the ward manager, junior sisters, registered nurses and multidisciplinary team to provide patient centered evidence based care; maintain high care delivery standards and efficient, safe management of patients within our busy wards. This role will offer the opportunity to develop your skills within a range of clinical specialities.&lt;/p&gt;\n&lt;p&gt;We have invested significantly in improving the experiences of our nursing workforce through our dedicated professional development and education team, who are leading the way nationally. Our Graduate Nursing Associate programme mirrors the multi award winning Graduate Nurse Programme supporting newly qualified nursing associates to make the transition from Trainee to registrant.&lt;/p&gt;\n&lt;p&gt;If you have successfully completed you End Point Assessment and would like to explore this opportunity further and you have a passion for developing and improving services we want to hear from you. You will receive a robust induction and preceptorship, we will support you to get off to a flying start. You will complete a probationary period and will receive a personal professional development plan to support your future career with The Mid Yorkshire Hospitals NHS Trust&lt;/p&gt;\n&lt;p&gt;For further information please contact Sharon Payne, Matron for Nurse Staffing: &lt;span&gt;sharon.payne10@nhs.net&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Previous applicants need not apply.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120735.png", "name": "Mid Yorkshire Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120735"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Various locations", "postalCode": "WF1 4DG"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.6949", "longitude": "-1.48592"}}, "title": "Nursing Associate", "url": "https://www.jobs.nhs.uk/xi/vacancy/916222138", "validThrough": "2020-11-12T23:59:59+0000"}