{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "35207", "minValue": "28691", "unitText": "YEAR", "value": "£28,691- £35,207 pa inc HCAS"}}, "datePosted": "2020-11-02T12:02:12+0000", "description": "&lt;p&gt;Are you looking for new challenges? Fed up of the same routine? Do you want to work in an ever changing environment where no two days are the same? Do you want to feel that you really make a difference?&lt;/p&gt;\n&lt;p&gt;This might be the job for you… We are looking for Band 5 RGN/RCN primary care nurses to join us as part of the new Integrated health team within HMP YOI Feltham&lt;/p&gt;\n&lt;p&gt;CNWL have recently been successful in their bid to deliver a new integrated health care service at HMP YOI Feltham. This is a unique and exciting opportunity to be part of this innovated model and also an opportunity to use all of your clinical and interpersonal skills, develop new skills and work with a unique population group who need your clinical skills.&lt;/p&gt;\n&lt;p&gt;You could make a difference. This is a varied role working within a Primary Care setting providing high quality care to patients with both primary care and acute care needs. It takes a very special, dedicated, resilient and caring clinician to provide care in such an ever changing, dynamic environment and you will be joining like-minded exceptional healthcare professionals.&lt;/p&gt;\n&lt;p&gt;Working within an integrated team affords us the benefit of being able to work in a truly holistic manner, responding to the needs of both physical and mental well-being .&lt;/p&gt;\n&lt;p&gt;Our motto? Caring not judging.&lt;/p&gt;\n&lt;p&gt;What we Offer&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;This post will attract the **Golden Hello**, a recruitment incentive bonus of 10% of gross salary to a maximum of £2500. Further details are included in the attached document.&lt;/li&gt;\n&lt;li&gt;Excellent progression through various career pathway opportunities such as but not limited to a **preceptorship Programme**&lt;/li&gt;\n&lt;li&gt;Support and guidance with Revalidation&lt;/li&gt;\n&lt;li&gt;Ongoing supervision and appraisals&lt;/li&gt;\n&lt;li&gt;Hidden Gem and annual award ceremonies&lt;/li&gt;\n&lt;li&gt;Excellent staff benefits: our benefit packages are amongst the best in London and include: childcare vouchers, health and wellbeing services, season ticket loans, cycle to work scheme and relocation package. We are also proud to support our employees with continued professional development opportunities and further education subject to service needs.&lt;/li&gt;\n&lt;li&gt;We welcome flexible working and will consider part-time applicants.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Head of Healthcare - Ann-Marie Carter ann-marie.carter1@nhs.net&lt;/p&gt;\n&lt;p&gt;Mobilisation Manager - sally-ann.morris@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central and North West London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120736"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "HMP YOI Feltham, Feltham", "postalCode": "TW13 4ND"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4415", "longitude": "-.434054"}}, "title": "Primary care nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251962", "validThrough": "2020-11-16T23:59:59+0000"}