{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37000", "minValue": "37000", "unitText": "YEAR", "value": "37000"}}, "datePosted": "2020-11-03T12:24:13+0000", "description": "&lt;p&gt;&lt;strong&gt;Whitfield PCN&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for Physician Associates to join our multidisciplinary team at Whitfield Primary Care Network, Stoke-on-Trent.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary:&lt;/strong&gt; - Physicians Associate Position Pay Band 7 Starting point £37K FTE depending on experience&lt;/p&gt;\n&lt;p&gt;You will have completed the Physician Associate Postgraduate Diploma/Masters, be a registered member on the Physician Associate Managed Voluntary Register (PAMVR) and have a passion for developing a career within Primary Care.&lt;/p&gt;\n&lt;p&gt;You will work to a professional code of ethics, and show a desire to learn and develop. You must be flexible in the role, have good team working and a caring attitude towards patients.&lt;/p&gt;\n&lt;p&gt;This is an exciting time to join an innovative and forward thinking Primary Care Network whose 4 member Practices include, Brook Medical Centre, Orchard Surgery, Millrise Medical Practice and Baddeley Green Surgery. All surgeries have strong reputations for Quality Improvement and investing in people. Our area spans across the North East area of Stoke-on-Trent delivering quality care to over 38,000 patients, we embracing the role of Physician Associate as part of our enhanced MDT in Primary Care.&lt;/p&gt;\n&lt;p&gt;We are committed to improving the care provided to patients, reducing health inequalities and raising the quality and standards of GP practice. Physician Associates in General Practice will be key in developing a model of care which addresses our ambition to deliver person-centred coordinated care and support implementation of the NHS long-term plan.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Main duties of role:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Physician Associate will be required to work autonomously in the practice, providing a range of services such as assessment, diagnosis, treatment, telephone triage, clinical decision making and referring patients appropriately, as well as supporting the management team in the reviewing of clinical policy and procedure when required. The Physician Associate will work collaboratively with the healthcare team to meet the needs of the patients, supporting the delivery of policy and procedures. The Physician Associate will provide a holistic and clinical service, with support from GPs as required, implementing agreed management plans and following approved protocols as appropriate. The Physician Associate will be expected on a typical day to carry out home visits, Care Home visits and consult with patients who present via booked appointments. The Physician Associate will also review and act appropriately on blood results and referrals/correspondence regarding their patients.&lt;/p&gt;\n&lt;p&gt;You will be working as part of an allied healthcare professional team and will be supported and supervised by a GP and/or ANP&lt;/p&gt;\n&lt;p&gt;Our current vacancies suit primary care experienced Physician Associates keen to work in an exciting, rewarding and demanding environment. You will provide safe, clinical decision-making and expert care.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;You will also benefit from:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Dedicated and bespoke Physician Associate training and CPD&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Continuous GP clinical supervision and support&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Access to online training portal&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Access NHS Pension&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;A comprehensive induction and orientation programme&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Flexible schedule: Monday to Friday between practice hours of 8am to 6:30pm&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Applications are welcome from qualified Physician Associates experience of working within a GP practice is desirable.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Exceptional candidates who are newly qualified will also be considered for this role.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;You will have completed the Physician Associate Postgraduate Diploma/Masters from an accredited UK university.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;You will be registered with the Physician Associate Managed Voluntary Register (PAMVR)&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt; &lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central Advertising - General Practitioners", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130654"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Stoke-on-Trent", "postalCode": "ST67NN"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.0568", "longitude": "-2.17564"}}, "title": "Physicians Associate", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253963", "validThrough": "2020-11-23T23:59:59+0000"}