{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "34845", "minValue": "30805", "unitText": "YEAR", "value": "£30,805-£34,845 pro rata"}}, "datePosted": "2020-11-02T16:51:21+0000", "description": "&lt;p&gt;&lt;strong&gt;Social Worker&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Based in Keynsham, but covering Bath and North East Somerset&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;£30,805-34,845pa pro rata 26 hours pw&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Are you a dynamic and enthusiastic Registered Social Worker based in the Bath and North East Somerset area? Are you looking to join an NHS Health and Social Care partner which is striving to make positive changes? Would you like to work for an organisation where more than 9 out of every ten 10 of the people who use services would recommend them?&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Feel Valued&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As a Social Worker delivering Local Authority services with us you will receive a salary between £30,805 (ASYE) to £34,845 pro rata depending on level of experience. We will provide you with access to a committed Learning and Development team, and we work closely with Universities and Health Education England to further your potential and support your progression. (Whether you are an ASYE and or completed your first year and have  and  have further  post qualifying experience  we are looking for a practitioner  with strong communication and organisation skills, together with  a flexible approach to ensure you deliver positive experiences to service users at every stage of their healthcare journey).&lt;/p&gt;\n&lt;p&gt;We will offer a combination of in house eLearning, workshops and courses to support your development.&lt;/p&gt;\n&lt;p&gt;As a registered Social worker with Social Work England you will be accessing the NHS Pension Scheme.&lt;/p&gt;\n&lt;p&gt;You will become part of the Virgin Tribe. This grants you access to premier offers and discounts on Virgin Products such as holidays. &lt;/p&gt;\n&lt;p&gt;You’ll access our central online health and lifestyle platform covering healthy recipes, activity challenges, and support information around mental health.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Feel Proud&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will have a Social Work qualification and registered with Social Work England. As the Social Worker you will you will hold a case load of clients, carry out Care Act Assessments, be responsible for Care Planning and case management of Autistic adults  and or a Learning disability  including being lead worker for safeguarding enquiries. You will be based primarily in Keynsham, but will work across the whole of Bath and North East Somerset.&lt;/p&gt;\n&lt;p&gt;As you will be responsible for working with varied service users and complex cases, the role requires strong knowledge of Autism and Learning Disabilities; applying a strength based approach to your practice. With confidence in the ability to hit the ground running. You’ll care for service users and their families in the way that you believe is best, delivering our high service standards, sharing best practice, and actively improving the way we work. &lt;/p&gt;\n&lt;p&gt;The role is part office and home working (during COVID-19)  based, and part working directly with service users either in a 1:1 capacity, in chairing meetings or working with other stakeholders such as carers, health professionals and providers.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Feel Inspired&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is a fantastic opportunity to join a well-managed, supportive and structured team involving work with Autistic adults living in a variety of settings ranging from supported living, living with families, specialist housing schemes and residential care. You will be undertaking Care Act support assessments, support planning and reviewing care packages as well as undertaking any safeguarding inquiries (on behalf of Bath and North East Somerset Council’s safeguarding team), Mental Capacity Act assessments and carer’s assessments. We are a busy, innovative team, always looking to improve and develop services for adults with autism. We work closely with our health colleagues in the Complex Health Needs Service, together with other departments both within Virgin Care and externally with service providers, housing, education and mental health services. We also work with the Council’s SEND practitioners for those young people coming through into adult services. &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We partner with the NHS to make a real difference to people in Banes and we’re building a working environment where colleagues too can really feel the difference. It’s the kind of place where nothing’s too much trouble. Where you’ll feel empowered, listened to, valued and where we’ll support you to bring your best self to work every single day and to deliver high quality care. And that’s just the beginning. Since 2006, we’ve delivered services to millions of people by developing our own unique approach where our patients are at the centre of everything we do.&lt;/p&gt;\n&lt;p&gt;We’re committed to equal opportunities and welcome a broad diversity of talent to apply. We reserve the right to cease any advertising prior to the published closing date for a role that receives a high number of applications. Virgin Care Limited, its subsidiary companies and the Virgin Care LLPs are part of the Virgin Group and provide NHS and social care services. If you would like to know a little more about how we use your information, please see our website’s privacy policy&lt;/p&gt;\n&lt;p&gt;At Virgin Care, we’ve created a working environment where everyone can really feel the difference. It’s the kind of place where nothing’s too much trouble. Where our service is seamless. Where you’ll feel empowered, listened to, valued and where we’ll support you to bring your best self to work every day. And that’s just the beginning.    &lt;/p&gt;\n&lt;p&gt;The Autism Social Work team comprises of 3 FTE Social Workers and 1FTE Team Manager.&lt;/p&gt;\n&lt;p&gt;If you’d like to discuss the role further, or see a copy of the full job description, please contact  Liana Tonkin, Team Manager, on 01225 613857  liana.tonkin@virgincare.co.uk . Or David Self, Service Manager on 01225 613857 David.self@virgincare.co.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Virgin Care", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127354"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Keynsham", "postalCode": "BS31 1AF"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4098", "longitude": "-2.49819"}}, "title": "Social Worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252935", "validThrough": "2020-11-16T23:59:59+0000"}