{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "25000", "minValue": "25000", "unitText": "YEAR", "value": "upto £25,000"}}, "datePosted": "2020-10-21T13:06:12+0100", "description": "&lt;h1&gt;&lt;strong&gt;Human Resources System Development Officer&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;&lt;strong&gt;Salary up to £24,000 per annum&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;37.5 hours per week to be worked flexibly in accordance with the requirements of the role, which may include occasional weekends.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We have an exciting opportunity for an experienced HR Systems Specialist to deliver a new HR system in line with the requirements of the department, ensuring that it is fit for purpose and working to project deadlines.&lt;/p&gt;\n&lt;p&gt;This role is initially for a 6-month fixed-term contract to support the implementation of our new HR system across the Mountbatten Group. The position will be fully office based with some travel between Mountbatten locations on the Isle of Wight and Hampshire.&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;About the Role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Reporting to the HR Advisor IOW (Project Lead), you will actively engage with key stakeholders, colleagues and external contractors, playing a key role in designing, implementing and testing the system to resolve issues and queries as they are raised. You will be poviding training to the HR department and designated Pilot Group Leads, ahead of the system going live across the organisation.&lt;/p&gt;\n&lt;p&gt;Day to day duties will include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Working with the HR Advisor (Project Lead), ensuring deadlines for each tasks are met by collating data within the Organisation and working with the Systems Provider to establish all process/procedures.&lt;/li&gt;\n&lt;li&gt;Identifying all HR information contained within the orgnaisation which is required to be transferred to the new HR systems, identifying where possible system and process improvements&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;About You&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will need to have proven experience of implementing HR systems ideally within a charity or healthcare setting, you will be responsible for the creation of tests, set up, work-flows and system testing in conjunction with the system providers project manager and the HR Advisor (Project Lead).&lt;/p&gt;\n&lt;p&gt;You will have excellent communication skills, both written and verbal, able to adapt your style according to your audience. Have a keen eye for detail, with the ability to prioritise and manage your own workloads to achieve agreed project deadlines.&lt;/p&gt;\n&lt;p&gt;Ideally have HR administration/systems or advisor experience in a generalist support role. Previous experience of IRIS Cascade system would be an advantage. Ability to be adaptive to meet changing deadlines in a fast past enviousness.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What we can off you&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;In return we offer a competitive salary with contributory pension scheme, 27 days annual leave entitlement (plus bank holidays), calculated on a pro-rata basis. Generous development and training opportunities. Free Parking on site. DBS Clearances.&lt;/p&gt;\n&lt;p&gt;If you wish to find out more about this opportunity please contact Cheryl Blackley in Human Resoruces.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/135458.png", "name": "Mountbatten Isle of Wight", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=135458"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hampshire", "postalCode": "SO30 3JB"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.9278", "longitude": "-1.32524"}}, "title": "HR Systems Development Officer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916236547", "validThrough": "2020-11-06T23:59:59+0000"}