{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "54304", "minValue": "47681", "unitText": "YEAR", "value": "£47,681 - £54,304 per annum, incl HCAS and 18% R&amp;R"}}, "datePosted": "2020-11-04T09:54:32+0000", "description": "&lt;h1&gt;Chief Cardiac Physiologist (Echocardiography)&lt;/h1&gt;\n&lt;p&gt;&lt;strong&gt;Band 7: £47,681 - £54,304 per annum, incl HCAS and 18% R&amp;R&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are seeking a suitably qualified Cardiac Physiologist/Echocardiographer to join our team at the Royal Surrey Hospital.&lt;/p&gt;\n&lt;p&gt;The Cardiology Business Unit provides a full invasive and non-invasive cardiac service including cardiac catheterisation. The department also offers physiologist-led exercise testing, 24 hour ECG and BP monitoring and event recording. We have a busy Pacemaker/ICD implant and follow-up service; we are the leading implant centre in Surrey for ICDs and CRTs.&lt;/p&gt;\n&lt;p&gt;In terms of echocardiography, the department currently performs around 8000-9500 routine echoes annually and around 1000 advance echoes such as Stress, Contrast and TOE.&lt;/p&gt;\n&lt;p&gt;BSE accreditation in adult Echocardiography is essential (or equivalent such as EACVI). Applicants will have a BSc in Clinical Physiology or equivalent and at least 1 year post BSE qualification experience in Transthoracic Echocardiography.&lt;/p&gt;\n&lt;p&gt;Applicants must be a highly self-motivated, well organized, flexible and reliable. You should be able to demonstrate expertise in advanced techniques in echocardiography and be enthusiastic to both teach and learn within the field of echocardiography. Excellent communication, interpersonal and time management skills are a key requirement and your willingness to use initiative will see you succeed. There is a commitment to research within the department and you will be expected to be a part of this.&lt;/p&gt;\n&lt;p&gt;This post offers you the opportunity to work in a stimulating environment with a friendly motivated team, further develop your knowledge and skills in Echocardiography and leadership at band 7 level, participate in training and teaching, and ensure you are supported in maintaining your BSE accreditation.&lt;/p&gt;\n&lt;p&gt;We are also able to offer flexible working hours of 8am to 6pm, four days per week with a fixed day off (following a two month settling in period), or 9am to 5pm five days per week.&lt;/p&gt;\n&lt;p&gt;A full training and induction programme will be provided to familiarise the successful candidate with departmental policies and procedures.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;We encourage you to give us a call to arrange an informal visit. If you would like to know more about this role please contact Siva Ratnatheepan (Head of Echocardiography) Tel: 01483 571122 Ext 6419 or Ext 6529.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120970.jpg", "name": "Royal Surrey NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120970"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Guildford, Surrey", "postalCode": "GU2 7XX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.241", "longitude": "-.607442"}}, "title": "Chief Cardiac Physiologist - Band 7 - Echocardiography", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255261", "validThrough": "2020-12-02T23:59:59+0000"}