{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "53459", "minValue": "45544", "unitText": "YEAR", "value": "£45,544 - £53,459 pa inc HCA"}}, "datePosted": "2020-11-06T15:16:56+0000", "description": "&lt;p&gt;West Hertfordshire Hospital’s NHS Trust is looking for a dynamic Midwife to support and lead the Digital agenda for maternity services in line with the National recommendations and targets.&lt;/p&gt;\n&lt;p&gt;The post holder will be responsible for systematically embedding the digital agenda along the maternal care pathway through digital development, pathway and policy development, audit and research. The post holder will be expected to lead the digital agenda to improve services, safety and outcomes for women and their families through the best use of information and technology. Inclusive leadership is essential to engage, enable and empower staff, promote ownership of learning and quality improvement, and to facilitate team working with the wider MDT and stakeholders.&lt;/p&gt;\n&lt;p&gt;The post holder will have day to day responsibility for the oversight of the maternity IT systems and associated clinical system. They will work closely with clinical leads to ensure a high quality service which is safe, effective and efficient through the best use of digital technology&lt;/p&gt;\n&lt;p&gt;The post holder will provide professional leadership to motivate staff regarding the use of digital technology and the development of the patient electronic record.&lt;/p&gt;\n&lt;p&gt;The post holder, working with IT, will lead, support and assist with the implementation of national drivers and strategies to enable maternity services to become digitally mature. The role will encompass working with wider teams including – for example the regional digital lead for the local maternity &amp; neonatal system (LMNS), health informatics department, IT and software suppliers where necessary.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Colette Mannion, Director of Midwifery and Gynaecology Nursing Colette.mannion@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "West Hertfordshire Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120820"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Watford General Hospital, Watford", "postalCode": "WD18 0HB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6491", "longitude": "-.404449"}}, "title": "Band 8a - Digital Lead Midwife, Maternity", "url": "https://www.jobs.nhs.uk/xi/vacancy/916260342", "validThrough": "2020-11-22T23:59:59+0000"}