{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum, pro rata"}}, "datePosted": "2020-11-06T16:14:49+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Somerset&lt;/span&gt;&lt;/strong&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt; Intermediate Care Service - Rapid Response Team - Therapist Band 5/6&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Experienced Therapists needed to help us transform hospital admission and discharge in Somerset &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Note: this role would be suitable for experienced Band 6&#39;s or Band 5&#39;s wishing to develop further in their career. We are able to offer a full supportive developmental programme for Band 5’s which will be discussed and decided between yourself and your manager. &lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Bridgwater Hospital location&lt;/strong&gt;(West Mendip location also available and being advertised)&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Are you an experienced Therapist who has a passion for helping people stay independent? Perhaps you like doing things differently, working in an unplanned way to help people avoid unnecessary hospital admission where possible? &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If so, intermediate Care is an exciting and innovative&lt;strong&gt;new&lt;/strong&gt;service we&#39;d like to welcome you to become a part of!&lt;/p&gt;\n&lt;p&gt;If successful, you‘ll join a supportive team who share a passion for admission prevention, reablement, and increasing independence, and you’ll play an active role in service development and supporting junior staff. You’ll work alongside Band 4 Senior Rehab Assistants to support the daily work of the rapid response team. As a Therapist within the team you&#39;ll also be working closely with Clinical Supervisors to proactively establish/identify patients who require early/urgent therapy intervention.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Responsibilities include&lt;/em&gt;&lt;/strong&gt;&lt;strong&gt;&lt;em&gt;:&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Effective management of the clinical caseload ensuring care is prioritised appropriately&lt;/li&gt;\n&lt;li&gt;Quality of patient assessment and care planning&lt;/li&gt;\n&lt;li&gt;Day to day management of therapy appropriate for the clinical area&lt;/li&gt;\n&lt;li&gt;Assist in the leadership and development of staff in the team and to act as a positive role model for more junior members of staff and students&lt;/li&gt;\n&lt;li&gt;Potentially required to deputise for the line manager in their absence&lt;/li&gt;\n&lt;li&gt;There will be an expectation to provide training regarding enablement/rehabilitation approach and support Band 4 and band 3’s in the service to complete and support Supervision as required.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;You’ll be working alongside the 4 Neighbourhoods within Somerset (West Mendip, South Petherton, Bridgwater, Dene Barton) Please note: you’ll also need to be flexible with covering all areas when there is sickness / annual leave etc.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What is the main aim of the service?&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Prevent unnecessary hospital admission&lt;/li&gt;\n&lt;li&gt;Help people stay independent by supporting their recovery in their own homes&lt;/li&gt;\n&lt;li&gt;Reduce the need for ongoing care and potentially reduce referral on to Discharge to assess service by using the enablement approach.&lt;/li&gt;\n&lt;li&gt;Prevent unnecessarily long hospital stays by providing support to enable quick turnaround of patients&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Hours of work for this post are between 8am - 8pm, 7 days a week. &lt;strong&gt;Please note:&lt;/strong&gt; you’ll need to work in shifts during the week to ensure the full day is supported.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;This vacancy offers the possibility to be able to work in a rotational way between discharge to assess &amp; rapid response to provide you with strong experience in both.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For more information please contact either Shaun Carthew (rapid response service manager) or Louise Bird (IRT service development lead).&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Looking to move? &lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Somerset is a fantastic place to live, with 4 Areas of Outstanding Natural Beauty, stunning beaches, green countryside, woodlands, lakes &amp; more. It’s not all rolling fields and cider though, with a thriving arts scene, fantastic food and drink, and a jam-packed calendar of events, Somerset truly offers something for everyone. There has never been a better time to escape to the countryside, and&lt;strong&gt; we offer a relocation package to those looking to move to Somerset&lt;/strong&gt; (details / terms and conditions can be sent directly to you).&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Somerset NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121360"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bridgwater Community Hospital, Bridgwater", "postalCode": "TA6 4GU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.1352", "longitude": "-3.00186"}}, "title": "Therapist, Band 6 - Rapid Response Service", "url": "https://www.jobs.nhs.uk/xi/vacancy/916260537", "validThrough": "2020-11-20T23:59:59+0000"}