{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 to £21,142"}}, "datePosted": "2020-10-29T10:29:17+0000", "description": "&lt;p&gt;The BMHU are looking to recruit a flexible and energetic Band 3 Therapeutic Liaison Worker to work on an acute ward.&lt;/p&gt;\n&lt;p&gt;The role will include facilitating group activities on the ward, which will vary depending on the patient group that are on the ward each week, which will require the successful applicant with be flexible with their approach.&lt;/p&gt;\n&lt;p&gt;You will be expected to coordinate your own time and create a timetable of activities for patients; however some of your work may be one to one time to engage patients who are unable to attend groups on the ward. You will be given a small budget for activities, which it will be your responsibility to ensure that is used effectively.&lt;/p&gt;\n&lt;p&gt;You will receive clinical supervision and be able to attend reflective practice with members of the team to support you.&lt;/p&gt;\n&lt;p&gt;You will have a personalised appraisal with the ward charge nurse or ward sister to facilitate your own development.&lt;/p&gt;\n&lt;p&gt;The working pattern is mostly Monday to Friday, 9 – 5; however there is also an opportunity to work evenings and weekends to support the patients when there is less activity on the ward.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Leicestershire Partnership Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120650"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Leicester", "postalCode": "LE3 9EJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6554", "longitude": "-1.18283"}}, "title": "Band 3 Therapeutic Liaison Worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247890", "validThrough": "2020-11-12T23:59:59+0000"}