{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "33000", "minValue": "33000", "unitText": "YEAR", "value": "up to £33,000 per annum DOE"}}, "datePosted": "2020-10-29T09:11:51+0000", "description": "&lt;p&gt;&lt;strong&gt;Break into Prison Healthcare!&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt; HMP YOI New Hall is a closed female local prison which holds, adult female prisoners of all categories and Young Offenders and Juveniles on Detention and Training Orders.&lt;br /&gt; &lt;br /&gt; We are the Health in Justice market leader, providing healthcare services to offenders across the country. Our model of care is our Wellbeing Approach – an integrated, comprehensive approach in recognition of the fact prisoners are a socially-excluded group with healthcare needs which are complex and often associated with poor outcomes. It adopts the premise no single health/wellbeing factor can be taken in isolation of other motivational issues which might impact a person’s care.&lt;br /&gt; &lt;br /&gt; &lt;strong&gt;About the Job:&lt;br /&gt; &lt;br /&gt; &lt;/strong&gt;As a Mental Health Nurse at HMP YOI New Hall, you will provide a holistic package of care to patients within the prison system, working with the team ensuring the delivery of high quality, individualised, evidence based patient centred nursing care. You’ll manage the assessment of health needs, planning, delivery and evaluation of care for the prison population, including clinical risk assessment.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt; &lt;strong&gt;About you:&lt;/strong&gt;&lt;br /&gt; &lt;br /&gt; You will be a Registered Nurse (Mental Health) with a valid NMC pin, with recent experience in acute, secure or a forensic setting.&lt;br /&gt; &lt;br /&gt; &lt;strong&gt;Further job information:&lt;/strong&gt;&lt;br /&gt; &lt;br /&gt; This is a full-time role, working 37.5 hours per week. The salary for this role is up to £33,000 per annum - dependent on experience.&lt;br /&gt; &lt;br /&gt; &lt;em&gt;Please note that this role is subject to Practice Plus Group Terms &amp; Conditions and offers of employment are subject to receipt of satisfactory references, enhanced DBS check and prison vetting.&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Practice Plus Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130136"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wakefield", "postalCode": "WF4 4AX"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.6362", "longitude": "-1.6085"}}, "title": "Mental Health Nurse - HMP YOI New Hall", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247695", "validThrough": "2020-11-29T23:59:59+0000"}