{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-10-22T23:15:15+0100", "description": "&lt;p&gt;Rivendell is situated in the village of Eastry, close to Sandwich and is one of 6 Rehabilitation Units across Kent, which provides inpatient recovery and rehabilitation for individuals with complex mental health and psychological needs. The unit comprises of 10 single bedrooms and is staffed 24 hour a day, 7 days a week.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Rivendell prides itself in delivering specialist individualized and tailored recovery programmes to meet individual’s needs and optimise independence.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;An opportunity exists for an enthusiastic, motivated and adaptable Registered Mental Health Nurse (RMN) to join our dynamic, multidisciplinary team. The successful applicant will need previous experience in working with adults with mental health and have a good knowledge of the Care Programme Approach, Mental Health Act and Person Centered Care Plans. Ideally, the applicant will evidence knowledge and understanding of the Recovery Model and the benefits of embracing the principles embedded in psychosocial interventions. They will be expected to deliver individual and group interventions in the following areas: psychoeducation, wellbeing, recovery, hearing voices and social inclusion and have a solid understanding of assessment and outcome measurements to identify and support the needs of the client group.&lt;/p&gt;\n&lt;p&gt;The successful applicant will be expected to work collaboratively within a team of registered nurses and healthcare assistants who are supported by a centralised multiprofessional team comprising of medical, psychological and occupational therapy practitioners in order to support and deliver a quality package of care. In addition the service works closely with wider mental health services and third sector providers in order to access wider opportunities for service users in the areas of work, education and leisure, so excellent communication skills are essential.&lt;/p&gt;\n&lt;p&gt;Our proactive and supportive team will encourage you to develop your own specialist skills, knowledge and competence through participation, reflection, supervision and training. Including experimental learning in other parts of the Rehabilitation Service. Personal development will also be guided using the Trust appraisal process which has strong links with Canterbury Christchurch University that provides pre-registration and post-registration training.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Sonia Michaels, Unit Manager&lt;/p&gt;\n&lt;p&gt;Email: soniamichaels@nhs.net, Telephone: 01304 613017&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121464.jpg", "name": "Kent and Medway NHS and Social Care Partnership Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121464"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Rivendell Rehabilitation Unit, Eastry", "postalCode": "CT13 0JX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2439", "longitude": "1.30313"}}, "title": "Staff Nurse - Inpatient Rehabilitation", "url": "https://www.jobs.nhs.uk/xi/vacancy/916239616", "validThrough": "2020-11-08T23:59:59+0000"}