{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-11-02T15:01:30+0000", "description": "&lt;p&gt;&lt;strong&gt;Band 6 Section 136 Practitioners (Mental Health)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for band 6 Mental Health Practitioners to work on our 136 unit at the Orchard. Applications are invited from RMNs and RLDNs. The Orchard is situated in Lancaster with easy access to some of England’s finest scenery. The Lake District and the Forest of Bowland both a 40 minute drive away.&lt;/p&gt;\n&lt;p&gt;The Orchard is a Mental Health Unit which consists of and 18 bedded mixed gender ward, a place of safety as well as some outpatient review rooms. The team work very closely to support each other and there is a clear focus on support and professional development of our nurses. This is supported through mentorship, supervision, training, teaching sessions and access to inpatient development days.&lt;/p&gt;\n&lt;p&gt;We have a wealth of disciplines based at the Orchard, including Psychologists, Occupational Therapists, Health and Wellbeing Workers, Mental Health Nurses, Healthcare Support Workers, Mental Health Act Administrators, Social Support Officer, Pharmacists and Psychiatric consultants as well as a varied discipline of students. This ensures a holistic way of working and enables us to deliver the highest standard of care to our patients.&lt;/p&gt;\n&lt;p&gt;The Section 136 Suite provides interim mental health care and assessment for patients detained under Section 136. The purpose of the Section 136 Suite is to provide an in-depth assessment within a 24 hour period. This is a nurse led service and you will be working within a multidisciplinary team to carry out a diverse range of duties.&lt;/p&gt;\n&lt;p&gt;Successful candidates will be instrumental in delivering duties that are aimed at promoting a timely assessment of needs and recovery from mental illness. The role will include accepting members of the public detained under Section 136 of the Mental Health Act, co-ordinate assessments, undertake assessments and complete the clinical paperwork. There will be opportunity for you to work alongside the Home Treatment Team and the mental Health Liaison Team to further enhance your development and to provide a whole team approach in our locality.&lt;/p&gt;\n&lt;p&gt;You will need to possess excellent interpersonal skills, the ability to carry out comprehensive assessments, be able to demonstrate sound leadership skills and staff development skills. A strong commitment to your ongoing professional education and development is essential.&lt;/p&gt;\n&lt;p&gt;If you are successful in this post, you will be given the opportunity to choose from long days, short shifts or a combination of the two (hybrid). If you are working long days, this will consist of 13 shifts in 28 days. If you are working short shifts, this will be 5 short shifts a week with a combination of Early and Late shifts. If you choose to combine the two, you will work two long shifts and two short shifts per week. There will also be an expectation to rotate onto nights at times.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Alec Stuart Modern Matron alec.stuart@lscft.nhs.uk 01524 550500&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Jackie McDowell Manager 01524 550500&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For all other enquiries please contact Employment Services Team Leader - 01772 520200&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121124.png", "name": "Lancashire & South Cumbria NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121124"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Orchard, Lancaster", "postalCode": "LA1 4JJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.032", "longitude": "-2.80452"}}, "title": "Mental Health Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252533", "validThrough": "2020-11-16T23:59:59+0000"}