{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "91881", "minValue": "91881", "unitText": "YEAR", "value": "£91,881"}}, "datePosted": "2020-11-02T11:31:51+0000", "description": "&lt;p&gt;Applications are invited for the post of Locum NHS Consultant Orthopaedic Surgeon, with expertise in the hand, wrist and elbow, to join the existing team of Consultant Trauma &amp; Orthopaedic Surgeons who provide the service across North West Wales. This post is full time and includes a commitment to participate in a 1 in 12 general orthopaedic and trauma on call rota.&lt;/p&gt;\n&lt;p&gt;The successful candidate will join a friendly and enthusiastic team of thirteen other consultants, who along with a hard-working, highly motivated, dedicated team of medical and nursing staff, provide a high quality, modern service in a rapidly developing unit. The Department provides elective and emergency in-patient, day-case and outpatient services to a catchment area of approximately 240,000 residents.&lt;/p&gt;\n&lt;p&gt;This consultant position will be based in Ysbyty Gwynedd which is located in Bangor, North West Wales, adjacent to the Menai Straits and in the shadow of the mountains of Snowdonia. North Wales is acclaimed to be one of the top spots in the UK to live, offering a wide variety of outdoor activities, attractions and some of the finest food. We are surrounded by stunning scenery to explore, from the rolling hills and valleys to the rugged mountains and long sandy beaches. Chester is less than an hour away and the cities of Liverpool and Manchester are just over an hour, making this location a perfect place to live. With affordable quality housing, excellent private and state schools and great local amenities, why not work where you’d love to live?&lt;/p&gt;\n&lt;p&gt;Betsi Cadwaladr University Health Board is the largest health board in Wales and provides services to a population of approximately 700,000 residents. It employs approximately 16,500 staff, has a budget of £1.2 billion and operates three district general hospitals, 22 other acute and community hospitals and a network of more than 90 health centres, clinics, community health team bases and mental health units. We have strong links with the University of Wales, Bangor giving candidates further opportunity to develop research links and/or teaching links.&lt;/p&gt;\n&lt;p&gt;Candidates who may wish to see the Department(s) involved are invited to contact:-&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Mr Haroon Mumtaz: Consultant T&amp;O Surgeon &amp; Clinical Lead&lt;/p&gt;\n&lt;p&gt;Telephone No. 01248 384384 Ext 5882&lt;/p&gt;\n&lt;p&gt;haroon.mumtaz@wales.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Mr Edwin P Jesudason: Consultant Hand &amp; Orthopaedic Surgeon&lt;/p&gt;\n&lt;p&gt;Telephone No. 01248 384384 Ext 5421&lt;/p&gt;\n&lt;p&gt;edwin.jesudason@wales.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;M&lt;strong&gt;r&lt;/strong&gt;s Karen Evans: Lead Manager, Surgery, Anaesthetics &amp; Critical Care Directorate&lt;/p&gt;\n&lt;p&gt;Telephone No 03000 850830&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameMr Edwin P JesudasonJob titleConsultant Hand &amp; Orthopaedic SurgeonEmail addressedwin.jesudason@wales.nhs.ukTelephone number01248 384384 Ext 5421&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123196.JPG", "name": "Betsi Cadwaladr University Local Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123196"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Ysbyty Gwynedd, Bangor", "postalCode": "LL57 2PW"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.209", "longitude": "-4.15983"}}, "title": "Locum Consultant Orthopaedic Surgeon with a special interest in Hand,", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251798", "validThrough": "2020-11-30T23:59:59+0000"}