{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "50819", "minValue": "37570", "unitText": "YEAR", "value": "£37,570 - £50,819 per annum pro rata"}}, "datePosted": "2020-10-27T16:48:59+0000", "description": "&lt;p&gt;Are you an experienced senior musculoskeletal (MSK) clinician looking for a new challenge? Sussex MSK Partnership (SMSKP) is looking for six experienced clinicians to work as Advanced Practitioners (AP) and First Contact Practitioner (FCP). We have one vacancy in the Spine pathway, one in the Lower Limb pathway and four vacancies as FCP posts.&lt;/p&gt;\n&lt;p&gt;All successful candidates will rotate between FCP and physiotherapy or between FCP / AP / physiotherapy. You are still part off and based within the wider MSK team. Training, mentorship and ongoing support will be provided to successful candidates in these roles.&lt;/p&gt;\n&lt;p&gt;Salary will be dependent on experience and those new to these positions would be taken on in a training capacity at Band 7 until the relevant competencies have been successfully achieved. At this point you will move across to the Band 8a pay scale.&lt;/p&gt;\n&lt;p&gt;Sussex Community NHS Foundation Trust is the main provider of community NHS health and care across West Sussex and delivers care in collaboration with HERE – Care Unbound and other NHS providers under the Sussex MSK Partnership. The Sussex MSK Partnership is a unique local, not for profit partnership bringing together primary care, specialist musculoskeletal care and community, mental health and well-being experts to deliver the whole musculoskeletal service in Sussex.&lt;/p&gt;\n&lt;p&gt;Your contract will depend on where you work and could fall either under SCFT or HERE.&lt;/p&gt;\n&lt;p&gt;Our commitment is to provide a truly integrated MSK service that is effective, efficient and compassionate.&lt;/p&gt;\n&lt;p&gt;You must be a UK registered clinician to apply, with a broad range of musculoskeletal experience. You will need to have had recent experience of leading and managing others. Applicants should be committed to delivering high quality care and have excellent communications skills. You will be required to work between the clinical sites of Brighton, Crawley and Horsham Hospitals.&lt;/p&gt;\n&lt;p&gt;In return we can offer you:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Flexible working patterns.&lt;/li&gt;\n&lt;li&gt;Supportive learning environment, your clinical development will be supported by senior staff including physiotherapy consultants, clinical team leads and AP’s.&lt;/li&gt;\n&lt;li&gt;Dedicated career pathways and great opportunities to develop your clinical and management skills with access to in-service training and professional development.&lt;/li&gt;\n&lt;li&gt;Commitment to and support for your wellbeing.&lt;/li&gt;\n&lt;li&gt;Excellent therapeutic and working environment which has recently undergone extensive refurbishment.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;If you are passionate about making a difference and want to contribute to an organisation which is continuously striving to improve then we would love to hear from you.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Sally York – Physiotherapy and FCP lead :sally.york@nhs.net&lt;/p&gt;\n&lt;p&gt;Dan Lethbridge – Lower limb lead : daniellethbridge@nhs.net&lt;/p&gt;\n&lt;p&gt;Johan Holte – Consultant Physiotherapist and Spine Lead : johan.holte@nhs.net&lt;/p&gt;\n&lt;p&gt;Closing date: 08/11/2020&lt;/p&gt;\n&lt;p&gt;Interviews will take place week commencing 23/11/2020&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Here are committed to equality and valuing diversity.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Care Unbound Limited, trading as Here", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130037"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Brighton", "postalCode": "BN1 6AG"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8384", "longitude": "-.148266"}}, "title": "Advanced Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245489", "validThrough": "2020-11-08T23:59:59+0000"}