{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365.00 - £37,890.00 pa pr"}}, "datePosted": "2020-10-30T14:17:22+0000", "description": "&lt;p&gt;&lt;span&gt;&lt;strong&gt;Band 6 Deputy Sister&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Do you want to make a positive difference to patient care and staff development? &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Be inspired – join our senior team on C4 Head and Neck Ward!&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are a 14 bedded ward, in the surgical directorate, specialising in ear, nose and throat, and oral maxillofacial. We also have two treatment rooms, which are attended by adults and children. We are a forward thinking, innovative ward, with a supportive multidisciplinary team and friendly, dynamic nursing staff.&lt;/p&gt;\n&lt;p&gt;The successful applicant will have excellent skills and knowledge in the clinical management of surgical patients and airway management. They will be an exceptional role model, leading by example in their provision of high quality, patient-centred care. They will demonstrate strong inter-personal and organisational skills, the ability to delegate effectively, co-ordinate the team, monitor and audit nursing standards, manage conflict and patient flow. They will provide leadership, direction, support and training to the nursing team. Furthermore, they will assist in creating a happy and safe environment, where staff are fulfilled and morale is high.&lt;/p&gt;\n&lt;p&gt;The successful applicant will have the opportunity of attending a variety of training courses to enhance their leadership skills. These include, but are not limited to, Leadership in Action, Managing Attendance, Coaching Skills Workshop, Appraisal Skills, Risk Management, COSHH, Route Cause Analysis, Recruitment and Selection, and workforce training. Other opportunities for further training, such as BTEC Level 3 in Leadership and Management, may also be available.&lt;/p&gt;\n&lt;p&gt;This is a fantastic opportunity for personal development and career progression – Apply today and make a positive change to the future of C4 Head and Neck Ward!&lt;/p&gt;\n&lt;p&gt;Please note: if this job requires you to have a DBS check to enable you to properly fulfil the requirements of the job, on appointment you will be required to repay the cost of obtaining a DBS check and this amount will be reclaimed from your salary.&lt;/p&gt;\n&lt;p&gt;Closing date: 15/11/2020&lt;/p&gt;\n&lt;p&gt;Provisional interview date: 25/11/2020&lt;/p&gt;\n&lt;p&gt;For further details, or for an informal visit, please contact:&lt;/p&gt;\n&lt;p&gt;Sister Lucinda Christopher&lt;/p&gt;\n&lt;p&gt;lucinda.christopher@uhd.nhs.uk&lt;/p&gt;\n&lt;p&gt;0300 019 2175&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120850.PNG", "name": "Royal Bournemouth and Christchurch Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120850"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Poole, Dorset", "postalCode": "BH15 2JB"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.722", "longitude": "-1.97311"}}, "title": "Deputy Sister / Charge Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250542", "validThrough": "2020-11-15T23:59:59+0000"}