{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum, pro rata"}}, "datePosted": "2020-11-03T15:31:17+0000", "description": "&lt;p&gt;An opportunity has arisen for a Biomedical Scientist (BMS) at Band 5 or a Specialist Biomedical Scientist at a Band 6 in the Cytology department of Manchester University NHS Foundation Trust at Oxford Road Campus. The post holder must be a Biomedical Scientist registered with the HCPC and will provide scientific services to patients and clients as an aid to clinical diagnosis.&lt;/p&gt;\n&lt;p&gt;You will have:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Band 6 applicants will have completed the Specialist Diploma in Cytology&lt;/li&gt;\n&lt;li&gt;Band 5 applicants will be supported to do the specialist portfolio and on completion be upgraded to Band 6.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;br /&gt;The post holder will join our friendly team at this busy teaching hospital which offers many specialist services. Our hospital has a bright and busy future; our staff has a proven record in providing high quality work, good teamwork and compassionate care for our patients. The post holder will assist and provide leadership, strategy and day to day support to the non-gynaecological cytology BMS and support teams.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;The Cytopathology department provides diagnostic service to MFT, Trafford General Hospital and the Christie Hospital. We have a consultant led service which provides on site diagnosis at EBUS clinics and BMS assistance at a wide range of FNA clinics including adequacy assessment at H&amp;N clinics.&lt;br /&gt;The department also offers a comprehensive specialist non-gynaecological cytology service, reporting on a wide range of samples including serous fluids, urine and respiratory samples. The department is the largest provider of synovial fluid and cervical cytology services in the North West.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameRosebina ZafarJob titleLead BMS in Non-gynecological CytologyEmail addressrosebina.zafar@mft.nhs.ukTelephone number0161 276 5110&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Manchester University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121137"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Manchester University Foundation Trust Oxford Road Site, Manchester", "postalCode": "M13 9WL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4625", "longitude": "-2.22771"}}, "title": "Biomedical Scientist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254569", "validThrough": "2020-11-15T23:59:59+0000"}