{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30426", "minValue": "16625", "unitText": "YEAR", "value": "£9.89 ph - £18.10 ph"}}, "datePosted": "2020-11-06T09:52:38+0000", "description": "&lt;p&gt;&lt;strong&gt;Care Support Worker – Alexandra Hospital, Redditch &lt;/strong&gt;(flexible and long-term opportunities available)&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Worcestershire Acute Hospitals NHS Trust&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Band 2 – &lt;/strong&gt;basic pay rate £9.89 ph, Sat/Night £13.94 ph, Sun/Bank Hol £18.10 ph&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Winter Incentive now available (Only available for shifts worked at Worcester Acute NHS Trust)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Here at NHS Professionals we are looking for Care Support Workers to join our team and help support our Alexandra Hospital based in Redditch part of the Worcester Acute Hospital NHS Trust. We offer flexible working that can fit in with your schedule.&lt;/p&gt;\n&lt;p&gt;NHS Professionals is the leading provider of managed flexible workforce services to the NHS with approximately 130,000 nurses, doctors, administration and clerical and other healthcare professionals signed to its bank. We help our NHS Trust clients implement tactical measures to improve workforce efficiency and productivity as part of an overall workforce strategy.&lt;/p&gt;\n&lt;p&gt;Within this role you will help to support patients with duties including washing, dressing, meals, helping individuals to mobilise and the general comfort of each individual patient. You will support the Registered Nurse by ensuring patients are monitored to include taking temperatures, pulse, respirations, and weight. You will work as part of the ward or department team. You will be a compassionate person that can communicate effectively and put the patient at the centre of all you do.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Essential Skills and Responsibilities&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;To apply for this role, you must have:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A minimum of 3 months experience within a Hospital setting within the last 2 years.&lt;/li&gt;\n&lt;li&gt;A basic standard of education including Maths and English.&lt;/li&gt;\n&lt;li&gt;Legible Handwriting.&lt;/li&gt;\n&lt;li&gt;The ability to communicate effectively, this includes written, verbal and listening.&lt;/li&gt;\n&lt;li&gt;An understanding of the concept of confidentiality.&lt;/li&gt;\n&lt;li&gt;Ideally hold an NVQ level 2 in Health and Social care or equivalent (Not Essential).&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;This job description gives a general outline of the post and is not intended to be inflexible or a final list of duties. It may therefore be amended from time to time in consultation with the post holder.&lt;/p&gt;\n&lt;p&gt;In return for your hard work and your professional, caring and reliable service you will have access to the following benefits:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Competitive, weekly pay&lt;/li&gt;\n&lt;li&gt;Flexible way of working&lt;/li&gt;\n&lt;li&gt;First Choice of available bank shifts&lt;/li&gt;\n&lt;li&gt;Access to the NHSP Stakeholder Pension&lt;/li&gt;\n&lt;li&gt;paid annual leave, statutory maternity/paternity pay (subject to qualifying criteria)&lt;/li&gt;\n&lt;li&gt;Training and development opportunities&lt;/li&gt;\n&lt;li&gt;Access to our very own pension’s scheme called ‘NHSP Stakeholder pension’&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Please note that you will be contacted via email throughout the recruitment process, so please check your emails regularly.&lt;/p&gt;\n&lt;p&gt;We regret we cannot contact everyone who is not selected for an interview, therefore if you do not hear from us within 21 days after submitting your application, please assume you have not been successful on this occasion.&lt;/p&gt;\n&lt;p&gt;For more information on this role please contact natalie.peace@nhsprofessionals.nhs.uk&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "NHS Professionals - Flexible Workers", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121069"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Redditch", "postalCode": "B98 7UB"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.2798", "longitude": "-1.91212"}}, "title": "Bank Care Support Worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259111", "validThrough": "2020-11-15T23:59:59+0000"}