{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30863", "minValue": "30863", "unitText": "YEAR", "value": "£18.36 per hour"}}, "datePosted": "2020-10-21T01:06:26+0100", "description": "&lt;h1&gt;&lt;strong&gt;Break in to prison healthcare!&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Have you ever thought about working within the prison environment?&lt;br /&gt; &lt;br /&gt; Are you looking for a new nursing challenge?&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h1&gt;&lt;strong&gt;Then look no further…&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;HMP Hewellis a closed category B male remand prison, with an operational capacity of 1,104. In the main closed site, there are 6 main house block residential units. The prison is operated by Her Majesty’s Prison Service.&lt;/p&gt;\n&lt;p&gt;Practice Plus Group are Health in Justice Market leader, providing healthcare services to offenders across the country. Our model of care is our Wellbeing Approach – an integrated, comprehensive approach in recognition of the fact prisoners are a socially-excluded group with healthcare needs which are complex and often associated with poor outcomes. It adopts the premise no single health/wellbeing factor can be taken in isolation of other motivational issues which might impact a person’s care.&lt;/p&gt;\n&lt;p&gt;To ensure the continued quality of care at HMP Hewell, we’re looking for Bank Primary Care Nurses to join our team.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h1&gt;&lt;strong&gt;About the role…&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Nursing in prison is never dull or predictable. On any given day the skills you use may be similar to those you need working in health promotion or A&amp;E, alternatively you may be supporting people to manage their mental health or substance misuse. It’s this variety that keeps things fresh and stimulating. Every day will bring new challenges and new experiences. But at the same time, you’ll have all the support you need to deliver the best care possible.&lt;br /&gt; &lt;br /&gt; The role will be an experience like no other, requiring a diverse and mixed nursing skills and background. One minute you could be delivering a nurse led clinic and the next you are attending an emergency response.&lt;br /&gt; &lt;br /&gt; You can expect to be involved in everything from clinical triage, suturing, wound care and fracture clinics to the evaluation and development of patient care and standards. You’ll carry out nurse-led clinics, reviewing patient histories, undertaking relevant examinations and tests, organising any necessary treatment and referring patients to other healthcare professionals when you need to.&lt;/p&gt;\n&lt;h1&gt; &lt;/h1&gt;\n&lt;h1&gt;&lt;br /&gt; &lt;strong&gt;About you…&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will be a qualified Registered Nurse (Adult) with a real passion for developing your clinical skills in an environment that is ever changing.&lt;br /&gt; &lt;br /&gt; If you are self-motivated and able to work autonomously as well as showing plenty of initiative when it comes to handling a wide range of situations, then this could be the right role for you!&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h1&gt;&lt;strong&gt;In return for your hard work you will receive...&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;At Practice Plus Group, we areproud to support our employees with continued professional development opportunities and further education (subject to service needs). Staff are encouraged to develop skills and learning to contribute to the dynamic care needs of our specific client groups. Other benefits include cycle to work scheme, on-site gym facilities and free onsite parking at some locations.&lt;/p&gt;\n&lt;h1&gt; &lt;/h1&gt;\n&lt;h1&gt;&lt;strong&gt;Further job information…&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This is a bank vacancy with variable hours, as required. The maximum rate for the role is £18.36per hour, depending on experience.&lt;/p&gt;\n&lt;p&gt;Please note that offers of employment are subject to Practice Plus Group Terms &amp; Conditions and receipt of satisfactory references, an enhanced DBS check and prison vetting.&lt;/p&gt;\n&lt;p&gt;At Practice Plus Group, we actively promote diversity and equal opportunities.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "Practice Plus Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130136"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Redditch", "postalCode": "B97 6QS"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.3256", "longitude": "-1.9916"}}, "title": "Bank Staff Nurse - HMP Hewell", "url": "https://www.jobs.nhs.uk/xi/vacancy/916235489", "validThrough": "2020-11-12T23:59:59+0000"}