{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum + Outer London HCAS"}}, "datePosted": "2020-11-02T08:16:54+0000", "description": "&lt;p&gt;Business Support Officer – Quality and Governance– Chase Farm Hospital&lt;/p&gt;\n&lt;p&gt;Specialist Service&lt;/p&gt;\n&lt;p&gt;The North London Forensic Service provides forensic mental health services in both inpatient and community settings. We pride ourselves on providing high quality services to those with mental health problems who have come into contact with the Criminal Justice System and our forensic inpatient services who have been rated for the past two years as “outstanding” by the Care Quality Commission.&lt;/p&gt;\n&lt;p&gt;The successful applicant will join a 30 strong admin team within the specialist service line, and will be based primarily at Chase Farm Hospital, although may travel to any of our other sites in the course of their work. The post holder will and manage the work of the Senior Management team across the service line and will provide administrative support for internal governance processes, including complaints/incidents, training, induction, risk registers, audits, etc. The post holder will be required to produce reports and identify trends and service improvements where required. The post holder will be required to work independently and as part of a team. They will undertake routine duties following departmental guidelines, but must able to use initiative when necessary.&lt;/p&gt;\n&lt;p&gt;We are seeking a dynamic, well-organised, and pro-active administrator. You will need working knowledge of all key IT systems, with an in depth knowledge of MS Excel as you will be managing large amounts of data. You should possess excellent interpersonal and communication skills, a good eye for detail, and be a true team player. The ability to organise and prioritise work under pressure so as to meet strict deadlines is an essential feature of this job. The Trust offers a New and Aspiring Manager training for staff looking to develop their careers. If you enjoy working as part of a dedicated team, have a flexible approach and professional attitude, and meet the requirements of the person specification we would like to hear from you.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Michele Malhotra&lt;/p&gt;\n&lt;p&gt;Job title: Service Administration Manager&lt;/p&gt;\n&lt;p&gt;Email address: michele.malhotra2@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number: 02087025993&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Barnet Enfield and Haringey Mental Health Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120621"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Chase Farm Hospital, Enfield", "postalCode": "EN2 8JL"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6663", "longitude": "-.103613"}}, "title": "Business Support Officer – Quality and Governance", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251317", "validThrough": "2020-11-06T23:59:59+0000"}