{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-10-26T13:32:00+0000", "description": "&lt;p&gt;&lt;strong&gt;Sussex Eating Disorders Services&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Practitioner Psychologist / specialist psychological therapist Band 7 (1 WTE)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;“When the winds of change blow, some people build walls and others build windmills&quot;&lt;br /&gt;― &lt;strong&gt;Chinese Proverb&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Come and join our small but mighty team of compassionate, supportive and skilled clinicians who are embracing the winds of change within the Sussex Eating Disorder Services (SEDS).&lt;/p&gt;\n&lt;p&gt;We are delighted to have secured additional funding for a FREED champion role. This is so that we can fully translate the steps we have taken to implement the FREED approach to enable rapid access to treatment for young adults presenting with the first episode of an eating disorder. This approach was pioneered by the South London and Maudsley eating disorder team and our Principal Grade Clinical Psychologist Dr Amy Brown was the original freed champion and fully involved in the initial roll out and evaluation of the approach. Since she joined our team last year we have done all we can to lay the foundations to bring the approach to Sussex and now we are ready. All we need is a FREED champion and we&#39;d love that champion to be you.&lt;/p&gt;\n&lt;p&gt;Our vision is to provide the best care possible for those with eating disorders whilst ensuring our team members receive the support, supervision and skills development they need to provide this care and flourish in their roles. There is in-house training and supervision for all the NICE guidelines recommended interventions for eating disorders and we are passionate about their safe roll out in our community setting.&lt;/p&gt;\n&lt;p&gt;We have recently launched an eating disorder research clinic. Unique to this is that the consultant clinical psychologists in the service also co-direct the clinic affording continuity between the clinical and research elements. As a team we deliver evidence-based and evidence generating practice and the FREED work will form a wonderful part of this.&lt;/p&gt;\n&lt;p&gt;SEDS (Sussex Eating Disorders Services) cover Sussex with differing commissioning arrangements in West Sussex, Brighton and Hove and East Sussex that cover a large rural area (ability to use a car is required). SEDS main base is in Brighton where team meetings are held. The clinical caseload for this role will be across Brighton and West Sussex.&lt;/p&gt;\n&lt;p&gt;The FREED champion role involves managing all young adult referrals to our service and some transition liaison with our colleagues in the Child and Adolescent ED service. The champion tracks all referrals for 18 to 25-year olds and conducts an ‘engagement call’ within 48 hours of a referral being received. These processes will be supported by an assistant psychologist and psychology interns whom the FREED champion will have a role in supervising.&lt;/p&gt;\n&lt;p&gt;The champion will endeavour to maintain the enthusiasm for FREED within the team and beyond (e.g., building links with child and adolescent services, universities and other eating disorder services), through training and regular updates/liaison. We are taking steps to set up a &#39;FREED mini team&#39; who will work with the FREED champion to provide assessment and treatment for FREED patients. We will have a weekly 15 minute &#39;FREED huddle&#39; to ensure that FREED processes are being followed, led by the champion. In addition to the responsibilities of tracking FREED patients and overseeing FREED within the service, the champion will have a clinical caseload themselves.&lt;/p&gt;\n&lt;p&gt;The FREED champion role is a rare opportunity for a practitioner to have a true mix of service development, research and clinical work protected in their job plan. The role will require good organisation skills, creative thinking/problem solving, as well as leadership and passion.&lt;/p&gt;\n&lt;p&gt;Successful candidates will either have a degree in psychology and doctoral level training in applied psychology (or its equivalent for those who trained before 1996 or outside the UK) as approved by the Health Care Professions Council (HCPC), or they will be a specialist psychological practitioner with recognised/accredited training in a psychological therapy such as CBT, art drama or music therapy. We welcome applications from newly qualified practitioners as well as those with more experience. We would love applications from those with experience of working with individuals with eating disordered presentations and those who have worked in other specialities and are excited by the prospect of transferring their skills to an eating disorder service.&lt;/p&gt;\n&lt;p&gt;We are committed to supporting staff well-being, developing new roles in teams, and have a thriving Recovery College. We have close links with the local universities and support the training schemes for clinical psychology and nursing, providing high quality placements. This is an opportunity to join an organisation which sets a high priority on the development of services in collaboration with experts through experience and carer’s and to work with dedicated and supportive colleagues. The trust is committed to strong integrated, collaborative leadership between managers and clinicians.&lt;/p&gt;\n&lt;p&gt;Sussex is easily accessible from London, Gatwick, Surrey, and Hampshire and is a beautiful county with good transport links, vibrant communities and tourist attractions, including the Coast and the South Downs.&lt;/p&gt;\n&lt;p&gt;Please note that whilst this is a fixed term contract, we have already secured funds to extend at least 0.6 of the post longer term and we will do all we can to secure further funding and transform it into a permanent post over the course of the year.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Nicola Gilbert&lt;/p&gt;\n&lt;p&gt;Job title Consultant Clinical Psychologist&lt;/p&gt;\n&lt;p&gt;Email address nicola.gilbert@sussexpartnership.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number 03003040090&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121074.jpg", "name": "Sussex Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121074"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "East Brighton CMHC, Brighton", "postalCode": "BN2 3EW"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8309", "longitude": "-.114138"}}, "title": "Practitioner Psychologist/ Psychological Therapist and FREED Champion", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242682", "validThrough": "2020-11-16T23:59:59+0000"}