{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 - £19,337"}}, "datePosted": "2020-11-04T11:24:50+0000", "description": "&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;We are looking for dynamic and motivated Healthcare Assistants with a strong Rehabilitation and Reablement ethos to join our friendly and supportive team in the Skylark Rehabilitation Unit located in The Meadows, Yate.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;There are 30 beds in the new unit and we will be providing intensive rehabilitation for people who are unable to safely return directly home following a hospital stay due to on-going rehabilitation and care needs. We will also support those people who need more complex discharge planning to enable them to return home. We are passionate about delivering high quality care to the people we support while helping them to reach their full functional potential and optimise their well-being. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We actively promote a multi-disciplinary model of care and our nursing, therapy and support teams work closely with our social care and community teams, to make sure those we support have an exceptional experience. We also work with our GPs with Specialist Interest and other medical colleagues to ensure we provide care of the highest standard.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The successful candidates will have a real passion for their work, with excellent communication skills, a positive attitude, and respect for those we support, their carers and families as well as our colleagues in the wider Multi-Disciplinary Team. You will join a team of experienced nurses, therapists and support staff to provide compassionate care, and will work with us to create an environment providing high quality rehabilitation and reablement. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;For more specific information on each available role, please see the individual job portfolio attached. &lt;span&gt;You will normally be expected to work 12.5 hours&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;If you are willing to go the extra mile to make everyone in the unit feel ‘important and valued’ and be the ‘best that they can be’ then we want to hear from you. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/127274.jpg", "name": "Sirona care and health CIC", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127274"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Yate", "postalCode": "BS37 5DW"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5447", "longitude": "-2.42401"}}, "title": "Healthcare Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255586", "validThrough": "2020-11-15T23:59:59+0000"}