{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "155", "minValue": "155", "unitText": "YEAR", "value": "£155.62 per week"}}, "datePosted": "2020-11-04T08:16:43+0000", "description": "&lt;p&gt;&lt;strong&gt;NCH&amp;C is proud to be the first standalone NHS community trust in the UK to achieve an ‘Outstanding’ rating from the Care Quality Commission (CQC). Our focus is on continually improving the quality of care we offer to local people and on improving access to that care, helping people to move seamlessly from one service to another. Praising NCH&amp;C’s “compassionate, inclusive and effective leadership at all levels”, the CQC observed that our staff are well supported to make positive changes and innovations.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We welcome applications from people who share our values and can help us deliver outstanding care in our local community.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are looking to appoint enthusiastic and well-motivated people to multiple Apprentice Health Care Assistant positions across Norfolk studying towards a nationally recognised Healthcare Support Worker Apprenticeship at Level 2 for a 14 month fixed term post. There is an opportunity for a person to develop knowledge, skills and behaviors within various inpatient and community clinical settings.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;You will work within ward and community teams, working with patients with various needs providing direct patient care. Excellent communication skills and a supportive approach to team working within the various clinical settings are key&lt;/strong&gt;&lt;strong&gt;. Demonstrating the ability to working within the Trust behavioural framework will be essential to the role.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;You will have the ability to manage your own learning supported by the allocated supervisors, Clinical Education Team and Talent for Care team in order to gain new knowledge and skills to benefit them and the service. This is a great opportunity to learn while working in an area with patients with various care needs.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Good interpersonal skills are essential as well as the ability balance academic studies and the work in practice.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;These are 14 months fixed term training positions where we have multiple positions across North, South, West and Norwich (please see map provided of the areas we cover) and a great opportunity for those wanting to start a career in the NHS. A guaranteed position as a Healthcare Assistant within the Trust will be offered subject to successful completion of the course and suitable conduct.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;To apply we require a minimum of 4 GCSE’S at grade D/3, be aged 16 or over and have been resident in the UK/EU for the last three years as per Apprenticeship Rules.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Apply now to join an organisation that has been awarded an ‘Outstanding’ rating by the Care Quality Commission (CQC), the highest possible rating and the first stand-alone NHS community trust in the country to be awarded the title.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Norfolk Community Health and Care NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120940"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "North Walsham Memorial Hospital, North Walsham", "postalCode": "NR28 9AP"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.8141", "longitude": "1.38792"}}, "title": "Apprentice Healthcare Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255070", "validThrough": "2020-11-19T23:59:59+0000"}