{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "27602", "minValue": "19751", "unitText": "YEAR", "value": "From £11.75 to £16.42 per hour"}}, "datePosted": "2020-11-02T11:36:43+0000", "description": "&lt;p&gt;We are currently seeking &lt;strong&gt;Regional&lt;/strong&gt; &lt;strong&gt;Bank&lt;/strong&gt; &lt;strong&gt;Staff Nurses (RMN /RNLD )&lt;/strong&gt; to work across two sites. Our &lt;strong&gt;Adult Mental Health service &lt;/strong&gt;at&lt;strong&gt; The Huntercombe Hospital, Eldertree Lodge&lt;/strong&gt; (Ashley House)&lt;strong&gt;,&lt;/strong&gt; located approximately 6 miles from &lt;strong&gt;Market Drayton &lt;/strong&gt;and just 11 miles from &lt;strong&gt;Stoke-on-Trent&lt;/strong&gt;. And our&lt;strong&gt; Child and Adolescent Mental Health Service (CAMHS) &lt;/strong&gt;at&lt;strong&gt; The Huntercombe Hospital Stafford &lt;/strong&gt;located in&lt;strong&gt; Wheaton Aston, &lt;/strong&gt;10 miles from &lt;strong&gt;Telford&lt;/strong&gt; &amp; 12 miles from &lt;strong&gt;Wolverhampton&lt;/strong&gt;.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Huntercombe Group&lt;/strong&gt; is one of the leading specialist care providers in the UK, providing treatment in the areas of &lt;strong&gt;Mental Health and Addictions, Brain Injury&lt;/strong&gt; &lt;strong&gt;Rehabilitation, Adolescent Mental Health (CAMHS), Learning Disabilities and Children Specialist Services.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Huntercombe Hospital, Eldertree Lodge – Market Drayton&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;CQC rating GOOD – report published November 2017&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Eldertree Lodge&lt;/strong&gt; (Ashley House) is a &lt;strong&gt;mental health hospital&lt;/strong&gt; that provides specialist assessments, treatments and rehabilitation for adults with intellectual disabilities, mental health needs, autistic spectrum disorders, including those with varying degrees of challenging behaviours and forensic histories. The Hospital has 46 beds spread across six wards.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Huntercombe Hospital Stafford – Wheaton Aston&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Stafford is a 39 bed Tier 4&lt;strong&gt; CAMHS hospital&lt;/strong&gt; for young people aged 12 -18 years with a range of mental health disorders including eating disorders and complex needs. On the hospital site there is a purpose-built 12 bed psychiatric intensive care service (PICU) for patients with severe mental Illness who require very specialist and intensive treatment. The 15 bed eating disorders service is housed separately in the original Manor House.&lt;/p&gt;\n&lt;p&gt;Our Bank &lt;strong&gt;Registered Nurses &lt;/strong&gt;are highly respected and they shape how we deliver care. Our &lt;strong&gt;‘Conversation&lt;/strong&gt; &lt;strong&gt;into Action’&lt;/strong&gt; programme actively encourages everyone to get involved and drive change for the better.&lt;/p&gt;\n&lt;p&gt;This is a great opportunity to work across two fantastic sites, learning about two different patient groups and maximising your experience in both.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job Summary:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To identify care needs of patients, planning and implementing nursing interventions and evaluating outcomes of care given&lt;/li&gt;\n&lt;li&gt;To communicate information accurately on patient care to the patient, families, internal and external professionals, including Commissioners whilst maintaining confidentiality and adhering to the principles of Information Governance&lt;/li&gt;\n&lt;li&gt;To administer drugs and checking/ preparations in accordance with Company policy and procedures and NMC guidelines.&lt;/li&gt;\n&lt;li&gt;To report and record incident and accidents in accordance with policy and procedures&lt;/li&gt;\n&lt;li&gt;To assist in the induction, development and supervision of, new and junior staff members, as required.&lt;/li&gt;\n&lt;li&gt;Liaising effectively with all actively involved in the care process, including carers and relatives, aspiring to provide an effective, seamless and integrated service to patients/residents&lt;/li&gt;\n&lt;li&gt;To protect vulnerable children from internal/external factors and act as a Patient Advocate&lt;/li&gt;\n&lt;li&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;To join The Huntercombe Group as a Bank&lt;strong&gt;Staff Nurse (RMN/RNLD)&lt;/strong&gt; you will:-&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Hold current NMC PIN registration and adhere to the NMC Codes of Conduct at all times&lt;/li&gt;\n&lt;li&gt;Have a person centred ethos, showing empathy and a desire to make a difference&lt;/li&gt;\n&lt;li&gt;Have the ability to motivate, lead and supervise a team&lt;/li&gt;\n&lt;li&gt;Be able to demonstrate initiative and creativity&lt;/li&gt;\n&lt;li&gt;Be flexible and adaptable, well organised and able to manage time and workload effectively in line with the needs of the service&lt;/li&gt;\n&lt;li&gt;Have a desire to expand your professional development and support organisational change&lt;/li&gt;\n&lt;li&gt;Have a legal right to work in the UK&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;span&gt;We welcome applications from everyone irrespective of ethnic origin, gender, age, gender identity, sexual orientation, religion, marital status, disability or social background. This is a great opportunity for someone to make a difference.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;An enhanced DBS (England) or PVG/Disclosure Scotland (Scotland) Disclosure will be required for all successful applicants. Costs will be met by the Company.&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/130001.jpg", "name": "The Huntercombe Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130001"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Adult Mental Health service / Child and Adolescent Mental Health Service (CAMHS)", "postalCode": "TF9 4LX"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9291", "longitude": "-2.35599"}}, "title": "Regional BANK Staff Nurse (RMN/RNLD)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251845", "validThrough": "2020-11-30T23:59:59+0000"}