{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 pro rata per annum"}}, "datePosted": "2020-11-04T13:30:54+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;span&gt;Closing date: 15th November 2020&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;An exciting opportunity has arisen to for a Stop Smoking Service Lead Nurse to manage Sunderland Specialist Stop Smoking Service, which is provided by Northumbria Healthcare NHS Trust. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Stop Smoking Service Lead Nurse will be a Registered General Nurse with significant post registration experience. The successful candidate will also have significant experience of smoking cessation, behaviour change, health improvement or and/or healthcare with knowledge of stop smoking practice as well as experience in public health work.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Stop Smoking Service Lead Nurse will have an integral role in the development and management of the service, providing inspiring leadership for the stop smoking service team and will make a substantial contribution to the improvement of health and wellbeing of target groups and individuals in Sunderland &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The role will include day to day management of the specialist stop smoking service, development of smoking cessation programmes, provision of a training programme for NHS providers of stop smoking support, leading the delivery of inpatient stop smoking interventions as part of Smokefree NHS work and leading on innovative ways to engage with the public and stakeholders throughout Sunderland. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Applicants will have excellent communication, organisational, planning and leadership skills to manage and lead stop smoking support across the service area in line with national and local guidance and standards. The post holder will work flexibly to the needs of the service to include out of hours working and some regional travel. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Lisa Irving - Public Health Strategy &amp; Programme Manager&lt;/p&gt;\n&lt;p&gt;lisa.irving@nhct.nhs.uk&lt;/p&gt;\n&lt;p&gt;07966490821&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Northumbria Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120801"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Sunderland Stop Smoking Service, Sunderland", "postalCode": "SR1 1HT"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.9056", "longitude": "-1.37994"}}, "title": "Stop Smoking Service Lead Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256023", "validThrough": "2020-11-15T23:59:59+0000"}