{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 - £19,337 pro rata"}}, "datePosted": "2020-10-21T12:46:53+0100", "description": "&lt;p&gt;We would love you to be part of our dynamic and innovative team.&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has risen within the Urgent Care &amp; Reablement service, for Band 2 Support Workers to join a community based multi-disciplinary team, providing enablement support and rehabilitation services for patient’s presenting with an acute deterioration in health and/or functional ability.&lt;/p&gt;\n&lt;p&gt;The aim of the service is to prevent and reduce avoidable hospital admissions and facilitate early hospital discharges by supporting patients through a re-ablement process in order to maximise independence; identifying when this is not achievable and signposting accordingly to ensure appropriate long-term support.&lt;/p&gt;\n&lt;p&gt;As a valued team member your development will be supported through a robust induction programme, a value based appraisal, one to one meetings, regular in-service training and clinical and managerial supervision. You will work out of a multi-professional base so there is opportunity for joint working [including Nurses, Care Co-ordinator, Physiotherapists and Occupational Therapists, Support Workers and other associated health care professionals] and collaborative learning across a range of Health Professionals who are supporting and delivering high standards of clinical care.&lt;/p&gt;\n&lt;p&gt;If you feel that you would like to be part of this innovative team and would like to accept the challenge of contributing to shaping the future of the service, then please consider the following post.&lt;/p&gt;\n&lt;p&gt;Experience in either community or acute setting would be an advantage.&lt;/p&gt;\n&lt;p&gt;Part time hours available:&lt;/p&gt;\n&lt;p&gt;Early: 08.00 – 14.00&lt;/p&gt;\n&lt;p&gt;Late: 16.00 – 22.00&lt;/p&gt;\n&lt;p&gt;Working up to 30 hours per week (5 days out of 7)&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Applicant must be a car driver&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Please note Trust interviews are currently taking place through Microsoft Teams, this can be downloaded either through the App Store or Google Play for use on your phone/tablet.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further information please contact Asma Bi (Team Manager) Tel: 07919691598 or Karen Goodman (Care Coordinator) Tel: 07825364071&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Coventry and Warwickshire Partnership Trust (CWPT)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121204"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Paybody Building, Coventry", "postalCode": "CV1 4FS"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4181", "longitude": "-1.49965"}}, "title": "Support Worker - Band 2", "url": "https://www.jobs.nhs.uk/xi/vacancy/916236455", "validThrough": "2020-11-06T23:59:59+0000"}