{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-10-30T12:31:27+0000", "description": "&lt;p&gt;Lancashire &amp; South Cumbria NHS FT are delighted to be hosting a virtual recruitment event for Mental Health and Learning Disability Student Nurses who are in their 1st year of Nurse Training on&lt;strong&gt;: &lt;/strong&gt;Friday 27th November 2020 via MS Teams.&lt;/p&gt;\n&lt;p&gt;The event is in relation to our Mental Health Network and is designed to give you more information about the Trust, types of services we offer, an opportunity to talk to clinicians from a range of teams, wards and services, and the offer of an interview on the day for one of our inpatient mental health areas.&lt;/p&gt;\n&lt;p&gt;Lancashire &amp; South Cumbria NHS FT covers a large geographical area and offers a diverse range of services in the Community, Inpatients, Secure Services and Inpatient and Community CAMHS.&lt;/p&gt;\n&lt;p&gt;You may also be eligible for a Relocation Package or Golden Hello incentives (subject to confirmation). Apply now for further details:&lt;/p&gt;\n&lt;p&gt;Interviews:&lt;/p&gt;\n&lt;p&gt;Following the event we can arrange for you to have an interview with us.&lt;/p&gt;\n&lt;p&gt;If successful at interview we will:&lt;/p&gt;\n&lt;p&gt;1) Provide you with a link person from the area where you have been successful in securing a post. This staff member will keep in contact with you for the rest of your nurse training.&lt;/p&gt;\n&lt;p&gt;2) We will invite you to events that are being held in the Trust&lt;/p&gt;\n&lt;p&gt;3) In your 3rd year we will invite you to attend and experience some of our preceptorship groups and also discuss which hospital you would like to work at.&lt;/p&gt;\n&lt;p&gt;4) Upon qualification and at the start of your post we will offer you a robust preceptorship period&lt;/p&gt;\n&lt;p&gt;5) We can offer you recruitment on to our Bank/Temporary Staffing, meaning that you can experience working in various areas in the Trust.&lt;/p&gt;\n&lt;p&gt;At Lancashire &amp; South Cumbria we offer a host of benefits and preceptorship support to help you in the transition from student to newly qualified Nurse.&lt;/p&gt;\n&lt;p&gt;Even if you have never had a placement with us please submit your application form or contact the Recruitment Team to book onto the event by emailing recruitment@lancashirecare.nhs.uk.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;recruitment@lancashirecare.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121124.png", "name": "Lancashire & South Cumbria NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121124"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Lancashire &amp; South Cumbria - various locations available, Lancashire &amp; South Cumbria - various locations available", "postalCode": "PR5 6AW"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7194", "longitude": "-2.63885"}}, "title": "Virtual Recruitment Day for 1st Year Student MH and LD Nurses", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250175", "validThrough": "2020-11-26T23:59:59+0000"}