{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 to £24,157 pa/pro rata"}}, "datePosted": "2020-10-30T11:01:11+0000", "description": "&lt;p&gt;We are excited to announce that we are recruiting a full time Therapy Assistant Practitioner to join our Community Integrated Response Team, part of Access and Intermediate Care Division. The post is a fixed term until 31st March 2021.&lt;/p&gt;\n&lt;p&gt;The team consists of occupational therapists, physiotherapists and technical instructors, we see adults across the Wirral who are best treated in their own homes, the work is varied and interesting and no two days are ever the same. Your role will be to provide holistic assessments to an identified group of patients and be able to follow them up to enable them to reach their rehabilitation potential.&lt;/p&gt;\n&lt;p&gt;As this is an enhanced therapy assistant role, the successful candidate will have a prior set of skills as described in the person specification with sound knowledge and experience of working with complex, frail and older people in a rehabilitation setting. You will have exceptional communication and interpersonal skills and be able to work closely and collaboratively with a wide range of people, recognising and respecting the contribution of other health and social care professionals/ workers.&lt;/p&gt;\n&lt;p&gt;Ideally, we are looking for someone who already has an Assistant Practitioner qualification (or nearing completion) but will consider applications from individuals who can demonstrate that they are practising at an enhanced level and have achieved competencies equivalent to that of an Assistant Practitioner.&lt;/p&gt;\n&lt;p&gt;You will be well supported in this new role by experienced therapists and via our robust supervision, training and appraisal structure. If you are enthusiastic about being part of a developing service, come and join us.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For more information, please do not hesitate to contact either Chris Burquest, Therapy Team Leader on 0151 514 2444 (internal 1231/1266) or mobile 07717 858041 Christopher.burquest@nhs.net; or Claire Burgess, Therapy Team Leader on 0151 514 2631 ext 1266 or email Claire.burgess@nhs.net&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/126754.png", "name": "Wirral Community Health and Care NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126754"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Pennant House, Bebington", "postalCode": "CH63 7PL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3513", "longitude": "-3.00398"}}, "title": "Therapy Assistant Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249862", "validThrough": "2020-11-13T23:59:59+0000"}