{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753-£51,668 per annum (pro rata if Part Time)"}}, "datePosted": "2020-10-13T13:26:28+0100", "description": "&lt;p&gt;Are you an enthusiastic Band 8a Advanced Nurse Practitioner looking for an exciting and rewarding role? Are you seeking job satisfaction, numerous benefits and training opportunities? Would you like your career to take a different direction into a friendly and professional organisation?&lt;/p&gt;\n&lt;p&gt;If the answer is yes, then the Band 8a Advanced Nurse Practitioner (Civilian) role within Defence Primary Healthcare (DPHC) at MOD St Athan, Barry could be the one for you.&lt;/p&gt;\n&lt;p&gt;As the post holder will be accountable for the direct delivery of autonomous advance primary healthcare nursing including elements of occupational health. You will be the lead nurse within the Medical Centre (MC) and will be the focal point for primary health care nursing issues.&lt;/p&gt;\n&lt;p&gt;You will also work within the Nursing and Midwifery Council (NMC) Code of Professional Conduct and adhere to all Nursing and Midwifery Council (NMC) standards and Ministry of Defence (MoD) /Defence Primary Health Care (DPHC) policies and guidelines.&lt;/p&gt;\n&lt;p&gt;Main duties of the role include but are not limited to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Working autonomously using advanced levels of history taking and examination skills within multi-disciplinary team, guidelines and protocols. Utilising advanced clinical skills in assessment to formulate a diagnosis and/or treatment plan.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Triaging urgent care requests if required, consulting with patients or directing them appropriately.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Critically and re-evaluating the clinical situation as the patient’s condition or needs changes.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Assisting the practice team with maintaining an effective recall system for Immunisation/Chronic Disease/Cytology.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Anticipating likely potential physical and psychological problems caused either by the condition or by treatment.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Proactively identifying, diagnosing and managing treatment plans for patients at risk of developing a long-term condition (as appropriate).&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Instigating necessary invasive and non-invasive diagnostic tests or investigations and interpreting findings/reports.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Accurately requesting radiological and pathology investigations and make clinical decisions based upon the results.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Providing specialist advice and support to patients, their families and other healthcare professionals following assessment, diagnosis and throughout treatment.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Prescribing and reviewing medication for therapeutic effectiveness, appropriate to patient needs using non-medical prescribing in accordance with evidence-based practice, DPHC protocols and current legislative frameworks within scope of practice.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Promoting health and well-being using health promotion, health education, screening and therapeutic communication skills (i.e. smoking cessation, weight management, alcohol misuse).&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Please see attached Job Description &amp; Person Specification for further information on the duties and responsibilities of the role.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;As the successful candidate you require Professional knowledge acquired through degree&lt;/p&gt;\n&lt;p&gt;supplemented by specialist training, experience, short course to Master&#39;s level equivalent in relevant clinical field. Diploma level IPC course minimum 60 credits at level 6.&lt;/p&gt;\n&lt;p&gt;There is no requirement to deploy as this is met by our uniformed personnel but you will form the continuity of care required by our patients when based at home.&lt;/p&gt;\n&lt;p&gt;Please be aware that if you are found successful you will be asked to provide evidence of your immunity to Hepatitis B.&lt;/p&gt;\n&lt;p&gt;The selection at sift stage will be based on your CV. At interview, you will be tested against the following NHS Key Skills Framework:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;NHS Health &amp; Wellbeing – HWB1 – Promotion of Health &amp; Wellbeing&lt;/li&gt;\n&lt;li&gt;NHS Health &amp; Wellbeing – HWB2 – Assessment &amp; Care Planning&lt;/li&gt;\n&lt;li&gt;NHS Health &amp; Wellbeing – HWB3 – Protect of Health &amp; Wellbeing&lt;/li&gt;\n&lt;li&gt;NHS Health &amp; Wellbeing – HWB6 – Assessment &amp; Treatment Planning&lt;/li&gt;\n&lt;li&gt;NHS Information &amp; Knowledge – NHS IK1 – Information Processing&lt;/li&gt;\n&lt;li&gt;NHS General – NHS G6 – People Management&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Please ensure you demonstrate that you have the required skills, qualifications and&lt;/strong&gt;&lt;strong&gt;memberships in your CV and that you have saved it using your surname then first name&lt;/strong&gt;&lt;strong&gt;prior to submitting your application.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Successful candidates must meet the security requirements before they can be appointed. The level of security needed is security check.&lt;/p&gt;\n&lt;p&gt;All employees joining Ministry of Defence who are new to the Civil Service will be subject to a 6-month probation period (unless otherwise advised) effective from the employment start date.&lt;/p&gt;\n&lt;p&gt;Please note the salary will be pro-rata where part time hours are undertaken.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please ensure you have read all the details in the important information link prior to &lt;/strong&gt;&lt;strong&gt;applying.&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/132174.png", "name": "Ministry of Defence (Defence Medical Services)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132174"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Station Medical Centre, RAF St Athan, Barry, CF62 4WA", "postalCode": "CF62 4WA"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4118", "longitude": "-3.41831"}}, "title": "Band 8a Advanced Nurse Practitioner (Civilian)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916224461", "validThrough": "2020-11-12T23:59:59+0000"}