{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 per annum"}}, "datePosted": "2020-10-23T14:45:56+0100", "description": "&lt;p&gt;Do you want to make a difference? Do you have proven experience of working directly with and caring for patients, ideally in a hospital setting and have completed the Care certificate or other relevant level of qualification in healthcare. Are you looking for a new and different career pathway whilst caring for patients? We have a unique opportunity for an enthusiastic Senior Clinical Trials Assistant to join our Trust Wide Research team, to start or further a career in research delivery. Clinical experience in a health care setting is essential; research experience is desirable, but not essential as full training will be given.&lt;/p&gt;\n&lt;p&gt;ABOUT THE TEAM&lt;/p&gt;\n&lt;p&gt;Working in the Trust Wide Team you will join an enthusiastic, driven and caring team, to help provide support to embed research teams across the trust for new and existing studies. Our team participates in research within many different specialities and areas across the Trust and there are opportunities to gain knowledge and experience within a speciality.&lt;/p&gt;\n&lt;p&gt;WHAT YOU’LL DO&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity to join the research team to help deliver commercial &amp; NIHR portfolio studies. We are dedicated in providing high quality, patient-centred clinical research at Southampton, delivering research across a wide portfolio of specialities. If you would like to take pride and ownership in giving patients the opportunity to take part in high quality ethical clinical research, this could be a very interesting opportunity for you. Primarily this role will be supporting the Neurodegenerative / MS research team, though the post holder may be required to work in other specialties as the research workload demands.&lt;/p&gt;\n&lt;p&gt;Although our service is run within “core” hours Monday to Friday, there is often the need to cover research studies outside of these hours, including nights and weekend work. Currently we are supporting Urgent Public Health research (COVID-19) and the post holder will be required to work on these studies, including potential “face-to-face” contact with COVID positive patients.&lt;/p&gt;\n&lt;p&gt;WHAT WE’RE LOOKING FOR&lt;/p&gt;\n&lt;p&gt;Enthusiasm, self-motivation, flexibility and drive will be required to ensure the success of this post. You will be involved in all aspects of the research process from study start-up, recruitment and delivery, to close out of a study. You will need to have an excellent level of written and verbal communication skill. IT skills would also be advantageous. You will work in collaboration with multidisciplinary teams, implementing studies to translate scientific discoveries into improved patient outcomes. No research experience is necessary as all training and development will be provided; we have an excellent induction and ongoing education programme.&lt;/p&gt;\n&lt;p&gt;WHAT WE CAN OFFER YOU&lt;/p&gt;\n&lt;p&gt;As one of the largest acute teaching Trusts in England, we can offer learning and development opportunities to help you achieve the career you aspire to. We believe you deserve the best possible surroundings in which to do your job and we want to support you in doing your job to the best of your ability.&lt;/p&gt;\n&lt;p&gt;As a Trust, we support flexible working and will consider requests taking into account the needs of the service. You’ll have an opportunity to discuss this at interview. Our LiveWell and inspire programme offers opportunities, support and advice, including smoking cessation services, exercise and activity classes, and support for mental health.&lt;/p&gt;\n&lt;p&gt;UHS employees are able to access a huge range of NHS discounts, are entitled to a minimum of 35 days paid holiday (pro rata) on appointment, can access on-site nursery facilities (subject to availability), and are offered entry to a generous pension scheme.&lt;/p&gt;\n&lt;p&gt;ABOUT OUR TRUST AND SOUTHAMPTON&lt;/p&gt;\n&lt;p&gt;UHS is rated ‘Good’ by the CQC and in the latest national NHS Staff Survey, we were in the top 10 acute trusts for staff engagement and for staff recommending the hospital as a place to work or receive care.&lt;/p&gt;\n&lt;p&gt;Southampton is an attractive place to live and work situated on the south coast, with an international airport and only an hour on the train from central London. The New Forest National Park and the beaches of the Jurassic coast are also right on our doorstep. The city offers living costs 20% lower than those in London, 13 schools rated outstanding by Ofsted and 13 nearby green spaces to enjoy.&lt;/p&gt;\n&lt;p&gt;ADDITIONAL INFORMATION&lt;/p&gt;\n&lt;p&gt;Interviews will be held on Tuesday, 17 November 2020.&lt;/p&gt;\n&lt;p&gt;FOR FURTHER INFORMATION OR TO APPLY&lt;/p&gt;\n&lt;p&gt;If you’re interested in applying for this role, we’d encourage you to get in touch using the contact information at the bottom of this advert with any questions or if you would like to arrange an informal visit. Alternatively, if you’re ready to apply, please follow the link below to complete an application.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Simon Smith&lt;/p&gt;\n&lt;p&gt;Senior Research Charge Nurse&lt;/p&gt;\n&lt;p&gt;Simon.smith@uhs.nhs.uk&lt;/p&gt;\n&lt;p&gt;023 8120 3555&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121042.gif", "name": "University Hospital Southampton NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121042"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southampton General Hospital, Southampton", "postalCode": "SO14 2AA"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8992", "longitude": "-1.40402"}}, "title": "Senior Clinical Trials Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240985", "validThrough": "2020-11-06T23:59:59+0000"}