{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum pro rata"}}, "datePosted": "2020-11-05T11:01:28+0000", "description": "&lt;p&gt;INTERNAL ONLY&lt;/p&gt;\n&lt;p&gt;We are looking to appoint a Band 6 Clinical Lead Development post within District Nursing to work across the Morecambe North Cluster as part of the Integrated Care Community (ICC&#39;s).&lt;/p&gt;\n&lt;p&gt;Posts available: 1 x 37.5 hr temporary fixed term (Maternity Cover) for 12 months.&lt;/p&gt;\n&lt;p&gt;The Post Holder will be required to work as an integral part of the Community Nursing Team; flexible working will be required to meet the needs of the patients and will hold 24 hour delegated responsibility for the team caseload. Whilst working with other health care professionals the post holder will develop the ethos of integrated care and seamless services ensuring that patient care is delivered to the highest possible standard.&lt;/p&gt;\n&lt;p&gt;You will work alongside the Team Leader and other District Nursing Sisters providing expert advice and guidance to junior team members. You will actively manage the caseload of patients and undertake complex visits, providing high quality nursing care to patients on the District Nursing caseload including Continuing Healthcare management.&lt;/p&gt;\n&lt;p&gt;The post holder&#39;s role will be developed to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Support the Team Lead in providing clinical leadership and management of the clinical caseload for the team&lt;/li&gt;\n&lt;li&gt;Be responsible for the allocation, assessment, planning, implementation and evaluation of programmes of care without direct supervision&lt;/li&gt;\n&lt;li&gt;Demonstrate procedures to and supervise unqualified staff&lt;/li&gt;\n&lt;li&gt;Maintain and ensure high standards and continuity of care on a 24 hour basis&lt;/li&gt;\n&lt;li&gt;To support the movement of patients between in-patient beds, secondary care and community teams where appropriate&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Anyone newly appointed to the trust will be subject to the completion of a satisfactory 6 month probationary period (this includes bank staff). This will give the new staff member an opportunity to become familiar with the role and working environment.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This post is only open to current employees of University Hospitals of Morecambe Bay and current employees of the Bay Health and Care Partners as below:&lt;/p&gt;\n&lt;p&gt;Morecambe Bay Clinical Commissioning Group&lt;br /&gt;GP Providers Alliance&lt;br /&gt;Lancashire County Council&lt;br /&gt;Cumbria County Council&lt;br /&gt;Lancashire Care Foundation Trust&lt;br /&gt;North West Ambulance Service&lt;br /&gt;Cumbria Partnership NHS Foundation Trust&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;If you are a current employee of any of the above organisations please mark your application as Internal&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameClaire McleanJob titleTeam LeaderEmail addressclaire.mclean@mbht.nhs.ukTelephone number01524406691/07834545736Additional contact information&lt;/p&gt;\n&lt;p&gt;District Nurse Team Leader - Claire Mclean 07834545736/01524406691&lt;/p&gt;\n&lt;p&gt;Claire.mclean@mbht.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University Hospitals of Morecambe Bay NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121712"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Queen Victoria Centre, Morecambe", "postalCode": "LA45NN"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.073", "longitude": "-2.8588"}}, "title": "District Nursing Sister Development Role - Internal Only", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257353", "validThrough": "2020-11-12T23:59:59+0000"}