{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62001", "minValue": "53168", "unitText": "YEAR", "value": "£53,168 - £62,001 per annum"}}, "datePosted": "2020-10-30T10:30:58+0000", "description": "&lt;p&gt;Have you got the energy and passion to help us shape the future of Nottingham University Hospitals NHS Trust? We have an exciting opportunity for a proactive Strategic Relationship and Business Development Manager to join our dynamic corporate team.&lt;/p&gt;\n&lt;p&gt;We are looking for a flexible, dynamic team player who will employ highly effective communication (written and oral), negotiation and influencing skills to build networks and relationships.&lt;/p&gt;\n&lt;p&gt;The post-holder will report to the Deputy Director of Strategy on cross-cutting strategic priorities, development of business cases and offer programme management expertise.&lt;/p&gt;\n&lt;p&gt;They will support the delivery of partnership priorities emerging from NUH’s long-term strategy and ensure that suitable arrangements are in place to across NUHs Clinical Divisions and Corporate Directorates to support effective oversight and management of the operational, contractual and strategic elements of NUHs key partnerships.&lt;/p&gt;\n&lt;p&gt;They will co-ordinate programmes for the Director of Strategy &amp; Transformation, Medical Director and Director of Integration. They will work collaboratively with lead clinicians across different specialities, operational and service improvement managers, research and innovation leads and commissioners, alongside liaising with clinical networks and senates.&lt;/p&gt;\n&lt;p&gt;We are looking for a candidate that can build upon existing partnerships with other organisations or create new ones in order that the Trust optimises the delivery of its strategic priorities and objectives.&lt;/p&gt;\n&lt;p&gt;This post holder will play a key role in working with partners to build a culture which encourages positive behavioural change and drives the introduction of innovative approaches to patient care which improve quality, safety, outcomes and experience.&lt;/p&gt;\n&lt;p&gt;As the successful candidate you will have experience of leading multi-agency meetings and events and excellent communication, stakeholder management skills and experience. You will provide and receive potentially complex and sensitive information, including presenting strategic, management and contract information about partnerships and dependencies clearly and coherently to a wide range of internal and external stakeholders in formal settings.&lt;/p&gt;\n&lt;p&gt;The post holder will be based at City Campus, although cross-site working will be required as well as home based working as we respond to Covid-19.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Niamh Brooks, Strategy Administrator on Niamh.Brooks@nuh.nhs.uk&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122234.jpg", "name": "Nottingham University Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122234"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "City Campus, Nottingham", "postalCode": "NG5 1PB"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9893", "longitude": "-1.16006"}}, "title": "Strategic Relationship and Business Development Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249740", "validThrough": "2020-11-30T23:59:59+0000"}