{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 pa pro rata"}}, "datePosted": "2020-10-27T11:45:21+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;span&gt;Worcestershire Special School Nursing Team – Based at Princess of Wales Community Hospital&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt; &lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;SCHOOL NURSE – SPECIAL SCHOOLS&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;BAND 5&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;24 HOURS PER WEEK – TERM TIME ONLY&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt; &lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Special school nursing team currently has a vacancy for a Band 5 Registered nurse to join our forward thinking and supportive team.  The service is provided across the whole county, and as a team we assist in supporting the Healthcare needs of children and young people attending one of the 7 Special schools in Worcestershire. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The post holder will either be qualified as Registered Children’s nurse, Registered Nurse or LD Nurse. It is essential that the successful candidate has recent clinical experience and skills with caring for children/young people with complex health needs.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are a Locality based service split into two Localities one in the North and one in the South.  The North Locality comprises 4 schools; Chadsgrove and Rigby Hall in Bromsgrove, Pitcheroak in Redditch and Wyre Forest in Kidderminster. The Locality is supported by a Band 6 Senior Special School nurse and the Team Lead oversees and supports the whole team.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The successful candidate for this post will be based pre-dominantly in the North of the Locality and linked to a school in the North. However there may be a requirement to provide cover in the South of the county should the need arise.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are striving to deliver the best care in our schools and as a team constantly review our practices and the way we deliver them, so we are a forward-thinking team and we are looking for someone with these qualities. This may mean supporting your colleagues at other schools in the County at times. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The successful candidate for this role will require excellent communication skills and be able to prioritise and plan their workload effectively which is varied and very busy at times. They must be able to plan and evaluate care needs, have excellent clinical skills and assessment skills, deliver teaching sessions in school and assess staff for competencies to undertake health interventions.  The successful applicant must also have a good understanding of IT as different systems are used e.g. ESR, Care notes, Spreadsheets but this list of requirements is not exclusive.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The post holder will be required to work independently but support is available through the wider team.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt; &lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Worcestershire Health and Care Trust take pride in the Health and care of Children, Young People and Families, aspiring to deliver outstanding care.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;It is essential applicants can meet the travel requirements of the post.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;If you think you may be interested or require further information, please contact Catherine Randle, Team Leader, Special School Nursing on 01527 488446 or 07701 294218.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;span&gt;All staff whatever their role, level or responsibility will be encouraged and supported to do their job well and to improve their job.&lt;/span&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;span&gt;Making Every Day Better for patients, staff, service users and carers is the responsibility of all of us and we want to embed a culture within the organisation that encourages and supports the drive to improve what we do.&lt;/span&gt;&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120795.jpg", "name": "Worcestershire Health and Care NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120795"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bromsgrove", "postalCode": "B61"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.3479", "longitude": "-2.08809"}}, "title": "Special School Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244271", "validThrough": "2020-11-11T23:59:59+0000"}