{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "25365", "minValue": "22987", "unitText": "YEAR", "value": "£22,987 - £25,365 per annum inclusive of HCAS"}}, "datePosted": "2020-10-28T10:16:26+0000", "description": "&lt;p&gt;&lt;span&gt;We have an exciting opportunity to join our established Macmillan Cancer Navigator team to provide a single point of contact for cancer patients, their carers and families in Frimley Health. The post holder will provide telephone support to cancer patients with guidance from Cancer Clinical Nurse Specialists (CNS) in order to help patients with cancer, navigate their way through their care. This role will require cross-site working with both established Navigator teams at both Frimley Park and Wexham Park Hospitals. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The role requires support with planning and administration for health and well-being events and other supported self-management events for cancer patients. You will also be required to carry out administrative duties to support the CNS teams as part of the implementation of Personalised Care, supporting Holistic Needs Assessment and Treatment Summary information management. The aims are to reduce non clinical phone calls to CNSs to enable them to provide more face to face and clinical support of cancer patients. The post holder would also be providing advice, information and referrals for cancer patients for benefit advice, psychological support and other non-clinical services. The post holder would be ensuring patients get the right support at the right time, to meet their needs, and requires a level of judgment in responding to the needs of individuals. This role demands a good level of communication and judgement to identify the complexity of patients&#39; needs, in order to provide appropriate advice and escalate to relevant cancer CNS as needed. You would be required to be IT competent to support and contribute to audit processes, governance and service development. There would be training given on relevant hospital IT systems and training on cancer, its diagnosis, treatment and management through in-house and online Macmillan training.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;There’s never been a more exciting time to build your career at Frimley Health, one of the country’s largest and most respected hospital trusts - &lt;/span&gt;&lt;/strong&gt;&lt;span&gt;We have three main hospitals: Frimley Park in Frimley near Camberley, Heatherwood in Ascot and Wexham Park near Slough. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;As well as delivering excellent general hospital services to local people, we provide specialist heart attack, vascular, stroke, spinal, cystic fibrosis and plastic surgery services across a much wider area. We also run outpatient clinics and diagnostic services from Aldershot, Farnham, Fleet, Windsor, Maidenhead, Bracknell and Chalfont St Peter.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Recently we have invested £150m in new facilities to create the best environments for our patients and staff. Our projects include new state-of-the-art Emergency Assessment Centre at Wexham Park and a newly planned care hospital in Ascot.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Our three core values, and the behaviours that support them, guide everything we do and set out what we expect of our staff in the way they treat patients, visitors, service users and each other. So whether you use our services or are just visiting you can expect us to be Committed to Excellence, Working Together and Facing the Future.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;If you have a passion for clinical excellence, patient care and your own career development, you’ll feel at home at Frimley Health. Whether you want to broaden your expertise, strengthen your skills or make the move into management. It’s one of the reasons our staff consistently rate us among the best places to work in the NHS.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Caroline Holmes - Macmillan Cancer Information &amp; Support Officer&lt;/p&gt;\n&lt;p&gt;Email address: caroline.holmes11@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number: 0300 615 4886&lt;/p&gt;\n&lt;p&gt;Or Lara Roskelly - &lt;span&gt;Macmillan Acute Oncology Clinical Nurse Specialist Team Leader 0300 613 4752 Frimley Park / 0300 615 3445 Wexham Park (&lt;span&gt;&lt;span&gt;lara.roskelly@nhs.net)&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121099.png", "name": "Frimley Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121099"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Frimley Park Hospital, Frimley", "postalCode": "GU16 7UJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3197", "longitude": "-.741538"}}, "title": "Macmillan Cancer Navigator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246011", "validThrough": "2020-11-11T23:59:59+0000"}