{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 per annum"}}, "datePosted": "2020-11-04T12:01:41+0000", "description": "&lt;p&gt;South Warwickshire Foundation Trust is committed to bringing care closer to home. This vacancy has arisen for an enthusiastic and proactive Band 4 Therapy Assistant to work with our Physiotherapists and Occupational therapists who are part of the North HomeFirst Community Emergency Response Team&lt;/p&gt;\n&lt;p&gt;The Therapy aspect of the service operates seven days a week from 08:00 hours until 18:00 and flexible working is required. The ability to travel independently across North Warwickshire is essential so a car driver is vital.&lt;/p&gt;\n&lt;p&gt;The successful candidate will work with clients in their own homes to deliver an integrated patient pathway across community services. You should have relevant therapy experience and demonstrate a willingness to complete specific therapy competencies and further learning as required. You will have experience in delivering therapeutic programmes of care in a patient’s home, including, but not exclusively: exercise programmes, provision of equipment and enabling activities of personal and domestic daily living tasks. Knowledge of community services and an understanding of community urgent response pathways would be advantageous.&lt;/p&gt;\n&lt;p&gt;You will need to meet the Person Specification and be confident that you are able to deliver the requirements of the post.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;South Warwickshire NHS Foundation Trust promotes flexible working options on all appropriate positions and our managers welcome these discussions during the recruitment process.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameTracy BirkettJob titleTherapy team lead for North Home First therapy servicesEmail addresstracy.birkett@swft.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "South Warwickshire NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120990"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Kings House, Bedworth", "postalCode": "CV12 8LL"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4797", "longitude": "-1.47078"}}, "title": "Therapy Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255728", "validThrough": "2020-11-16T23:59:59+0000"}