{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Depending on experience"}}, "datePosted": "2020-11-06T14:57:55+0000", "description": "&lt;p&gt;&lt;strong&gt;Locality Lead Immunisation Nurse&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hull and East Riding&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Full time / Part time, Permanent&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;IntraHealth is one of the UK’s leading provider of NHS Primary and Community Care services. We serve a range of patients across our three divisions of Primary Care (general practice), Pharmacy and Clinical Services which includes anticoagulation monitoring, patient medication reviews and childhood immunisation programmes.&lt;/p&gt;\n&lt;p&gt;We also provide management and clinical support to other GP practices and NHS bodies. We are a well-established organisation having provided NHS services for 19 years. Our team is made up of GPs, Advanced Nurse Practitioners (ANPs), nurses, pharmacists, Health Care Assistants (HCAs) and local administration teams supported by a centralised back office function; providing finance, HR, administration and data analysis support.&lt;/p&gt;\n&lt;p&gt;We operate NHS services across the North East, North West and Yorkshire.&lt;/p&gt;\n&lt;p&gt;IntraHealth Ltd delivers immunisation and vaccination services for NHS England across several areas in the UK. Our immunisation and vaccination service has been running for 8 years and forms part of our established clinical services in the North of England.&lt;/p&gt;\n&lt;p&gt;IntraHealth are recruiting a Locality Lead Immunisation Nurse to join our Immunisation &amp; Vaccination Team in the handling of information surrounding the immunisation and vaccinations across Hull and East Riding.&lt;/p&gt;\n&lt;p&gt;The applicant will work within ateam and support the delivery of IntraHealth’s expanding immunisation and vaccination programmes. Successful candidates will work autonomously, but also as part of the wider team delivering immunisations and vaccinations to primary and secondary school children.&lt;/p&gt;\n&lt;p&gt;The successful applicant for this post will be joining us at a particularly exciting time as we develop and expand our service.&lt;/p&gt;\n&lt;p&gt;Closing date for receipt of applications: Sunday 22nd November 2020&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central Advertising - Other", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130656"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hull and East Riding", "postalCode": "HU7 4WD"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.793", "longitude": "-.321099"}}, "title": "Locality Lead Immunisation Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916260231", "validThrough": "2020-11-22T23:59:59+0000"}