{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "26520", "minValue": "26520", "unitText": "YEAR", "value": "Up to £26,520 per annum (DOE)"}}, "datePosted": "2020-10-19T11:03:41+0100", "description": "&lt;h2&gt;&lt;strong&gt;Make a difference from day one!&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;br /&gt;Prisons are one of the most challenging, yet rewarding places for healthcare professionals to work. If you are a qualified Pharmacy Technician, or soon to qualify, and want a role where you can develop your existing skills and learn something new every day in an environment that never stands still, then this is it!&lt;/p&gt;\n&lt;p&gt;Practice Plus Group are Health in Justice Market leader, providing healthcare services to offenders across the country. Our model of care is our Wellbeing Approach – an integrated, comprehensive approach in recognition of the fact prisoners are a socially-excluded group with healthcare needs which are complex and often associated with poor outcomes. It adopts the premise no single health/wellbeing factor can be taken in isolation of other motivational issues which might impact a person’s care.&lt;/p&gt;\n&lt;p&gt;Our core values are; everyone makes a difference, patients are at the heart of everything we do and together we make things better. If you share these values and have transferable skill, we want to meet you!&lt;br /&gt;&lt;br /&gt;HMP Oakwood is the largest prison in Europe, holding 2106 Category C male offenders. HMP Oakwood’s large modern healthcare facilities enable us to deliver “Exceptional Care” to our patient group. We provide a range of both physical and psychosocial health care service, including long term conditions, primary care, wound care, sexual health, mental health services, substance misuse, social care and pharmacy.&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;h2&gt;&lt;br /&gt; &lt;strong&gt;A bit about the job...&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;br /&gt;You will work closely with the existing primary care team, pharmacy team and on site pharmacist in the delivery of a high quality pharmacy service to the prison population.&lt;br /&gt;&lt;br /&gt;You can expect to provide medicines management services to assist and support the primary care team to deliver effective clinical intervention and provide pharmacy related information to patients, prison officers and other healthcare professionals ensuring that the level of advice given is appropriate. The role requires the ability to administer medication and manage processes whereby patients are supported to manage their own in-possession medications effectively.&lt;br /&gt;&lt;br /&gt;The Pharmacy Technician will also assist with the implementation and development of pharmacy support to all wings in the prison which includes, where appropriate, counselling of patients on the correct use of medication.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h2&gt; &lt;/h2&gt;\n&lt;h2&gt;&lt;strong&gt;What do we need from you so you can do the job?&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;br /&gt;You will hold NVQ Level 3, BTEC or equivalent qualifications and have current registration with the General Pharmaceutical Council (GPhC) to be considered for this role. You will also have relevant post-qualification experience working within a pharmacy environment and multi-disciplinary team.&lt;/p&gt;\n&lt;p&gt;You’ll be able to demonstrate assessment skills, including undertaking of risk assessments and have sound patient counselling skills, treating patients with respect and dignity at all times, adopting a culturally sensitive approach.&lt;/p&gt;\n&lt;p&gt;As a Pharmacy Technician, you may be required to take on a role of working across multiple Pharmacy Services if and when required.&lt;/p&gt;\n&lt;p&gt;If you are self-motivated and able to work autonomously as well as showing plenty of initiative when it comes to handling a wide range of situations, then this could be the right role for you!&lt;/p&gt;\n&lt;h2&gt;&lt;br /&gt;&lt;br /&gt; &lt;strong&gt;In return for your hard work you will...&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;br /&gt;Receive an annual salary of up to £26,520 per annum depending on experience; free uniform, free mandatory training, indemnity cover, CPD and re-validation support.&lt;br /&gt;&lt;br /&gt;The post will involve shift work over a 7-day period to include weekends and Bank holidays.&lt;br /&gt;&lt;br /&gt;We offer 25-days annual leave plus 8 public holidays (pro-rata for part time) and contributory pension scheme.&lt;br /&gt;&lt;br /&gt;We also offer CPD, revalidation support, free online and face to face training, regional/national opportunities, cycle to work scheme and online discounts.&lt;br /&gt;&lt;br /&gt;Onsite benefits at HMP Oakwood include access to an onsite gym, free parking and subsidised café/restaurant.&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;How will we support you in your employment?&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;• Bespoke induction&lt;br /&gt;• Competency framework&lt;br /&gt;• Regular clinical supervision&lt;br /&gt;• Supported development into specialities such as diabetes or asthma&lt;br /&gt;• Regional and national career development opportunities&lt;br /&gt;• Our bespoke Learning Management System to address your learning needs&lt;br /&gt;• Support from the wider team&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;h2&gt;&lt;br /&gt; &lt;strong&gt;Next steps&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;br /&gt;If you are shortlisted, you will be contacted by our Internal Recruiter for this role. They will submit your CV to the hiring manager and in turn will arrange an interview for you to attend at HMP Oakwood if the hiring manager feels that you are suitable for the job.&lt;/p&gt;\n&lt;h2&gt;&lt;br /&gt;&lt;br /&gt; &lt;strong&gt;More information&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Please note that this role is subject to Practice Plus Group Terms &amp; Conditions and offers of employment are subject to satisfactory receipt of references, enhanced DBS check and prison vetting.&lt;br /&gt;&lt;br /&gt;At Practice Plus Group we actively promote diversity and equal opportunities. Full time and part time opportunities will be considered for all of the above posts.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Note that shifts patterns for all of the posts, with the exception of the GP post will involve shift work, working over- 7-day rota which will include weekends and Bank holidays.&lt;br /&gt;&lt;br /&gt;We also offer the opportunity for informal visits and shadow shifts on site to experience the environment prior to any offers of employment post interview.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Practice Plus Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130136"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wolerhampton", "postalCode": "WV10 7QD"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6429", "longitude": "-2.08824"}}, "title": "Pharmacy Technician - HMP Oakwood", "url": "https://www.jobs.nhs.uk/xi/vacancy/916231952", "validThrough": "2020-11-09T23:59:59+0000"}