{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 per annum pro rata"}}, "datePosted": "2020-10-14T11:46:53+0100", "description": "&lt;h2&gt;&lt;span&gt;The role&lt;/span&gt;&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;&lt;strong&gt;Are you someone looking to start a career in one of the UK’s most respected mental health trusts?&lt;/strong&gt;&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;&lt;strong&gt;Would you like to be part of a dedicated team committed to those with mental health problems enjoy a better future?&lt;/strong&gt;&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;&lt;strong&gt;Would you like to do a job that makes a difference every day?&lt;/strong&gt;&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt; We are looking for an exceptional individual to come and join our vibrant, fast paced team. If you have experience of administration and working on a reception and like varied day to day to work in a challenging environment, this could be the place for you. This will be a challenging and developing role that is varied and interesting and will need you to bring energy, flexibility and commitment.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Devon Partnership NHS Trust can provide you with a dynamic, people-centred environment, where you will be empowered to support patients with complex conditions, adopting a personalised approach to patient care that maximises independence, choice and control, following our philosophy of enabling people to reach and maintain their optimum level of health and wellbeing.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Devon Partnership NHS Trust is growing as we establish ourselves us as one of the leading providers of mental health services in the country.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Working as part of Devon Partnership NHS Trust, you will make a difference to people’s lives from the moment you start.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;£19,737 - £21,142 per annum pro rata (Band 3)&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Working hours will be 08:30 - 16:30 Monday, Tuesday and Friday&lt;/span&gt;&lt;/p&gt;\n&lt;h2&gt;&lt;span&gt;About you &lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;span&gt;We are seeking an enthusiastic and experienced Receptionist to join our friendly team in Exeter Health and Wellbeing Clinic Hub who enjoys working as part of a team and can demonstrate a commitment to delivering a high quality administration support in an efficient and timely manner.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are seeking candidates who are able to demonstrate the following:&lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;span&gt;Efficient manner&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Friendly, approachable and able to build positive relationships&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Strong organisation, interpersonal and communication skills&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Strong initiative and adaptability&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Able to cope with unexpected changes in routine&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Motivated with good attention to detail&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Able to work independently and as part of a team&lt;/span&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;span&gt;The applicant must be experienced and competent in IT and be aware of the need of patient confidentiality. Knowledge of medical terminology an advantage.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Working in a passionate team, you will have access to our Trust-wide Learning and Development programme and be supported in your career and personal growth, with opportunities to help you build your Continuing Professional Development portfolio, enabling you to extend your skills and ensure that you excel.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This is a great opportunity for an ambitious and confident individual looking to join a professional, interesting, busy team within Mental Health services.&lt;/span&gt;&lt;/p&gt;\n&lt;h2&gt;&lt;span&gt;The location&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;Your base will be at Wonford House in Exeter, however under the current COVID-19 conditions this may be subject to alternative arrangements/change for example home working. Please be assured that any alternatives will be discussed fully with you and the organisation. Please ask the appointing manager if you have any questions.&lt;/p&gt;\n&lt;h2&gt;&lt;span&gt;About us&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;span&gt;We are a friendly team, the office is busy, and the work is interesting and varied.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Here at Devon Partnership we are passionate and proud of the work we do and the impact we make. We can offer you a great place to work with good benefits, flexible working and a supportive, friendly and inclusive environment.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Join us at Devon Partnership NHS Trust and you’ll be joining an award-winning organisation that is passionate about mental health and learning disability. One that cares about the people it supports – and one that also cares about its staff.&lt;/span&gt;&lt;/p&gt;\n&lt;h2&gt;&lt;span&gt;Our offer to you&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;span&gt;We recognise our people want to learn and develop, becoming the best that they can be. We offer all our staff a range of training opportunities including a variety of in-house training programmes designed and delivered by experts, and opportunities to access external training where appropriate. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;In addition to ongoing training and development opportunities, we are committed to providing an environment in which you can thrive. &lt;br /&gt; &lt;br /&gt; Benefits of working at Devon Partnership NHS Trust include:&lt;br /&gt; &lt;br /&gt; &lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Commitment to flexible working where this is possible&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;27 days of annual leave per year plus bank holidays, increasing to 29 days after 5 years and 33 days after 10 years’ service with the NHS so you can really enjoy what Devon has to offer&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Individual personal development plans and a commitment to ongoing training&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Generous NHS pension scheme&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Good maternity, paternity and adoption benefits&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Childcare voucher scheme&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Health service discounts and online benefits&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Incremental pay progression&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Free confidential employee assistance programme 24/7&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Access to our LGBTI+ network&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Health and wellbeing opportunities&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Cycle to Work Scheme and reduced public transport rates&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Structured learning and development opportunities.&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;&lt;span&gt;Living here&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;Devon offers beautiful coastal and countryside locations with a wide range of social &amp; leisure opportunities. This ranges from some of the best beaches in the Country, The Moors, Canals and rivers all of which can be accessed easily via foot, car, bike or boat.&lt;/p&gt;\n&lt;p&gt;Great place to work. Great place to live&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120813.png", "name": "Devon Partnership NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120813"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wonford House Exeter", "postalCode": "EX2 5AF"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7154", "longitude": "-3.50631"}}, "title": "Receptionist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916226068", "validThrough": "2020-11-06T23:59:59+0000"}