{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44780", "minValue": "37638", "unitText": "YEAR", "value": "£37,638 - £44,780 per annum pro rata inclusive"}}, "datePosted": "2020-11-03T14:01:22+0000", "description": "&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Senior Staff Nurse (Kangaroo Ward)&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;1 YEAR FIXED TERM&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Maternity Cover&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We have an exciting opportunity for a Band 6 Senior Staff Nurse to join the Kangaroo team and take responsibility for clinical leadership to a designated nursing team and ensure the provision of high quality nursing care to complex, long term ventilated children and families. You will also be involved in the discharge process for these children and families.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Kangaroo Ward&lt;/strong&gt; is a 9 bedded ward caring for children requiring long-term ventilation via a tracheostomy, those requiring non-invasive ventilation and complex care needs transitioning from hospital to home. There is a dedicated sleep study bed and we also care for children chronic respiratory conditions, including a variety of congenital anomalies, cystic fibrosis and nasopharyngeal airway (NPA). Our aim is to help patients achieve their full potential medically, developmentally and emotionally. The nursing team on Kangaroo provides varied input of nursing care from both low to high dependency, training and supporting families and community carers/nurses to prepare patients for discharge.&lt;/p&gt;\n&lt;p&gt;To be considered for this role you must be a registered nurse with excellent paediatric clinical skills with relevant background in respiratory care. It is essential to have demonstrable experience of taking charge of a clinical unit and show qualities of a team leader and role model.&lt;/p&gt;\n&lt;p&gt;This is a challenging role that is extremely rewarding. We are looking for an individual who is ready for the next move in their career and demonstrates a desire to deliver a positive patient experience, actively involved in discharge and supportive of the future developments of the service and promotes the effective flow of patients through the department.&lt;/p&gt;\n&lt;p&gt;The successful applicant will have support and opportunity to work closely with a team of Ward Managers, Long- term Ventilation, Non –invasive Ventilation Clinical Nurse Specialists and Matron who lead and manage other Cardiorespiratory Wards within Critical Care and Cardiorespiratory Unit.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Jodian Pringle&lt;/p&gt;\n&lt;p&gt;Ward Sister for Kangaroo&lt;/p&gt;\n&lt;p&gt;Knolerhia.Pringle@gosh.nhs.uk&lt;/p&gt;\n&lt;p&gt;0207 829 5164 &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121180.png", "name": "Great Ormond Street Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121180"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Great Ormond Street Hospital, London", "postalCode": "WC1N 3JH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5222", "longitude": "-.119898"}}, "title": "Senior Staff Nurse (Kangaroo Ward)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254240", "validThrough": "2020-11-17T23:59:59+0000"}