{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51068", "minValue": "32478", "unitText": "YEAR", "value": "£32,478 - £51,068 pa plus London weighting"}}, "datePosted": "2020-10-26T13:31:45+0000", "description": "&lt;p&gt;&lt;span&gt;&lt;strong&gt; The National Hospital for Neurology and Neurosurgery&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Clinical Fellows in Neuroanaesthesia&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Applications are invited for the posts of Clinical Fellow in Neuroanaesthesia at Queen Square. &lt;span&gt;These posts are available from November 2020 throughout the following year&lt;/span&gt;. The posts would be ideally suited to a senior SpR with an interest in neuroanaesthesia. The fellowships are for a minimum period of 6 months, renewable to one year depending on satisfactory performance and individual training needs. The Clinical Fellow Post in Neuroanaesthesia will involve training in all aspects of anaesthesia for neurosurgery, neuroradiology and neuro-critical care and is a recognised programme for the International Council on Perioperative Neuroscience Training programme (ICPNT) There will also be opportunities to develop specialist skills needed within neuroanaesthesia which can be tailored to individual needs. The applicant will also be expected to be involved in quality improvement projects. The National Hospital for Neurology and Neurosurgery provides neurological and neurosurgical services on a local, regional, national and international basis. The Hospital has two Intensive Care Units and a High Dependency Unit providing one of the largest dedicated neurological critical care facilities in the UK. Clinical Fellows in a year’s fellowship are encouraged to spend 3 months in the Neurocritical Care Unit by mutual agreement&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The department is a recognised sponsor for the General Medical Council and also supports the MTI training scheme with the Royal College of Anaesthetists. We also offer fellows who spend a year with us International Council on Perioperative Neuroscience Training (ICPNT) accreditation.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Dr Val Luoma or Dr Rob John, College Tutors or Dr Sally Wilson, Deputy Clinical Director on 020 344 84711.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University College London Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120731"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "University College London Hospitals NHS Foundation Trust (UCLH), London", "postalCode": "NW1 2PG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5257", "longitude": "-.13737"}}, "title": "Clinical Fellow within  Neuroanaesthesia", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242670", "validThrough": "2020-11-09T23:59:59+0000"}