{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "32146", "minValue": "26152", "unitText": "YEAR", "value": "£26,152 - £32,146 pa inc HCA"}}, "datePosted": "2020-11-06T13:17:24+0000", "description": "&lt;p&gt;We have an exciting opportunity for Rotational Band 5 Dietitian within our team of 17 Dietitians at Watford General Hospital. West Hertfordshire NHS Trust is a busy acute district general hospital with most of the main caseload now centralized at the Watford Hospital site. This would be an excellent role for a newly qualified Dietitian wishing to increase their knowledge, skills and experience in a stimulating and supportive environment. You will cover a variety of clinical areas including Care of the Elderly, Diabetes, Surgery, General Medicine, AAU, Stroke and Gastroenterology.&lt;/p&gt;\n&lt;p&gt;Each rotation is supported by a robust senior tier with a wealth of experience to help guide and support in both your individual learning needs but to also strive to ensure that the best standards of care are provided. A well established supervision, probationary, and appraisal process is in place to help facilitate this. We also offer In-Service training opportunities. There are also opportunities for course funding both externally and through the department’s links with the University of Hertfordshire.&lt;/p&gt;\n&lt;p&gt;The department is involved in training student dietitians from the University of Hertfordshire and other healthcare professionals.&lt;/p&gt;\n&lt;p&gt;We offer our staff a wide range of benefits including family friendly policies, occupational health services, excellent pension scheme and NHS shopping discount.&lt;/p&gt;\n&lt;p&gt;Watford Hospital is within easy walking distance of the Metropolitan line (underground) and London Midland overland Train at Watford Junction Station, which is a 20 minute journey away from London Euston. Car drivers also have easy access via the M1, M25, M40, A1 and A41.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Meghna Mapara, Therapy Team Lead Dietetics and SLT on 01923 217200&lt;/p&gt;\n&lt;p&gt;Email: meghna.mapara@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "West Hertfordshire Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120820"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Watford General Hospital, Watford", "postalCode": "WD18 0HB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6491", "longitude": "-.404449"}}, "title": "Band 5 - Rotational Dietitian, Dietetics", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259888", "validThrough": "2020-11-23T23:59:59+0000"}