{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 p.a exc"}}, "datePosted": "2020-10-26T21:15:22+0000", "description": "&lt;p&gt;&lt;strong&gt;Consultant in Respiratory Medicine, Epsom &amp; St. Helier University Hospitals NHS Trust, London &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Consultant in Respiratory Medicine, Epsom &amp; St. Helier University Hospitals NHS Trust, London&lt;/p&gt;\n&lt;p&gt;Our Respiratory Department is looking to recruit a full-time substantive Consultant in Respiratory and General Medicine, to join three existing Consultants. Each of the colleagues has a strong general/specialist respiratory background and we are delighted to offer this replacement post to support the service based at St. Helier Hospital, Sutton, London (part of Epsom &amp; St. Helier University Hospitals NHS Trust).&lt;/p&gt;\n&lt;p&gt;Applicants with sub-speciality clinical interest (EBUS /ILD or other) are welcomed and will be supported by the Department.&lt;/p&gt;\n&lt;p&gt;As a Department we are one of the biggest units in Southwest London, spread across two hospital sites (St Helier Hospital and Epsom Hospital). We have 8 substantive Respiratory Colleagues, covering a large catchment area of Southwest London and Surrey. The successful candidate will join a team of 7 substantive Consultant colleagues, at St Helier Hospital (3 colleagues: Drs Varney/Medveczky/Getsova and this post) and Epsom Hospital (4 colleagues: Drs Ratoff/Rahman/Wells/Molanguri). There are close ties between the two sites, including MDT, departmental meetings, audit and shared pathways with specialist clinics at Epsom (e.g. Pleural Clinic with indwelling catheter insertion service).&lt;/p&gt;\n&lt;p&gt;At St Helier Hospital we provide Respiratory input in general and sub-speciality clinics (Asthma/COPD/ Allergy-Immunology/ Cancer and Tb), share a weekly bronchoscopy rota and contribute towards the General (Internal) Medicine on-call, non-resident with 1:16 rota.&lt;/p&gt;\n&lt;p&gt;The Consultants at St Helier site have further support from an Associate Specialist, two Specialist Registrars, junior doctors and a team of experienced Specialist Respiratory Nurses/Tb and Lung Cancer nurses.&lt;/p&gt;\n&lt;p&gt;The post is a 10 PA post. There is an opportunity to increase the PAs in discussion with the Clinical Lead.&lt;/p&gt;\n&lt;p&gt;The successful candidate will provide specialist clinical advice in Respiratory Medicine both on inpatients and outpatients management. He/ She will support the Department with maintaining the Respiratory service provision in Outpatients’ clinics (General Respiratory and Lung Cancer pathways), offer Consultant led referral / in reaching sessions to Acute Medicine/ ITU and contribute to further service expansion and development.&lt;/p&gt;\n&lt;p&gt;All Respiratory Consultants contribute to the General Medical on-call, on a 1:16 rota, with weekday ward rounds performed by the Acute Physicians. Due to the nature of medical - on calls a dual CCT accreditation with the GMC in Respiratory Medicine and General (Internal Medicine) is essential.&lt;/p&gt;\n&lt;p&gt;Epsom &amp; St. Helier University Hospitals NHS Trust is a University teaching hospital with strong links to the neighbouring St George’s Medical School, University London. There are many opportunities to get involved in undergraduate and postgraduate teaching and training, and the Respiratory Department plays an integral role in this commitment.&lt;/p&gt;\n&lt;p&gt;We are proud to have excellent links to our neighbouring Trusts (Royal Marsden/ St. George’s Hospital University of London) for provision of Oncology, Thoracic Surgery and EBUS. We have an established and thriving Lung Cancer service supported by both hospital sites, with direct input from our Royal Marsden Colleagues in Oncology and Thoracic Surgeon from St George’s Hospital.&lt;/p&gt;\n&lt;p&gt;St Helier Hospital is also the site of two regional tertiary centres – our Renal Unit and Allergy/Immunology Centre, covering South West London and Sussex/Surrey. This creates a unique environment enabling exciting referrals, optional clinics and opportunities for research.&lt;/p&gt;\n&lt;p&gt;This post would suit both – a visionary, motivated Consultant as well as an already established Physician. Please refer to the detailed proposed job description for more information about the Department and the post.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We request that successful applicants&lt;/strong&gt; &lt;strong&gt;must have relevant UK and NHS experience in Respiratory Medicine with full registration with the GMC and already have CCT, or be within 6 months of obtaining both a CCT in Respiratory and General Internal Medicine&lt;/strong&gt;.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;No agencies&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;AAC Interview date – 20th November 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDr Shakil RahmanJob titleClinical Lead for Respiratory MedicineEmail addressshakil.rahman1@nhs.netAdditional contact information&lt;/p&gt;\n&lt;p&gt;For informal discussions or expressions of interest please contact:&lt;/p&gt;\n&lt;p&gt;Dr Shakil Rahman, Clinical Lead for Respiratory Medicine, Tel No. 01372 735 293/Mob. 07899914385/ email: shakil.rahman1@nhs.net&lt;/p&gt;\n&lt;p&gt;Candidates are encouraged to attend an informal visit prior to interview.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121992.jpg", "name": "Epsom and St Helier University Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121992"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St. Helier, London", "postalCode": "SM5 1AA"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3801", "longitude": "-.183166"}}, "title": "Consultant Physician in Respiratory Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243644", "validThrough": "2020-11-09T23:59:59+0000"}