{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "35207", "minValue": "28691", "unitText": "YEAR", "value": "£28,691 - £35,207 PA inc. HCAS"}}, "datePosted": "2020-10-27T09:01:32+0000", "description": "&lt;p&gt;Are you a nurse looking for a supportive team and the opportunity to develop new skills?&lt;/p&gt;\n&lt;p&gt;This is an exciting time to join the community nursing service in Merton. We are developing new community pathways which will support the delivery of more care in people’s homes, and to enable us to do this we have a range of new learning and development opportunities available through the CLCH Academy.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;But don’t just take our word for it, listen to what our staff have to say about their jobs:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Lisa has worked as a nurse in the community since qualifying in 2006. She is now a Band 8A Clinical Operations Manager. She says:&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;I knew I wanted to work in the community when I first qualified as I am passionate about providing excellent care to people in their own home environment. I like to be able to holistically assess a patient and engage them with other services that they require, to ensure they are able to remain in their own home for as long as they wish and live independently.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Community nursing is such a varied job and I found I developed so many more skills than I would if I’d specialised in a particular area and worked on a ward. I soon developed my clinical skills including wound care, palliative care, medication management, continence management and pressure ulcer care (to name but a few). I then started to develop my leadership skills. It wasn’t long before I was seconded into a Band 6 deputy team leader role where I further gained much more experience in complex clinical assessments and leadership. Having decided this was where I wanted to be I undertook the District Nurse 1 year degree course which fully equipped me to take on my next role as a Band 7 Team Leader. From there it was only a couple of years before I progressed further into my Clinical Operations Manager role which is where I am today.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Community nursing offers such a great opportunity to learn new skills and allows you to work independently whilst still being part of a supportive team. It also offers excellent progression, whether you choose to specialise in a clinical pathway or take the leadership pathway as I did.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for a nurse with a genuine interest in continuing to develop skills in community nursing. We have a good track record of supporting newly qualified nurses, return to practice nurses, and nurses transitioning into the community from other settings including acute care. You must be able to work flexibly according to service needs and have excellent organisational, time management and communication skills.&lt;/p&gt;\n&lt;p&gt;We are based Merton Civic Centre in Morden, please get in touch if you would like to arrange an informal visit and meet the team.&lt;/p&gt;\n&lt;p&gt;Just as we care about our patients’ wellbeing, we care about yours!&lt;/p&gt;\n&lt;p&gt;We can offer you:&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Why join the team:&lt;/em&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;We will provide robust role-related training to ensure you are supported and competent including core mandatory training. In addition, there is a wealth of clinical skills training, preceptorship or supervision and Band 5 development programmes available to you through our CLCH Academy.&lt;/li&gt;\n&lt;li&gt;A comprehensive induction into the community service followed by a local induction to introduce you to the role&lt;/li&gt;\n&lt;li&gt;Newly Qualified nurses will receive preceptorship for which we have been awarded the CapitalNurse Preceptorship Quality Mark.&lt;/li&gt;\n&lt;li&gt;Work with a great team in community services offering excellent care to people in their own home environment&lt;/li&gt;\n&lt;li&gt;Morden good transport links to London it’s a vibrant town with bars restaurants, shops but also lots of green spaces with country walks on Wimbledon common, it’s an ideal family location.&lt;/li&gt;\n&lt;li&gt;Car lease scheme *T&amp;C’s apply&lt;/li&gt;\n&lt;li&gt;Annual travel card loan&lt;/li&gt;\n&lt;/ul&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/125514.jpg", "name": "Central London Community Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=125514"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Merton Community Nursing Services East, London", "postalCode": "SW1E 6QP"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4977", "longitude": "-.137477"}}, "title": "Community Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243769", "validThrough": "2020-11-10T23:59:59+0000"}