{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 p.a. pro rata"}}, "datePosted": "2020-11-04T08:16:09+0000", "description": "&lt;p&gt;&lt;strong&gt;Our Trust&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Cambridge University Hospitals (CUH) NHS Foundation Trust comprises Addenbrooke’s Hospital and the Rosie Hospital in Cambridge. With over 11000 staff and over 1100 beds the priorities of the Trust focus on a quality service which is all about people – patients, staff and partners. Recognised as providing ‘outstanding’ care to our patients and rated ‘Good’ overall by the Care Quality Commissioner, is testament to the skill and dedication of the people who work here. CUH’s values – Together- safe, kind, excellent – are at the heart of patient care, defining the way all staff work and behave. The Trust provides accessible high-quality healthcare for the local people of Cambridge, together with specialist services, dealing with rare or complex conditions for a regional, national and international population.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This is an exciting opportunity for 2 AAC Professionals (Speech and Language Therapist; Occupational Therapist; Qualified Teacher; Clinical Scientist) to join the Communication Aid Service East of England (CASEE) for fixed term/secondment cover posts.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;CASEE is one of 14 regional specialised Augmentative and Alternative Communication (AAC) Services commissioned by NHS England to provide a consistent, equitable AAC Service across England and is managed within the CUH Speech and Language Therapy Service.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Our service works closely with local therapy teams to provide a service to children and adults who are eligible for a specialised AAC assessment across the six counties of the East of England.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;You will work closely with CASEE&#39;s multi-disciplinary team of clinicians and technical staff, to deliver highly specialist assessment and provision of power-based (high tech) AAC to eligible children and adults across the 6 counties of the east of England. We visit people in their own homes, schools, colleges and residential homes but are now also providing video assessments and training wherever we can in line with CoVid 19 guidelines.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Ideally, you will be highly experienced in working with people with complex needs who require AAC to support their communication.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;You will be familiar with high level assessment, working as part of a multi-professional team and bringing your unique professional expertise to create a range of AAC solutions. You will also be confident in providing training to professionals and families and be able to communicate effectively with a broad range of individuals.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Whilst high level AAC skills and experience is desirable, we welcome applications from AAC professionals who have an interest in AAC and who are committed to quickly develop the necessary specialist knowledge and skills.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Individual personal development needs will be identified and supported.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Part time/ job shares are welcomed.&lt;/p&gt;\n&lt;p&gt;Internal applicants on permanent contracts can only apply for this post as a secondment and must have the approval of your current line manager before applying.&lt;/p&gt;\n&lt;p&gt;This post is subject to a satisfactory DBS clearance and as a result, you will be required to pay the associated fee of £40.00. This fee will be deducted from your second month’s salary.&lt;/p&gt;\n&lt;p&gt;This vacancy will close on 18th November 2020&lt;/p&gt;\n&lt;p&gt;Interviews are due to be held on 25th and 26th November 2020&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Benefits to you&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We offer development opportunities and a wide range of benefits including on-site leisure facilities, shopping concourse, day nurseries and access to a great transport system with easy access to airports and rail travel.&lt;/p&gt;\n&lt;p&gt;For further details of our fantastic benefits please refer to the attachment below - CUH Benefits.&lt;/p&gt;\n&lt;p&gt;Please note if you would like to discuss the required hours of this role further, you should approach the contact given. In some cases alternative working hours will be considered.&lt;/p&gt;\n&lt;p&gt;We welcome applications from the Armed Forces.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameCatherine Hale/ Jen DeaconJob titleActing Service Lead/ CASEE team secretaryEmail addresscatherine.hale@addenbrookes.nhs.ukTelephone number01223 349401Additional contact information&lt;/p&gt;\n&lt;p&gt;Please contact us if you have any questions about the posts or if you would like to find out more about the Communication Aid Service East of England (CASEE).&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Cambridge University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121319"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "CASEE Office, OH Building-Division B, Cambridge", "postalCode": "CB2 0QQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1751", "longitude": ".141751"}}, "title": "Advanced AAC Professional", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255045", "validThrough": "2020-11-18T23:59:59+0000"}