{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pa (pro rata for part time)"}}, "datePosted": "2020-10-26T12:47:07+0000", "description": "&lt;p&gt;Amersham Community Hospital is a delightful hospital, currently with 2 wards caring for 41 inpatients and we are seeking nurses with a desire to experience and develop rehabilitation nursing. We offer both general and specialist rehabilitation for patients with neurological conditions, post orthopedic and vascular surgery and general rehabilitation for patients who need that little bit extra support to get them back on their feet.&lt;/p&gt;\n&lt;p&gt;Waterside Ward, where we cater for patients following surgery and following general decline in physical abilities, is a 24 bedded ward. We are seeking motivated, rehab minded individuals who are keen to develop the &#39;care closer to home&#39; ethos by ensuring our patients adopt a similar mind set and make the most of their rehab opportunity.&lt;/p&gt;\n&lt;p&gt;BNRU (Bucks Neuro Rehabilitation Unit) is a specialised Neuro-rehabilitation centre where patients attend for a longer term rehabilitation, up to 8 weeks in duration however this is individualised for each patient. The nursing team is supported by a team of physio and occupational therapists, psychologists and other members of the MDT.&lt;/p&gt;\n&lt;p&gt;We also serve the community by providing a &#39;one stop shop&#39; in our new CAT Service - Community Assessment and Treatment Service where patients are referred by their GP or community nurse and are assessed by the team consisting of a Consultant Geriatrician, Physio and Occupational Therapists and Nurses. While working on one of our wards you may be extended the opportunity to work in the CATS team which would enhance your assessment skills and autonomy.&lt;/p&gt;\n&lt;p&gt;We can offer you a range of different experiences including a rotation programme individually tailored for you or a permanent position on one of our wards. Will you be the one to succeed in securing a position in our service?&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;To discuss further please call Waterside Ward Sister Heidi Dunham on 01494 734711&lt;/p&gt;\n&lt;p&gt;or BNRU Sister Annabelle Bautista 01494 734102.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Buckinghamshire Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120887"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Amersham, Amersham", "postalCode": "HP7 0JD"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.663", "longitude": "-.621366"}}, "title": "Staff Nurse - Waterside Ward", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242521", "validThrough": "2020-11-09T23:59:59+0000"}