{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 pa pro rata"}}, "datePosted": "2020-11-05T12:15:18+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;span&gt;BASED AT THE BENET BUILDING, HEREFORD&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt; &lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt; &lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;CAMHS LD PRACTITIONER (RMN, OT, SOCIAL WORKER)&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;BAND 6&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;30 HOURS PER WEEK&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Do you have the drive to join an experienced and highly motivated CAMHS team to deliver responsive and effective services?&lt;/p&gt;\n&lt;p&gt;You will be part of the exciting changes working within the CAMHS multi-disciplinary team inputting into clinical pathways, developments and delivering therapeutic interventions, with specific focus on meeting the mental health needs of CYP who have a learning disability.&lt;/p&gt;\n&lt;p&gt;You will be a qualified professional with current registration with a relevant professional body.&lt;/p&gt;\n&lt;p&gt;You will hold a caseload of young people with complex mental health needs and will take responsibility for providing assessments and therapeutic treatment programmes for these CYP. You will care co-ordinate a number of young people on your caseload. You will have a proven ability to liaise with and work in collaboration with other relevant agencies according to the needs of the young person.&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity to join the very busy Hereford Child and Adolescent Mental Health Service (CAMHS) based in Hereford City. CAMHS LD sits within CAMHS alongside our Eating Disorder and Duty teams, as well as our core CAMHS service. No two days will be the same, so flexibility, problem solving skills and a desire to make a difference are all vital for this role.&lt;/p&gt;\n&lt;p&gt;As part of the national transformation of CAMHS, some infrequent on call weekend working is required.&lt;/p&gt;\n&lt;p&gt;Herefordshire is a predominately rural county with small market towns and transport links to the city of Hereford. The area offers excellent living and working prospects and a rich cultural life. Nearby are the Wye Valley AONB, the Forest of Dean, the Malvern Hills, the Brecon Beacons National Park and easy access to the M50 and M5. A thriving Arts Centre (The Courtyard) and good schools and colleges contribute to making Herefordshire a great place to live.&lt;/p&gt;\n&lt;p&gt;This post requires the post holder to be able to undertake all mandatory training including PBM (subject to Occupational Health Clearance).  Any training requirements should also be including in the Job Description/Person Specification.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;All staff whatever their role, level or responsibility will be encouraged and supported to do their job well and to improve their job.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt; &lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Making Every Day Better for patients, staff, service users and carers is the responsibility of all of us and we want to embed a culture within the organisation that encourages and supports the drive to improve what we do.&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120795.jpg", "name": "Herefordshire and Worcestershire Health and Care NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120795"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hereford", "postalCode": "HR1 2ER"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.0569", "longitude": "-2.70553"}}, "title": "CAMHS Learning Disability Practitioner (RMN, OT, Social Worker)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257589", "validThrough": "2020-11-19T23:59:59+0000"}