{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 p.a. + L.W."}}, "datePosted": "2020-10-26T16:31:52+0000", "description": "&lt;p&gt;&lt;strong&gt;Consultants in Infection/Microbiology (two posts, 10 PAs per week, permanent) Barnet and Chase Farm Hospitals&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We have a fantastic opportunity for two people to join a cohesive, dynamic and friendly Infection team in North London. Applications are invited for two full time Consultant posts in Infection at Barnet and Chase Farm Hospitals, which forms part of the Royal Free London NHS Foundation Trust. Applications are welcome from those looking for part-time and flexible arrangements.&lt;/p&gt;\n&lt;p&gt;The posts would be suited to applicants with CCTs or equivalent in Microbiology or Microbiology and Infectious Diseases.&lt;/p&gt;\n&lt;p&gt;The successful candidates would form part of a team of 5 Consultant Microbiologists who provide the Infection services to Barnet and Chase Farm Hospitals and the surrounding community. Roles within this would include the provision of clinical advice, daily intensive care ward rounds, Microbiology and Virology laboratory result oversight and authorisation, contribution to Antimicrobial Stewardship ward rounds and building on the current Diabetic Foot and Orthopaedic multi-disciplinary teams with integration into the delivery of outpatient parenteral antibiotic therapy (OPAT). The role also requires working closely with our friendly and enthusiastic Infection Control nurses and Clinical Practice Educators.&lt;/p&gt;\n&lt;p&gt;The laboratory service is part of Health Services Laboratories (HSL), the recently formed pan-pathology partnership between the Royal Free London, UCLH and The Doctors’ Laboratory (TDL) and is situated off site at the HSL Halo building on Mabledon Place, King’s Cross. There is close working and collaboration with the laboratory team, with communication predominantly maintained remotely via ‘virtual’ bench rounds. Occasional attendance on site at the laboratory will be required as part of the delivery of service.&lt;/p&gt;\n&lt;p&gt;The Infection Directorate is cross site with the Royal Free Hospital and includes the departments of Infectious Diseases, Microbiology and Virology, with strong links to the departments of Immunity, HIV medicine and Immunology. These posts sit within the Department of Microbiology.&lt;/p&gt;\n&lt;p&gt;Our mission is to be world class in terms of our innovative healthcare services, clinical research and teaching excellence.&lt;/p&gt;\n&lt;p&gt;Applicants must be fully registered with the GMC and hold License to Practice, and be on the Specialist Register or be within six months of attaining CCT or equivalent at the interview stage. The post is ideally suited to applicants with microbiology training or microbiology/infectious diseases joint training.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Dr. Stephanie Paget&lt;/p&gt;\n&lt;p&gt;Job title: Microbiology Consultant, Clinical Lead&lt;/p&gt;\n&lt;p&gt;Email address: stephanie.paget@nhs.net&lt;/p&gt;\n&lt;p&gt;Or&lt;/p&gt;\n&lt;p&gt;Contact name: &lt;span&gt;Dr. Husam El-Mugamar&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Contact job title: &lt;span&gt;Microbiology Consultant&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Contact email address: husam.el-mugamar@nhs.net&lt;/p&gt;\n&lt;p&gt;or&lt;/p&gt;\n&lt;p&gt;Contact name: &lt;span&gt;Dr. Anand Sivaramakrishnan&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Contact job title: &lt;span&gt;Microbiology Consultant&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Contact email address: anand.sivaramakrishnan@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120624.jpg", "name": "Royal Free London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120624"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Barnet Hospital, London", "postalCode": "EN5 3DJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.651", "longitude": "-.215519"}}, "title": "Consultant in Infection and Microbiology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243445", "validThrough": "2020-11-09T23:59:59+0000"}