{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-10-28T15:15:43+0000", "description": "&lt;p&gt;&lt;strong&gt;Sussex Liaison and Diversion (SL&amp;D)&lt;/strong&gt; is seeking to recruit a dynamic and motivated senior support worker for a new role in our Children and Young People&#39;s pathway. This is a fixed term 2 year appointment.&lt;/p&gt;\n&lt;p&gt;Reporting to and supported by an experienced Youth Clinical Nurse Specialist, you will join a growing team of frontline staff who provide high quality specialist vulnerability screening, assessment, and onward support to people across Sussex and Brighton &amp; Hove who have become involved in the criminal justice system. You will have experience of working with children and young people who are at risk of poor health and social care outcomes, and will have growing knowledge of the youth criminal justice, health, mental health, and social care systems.&lt;/p&gt;\n&lt;p&gt;You will use your well-developed engagement and communication skills to conduct vulnerability screenings of children and young people in the early stages of the criminal justice system. This may include working in people&#39;s homes, in police stations, courts, and at other locations. A high proportion of your work will be conducted virtually using appropriate remote working methods.&lt;/p&gt;\n&lt;p&gt;Your written and verbal feedback will inform police and court decision making, and will support the early identification of need in order to achieve successful onward referral for vulnerable young people into the most appropriate health and social care services. You will additionally provide short-term (6-10 week) community support to a small cohort of young people. This will typically include: supporting their attendance at other health services and social care agencies you have referred them to, supporting them to engage with the criminal justice system, and other related activities.&lt;/p&gt;\n&lt;p&gt;You will have good awareness of child safeguarding procedures. You will be motivated to speak up for and confident in advocating for children and young people who may have committed serious or violent offences, effectively articulating their disadvantage and vulnerability both to criminal justice partners and other support agencies.&lt;/p&gt;\n&lt;p&gt;You will help the service develop and maintain links with local police YPOs, CAMHS teams, Local Authority children&#39;s services (including educational services), youth offending teams, and third sector organisations. You will additionally be a source of knowledge for other non-specialist staff working in the team across Sussex, who may contact you for advice regarding vulnerable young people.&lt;/p&gt;\n&lt;p&gt;This role requires you to be organised, and efficient: you will need to be able to travel promptly between locations during the working day; this will include locations in East or West Sussex, or Brighton/Hove as necessary.&lt;/p&gt;\n&lt;p&gt;This role may be considered for secondment of existing SL&amp;D staff.&lt;/p&gt;\n&lt;p&gt;The Job Description is subject to Job Evaluation&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This role requires both enhanced DBS clearance and Sussex Police clearances (NPPV level 2).&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For more information on L&amp;D services nationally please visit NHSE&#39;s health and justice commissioning webpages.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you would like to discuss the post further please contact Ruth Hodierne (CNS) on 07388 994537, or email: ruth.hodierne@sussexpartnership.nhs.uk.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121074.jpg", "name": "Sussex Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121074"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "THe Firs, Hellingly", "postalCode": "BN27 4ER"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8889", "longitude": ".268666"}}, "title": "Children and Young People - Senior Support Time Recovery Worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247147", "validThrough": "2020-11-11T23:59:59+0000"}