{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum pro rata"}}, "datePosted": "2020-10-26T09:27:23+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for a highly motivated, enthusiastic and experienced registered nurse to join our busy and dynamic Outpatient team within the RD and e. We are looking for a committed, flexible and hardworking Registered Nurse with good interpersonal and communication skills.&lt;/p&gt;\n&lt;p&gt;Outpatient’s consists of a variety of specialties under the domains of Surgical, Medical, ENT and Maxillo Facial departments which are held on the RD and E Wonford site and in the community. We have a range of procedural consultant led clinics along with specialist nurse led clinics. The successful candidate will be a required to work within all areas. Knowledge and or experience within the urology speciality is desirable as the successful candidate will be required to undertake training to perform intravesicle treatments. The successful candidate will be providing high quality seamless patient care by being responsible for the day to day running of clinics, coordinating the outpatient department and providing support to the outpatient nursing team.&lt;/p&gt;\n&lt;p&gt;The role also involves working on the acute site and also within the community hospitals, therefore a clean driving licence is essential for this role.&lt;/p&gt;\n&lt;p&gt;We currently have a range of hours available within Outpatients. The service is covered Monday to Saturday along with late clinics.&lt;/p&gt;\n&lt;p&gt;We require individuals who are forward thinking, well organised with a positive can do attitude and are open to flexibility and change.&lt;/p&gt;\n&lt;p&gt;We offer a supportive, exciting and challenging work environment and we are committed to the training and development of our staff. We are keen to develop suitable candidates in this role, by facilitating their education within the department and attending trust study days.&lt;/p&gt;\n&lt;p&gt;Our vision is to provide safe, high quality seamless services delivered with courtesy and respect. To achieve our vision we expect all our staff to uphold our Trust values. Our Trust values are:&lt;/p&gt;\n&lt;p&gt;Honesty, Openness &amp; Integrity&lt;br /&gt; Fairness&lt;br /&gt; Inclusion &amp; Collaboration&lt;br /&gt; Respect &amp; Dignity&lt;/p&gt;\n&lt;p&gt;For further details / informal visits please contact:&lt;/p&gt;\n&lt;p&gt;Clinical Nurse Manager Jo Morgan on 01392 402200 or Clinical ODP Manager Janet Jones on 01392 403731&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121044.jpg", "name": "Royal Devon and Exeter NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121044"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Exeter", "postalCode": "EX2 5DW"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7167", "longitude": "-3.50669"}}, "title": "Registered Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241844", "validThrough": "2020-11-09T23:59:59+0000"}