{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503"}}, "datePosted": "2020-11-05T10:16:18+0000", "description": "&lt;p&gt;Harrogate District Foundation Trust is situated in a beautiful spa town in North Yorkshire close to the city of Leeds. Our CQC report rates caring as outstanding, all staff within the Trust are immensely proud of this and our values of respectful, passionate and responsible are clearly seen in every aspect of our work.&lt;/p&gt;\n&lt;p&gt;The hospital’s acute paediatric service is looking for an experienced neonatal and / or paediatric nurse to be the Team Leader for its 22 bedded children’s ward which includes a children’s assessment unit and a 7 cot special care baby unit. This is an unusual post coving two closely linked services with ample opportunity to develop new ways of working.&lt;/p&gt;\n&lt;p&gt;The role would include clinical work within the SCBU and Children’s ward and managerial responsibilities for all areas. Services are well supported by our consultants and the wider multi-disciplinary team and the matron will guide and encourage your development to reach your full potential. Would you love to take ownership of your clinical areas and strive for excellence ever time, working with a team that is willing to change and put its patients and families at the centre of the decision making? The whole hospital is friendly and staff enjoy working here, they feel valued. Come for a visit and see for yourself.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If you have any further queries please contact Julie Walker on 01423 557735 or 0758 4265980 or email at julie.walker76@nhs.net&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This job advert will close as soon as a sufficient amount of applications have been received. Please apply for this job as soon as you can, if you are interested.**&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Name: Julie Walker Job title: Matron Email address: julie.walker76@nhs.net Telephone number: 01423 557735 , 0758 4265980&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Harrogate and District NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120853"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Harrogate District Foundation Trust, Harrogate", "postalCode": "HG2 7SX"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.993", "longitude": "-1.51812"}}, "title": "Ward Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257185", "validThrough": "2020-11-19T23:59:59+0000"}