{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum, pro rata &amp; AFC unsoci"}}, "datePosted": "2020-11-03T15:16:35+0000", "description": "&lt;p&gt;Do you want to progress your career in paediatric pharmacy?&lt;/p&gt;\n&lt;p&gt;Are you driven by the desire to improve paediatric patient care?&lt;/p&gt;\n&lt;p&gt;Are you keen to provide and partake in the learning opportunities offered from working in a specialist area?&lt;/p&gt;\n&lt;p&gt;If so, this is the post for you.&lt;/p&gt;\n&lt;p&gt;Royal Manchester Children’s Hospital is world renowned, and provides care to complex patients including gastroenterology, oncology, haematology, metabolic medicine, surgery, critical care, renal medicine, rheumatology, endocrinology, cardiology, respiratory and neurology.&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for a Specialist Paediatric Pharmacist to join our Women’s and Children’s Pharmacy team and lead a high quality clinical pharmacy service to the gastroenterology and intestinal failure specialties.&lt;/p&gt;\n&lt;p&gt;You will be an integral member of the gastroenterology and nutrition support teams, working with clinicians, dietitians and nursing teams within the Trust. Your role will involve actively supporting the prescribing, monitoring and supply of parenteral nutrition, immunomodulators and biological therapies to inpatients, outpatients and patients at home.&lt;/p&gt;\n&lt;p&gt;Working within the Women’s and Children’s pharmacy team can offer you support in developing your expertise and skills through formal training courses, mentoring and regular appraisals. Our team has a wealth of clinical knowledge in a wide range of clinical specialities with a strong team of senior pharmacists. We have excellent links with local universities and CPPE, as well as a variety of clinical national networks.&lt;/p&gt;\n&lt;p&gt;Passion, dedication and motivation are essential here; you will need to be a confident communicator, comfortable working in hospital teams and solving problems under pressure, with an enthusiasm for learning and personal development.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameLorna MarksJob titleSpecialist Pharmacist for Metabolic MedicineEmail addressLorna.marks@mft.nhs.ukTelephone number0161 701 0256&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Manchester University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121137"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "ORC, Manchester", "postalCode": "M13 9WL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4625", "longitude": "-2.22771"}}, "title": "Specialist Paediatric Pharmacist - Gastroenterology and Intestinal Fa", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254528", "validThrough": "2020-11-15T23:59:59+0000"}