{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "73664", "minValue": "63751", "unitText": "YEAR", "value": "£63,751 - £73,664"}}, "datePosted": "2020-10-30T15:00:24+0000", "description": "&lt;p&gt;&lt;span&gt;An exciting opportunity has arisen to join the Division of Unscheduled care at Blackpool Teaching Hospital as the Assistant Divisional Director of Operations and Head of the Integrated Discharge Team. The role is to deputise for the Divisional Director of Operations, to oversee and manage diverse discharges and work collaboratively with external partners. The successful applicant will continue the development of the Discharge 2 assess model and Single Point of Discharge, as well as management of the Hospital Discharge Team.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;As post holder you will provide leadership and expertise to the Discharge Team by providing information, support and advice, and specialist knowledge to patients, their families and carers. You will also be a resource to the multi-disciplinary team.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Your will participate in the co-ordination of patient care to ensure continuity throughout patients’ care pathway and promote safe and timely discharges. You will be pivotal in supporting Trust, local and national initiatives as well as the review and development of the service.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;As post holder you will liaise closely with the health care teams of in both primary and secondary care. You will be able to demonstrate wide and in-depth experience of all aspects of discharge pathways, exercising leadership and effective education within their scope of practice.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will guide the Specialist Discharge Nurses in promoting and implementing the Discharge to Assess (D2A) pathways and NHS Continuing Health Care Process working collaboratively with partner agencies.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameJoanne BarkJob titleDeputy Director of Operations - USCEmail addressjoanne.bark1@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Blackpool Teaching Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120954"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Blackpool Teaching Hospitals, Blackpool", "postalCode": "FY3 8NR"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8207", "longitude": "-3.01626"}}, "title": "Assistant Divisional Director of Operations and Head of Integrated Di", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250674", "validThrough": "2020-11-15T23:59:59+0000"}