{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "107668", "minValue": "79860", "unitText": "YEAR", "value": "£79,860-£107,668"}}, "datePosted": "2020-10-06T13:52:35+0100", "description": "&lt;h1&gt;Isle of Wight NHS Trust&lt;/h1&gt;\n&lt;h2&gt;Locum Consultant General Adult Psychiatry (2 Posts)&lt;/h2&gt;\n&lt;p&gt;These full-time posts offer an exciting opportunity for an ambitious psychiatrist to support a unique NHS trust going through transition and maintaining safe and effective services during this period. Post-holders will be expected to take on an active role providing consultant leadership and oversight for inpatient care, crisis resolution and home treatment as well as adult (ageless) community mental health services.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;There is additional opportunity for those wanting to get involved into developing state of the art Mental Health services fit for the needs of the population. There is a MH transition team working towards establishing this service in line with the MH sustainability and transformation plan. The acute and community mental health services on the island will be changing with the vision to eventually move into a sectorial model. There will be opportunity for the successful applicants to work sessions across CMH and Acute The final job-plan will be agreed with the successful candidate and the Clinical Director and service manager. Colleagues with service transformation experience will be offered up to additional 1 SPA for service transformation to work as part of the transformation team subject to job-planning.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The trust has identified a strategic mainland partner which will help with this service development. Should the successful applicants have an interest in staying permanently he/she would be in an excellent position to apply and help design there future work environment.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Isle of Wight NHS Trust - Medical Recruitment", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=135474"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Newport", "postalCode": "PO30 5TG"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7111", "longitude": "-1.30088"}}, "title": "Locum Consultant Psychiatrist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916214913", "validThrough": "2021-04-06T23:59:59+0100"}