{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum, pro rata"}}, "datePosted": "2020-10-26T15:16:06+0000", "description": "&lt;p&gt;We are looking to recruit an experienced, highly skilled and forward thinking individual to be our Outpatient, Trauma and Elective Orthopaedic Lead Physiotherapist.&lt;/p&gt;\n&lt;p&gt;This is a brand new post, to expand the clinical leadership within Physiotherapy, drive forward the transformation of current physiotherapy pathways and ultimately improve our patient outcomes. It is expected that the successful candidate will bring a wealth of experience and transferrable skill from their current practice in physiotherapy, this could include but is no limited to: Musculoskeletal, Trauma and Elective Orthopaedics.&lt;/p&gt;\n&lt;p&gt;As this is a new role, we are hoping the successful candidate will work alongside the leadership team to create a long-term vision and action plan for the services, with measureable outcomes. Physiotherapy is part of the Core Therapies business unit, integrated with Occupational Therapy. You would report directly into the Professional Lead for Physiotherapy and also be supported by the Professional Lead for Occupational Therapy and the Specialty Business Manager. You will receive peer support from our Advanced Specialist Practitioners in Upper Limb, Lower Limb, Spine and Hand Therapy.&lt;/p&gt;\n&lt;p&gt;We are looking for someone who holds a successful record of high quality leadership; with experience of leading a team, change management and improving outcomes for service users. As we are an integrated service, you would be expected to provide leadership/clinical guidance for the Occupational Therapists within our trauma and elective orthopaedic teams.&lt;/p&gt;\n&lt;p&gt;The key areas of clinical and professional responsibility include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;MSK Outpatients&lt;/li&gt;\n&lt;li&gt;Pain&lt;/li&gt;\n&lt;li&gt;Women’s Health&lt;/li&gt;\n&lt;li&gt;Hydrotherapy&lt;/li&gt;\n&lt;li&gt;Trauma&lt;/li&gt;\n&lt;li&gt;Elective Orthopaedics&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Due to the pathways in and out of the above services, you would also have close working relationships with the relevant inpatient teams and the consultant team in orthopaedic clinic and fracture clinic.&lt;/p&gt;\n&lt;p&gt;You must be an autonomous expert practitioner in your chosen specialty and be capable of using transferrable knowledge and skill to professionally support staff with their clinical caseloads. You will work across professional and organisational boundaries to expand and develop physiotherapy pathways and services. You will be the point of contact for advice and expertise on issues relating to the above specialist areas of physiotherapy.&lt;/p&gt;\n&lt;p&gt;There is a clinical element to this role; it is estimated to be 1 day per week. The area of work will depend on the successful candidate’s current role and background. This can be discussed further at interview.&lt;/p&gt;\n&lt;p&gt;Personal development is high on LTHTR’s agendas for its senior leaders. There are 3 Health Academy’s across the 2 sites and a dedicated organisation development (OD) team. They provide high quality in house leadership development programmes and many other useful courses. You will oversee the education and staff competency of your specialist teams and support them to continuously develop.&lt;/p&gt;\n&lt;p&gt;It is a really exciting time to join Core Therapies at LTHTR, we are currently recovering from the recent pandemic and this provides opportunity for further innovation and continuous improvement, especially in our outpatient services.&lt;/p&gt;\n&lt;p&gt;If you feel ready to take on this new and exciting challenge, please make contact to find out more.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Meet the Teams…&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Core Therapy respiratory teams are active on Twitter – take a look at them in action:&lt;/p&gt;\n&lt;p&gt;@lancshospMSKPT @WHphysioLTH @RPHTraumaOrtho&lt;/p&gt;\n&lt;p&gt;We are proud to have taken part in #24hours, an in house mini-series focusing on our acute medicine team and Hand Therapy team, click to link to find out more and meet the teams:&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Interview Date: 26th November 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Claire Granato - Professional Lead Physiotherapists 07860502798/01772 524097 or Claire.granato@lthtr.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Lancashire Teaching Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121125"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Preston Hospital", "postalCode": "PR2 9HT"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7909", "longitude": "-2.70449"}}, "title": "Lead Physiotherapist for Outpatients and Trauma &amp; Orthopaedics", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243087", "validThrough": "2020-11-15T23:59:59+0000"}