{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 to £19,337 per annum (pro rata)"}}, "datePosted": "2020-11-02T15:59:52+0000", "description": "&lt;p&gt;&lt;strong&gt;Job Title – Health Care Assistant – Band 2 or 3&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Base – Berkeley House, Stroud &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary – B2 £18,005 - £19,337 / B3 £19,737 - £21,142 PA (PR)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours per week – 22.5 / 30 / 37.5 hours available &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Are you interested in a challenging your expectations of working with people with a Learning Disability? &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Are you able to share your positivity even in the most challenging situations?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If you are then we have a job for you!&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are looking for someone who is dynamic, enthusiastic and person centred to join our team in our assessment and treatment hospital for people with learning disabilities who may exhibit behaviours that challenge or have mental health issues. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;You will need to be resilient and prepared to focus on the positives whilst thriving off the challenges. In return we offer the chance to work with some highly complex people in an extremely rewarding job where no day is the same as the last. You will be joining a team of highly skilled and committed individuals and will become part of the Multi-disciplinary team. We offer training to increase your existing skill set and the opportunity to work closely with individuals within a hospital environment as well as the community.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The shifts you will be required to work will be a mix of 07:00-14:50, 08:00-16:00, 13:40-21:30 and 21:00-07:20 over a roster period. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If shortlisted it is strongly advised to come and have a look round and discuss with staff the unit and its remit to get a feel of what we do, prior to attending interview.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The qualification, training &amp; experience requirements for the role are underlined in the Job Description/Person Specification.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing date: 30th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Shortlisting date: 1st December 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For more information about this opportunity, please don’t hesitate to contact Simon Eddy (Manager), Jane Ffoulkes or Steph Sims (Deputy Manager) on 01453 563100.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please note:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;The job description for the Band 2 role is available under the ‘job description and person specification’ link to the right hand side&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;The job description for the Band 3 role is available under the ‘additional vacancy specific document’ link to the right hand side&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;As a Health Care Assistant/ Support Worker you will be responsible for participating and assisting in the delivery of care / services to patients and service users as part of a Mental Health and Social Care Health Service. Health Care Assistant, Social Care Workers and other Healthcare Support Workers employed by the Trust are required to follow the guidance set out in Code of Conduct for Health Care Assistants/ Health Care Support Workers to provide safe and compassionate care of a high standard, and to challenge others who are not. You will receive direct supervision and partake in reflective practice / training on a regular basis and be required to meet the Care Certificate standards.&lt;/p&gt;\n&lt;p&gt;This post requires the post holder to be able to undertake all statutory and mandatory training and post holders must be able to undertake physical interventions. Fitness for physical intervention will be assessed by Occupational Health.&lt;/p&gt;\n&lt;p&gt;To ensure you fully understand how the Trust, as a Data Controller, will process and store your data please read the attached document ‘Applicant and Staff Privacy Notice’ prior to applying for the role.&lt;/p&gt;\n&lt;p&gt;Candidates for any staff appointment shall, when making application, disclose in writing to the Trust whether they are related to any governor. Failure to disclose such a relationship may disqualify a candidate and, if appointed, may render him/her liable to dismissal.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120776.png", "name": "Gloucestershire Health and Care NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120776"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Stroud", "postalCode": "GL5 4SA"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7464", "longitude": "-2.24769"}}, "title": "Health Care Assistant – Band 2 or 3", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252727", "validThrough": "2020-11-30T23:59:59+0000"}