{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "21142", "unitText": "YEAR", "value": "£21,142 to £30,615 per annum pro rata"}}, "datePosted": "2020-10-26T13:16:51+0000", "description": "&lt;p&gt;&lt;strong&gt;OneTeamOneOUH&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We would like to welcome you to join our team and be part of our world renowned teaching hospital and centre of clinical excellence!&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Now is a great time to join the nursing team at OUH.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Nursing and midwifery is about to enter an exciting phase as we finalise and put into action our updated strategy for nursing and midwifery. Part of this is to embark on our Pathway To Excellence® journey as we seek accreditation and build within our nursing teams an expanded shared decision making culture.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Our nursing teams are supported by an excellent framework of practice development offering ongoing professional development where Our nurses are empowered, are instilled with a strong sense of professional pride, ensuring that we deliver the highest calibre of care to our patients!.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Joining our team provides opportunity for you to grow your career, whether you are starting as a newly qualified or an experienced registered nurse, we have a variety of specialty areas for you to choose from and career pathways tailored to you to realise your ambitions and potential.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Whether you want to work in one of our fast paced surgical wards, our leading cancer centre, neurology and neurosurgery, excellent heart centre, refurbished and expanded Emergency Department, one of our specialist medical departments and a well-respected children’s hospital, the opportunities are endless. If critical care nursing is your passion, we have units based on all our sites covering all specialities – including neurosurgery/neurology, general, cardiac, paediatric and newborn. We have sites in &lt;strong&gt;Oxford and Banbury&lt;/strong&gt; and satellite sites across the Thames Valley region for you to choose from.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Start the conversation with us today and continue your nursing journey by contacting one of our specialist leads and explore the many career options OUH has to offer you:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Opening: 26th October 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing: 23rd November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interviews: will be conducted UK time&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Lucy Constant – R&amp;R Lead for Nursing Workforce – lucy.constant@ouh.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Oxford University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120889"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "All OUH Sites, Oxford and Banbury", "postalCode": "OX3 9DU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7639", "longitude": "-1.21979"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242626", "validThrough": "2020-11-23T23:59:59+0000"}