{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "15381", "minValue": "15129", "unitText": "YEAR", "value": "£9.00 per hour rising to £9.15 after probation"}}, "datePosted": "2020-11-03T00:48:12+0000", "description": "&lt;p&gt;Cygnet Health Care have been providing a national network of high quality specialist mental health services for more than 30 years.&lt;/p&gt;\n&lt;p&gt;Located in Brant Broughton, Lincolnshire, Broughton House is a 29 bed specialist residential service for adults with autism and who may present with behaviours that challenge. We aim to provide a safe, comfortable and effective care environment for those in our care, promoting independence and community integration.&lt;/p&gt;\n&lt;p&gt;We are looking for professional, ambitious and passionate individuals to provide care and support to our service users ensuring individuals retain as much of their dignity and individuality as possible as well as being involved in the general activities of the home. No experience or qualifications needed as we provide full training and Induction.&lt;/p&gt;\n&lt;p&gt;If you’re passionate about what you do, we want to hear from you.&lt;/p&gt;\n&lt;h2&gt;In this role you’ll:&lt;/h2&gt;\n&lt;p&gt;• Offer enhanced care with a flexible learning approach for all our residents&lt;/p&gt;\n&lt;p&gt;• Work in the residential area, providing guidance and encouragement to residents through physical and emotional support&lt;br /&gt; • Maintain a safe, clean and enjoyable environment for our residents to live in, which will involve undertaking some domestic duties and complying with policies and procedures&lt;br /&gt; • Assist residents with their medical and welfare needs and report as required&lt;br /&gt; • Safeguard residents&lt;br /&gt; • Learn about individuals’ specific needs and provide help in the most appropriate way&lt;/p&gt;\n&lt;h2&gt;We&#39;re looking for people who have:&lt;/h2&gt;\n&lt;p&gt;• Excellent communication skills and the ability to be a good team player&lt;br /&gt; • The sensitivity and energy required to provide a trusting, stimulating and varied lifestyle for the residents&lt;br /&gt; • A genuine desire to make a real difference in people’s lives&lt;br /&gt; • Flexibilty to work 12 hour shift patterns on a rota basis&lt;br /&gt; • Driving licence and own transport is essential due to lack of public transport&lt;/p&gt;\n&lt;h2&gt;In return we’ll offer you:&lt;/h2&gt;\n&lt;p&gt;• Full Training and Induction&lt;br /&gt; • Employee Discount Scheme&lt;br /&gt; • DBS paid&lt;br /&gt; • Regular coaching and support&lt;br /&gt; • Free meals on duty&lt;br /&gt; • Free parking at site&lt;br /&gt;• Blue light card- NHS discounts- A wide range of offers from categories such as holidays, rail travel, cars, days out, fashion, gifts, insurance, phones and many other items.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;strong&gt;Please note: successful candidates will be required to undergo an enhanced DBS check.&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/129977.png", "name": "Cygnet Health Care", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=129977"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "12 High St, Brant Broughton, Lincolnshire, LN5 0SL", "postalCode": "LN5 0SL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.0753", "longitude": "-.633158"}}, "title": "Support Worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253093", "validThrough": "2020-11-30T23:59:59+0000"}