{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pa"}}, "datePosted": "2020-11-04T08:30:41+0000", "description": "&lt;p&gt;&lt;strong&gt;BE THE NEXT TO JOIN OUR TEAM &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;There Is currently an opportunity within our Anaesthetic Support team here at the Countess of Chester NHS Foundation Trust for an ODP-RN. We are committed to providing high quality care to patients, and are seeking enthusiastic individuals to join our existing team to support the on-going Quality Improvement Programme.&lt;/p&gt;\n&lt;p&gt;Main Theatres consists of 11 operating theatres and an 11 bay Recovery (PACU), there is also a further 5 Day Theatres and Recovery bays.&lt;/p&gt;\n&lt;p&gt;Anaesthetic support duties include elective and emergency sessions in the Maternity department, the Cardiac arrest team and A&amp;E Resus (inter hospital transfer) also, IVF, Endoscopy (EBUS), Interventional Radiology, MRI, CT, ITU, Cardio version and Community Dental.&lt;/p&gt;\n&lt;p&gt;Surgical specialities include General, Colo-rectal, Breast, Urology, Gynaecology, Ophthalmic, Gastro-intestinal, Orthopaedic/Trauma, Plastics, Max Fax, ENT, and we are Vascular HUB for the region. We also provide a 24 hour Emergency Theatre with a second on call team at nights and weekends.&lt;/p&gt;\n&lt;p&gt;We would welcome enquires from enthusiastic practitioners. If you are newly qualified Preceptorship will be provided with an induction programme to support your knowledge and skills required for the post.&lt;/p&gt;\n&lt;p&gt;Please be aware that the above information maybe subject to change and further details will be available at the time of interview. Please detail your exact date of expected qualification if you are a new ODP registrant.&lt;/p&gt;\n&lt;p&gt;All applicants must hold professional qualification and registration with the HCPC (or awaiting registration) or NMC.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;All positions include, nights, weekends and an on call commitment in accordance with the rota. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Clive Sheppard&lt;/p&gt;\n&lt;p&gt;Job title Speciality Manager - Anaesthetic support&lt;/p&gt;\n&lt;p&gt;Telephone number 01244 366540&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121083.JPG", "name": "Countess of Chester Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121083"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Countess of Chester Hospital, Chester", "postalCode": "CH2 1UL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.2118", "longitude": "-2.89903"}}, "title": "Theatre Practitioner - ODP / RN", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255091", "validThrough": "2020-11-18T23:59:59+0000"}