{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683"}}, "datePosted": "2020-10-21T16:57:53+0100", "description": "&lt;p&gt;&lt;strong&gt;SHEFFIELD CHILDREN&#39;S NHS FOUNDATION TRUST&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;CONSULTANT IN PAEDIATRIC HAEMATOLOGY&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Applications are invited for the post of a consultant in paediatric haematology based at Sheffield Children&#39;s NHS Foundation Trust. This is a new post with roles in both benign and malignant haematology which has arisen as a result of service expansion.&lt;/p&gt;\n&lt;p&gt;We are looking for a highly committed and motivated individual to join our team of 4 haematologists and 3 oncologists in providing tertiary malignant and non-malignant services for South Yorkshire and North East Lincolnshire. Our service includes a regional paediatric haemopoietic stem cell transplant programme, comprehensive haemophilia care and a specialist haemoglobinopathy service. The latter was recently designated as the haemoglobinopathy co-ordinating centre for sickle cell disease for paediatrics for the North East and Yorkshire.&lt;/p&gt;\n&lt;p&gt;This is a full-time (10PA) post and has Royal College of Pathology approval. Any applicant who is unable for personal reasons to work full-time will be eligible to be considered for the post; if such a person is appointed, modification of the job content will be discussed on a personal basis with the Trust in consultation with consultant colleagues.&lt;/p&gt;\n&lt;p&gt;Applicants should possess, or be within 6 months of receiving, a CCT in Haematology at the time of appointment or show evidence of its equivalent if not UK trained by the date of interview and have adequate experience as described in the person specification.&lt;/p&gt;\n&lt;p&gt;Sheffield Children’s NHS Foundation Trust is one of only four dedicated children’s hospital trusts in the UK providing integrated, highly specialist healthcare for children and young people in Sheffield, South Yorkshire and beyond. The trust is committed to being a leader in the field of training and research in children’s healthcare and we continue to deliver a strong portfolio of research and product innovation.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Sheffield is one of the largest cities in England yet is just a few miles away from the Peak District National Park renowned for its beautiful scenery, picturesque villages and abundance of outdoor activities.&lt;/p&gt;\n&lt;p&gt;Interested applicants are encouraged to contact us to discuss further and/or to arrange a visit:&lt;/p&gt;\n&lt;p&gt;Dr Emma Astwood - emma.astwood@nhs.net&lt;/p&gt;\n&lt;p&gt;Dr Jeanette Payne - jeanette.payne@nhs.net&lt;/p&gt;\n&lt;p&gt;Dr Salah Ali –salah.ali@nhs.net&lt;/p&gt;\n&lt;p&gt;Dr Dan Yeomanson – danyeomanson@nhs.net&lt;/p&gt;\n&lt;p&gt;Dr Vicki Lee – victoria.lee13@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone - 0114 2717477&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122992.JPG", "name": "Sheffield Children's NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122992"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Sheffield", "postalCode": "S10 2TH"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3806", "longitude": "-1.49123"}}, "title": "Consultant Paediatric Haematologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916237381", "validThrough": "2020-11-15T23:59:59+0000"}