{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365-£37,890 pa"}}, "datePosted": "2020-10-31T14:47:24+0000", "description": "&lt;p&gt;&lt;span&gt;Community Learning Disability Physiotherapist – Band 6&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen to join our friendly, multi-disciplinary Learning Disability team at Derbyshire Healthcare NHS foundation Trust, providing a high standard of physiotherapy services to our local population in their own homes and care homes.&lt;/p&gt;\n&lt;p&gt;In line with the national challenges around COVID-19, we are looking to continue with the provision of skilled services to people with Learning Disabilities and/or ASD.&lt;/p&gt;\n&lt;p&gt;We are currently exploring how we can do this amid and post-COVID-19 and how we can continue to provide the best service we can to our community.&lt;/p&gt;\n&lt;p&gt;We are looking for a Physiotherapist with experience in Learning Disabilities to enter this new era with us. This is a perfect time to join the team!&lt;/p&gt;\n&lt;p&gt;The Learning Disability Community Support Team strives to provide forward-thinking, high-quality services, working in partnership with other agencies.&lt;/p&gt;\n&lt;p&gt;The postholder will report to the band 7 Clinical/Operational Managers in Physiotherapy and be a valuable member of a multi-disciplinary team, supporting colleagues across a wide range of services.&lt;/p&gt;\n&lt;p&gt;The role involves working with your own caseload and providing a holistic, health-based service. Reasonable adjustments are always a first consideration and if mainstream services are able to provide the therapy, we would advocate this to be the first service referred to.&lt;/p&gt;\n&lt;p&gt;Ours is a specialist service that would see the most highly-complex individuals, usually in their own homes.&lt;/p&gt;\n&lt;p&gt;Our ideal candidate will be well-motivated and enthusiastic to support service users with complex physical, sensory and behavioural impairments.&lt;/p&gt;\n&lt;p&gt;We’re looking for someone who is used to providing therapeutic activity and specialist equipment to people with physical and learning disabilities. It is also important to be comfortable and familiar with using positive behaviour support, sensory strategies and person-centred planning.&lt;/p&gt;\n&lt;p&gt;You will undertake assessments and provide specialist Physiotherapy to adults (16 years +) with Learning Disabilities who have complex communication needs. As well as resource for carers, the multi-disciplinary team and other care providers.&lt;/p&gt;\n&lt;p&gt;Therefore, you will need to effectively engage with your patients, peer groups, family and or carers in all elements of your role, leading by example and promoting a supportive and caring culture.&lt;/p&gt;\n&lt;p&gt;The post-holder will demonstrate a high level of clinical knowledge and skills and will have a varied clinical background, with at least 2 years’ experience, preferably including working in a community setting, postural care, hydrotherapy, rebound, etc.&lt;/p&gt;\n&lt;p&gt;This is a full-time, substantive post within the Community Learning Disability Physiotherapy team. However, part time hours may be considered and we encourage a healthy work/life balance.&lt;/p&gt;\n&lt;p&gt;We are keen to develop and progress every member of the team and therefore the post holder will be expected to also support colleagues with this.&lt;/p&gt;\n&lt;p&gt;Regular travel throughout the team locality is a requirement. Therefore, it is essential that you have the means to commit to this.&lt;/p&gt;\n&lt;p&gt;The successful applicant will enjoy the following benefits:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A competitive salary with regular pay reviews in line with Agenda for Change&lt;/li&gt;\n&lt;li&gt;Eligibility to join the NHS Pension Scheme&lt;/li&gt;\n&lt;li&gt;Generous holiday entitlement of 27 annual leave days, rising to 29 days after 5 years’ service and 33 days after 10 years’ service, plus bank holidays&lt;/li&gt;\n&lt;li&gt;Recognition of NHS and IAPT length of service relating to annual leave entitlement&lt;/li&gt;\n&lt;li&gt;Investment in training to support and develop you.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Join our CQC rated&lt;strong&gt; ‘GOOD’&lt;/strong&gt; Learning Disability service!&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please Note - The Derbyshire Healthcare NHS Foundation Trust is supporting the current Government guidelines regarding social distancing. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;With this in mind, all interviews are now conducted by video link using Microsoft Teams. Full details of our process will be given to shortlisted candidates when invited to interview. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For an informal discussion and/or visit please contact&lt;/p&gt;\n&lt;p&gt;Lijo Simon, MCSP, Clinical Operational Manager (Physiotherapy), 01332 640 500 / 07557 601706, lijo-jose.simon@nhs.net&lt;/p&gt;\n&lt;p&gt;or&lt;/p&gt;\n&lt;p&gt;Philip Toy, Clinical Operational Manager (Physiotherapy), 01629 531874 / 07769 645282, philip.toy@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121834.jpg", "name": "Derbyshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121834"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Derbyshire, Derby", "postalCode": "DE22 3LZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9167", "longitude": "-1.51329"}}, "title": "Band 6 Community Physiotherapist Learning Disabilities", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251141", "validThrough": "2020-11-15T23:59:59+0000"}