{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "14725", "minValue": "14725", "unitText": "YEAR", "value": "£8.76 Per Hour"}}, "datePosted": "2020-11-03T11:01:21+0000", "description": "&lt;p&gt;MALE SUPPORT WORKER - HOLLAND HOUSE&lt;/p&gt;\n&lt;p&gt;HOLLAND HOUSE, DENBIGH, LL16 3LG.&lt;/p&gt;\n&lt;p&gt;REF: #HH377&lt;/p&gt;\n&lt;p&gt;Salary: £8.76 per hour&lt;/p&gt;\n&lt;p&gt;Desirable/ Requirements: QCF Level 2 Health &amp; Social Care or willing to work towards&lt;/p&gt;\n&lt;p&gt;Hours of Work: 37.5 Hours per week.&lt;/p&gt;\n&lt;p&gt;Contract Type: Permanent.&lt;/p&gt;\n&lt;p&gt;Benefits of Working with us:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Meals Provided&lt;/li&gt;\n&lt;li&gt;On-site parking available&lt;/li&gt;\n&lt;li&gt;Free Eye Care Vouchers&lt;/li&gt;\n&lt;li&gt;Enhancement for Night Shifts&lt;/li&gt;\n&lt;li&gt;Work Place Pension with Legal &amp; General&lt;/li&gt;\n&lt;li&gt;Company Loan Programme&lt;/li&gt;\n&lt;li&gt;Enhanced payments for Bank Holidays&lt;/li&gt;\n&lt;li&gt;Comprehensive Learning &amp; Development Package&lt;/li&gt;\n&lt;li&gt;Progression Opportunities&lt;/li&gt;\n&lt;li&gt;We also offer Health &amp; Social Care QCF qualifications&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Company Funded Benefits: Free DBS check, Flu vaccination and Hepatitis B vaccination&lt;/p&gt;\n&lt;p&gt;About the Role: We have a vacancy for you to join an existing friendly team, supporting individuals with a learning disability to lead a full a meaningful life. You will have the opportunity to develop your skills, share your experiences and really make a difference to the lives of those we support.&lt;/p&gt;\n&lt;p&gt;If you are ready for an exciting and varied role where you may; assist someone to learn new skills this may be through local colleges or getting out and about visiting family and places of interest, enjoying hobbies, leisure interests and much more besides then we would like to hear from you.&lt;/p&gt;\n&lt;p&gt;It may be that you want a change, fresh start or just want to bring your skills to a new service, where at the same time you can benefit from support and guidance from the management team. There will be an opportunity for you to access our bespoke training package.&lt;/p&gt;\n&lt;p&gt;The ideal candidate for this post will have experience in learning disabilities and mental health issues (however this is not essential Within this role you will need an understanding of, medication procedures, safeguarding policies and procedures, motivation skills, be self-motivated, flexible and organised.&lt;/p&gt;\n&lt;p&gt;Skills: Strong communicator, creative, motivated, ability to cope in challenging situations, understand and support individuals to lead a good quality of life whilst achieving positive outcomes along the way.&lt;/p&gt;\n&lt;p&gt;About the Service: About the Service: Holland House and Holland Villas are a residential service based in the historic town of Denbigh. We are an 11 bedded home that offers independent living for young adults aged 18 + with a primary Mental Health diagnosis (functional).&lt;/p&gt;\n&lt;p&gt;The purpose of our services is to support our residents with everyday life such as, introduce and develop life skills such as managing finances, promoting independence, gaining work experience within the community, attending college courses, cooking, cleaning, communication, confidence building and companionship. Our aim to assist residents to step down to less support within the community.&lt;/p&gt;\n&lt;p&gt;We recruit staff that are willing to learn, have life skills and empathy and are able to put others first. You must be able to demonstrate compassion, patience and understanding. Have excellent listening skills and be able to encourage and motivate others.&lt;/p&gt;\n&lt;p&gt;Our existing team come with differing skills and personalities that meet the needs of the residents.&lt;/p&gt;\n&lt;p&gt;Equal Opportunities: MHC are an equal opportunities employer and welcome applications from all who believe they fit the essential requirements for this role regardless of their race, sex, disability, religion/belief, sexual orientation or age.&lt;/p&gt;\n&lt;p&gt;About MHC: We are committed to delivering the very best care within our health/social care services across England and North Wales. We provide a culture that empowers the people we work with - both individuals and colleagues - to fulfil their potential.&lt;/p&gt;\n&lt;p&gt;By working together, we develop pathways for individuals and colleagues that enable them to achieve positive outcomes. Likewise, we work together with families and carers too, so they are always fully involved in their loved one&#39;s care while they are with us.&lt;/p&gt;\n&lt;p&gt;How to Apply: Please complete the short application and upload your CV, alternatively for an informal discussion about this role you can contact MHC Workforce on 01824 572020.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;(We reserve the right to bring forward our closing date, without notice in the event of high volumes of interest).&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/131854.jpg", "name": "Mental Health Care (UK) Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=131854"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Lenten Pool, Denbighshire", "postalCode": "LL16 3LG"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.1831", "longitude": "-3.42304"}}, "title": "MALE SUPPORT WORKER - HOLLAND HOUSE", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253610", "validThrough": "2020-12-03T23:59:59+0000"}