{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 Per annum"}}, "datePosted": "2020-10-23T13:46:20+0100", "description": "&lt;p&gt;&lt;span&gt;We have a new vacancy for an enthusiastic RNLD to join our energetic and committed team to continue on the journey of developing and strengthening community support for adults with Learning Disabilities who may also be Autistic, present with mental ill-health and/or behaviour that challenges. Intensive Support Team works across Community Adult Learning Disability teams to support the on-going Transforming Care for people with a Learning Disability nationally.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Our purpose is to provide assessments and positive behavioural approaches /plans for people who are at risk of admission to specialist or mental health hospital or placement breakdown. This involves working with the individuals, providing modelling and training to provider care staff and/or family members, to achieve patient centered outcomes and support improvement in quality of life as much as possible. We may also support safe transitions between providers and work with inpatient services, the individual to facilitate successful discharge.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Clinical work is multi-disciplinary involving assessment of complex cases, formulation and provision of therapeutic interventions, including positive behavioural approaches as part of the multi-disciplinary care planning and delivery. Planning and directing and supervising associated work for HCAs and delivery of patient-centered training packages to care providers are also part of this rewarding role.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The role involves working in collaboration with Social Care, Specialist Commissioning and Specialist Care Providers. Intervention plans involve working alongside all these agencies, our Trust’s Community Learning Disability multi-disciplinary teams in Cornwall&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameKaren TaylorJob titleTeam ManagerEmail addresskaren.taylor55@nhs.netTelephone number01208 74146Additional contact information&lt;/p&gt;\n&lt;p&gt;additional contact&lt;/p&gt;\n&lt;p&gt;Georgina Samuels 01209204025&lt;/p&gt;\n&lt;p&gt;0r&lt;/p&gt;\n&lt;p&gt;Tracy Taylor 01872 221555&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120947.png", "name": "Cornwall Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120947"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Suite 7 Carew House, PL31 2QN, Bodmin", "postalCode": "PL31 2QN"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.472", "longitude": "-4.74269"}}, "title": "Community Learning Disability Nurse - Band 6", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240769", "validThrough": "2020-11-08T23:59:59+0000"}