{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "73195", "minValue": "39251", "unitText": "YEAR", "value": "£39,251 - £73,195 per annum"}}, "datePosted": "2020-11-05T10:31:16+0000", "description": "&lt;p&gt;This appointment is Health Board wide, with your principal base of employment being Glangwili General Hospital in Carmarthen, although other working locations including off site working may be necessary and will form part of your agreed job plan. This will be subject to change as the Health Board’s clinical requirements are amended to meet the needs of the service/patients.&lt;br /&gt;&lt;br /&gt;The post offers excellent opportunities to gain valuable experience in busy and supportive departments.&lt;br /&gt;&lt;br /&gt;We are able to provide you with excellent teaching and training, with a robust induction into the NHS processes and procedures. There is also a fully functional Clinical Skills laboratory on some of our sites to improve and enhance your skills. &lt;br /&gt;&lt;br /&gt;You will enjoy excellent conditions of employment, whilst building your future in one of the best locations in the UK. All our sites offer a relaxed lifestyle and picturesque countryside. We can offer you experience in modern General Hospitals in a rural setting. Overseas applicants should demonstrate a breadth and depth of experience comparable to that obtainable in the UK. Previous NHS Experience is desirable, but not essential. The Postgraduate Department has a fully developed programme of guest lectures, lunchtime and afternoon meetings, including special interest groups and co-ordinated intra-practice activities and career counselling. The library offers a wide ranging book collection, with interlibrary lending network, excellent IT facilities audio-visual and conferencing equipment.&lt;br /&gt;&lt;br /&gt;Hywel Dda University Health Board provides healthcare services to a total population of around 372,320 throughout Carmarthenshire, Ceredigion and Pembrokeshire. It provides Acute, Primary, Community, Mental Health and Learning Disabilities services via General and Community Hospitals, Health Centres, GP&#39;s, Dentists, Pharmacists and Optometrists and other sites. It also provides a range of services for people living in south Gwynedd and Powys. Integrated health boards are a key first step in creating a world class NHS in Wales.&lt;br /&gt;&lt;br /&gt;Primary care and community services are delivered through: 55 GP practices, 51 Dental practices, 100 Community pharmacies, 52 Optometry premises, 8 Community hospitals, 11 Health centres. Our in-hospital services are currently delivered through:4 Hospitals (Bronglais, Glangwili, Prince Philip, Withybush)&lt;/p&gt;\n&lt;p&gt;We have a highly successful peer mentoring programme, in which you are encouraged to take an active part.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Mr Sohail Moosa, Clinical Team Lead, Glangwili General Hospital, Dolgwilli Road, Carmarthen, SA31 2AF&lt;/p&gt;\n&lt;p&gt;01267 227514&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123194.gif", "name": "Hywel Dda University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123194"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Glangwili General Hospital, Carmarthen", "postalCode": "SA31 2AF"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.8675", "longitude": "-4.28474"}}, "title": "Specialty Doctor - Urology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257229", "validThrough": "2020-11-22T23:59:59+0000"}