{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum / pro rata"}}, "datePosted": "2020-10-23T09:00:51+0100", "description": "&lt;p&gt;We are a well established CAMHS Eating Disorder Service delivering high standards of care with an emphasis on continuous improvement. As a service we are working towards our QNCC accreditation and have won two national conference awards for our participation strategy and conference contributions. We invest in research and welcome participation throughout all of our service developments.&lt;/p&gt;\n&lt;p&gt;We are looking for a motivated nurse with a passion and interest for working with young people experiencing an eating disorder to join our team. Previously we have successfully employed a newly qualified nurse who is coming to the end of their preceptorship where they will be eligible to apply for a band 6. Due to the success of this we are committed to employ another band 5 nurse and offer support through preceptorship to obtain a band 6 role within the service.&lt;/p&gt;\n&lt;p&gt;In this role you will provide specialist assessment, treatment and care review to young people and families served by the Oxfordshire Child &amp; Adolescent Eating Disorder Service. You will take responsibility for triaging new referrals and managing urgent clinical calls, including risk, on a rotational basis.&lt;/p&gt;\n&lt;p&gt;You will be supported professionally by our new nursing lead in eating disorders and receive expert clinical supervision. We are also looking forward to welcoming a nursing associate within the service and the post holder will have some responsibility for supporting them in their training. There will be many opportunities to be supported but also to grow and develop in your nursing career.&lt;/p&gt;\n&lt;p&gt;Full training in the core Eating Disorder NICE con-concordant treatments will be available with supervision specific to treatment also in place.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameAnnie FarrellyJob titleDeputy Team ManagerEmail addressanne.farrelly@oxfordhealth.nhs.ukTelephone number01865 904708&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Oxford Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122233"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Raglan House, Oxford", "postalCode": "OX4 3LX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7332", "longitude": "-1.21271"}}, "title": "CAMHS Eating Disorder Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916239750", "validThrough": "2020-11-08T23:59:59+0000"}