{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum"}}, "datePosted": "2020-10-09T17:30:32+0100", "description": "&lt;p&gt;CONSULTANT GASTROENTEROLOGIST&lt;/p&gt;\n&lt;p&gt;Nottingham University Hospitals is one of the largest tertiary NHS Trusts in the country and is a referral centre for the Mid Trent Cancer Network, which covers a population of over 2 million. An exciting opportunity has arisen to join our cohesive and progressive gastroenterology and hepatology department which has a strong clinical and academic national profile (nddcbru.org.uk).&lt;/p&gt;\n&lt;p&gt;The appointee will be fully trained in the management of patients with acute and chronic gastroenterological conditions and in managing acute GI emergencies, including GI bleeding, and able to contribute to the acute GI on-call service at the Queen’s Medical Centre (QMC) and Nottingham City Hospital (NCH) campus, currently as part of a 1:14 consultant-led, specialist nurse and registrar supported, 24 hour rota. The full-time post is based on a 10 Programmed Activity (PA) job plan which does not include general medicine.&lt;/p&gt;\n&lt;p&gt;Opportunities to sub-specialise and further develop skills post-CCT will be supported by our team of 22 gastroenterologists (12 NHS and 10 academic) and 9 hepatologists. As a group we are actively transforming the way we deliver Gastroenterology services, building on existing strong collaborations with our community colleagues through the ICS with the primary goal to improve patient experience and outcomes.&lt;/p&gt;\n&lt;p&gt;Please contact us early to discuss working in Nottingham, how we can support your specific areas of interest and further your career in Gastroenterology.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Emilie Wilkes, Head of Service for Gastroenterology, email, emilie.wilkes@nuh.nhs.uk, Telephone 07812 275751&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122234.jpg", "name": "Nottingham University Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122234"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Nottingham University Hospitals NHS Trust, Nottingham", "postalCode": "NG5 1PB"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9893", "longitude": "-1.16006"}}, "title": "Consultant Gastroenterologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916221295", "validThrough": "2020-11-06T23:59:59+0000"}