{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 to £44,503 pa"}}, "datePosted": "2020-11-05T12:30:21+0000", "description": "&lt;p&gt;&lt;span&gt;South Central Ambulance Service NHS Foundation Trust (SCAS) covers the counties of Hampshire, Berkshire, Oxfordshire and Buckinghamshire, an area of c. 4,600 sq miles with a resident population of approximately four million.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;To help cover an increasing need for the provision of driver training the Trust has a number of vacancies for fully qualified Emergency Response Instructors to work in an Education Manager – Driving (Bank Agreement) role. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The position can be located within any Division and the successful applicant will work as part of the Human Resources Directorate within the Education Centres, liaising closely with the Head of Education, Senior Education Manager – Driving, other Education Managers – Driving, the Driving Standards Manager and Operational Managers throughout the Trust.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Trust has Education Centres in Buckinghamshire, Hampshire, Berkshire and Oxfordshire and the post will require some Saturday working.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The post holder will provide leadership to students and staff and will support the management team and other Driving Educators and will be responsible for the provision of driver training on all vehicles within the Trust. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Other duties include responsibility for the promotion, enhancement and evaluation of long-term education and development needs in relation to driving, with particular reference to Road Traffic Law, the Road Safety Act 2006, Accident Prevention, Audit and the Corporate Governance agenda. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This is a key role and offers an exciting opportunity for someone with enthusiasm and dedication to the raising of standards.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;The successful applicant will hold a valued place in the Human Resources Directorate during a tremendously challenging and exciting time for the Trust.  &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The successful candidate will have excellent communication skills, both written and verbal are essential as the successful candidate will be required to liaise with a number of contacts both internally and externally.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Shortlisted candidates will be required to attend a panel interview and assessment process.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Please note, due to the nature of this agreement, this position is for fully qualified IHCD/DERADI instructors only that are currently able to deliver on the Futurequals L3 CERAD course.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;For an informal discussion about the role please contact&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Nick Lambert, Senior Education Manager – Driving &amp; Commercial on 07500 127045.&lt;/span&gt;&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122412.jpg", "name": "South Central Ambulance Service", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122412"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Newbury, Bicester &amp; Southampton", "postalCode": "RG14 7RW"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3824", "longitude": "-1.33544"}}, "title": "Education Manager - Driving (Bank)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257660", "validThrough": "2020-11-19T23:59:59+0000"}