{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "42295", "minValue": "38376", "unitText": "YEAR", "value": "£38,376.00 - £42,295.50 per annum"}}, "datePosted": "2020-10-28T10:51:21+0000", "description": "&lt;p&gt;&lt;span&gt;&lt;strong&gt;Huntercombe Hospital Maidenhead&lt;/strong&gt; is the UKs largest specialist Hospital for inpatient &lt;strong&gt;CAMHS&lt;/strong&gt;, serving&lt;strong&gt; NHS&lt;/strong&gt; funded patients, and these positions present an opportunity to work with a leading team in child and adolescent mental health. We support young people who are experiencing significant mental health difficulties requiring inpatient admission. We have a total of 60 beds across four wards: &lt;strong&gt;2 PICU wards (Psychiatric Intensive Care), one GAU (General Adolescent Unit), and one Specialist Eating Disorder Ward&lt;/strong&gt;. We have recently been rated as “good” by CQC and “good” by Ofsted.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We would be delighted to speak to you If you’ve previously worked for the&lt;strong&gt; NHS&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;&lt;/span&gt;&lt;span&gt;The Huntercombe group is one of the country’s leading specialist healthcare providers, with hospitals and centres throughout England and Scotland, delivering wide-ranging services in adult mental health and learning disabilities, specialist brain injury, and child and adolescent mental health services (CAMHS) including services for those with eating disorders and social care for children with additional needs. Our aspiration is to nurture the world, one person at a time and that’s why everything we do is designed to provide the best care and recovery for our patients and residents.&lt;br /&gt;&lt;br /&gt;We currently have two vacancies:&lt;br /&gt;Tamar Ward is a 10-bed GAU for both male and female patients aged 12-18. Tamar supports young people detained under the Mental Health Act as well as informal patients who are experiencing periods of distress which cannot be safely managed in a community CAMHS setting. The MDT provides assessment, formulation and intervention until young people can safely step-down to a community setting.&lt;br /&gt;&lt;br /&gt;Kennet Ward is a 20-bed specialist Eating Disorder Unit for young people aged 12–18 years set within a converted historic Manor House. Kennet runs a treatment program for young people with Anorexia Nervosa and other restrictive eating disorders (e.g. Atypical Anorexia Nervosa, some cases of Avoidant/Restrictive Food Intake Disorder (ARFID)). On our ward we aim to support young people to return to a healthy weight and empower them and their families to continue their recovery at home with an understanding of the factors contributing to their illness.&lt;br /&gt;&lt;br /&gt;We are seeking to recruit a highly motivated, innovative Clinical or Counselling Psychologist to join our well-established therapies team. Currently we comprise Clinical and Counselling Psychologists, Assistant Psychologists, Family Therapists and Systemic Practitioners, Dieticians, Physiotherapists, Creative Therapists, and Occupational Therapists and would like to hear from individuals who would welcome opportunities to work with us to provide the best possible care for our young people.&lt;br /&gt;&lt;br /&gt;The successful applicant will be a Clinical or Counselling Psychologist and will be keen to apply their existing skills to working in a Tier 4 setting with young people and their families. They will be interested in the application of evidence-based approaches to our population and keen to engage in evidence-generating practice. The applicant will value working as part of a multi-disciplinary team (MDT) and will understand the importance of working alongside MDTs to achieve the best possible outcomes for young people.&lt;br /&gt;&lt;br /&gt;We are seeking to recruit a practitioner who has demonstrable skills in engaging individuals in and working in a person-centred way to support them in achieving their goals. The applicant will recognise the value of group and individual therapy in achieving these aims, as well as working with the wider MDT to ensure that a shared formulation is held in young people’s professional networks both within and outside the hospital. The successful applicant will have a strong commitment to advocating for young people and families and ensuring that their needs and wishes remain at the centre of their care plans.&lt;br /&gt;&lt;br /&gt;The post-holder will be expected to work at an appropriate level of autonomy alongside senior members of the team and be involved in day-to-day decision making on the ward.&lt;br /&gt;&lt;br /&gt;We are recruiting for a full-time (37.5 hours per week) position but would consider applicants with a preference for part-time hours.&lt;br /&gt;&lt;br /&gt;We are seeking to recruit an individual who is committed to improving the well-being of young people and families as well as their colleagues.&lt;span&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;&lt;strong&gt;&lt;br /&gt;&lt;/strong&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;&lt;strong&gt;In return we can offer you:&lt;/strong&gt;&lt;br /&gt;• The chance to work with innovative, passionate teams who value Psychology and are committed to achieving the best possible outcomes for those in their care&lt;br /&gt;• An organisation committed to offering CPD opportunities to its staff and developing them in their roles&lt;br /&gt;• A thorough induction programme tailored to the ward and hospital&lt;br /&gt;• Clear pay structure, with competitive rates&lt;br /&gt;• Generous annual leave entitlement&lt;br /&gt;• Sick pay of 4 weeks full pay and 4 weeks half pay&lt;br /&gt;• The opportunity to participate in a company contributory pension scheme with up to 3% matching contributions&lt;br /&gt;• Maternity leave at 3 months full pay and 3 months half pay&lt;br /&gt;• 2 weeks paid paternity leave&lt;br /&gt;• Shared parental leave, matching the maternity leave benefit&lt;br /&gt;• Death in service benefit equivalent to 2 x salary&lt;br /&gt;• A range of staff discounts&lt;br /&gt;• Opportunities for training and development&lt;br /&gt;• Employee Assistance Programme (EAP)&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/130001.jpg", "name": "The Huntercombe Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130001"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Taplow, near Maidenhead &amp; Slough", "postalCode": "SL6 0PQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5188", "longitude": "-.659092"}}, "title": "CAMHS Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246182", "validThrough": "2020-11-29T23:59:59+0000"}