{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24926", "minValue": "23521", "unitText": "YEAR", "value": "£23,521 - £24,926 per annum inclusive of HCAS"}}, "datePosted": "2020-11-04T15:16:56+0000", "description": "&lt;p&gt;Moorfields Eye Hospital invites applications for the post of Outpatient Clinic Co-coordinator based at Moorfields Eye Clinic in Croydon University Hospital and Purley war Memorial Hospital. This post will also require some travel to Moorfields Eye Hospital in City Road, London for training purposes.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;You will be required to provide high quality clerical and administrative support as a member of one of our administrative teams. You will act as first point of contact for all patients, both in a busy outpatient environment and in the administrative offices. We are passionate about delivering an excellent service to patients and you will play a crucial role in achieving this. Reception duties include: meeting and greeting patients on arrival to the hospital, checking patients into the appropriate clinics using the Trust patient administration system, booking clinic appointments, and accurate recording of patient data. Additional administrative duties include: ensuring clinics are booked to profile, answering queries (by telephone and in person), filing, faxing, and supporting the Team Leaders &amp; Clinic Manager with clinic cancellations and other administrative duties.&lt;/p&gt;\n&lt;p&gt;You will have good interpersonal skills, a polite and courteous manner and a professional attitude. You will have effective verbal and written communication skills and will enjoy working as a member of a team. You will be able to cope under pressure in a busy working environment. Accuracy and attention to detail are essential, as are basic computer skills, although training will be provided on in-house systems.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This post will be subject to a probationary period of 6 months. During the probationary period, your suitability for continued employment will be assessed and provided a satisfactory standard is achieved and provided a satisfactory standard is achieved and maintained, your employment will be confirmed. The probationary period may be extended or your employment terminated either during or at the end of probation, in line with the trust Probationary Policy. For the duration of the probation period, the notice period will be in line with contractual obligations on either side.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;We reserve the right to expire vacancies prior to the &lt;span&gt;advert&lt;/span&gt;ised closing date once a sufficient number of applications have been received. You are advised not to delay submitting your completed application&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameChris MorrisonJob titleDeputy Team LeaderEmail addressChristopher.morrison5@nhs.netTelephone number0208 401 3000 Ext5209&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Moorfields Eye Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121181"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Croydon University Hospital, Croydon and Purley", "postalCode": "CR7 7YE"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3891", "longitude": "-.108758"}}, "title": "Outpatient Clinic Co-Ordinator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256410", "validThrough": "2020-11-15T23:59:59+0000"}