{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683"}}, "datePosted": "2020-10-10T23:40:54+0100", "description": "&lt;p&gt;Heartlands Liaison with Substance Misuse.&lt;/p&gt;\n&lt;p&gt;We are looking for a full time Consultant medical colleague to work within the Liaison Psychiatry team, in the &lt;strong&gt;Heartlands Hospital&lt;/strong&gt;. This is to compliment the range of clinicians we have within the team. The Liaison Psychiatry team is run by the Birmingham and Solihull Mental Health team which holds the contractual arrangement for running the Liaison Psychiatry service in all the General hospitals in Birmingham and Solihull. We are looking for someone who is comfortable with the concept of All age Liaison Psychiatry service as well as in the field of Substance Misuse.&lt;/p&gt;\n&lt;p&gt;Heartlands Hospital is a multispecialty hospital with an ED and multiple specialist services including Elderly Medicine, Renal Medicine, surgery, Obstetrics. It has about 600 beds for acute sector and has an established Liaison Psychiatry team with multidisciplinary input, based in the hospital. We are looking to recruit to an established post but configured differently.&lt;/p&gt;\n&lt;p&gt;The post holder will be accountable for the support to provision of psychiatric services through the comprehensive assessment, diagnosis, treatment and discharge planning of patients, referred through - Liaison Psychiatry multi-disciplinary team;&lt;/p&gt;\n&lt;p&gt;The post holder will work alongside existing – Liaison psychiatry consultant colleagues, the Service Manager and Team Manager, and will be expected to establish positive communication channels with colleagues within both BSMHFT and the Acute hospital Clinicians and contribute to further development of the service.&lt;/p&gt;\n&lt;p&gt;*Job plan will be negotiated to ensure enough time for cover of other commitments in conjunction with existing commitments.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDhruba BagchiJob titleConsultant Psychiatrist/Clinical DirectorEmail addressdhruba.bagchi@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Birmingham and Solihull Mental Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120844"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Heartlands Hospital, Birmingham", "postalCode": "B9 5SS"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4802", "longitude": "-1.82996"}}, "title": "Consultant Psychiatrist Liaison with Substance Misuse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916221414", "validThrough": "2020-11-08T23:59:59+0000"}