{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 p.a. +L.W."}}, "datePosted": "2020-10-16T13:45:59+0100", "description": "&lt;p&gt;Royal Free London NHS Foundation TrustConsultant Vascular Surgeon (with interest in Peripheral Arterial Disease) - &lt;em&gt;10 PAs per week, permanent&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;The Royal Free London NHS Foundation Trust is delighted to offer this unique opportunity for a vascular surgical specialist to join our dynamic team of 15 consultant vascular surgeons that provide care both for the local population, the wider North-Central London area and beyond.&lt;/p&gt;\n&lt;p&gt;Our Vascular Unit has a major national and international profile as a result of its portfolio of complex vascular specialty services delivered on the Royal Free Site as well as its proximity to a number of super-specialist surgical centres. The Royal Free is the hub for Vascular services for North Central London working alongside spokes at UCLH, the North Middlesex and the Whittington, and with affiliations at Great Ormond Street, The Royal National Orthopaedic Hospital and The National Hospital for Neurology and Neurosurgery. &lt;br /&gt;&lt;br /&gt;The successful candidate will participate in the General Vascular Surgical Consultant On-call rota which comprises a 1:12 for first on call and a 1:12 for second on call. The applicant must be able to demonstrate a broad experience in elective and acute vascular surgery, with a particular emphasis on peripheral arterial disease. &lt;br /&gt;&lt;br /&gt;Candidates must have demonstrable experience in the specialty and be on the GMC specialist register (or be within six months of gaining specialist registration at the time of interview).&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Fiona Myint&lt;/p&gt;\n&lt;p&gt;Job title: Consultant Vascular Surgeon&lt;/p&gt;\n&lt;p&gt;Email address: fiona.myint@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120624.jpg", "name": "Royal Free London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120624"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Free, London", "postalCode": "NW3 2QG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5532", "longitude": "-.165298"}}, "title": "Consultant in Vascular Surgery", "url": "https://www.jobs.nhs.uk/xi/vacancy/916230440", "validThrough": "2020-11-12T23:59:59+0000"}