{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "49036", "minValue": "49036", "unitText": "YEAR", "value": "49,036"}}, "datePosted": "2020-10-30T11:46:14+0000", "description": "&lt;p&gt;The Emergency Department in Leicester is inviting applications for Medical Education Fellows from highly motivated higher specialty Emergency Medicine trainees with a desire to influence the delivery of Medical Education. We have adult positions available, this fixed one-year position has a 50% Medical Education 50% clinical split throughout the year.&lt;/p&gt;\n&lt;p&gt;Leicester Emergency Department is the home of EM3.org.uk (#EM3) and has a forward thinking multi-modality, multi-disciplinary approach to Emergency Medicine Education. The Education fellows hold pivotal roles within the ED’s multi-disciplinary education team and are involved in all aspects of the Department’s Education strategy. These include: simulation (in-situ and simulation suite), shop floor teaching, CBD clinics virtual learning, FOAMED, FOANED, practical skills, induction, regional and local teaching programmes and much more.&lt;/p&gt;\n&lt;p&gt;Most fellows complete the post with: a fully funded Postgraduate Certificate in Medical Education, having attended (many have presented) at multiple national and regional conferences, a publication, multiple posters and often some sort of national or regional prize!&lt;/p&gt;\n&lt;p&gt;The ED has a clear Education vision aligned with the UHL Educational Strategy under the direction of the Medical Director and Associate Medical Director for Education. We are currently developing the educational plan for the next 3 years which will offer plenty of opportunity for Educational QIPs and personal projects. There ED Education team also includes an Education Administrator and a Multimedia technologist who support the team (and work closely with the fellows).&lt;/p&gt;\n&lt;p&gt;The clinical element is at Registrar level (applicants must have completed CT3 by August 2020) and requires doctors with excellent clinical leadership skills to work in our new (opened April 2017) state of the Art Emergency Department.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameAlexandra DixonAdditional contact information&lt;/p&gt;\n&lt;p&gt;Alexandra Dixon&lt;/p&gt;\n&lt;p&gt;Medical Staffing, Recruitment Lead for ED&lt;/p&gt;\n&lt;p&gt;Leicester Royal Infirmary&lt;/p&gt;\n&lt;p&gt;LE1 5WW&lt;/p&gt;\n&lt;p&gt;0116 258 5646&lt;/p&gt;\n&lt;p&gt;Alexandra.dixon@uhl-tr.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120651.jpg", "name": "University Hospitals of Leicester", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120651"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Leicester Royal Infirmary, Leicester", "postalCode": "LE1 5WW"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6278", "longitude": "-1.13479"}}, "title": "Emergency Medicine Medical Education OOPE", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250016", "validThrough": "2020-11-13T23:59:59+0000"}