{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum"}}, "datePosted": "2020-11-02T16:16:35+0000", "description": "&lt;p&gt;&lt;strong&gt;**Previous applicants need not apply**&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Advanced Nurse Practitioner – Urgent Care/Walk in Centre&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Do you want to be part of a successful, progressive Urgent Care Team? we want to hear from you!&lt;/p&gt;\n&lt;p&gt;This is an Exciting time to join one of the most successful Urgent Care Teams within Greater Manchester. As part of Integration agenda along with recent investment we are co-locating our local Walk in centre onto the Hospital campus adjacent to our ED in order to improve flow and patient experience.&lt;/p&gt;\n&lt;p&gt;We are looking for highly motivated, committed and enthusiastic Advanced Practitioners who are passionate about delivering high quality compassionate care within Urgent Care. You will need to be equipped with excellent interpersonal and leadership skills. You should be an enthusiastic, innovative, highly motivated Senior Nurse/Practitioner leader to fulfil this exciting role.&lt;/p&gt;\n&lt;p&gt;Working within the framework of the advanced practitioner, your key role will be to ensure clinical quality standards are achieved by providing inspirational and visible clinical leadership to the nursing and medical teams working within the Emergency Department. Successful candidates will be comfortable working autonomously when making decisions relating to patient care. You will ideally have experience within an urgent care or walk in centre setting and your high standards of patient care will naturally inspire those you work with.&lt;/p&gt;\n&lt;p&gt;This is a great opportunity to join a dedicated, successful, and friendly team, in a time of exciting service development, whilst providing care that will really make a difference, by working within a caring, compassionate service who truly put the patients at the forefront of everything they do&lt;/p&gt;\n&lt;p&gt;Having the qualifications and ability to see both adults and children would be particularly advantageous.&lt;/p&gt;\n&lt;p&gt;Everyone matters at Tameside and Glossop - in return for your valued service we will support your work-life balance with flexible and agile working options.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Daniel White – Emergency Department Matron (Operational) - Daniel.White@tgh.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Tameside and Glossop Integrated Care NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121286"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Tameside Hospital, Ashton under Lyne", "postalCode": "OL6 9RW"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4919", "longitude": "-2.07155"}}, "title": "Advanced Nurse Practitioner - Walk in Centre", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252796", "validThrough": "2020-11-30T23:59:59+0000"}