{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum pro rata"}}, "datePosted": "2020-10-26T12:16:18+0000", "description": "&lt;p&gt;Note: The job title will be prefixed with ‘Student’ until accreditation as a HEMS Paramedic is agreed by EEAST.&lt;/p&gt;\n&lt;p&gt;To work as a member of the Air Ambulance team utilising ground response vehicles or helicopters providing a primary enhanced care response to the scene of an incident and where necessary supporting safe in-transit care en-route to hospital, on behalf of the NHS ambulance service.&lt;/p&gt;\n&lt;p&gt;To work as a member of the team, utilising a ground ambulance or helicopter to provide critical care transfer and, on occasions, retrieval services between hospitals or other facilities.&lt;/p&gt;\n&lt;p&gt;To work competently, under supervision where necessary and appropriate, in the role of the Specialist Paramedic (Critical Care), within the HCPC Standards of Conduct Performance and Ethics, and Standards of Proficiency, College of Paramedics competency and curriculum frameworks; and EEAST / Charity Standard Operating Procedures providing clinical care to critically ill or injured patients.&lt;/p&gt;\n&lt;p&gt;To undertake all required training, education and development activity in relation to the post and to meet the needs of the service.&lt;/p&gt;\n&lt;p&gt;To support the education and development of the wider clinical team.&lt;/p&gt;\n&lt;p&gt;The post holder will be required to participate in the staffing of the Critical Care Desk based in EOC, which may include (but not limited to) interrogation of calls and directing dispatch of critical care resources to the most appropriate incidents (air and land resources) and collating details on availability of critical care and specialist capacity within the region’s acute Hospital.&lt;/p&gt;\n&lt;p&gt;Positions are available at the following location:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Cambridge&lt;/li&gt;\n&lt;li&gt;Wyton&lt;/li&gt;\n&lt;li&gt;Norwich&lt;/li&gt;\n&lt;li&gt;North Weald&lt;/li&gt;\n&lt;li&gt;Earls Colne&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Rob Riches&lt;/p&gt;\n&lt;p&gt;Clinical Lead Trauma and Critical Care&lt;/p&gt;\n&lt;p&gt;07825963855&lt;br /&gt;&lt;br /&gt;rob.riches@eastamb.nhs.uk&lt;/p&gt;", "employmentType": "OTHER", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120792.jpg", "name": "East of England  Ambulance Service Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120792"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "3 vacancies at Norwich and 3 at Cambridge, Cambridge and Norwich Airbase", "postalCode": "MK41 0RG"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1524", "longitude": "-.416922"}}, "title": "HEMS Paramedic", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242364", "validThrough": "2020-11-30T23:59:59+0000"}