{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum"}}, "datePosted": "2020-10-23T14:46:06+0100", "description": "&lt;p&gt;&lt;strong&gt;Are you a Consultant Psychiatrist who is dedicated and passionate about improving mental health services? Are you looking for your next role as a dynamic clinical leader in Acute Inpatient Psychiatry?&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;As the full time inpatient consultant on Juniper Ward, you will provide medical leadership to a multi-disciplinary team on an 18-bed inpatient male and female ward based within the Long Fox Unit at Weston General Hospital.&lt;/p&gt;\n&lt;p&gt;Juniper ward uses evidence based therapeutic interactions with a multi-disciplinary approach. Inpatient treatment is provided 24/7 for people with mental health problems and supports service users experiencing an acute psychiatric crisis of such severity they cannot be managed at home with the involvement of the intensive team.&lt;/p&gt;\n&lt;p&gt;The ward aims to provide care for adults in an inpatient setting, building on the patients’ strengths, maintaining levels of independence and promoting well-being.&lt;/p&gt;\n&lt;p&gt;North Somerset Mental Health has a forward thinking and inclusive medical community, committed to medics being at the forefront of making changes for the better. We are passionate about your development and helping you to achieve your career aspirations, with a pledge to protected time for Supporting Professional Activities sessions (2.5 PA in the first year).&lt;/p&gt;\n&lt;p&gt;You will be encouraged and supported to be involved in service leadership and management. We offer one of the most competitive and flexible benefits packages.&lt;/p&gt;\n&lt;p&gt;The role is currently supported by full time Trust Grade, Core Trainee and Foundation Year doctors, with plans to develop a non-medical prescriber/AC post in the next year, to work alongside the consultant, significantly reducing consultant workload.&lt;br /&gt;&lt;br /&gt;North Somerset is located at the gateway to the South West and offers the best of seaside and country living combined with the benefits of being close to the vibrant cities of Bristol, Bath and Exeter.&lt;/p&gt;\n&lt;p&gt;It has easy travel routes to Devon, Cornwall, South Wales, London and beyond via the M4 and M5, a central train station in Weston-Super-Mare and several smaller stations across the area and is situated close to Bristol International Airport.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Dr Iwona Kolsut, Medical Lead, Tel: 01275 335300&lt;/p&gt;\n&lt;p&gt;Emmy Watts, Operations Manager, Tel: 01934 523696&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121159.jpg", "name": "Avon and Wiltshire Mental Health Partnership NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121159"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Long Fox Unit, Weston-super-Mare", "postalCode": "BS23 4TS"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3229", "longitude": "-2.97333"}}, "title": "Consultant Psychiatrist - Acute Inpatient", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240993", "validThrough": "2020-11-09T23:59:59+0000"}