{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30600", "minValue": "30600", "unitText": "YEAR", "value": "Up to £30,600 FTE - dependent on experience"}}, "datePosted": "2020-11-06T09:00:20+0000", "description": "&lt;h1&gt;&lt;strong&gt;Make a difference!&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;Prisons are one of the most challenging, yet rewarding places for healthcare professionals to work - if you’re looking for a role where you can develop your existing skills and learn something new every day, then this is the place to be.&lt;br /&gt; &lt;br /&gt; Practice Plus Group are Health in Justice Market leader, providing healthcare services to offenders across the country. Our model of care is our Wellbeing Approach – an integrated, comprehensive approach in recognition of the fact prisoners are a socially-excluded group with healthcare needs which are complex and often associated with poor outcomes. It adopts the premise no single health/wellbeing factor can be taken in isolation of other motivational issues which might impact a person’s care.&lt;br /&gt; &lt;br /&gt; HMP Bure is a category C male prison built on part of the former RAF Coltishall site, 7 miles north of Norwich. The prison was constructed throughout 2009 and currently holds 650+ prisoners. HMP Bure has residential units and a full healthcare unit.&lt;/p&gt;\n&lt;p&gt;To ensure the continued quality of care at HMP Bure, we’re looking for a Primary Care Nurse to support us and the existing team.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h1&gt;&lt;strong&gt;What we can offer you…&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;A salary of up to £30,600 per annum FTE - dependent on experience.&lt;/p&gt;\n&lt;p&gt;Company contributory pension scheme.&lt;/p&gt;\n&lt;p&gt;Clinical development opportunities in specialist roles of your interest , such as CBT, ANP, BBV, sexual health, ILS (intermediate life support), health promotion, RCGP and long term condition courses.&lt;/p&gt;\n&lt;p&gt;Free uniform, free mandatory training, indemnity cover, CPD and re-validation support.&lt;/p&gt;\n&lt;p&gt;25 days annual leave plus 8 public bank holidays (pro-rata for part-time), plus other benefits including cycle to work scheme and clinical development opportunities.&lt;/p&gt;\n&lt;p&gt;Cycle to work scheme as well as online retail discounts and other onsite benefits.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h1&gt;&lt;strong&gt;How will we support you…&lt;/strong&gt;&lt;/h1&gt;\n&lt;ul&gt;\n&lt;li&gt;Bespoke induction&lt;/li&gt;\n&lt;li&gt;Competency framework&lt;/li&gt;\n&lt;li&gt;Preceptorship (newly qualified practitioners)&lt;/li&gt;\n&lt;li&gt;Regular clinical supervision&lt;/li&gt;\n&lt;li&gt;Supported development into specialties such as diabetes or asthma&lt;/li&gt;\n&lt;li&gt;Regional and national career development opportunities&lt;/li&gt;\n&lt;li&gt;Our bespoke Learning Management System to address your learning needs&lt;/li&gt;\n&lt;li&gt;Support from the wider team&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h1&gt;&lt;strong&gt;&lt;br /&gt; &lt;/strong&gt;&lt;strong&gt;What we need from you…&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;As a Registered Nurse you’ll be an integral part of the multi-disciplinary healthcare team by bringing your top notch clinical skills and passion for care.&lt;br /&gt; &lt;br /&gt; With plenty of primary care experience, you could be involved in anything from developing and leading clinics (wellman, health promotion), undertaking examinations and tests as well as answering emergency bells and potentially being the first person to attend an emergency.&lt;br /&gt; &lt;br /&gt; If you have a passion for bringing new ideas to the table then we’re here to listen on how we can improve and continue to develop our healthcare service within the prison environment.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h1&gt;&lt;strong&gt;Next steps&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;If you are shortlisted, you will be contacted by the Internal Recruiter for this role. The recruiter will submit your CV to the hiring manager and in turn will arrange an interview for you to attend if the hiring manager feels that you are suitable for the job.&lt;br /&gt; &lt;br /&gt; For more information, please contact us on the details provided.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h1&gt;&lt;strong&gt;More information&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;This is a full-time role working 37.5 hours per week. Healthcare operates 7 days a week.&lt;br /&gt; We also welcome part-time applications.&lt;br /&gt; &lt;br /&gt; Please note that offers of employment are subject to Practice Plus Group Terms &amp; Conditions and receipt of satisfactory references, an enhanced DBS check and prison vetting.&lt;br /&gt; &lt;br /&gt; &lt;strong&gt;&lt;em&gt;At Practice Plus Group we actively promote diversity and equal opportunities.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Practice Plus Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130136"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Norwich", "postalCode": "NR10 5GB"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.756", "longitude": "1.30738"}}, "title": "Primary Care Nurse - HMP Bure", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258949", "validThrough": "2020-11-20T23:59:59+0000"}