{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 per annum"}}, "datePosted": "2020-11-02T13:16:33+0000", "description": "&lt;p&gt;A new and exciting role has become available within our Children’s Community Nursing Team for a dynamic, enthusiastic and innovative Registered Children’s Nurse with an enjoyment and flare for facilitating Nurse education and carer training.&lt;/p&gt;\n&lt;p&gt;Our Service provides nursing care and interventions for children and young people from the age of 0-18yrs including Acute nursing needs, Chronic and complex healthcare needs case management, Palliative and End of Life Care, Respite Nursing, and Special School Nursing.&lt;/p&gt;\n&lt;p&gt;We are looking for someone to join our team as a clinical educator. As an integral member of the Training and Education team, you will take responsibility for the day to day coordination of training for external care providers, and for education and development of all staff within the CCN Service. You will ensure timely and appropriate delegation of training requests and support, plan and deliver an on-going education programme for internal staff and students.&lt;/p&gt;\n&lt;p&gt;You will be required to have exceptional organisational skills and the ability to work autonomously, and as part of a team, to deliver high standards of evidence based training and quality nursing care to the children and young people on our caseload in their homes and within a variety of community settings across Oxfordshire.&lt;/p&gt;\n&lt;p&gt;In addition to this you will have opportunity to undertake shifts as duty nurse for the Single Point of Access (SPA) and partake in the Acute and Palliative and End of Life care rotas.&lt;/p&gt;\n&lt;p&gt;We invest in our staff and provide excellent opportunities for professional development. If this sounds like the role for you please get in touch.&lt;/p&gt;\n&lt;p&gt;Part-time hours conidered.&lt;/p&gt;\n&lt;p&gt;Own car or access to alternative travel for business use is essential.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Cheryl Crawford&lt;/p&gt;\n&lt;p&gt;01865 902700&lt;/p&gt;\n&lt;p&gt;07920 235704&lt;/p&gt;\n&lt;p&gt;Cheryl.Crawford@oxfordhealth.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Oxford Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122233"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Oxford", "postalCode": "OX4 3LX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7332", "longitude": "-1.21271"}}, "title": "Clinical Educator - Children&#39;s Community Nursing", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252205", "validThrough": "2020-11-23T23:59:59+0000"}