{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "35612", "minValue": "28588", "unitText": "YEAR", "value": "£28,588 - £35,612 per annum pro rata"}}, "datePosted": "2020-11-05T14:46:35+0000", "description": "&lt;p&gt;&lt;span&gt;We welcome and encourage applications from everyone, including groups currently underrepresented in our workforce and pride ourselves as being an employer of choice.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;To find out more about how we champion diversity and inclusion in the workplace, visit PHE Website &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;On 18 August 2020, the Secretary of State for Health and Social Care announced plans to establish the National Institute for Health Protection and consult on the best future options for strengthening health improvement and other public health functions in the wider system. Public Health England and many of its employees will be in scope for transition to new organisations in Spring 2021. Any new or current employees working for Public Health England during this time, will receive appropriate communications and consultation prior to any formal transfer taking place.  Employees who compulsorily transfer to successor bodies will remain on their existing contractual terms and conditions and this applies both to current employees and those recruited during the transition.  The recruitment, growth &amp; development of our workforce is vital for the continuing success of PHE and the future National Institute for Health Protection.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;&lt;br /&gt;Multiple exciting opportunities have arisen for an experienced scientist to support the evaluation of immune responses to existing and novel vaccines, with specific focus on Group B Streptococcus and SARS-CoV-2. Two positions will sit within the Pathogen Immunology Group and one within the Immunoassay Group, all based at Public Health England, Porton Down. &lt;/span&gt;&lt;span&gt;The post requires a graduate level scientist with additional lab experience who would be prepared to support various projects within each of the two groups. This work will involve working closely with the Project Team Leaders and other scientists within the groups to ensure that the objectives of the projects are met within the required timelines. &lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;Candidates should have experience performing immunological assays and/or expertise in protein purification techniques. &lt;/span&gt;&lt;span&gt;Experience of working at ACDP Containment Level 2 &lt;/span&gt;&lt;span&gt;and knowledge of immunology and vaccines is essential. For one of the positions previous experience of working to quality systems (e.g. GXP and ISO 9001) is desirable. Successful applicants will be able to demonstrate a high level of attention to detail with the ability to follow written procedures and accurately record results. They will be adaptable and flexible, proactive and highly organised with the ability to work both independently and as part of a team, and have excellent writing and presentation skills&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Please note this is not a biomedical scientist post and is therefore not suitable for completing an IBMS registration training portfolio.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Option 3 – External&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Open to all external applicants (anyone) from outside the Civil Service (including by definition internal applicants).&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Appointment to this post is on PHE terms and conditions of service. Only previous continuous service in the Civil Service is recognised for contractual purposes.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;span&gt;&lt;span&gt;Applicants are strongly advised to use the criteria in the person specification (available online) as sub-headings in their application to make it clear how they meet each of the selection criteria. Please also see job description for full details of job responsibilities and competencies.&lt;/span&gt;&lt;/span&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Public Health England promotes diversity in the workplace and is an equal opportunities employer.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameStephen TaylorJob titleSenior Project Team LeaderEmail addressstephen.taylor@phe.gov.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/127774.jpg", "name": "Public Health England", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127774"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Porton Down, Salisbury", "postalCode": "SP4 0JG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.1325", "longitude": "-1.7031"}}, "title": "Research scientist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258174", "validThrough": "2020-11-19T23:59:59+0000"}