{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-10-16T16:31:11+0100", "description": "&lt;p&gt;&lt;strong&gt;Specialist Multisector Pharmacist&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Up to 2 year Fixed Term Contract &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you have been registered for at least 2 years, then look no further if you want to broaden your scope of practice with the opportunity to explore portfolio working in a multisector environment in East Sussex. This role will support you to fulfil your current developmental needs and establish your identity, within the locality, through our NHS partner rotations and novel Primary Care Network (PCN) pharmacist roles as part of our expanding Multisector Foundation to Advanced Vocational Training Scheme (VTS)!&lt;/p&gt;\n&lt;p&gt;Due to further PCN roll out of the scheme, we are recruiting additional pharmacists to be part of our successful multisector VTS pharmacist team. Our structured and individualised core induction is designed to recognise your prior experience or identify your learning needs, to tailor the rate of progression through the programme.&lt;/p&gt;\n&lt;p&gt;We are looking for enthusiastic and highly motivated pharmacists, who have been qualified for at least 2 years with past experience in any sector of pharmacy.&lt;/p&gt;\n&lt;p&gt;During the two year programme you will have the unique opportunity to train and develop your personal skills across: GP practices within the local PCN, rotations in secondary care working on the Acute Medical Unit within hospital, intermediary care within Community Health Services; primary care through the CCG; Medicines Optimisation in Care Homes service (MOCH) and specialist inpatient and Community Mental Health (CMHS).&lt;/p&gt;\n&lt;p&gt;Pharmacists progressing through the programme will have the opportunity to apply for the HEE commissioned Clinical Enhanced Pharmacist Independent Prescribers (CEPIP) qualification enabling them to broaden their sphere of competence. We currently have multisector pharmacists undertaking the CEPIP at both Medway and Kings University, with DMP support from primary and secondary care, and a scope of practice ranging from DOACs to UTIs in the Frail Patient.&lt;/p&gt;\n&lt;p&gt;You will have a designated Educational Supervisor who will support your development as well as specialist rotational Practice Supervisors enabling you to demonstrate Foundation to Advanced level Practice, through supervised learning events, across the range of sectors. You will also have a DMP/DPP to support the CEPIP linked to your scope of practice.&lt;/p&gt;\n&lt;p&gt;Whilst delivering a pharmacy service, the VTS offers you a contemporary and innovative approach to post-registration training. You will develop a clinical skills base along with the optimum skill set for a pharmacist caring for patients in and across any sector of healthcare equipping you for forthcoming pharmacist roles within the locality partners supporting the desired outcomes of the NHS Long Term Plan. The programme supports a culture of multiprofessional education with opportunities to join ward rounds, clinics and virtual patient consultations as part of a multidisciplinary team.&lt;/p&gt;\n&lt;p&gt;The locality partners working together with East Sussex Healthcare NHS Trust (ESHT) are:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;PCNs within East Sussex CCG&lt;/li&gt;\n&lt;li&gt;East Sussex CCG&lt;/li&gt;\n&lt;li&gt;Sussex Community NHS Foundation Trust&lt;/li&gt;\n&lt;li&gt;Sussex Partnership NHS Foundation Trust&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Recruitment is being hosted by ESHT so please get in touch with Alice Conway or Sarah Purdy (details below) for an informal discussion to find out more about how this role can help you to gain experience within a patient facing role incorporating clinical, management, governance, research, education and leadership skills through a programme that is quality assured and validated against professional development frameworks with a wide variety of inter-professional learning opportunities.&lt;/p&gt;\n&lt;p&gt;This programme is supported by Health Education England (Kent, Surrey and Sussex) and further information including evaluation from current programme participants and the Training Programme Directors can be found on their website&lt;/p&gt;\n&lt;p&gt;We regret that we are unable to advise candidates if they have not been shortlisted. If you have not heard from us within three weeks of the closing date please assume that you have been unsuccessful on this occasion. &lt;br /&gt;&lt;br /&gt;In the event of an excessive number of applicants the Trust reserves the right to close this vacancy earlier than indicated.&lt;br /&gt;&lt;br /&gt;Successful candidates are normally offered salaries at the bottom of the relevant salary range. However, where previous or equivalent NHS experience in a similar role can be demonstrated and evidenced, this may be taken into consideration when setting the starting salary.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Up to 2 year Fixed Term Contract initially, with support for identifying potential opportunities to progress to locality roles upon completion.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Training Programme Directors contact details are shown below and are happy to discuss the training scheme in more detail with interested potential candidates or explore any opportunities for less than full time working.&lt;/p&gt;\n&lt;p&gt;Alice Conway alice.conway@nhs.net 07980947244 or Sarah Purdy s.purdy@nhs.net 07980947227&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120634.jpg", "name": "East Sussex Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120634"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Eastbourne, Eastbourne", "postalCode": "BN21 2UD"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.787", "longitude": ".271136"}}, "title": "Specialist Multisector Pharmacist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916231112", "validThrough": "2020-11-15T23:59:59+0000"}