{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 pro rata pa inc plus Inner Londo"}}, "datePosted": "2020-11-03T14:16:46+0000", "description": "&lt;p&gt;&lt;strong&gt;About the team:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Lewisham Crisis Resolution Home Treatment Team (HTT) works closely with all the local community and inpatient services, providing assessment and home treatment. Presenting problems will include psychosis, mania, depression and suicide and self-harm risk behaviours&lt;/p&gt;\n&lt;p&gt;Lewisham HTT provides borough wide input to service users residing within the borough of Lewisham who are in need of home treatment either at a time of crisis or with the provision of additional support prevents the need for more intensive treatment in hospital. The HTT also supports the early discharge of patients who have been admitted to hospital by providing an in-reach assessment service to the local inpatient wards. The HTT provides brief, time limited interventions with a view to transferring the service user back or onwards to a community mental health team for further treatment, or discharging the service user back to primary care for on-going support&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the role:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The role will involve providing highly specialist brief psychological therapy service to Lewisham Crisis Resolution Home Treatment Team including specialist assessment, treatment, planning, implementation and monitoring of outcomes. Some of the key responsibilities include:&lt;/p&gt;\n&lt;p&gt;To contribute to enabling other staff, service users and carers from diverse backgrounds to flourish by working to create a psychologically safe environment.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;To adapt standard psychological interventions to the particular demands of home treatment team working enabling multi-disciplinary team members to carry out short term psychologically informed interventions with the majority of service users.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;To provide clinical supervision, staff support and consultation as appropriate, functioning as a lead specialist in Lewisham Crisis Resolution Home Treatment team enhancing the psychologically informed ways of working across multi-professional staff&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;To undertake service evaluation, audit and research.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the location:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Lewisham is a borough of high social and psychological needs with considerable cultural diversity. Mental Health services support an ethnically diverse group of clients, where English may not be their first language and who present with a wide range of common mental health problems at varying levels of severity. Many clients present with multiple problems including social, housing and employment issues. You will be based at Lewisham Hospital, Ladywell unit.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Benefits&lt;/strong&gt;:&lt;/p&gt;\n&lt;p&gt;We are committed to ensuring our staff get the most out of their benefits package and understand the importance of a healthy work life balance. There is an extensive range of excellent benefits for you and your family. We want you to feel like you are part of a close knit team at SLaM. It’s important to us that you valued and appreciated and that are why we have a comprehensive benefits package on offer&lt;/p&gt;\n&lt;p&gt;Some of our benefits are highlighted here:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Generous pay, pensions and leave, &lt;/strong&gt;we offer a comprehensive pay, pensions and leave package which is dependent on the role and length of service.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Work life balance, &lt;/strong&gt;flexible working and support a range of flexible options, such as: part-time working and job sharing.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Career development, &lt;/strong&gt;There are plenty of opportunities to progress your career and we support your development through a number of programmes such as mentoring, coaching, positive people management, collective leadership and other talent programmes&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Car lease, &lt;/strong&gt;our staff benefits from competitive deals to lease cars&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Accommodation, &lt;/strong&gt;our staff benefits from keyworker housing available which is available on selected sites&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;NHS discounts, &lt;/strong&gt;with discounts up to 10% from a variety of well-known retail brands though Health Service Discounts website.&lt;strong&gt;Other benefits include:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Counselling services&lt;/p&gt;\n&lt;p&gt;Wellbeing events&lt;/p&gt;\n&lt;p&gt;Long service awards&lt;/p&gt;\n&lt;p&gt;Cycle to work scheme&lt;/p&gt;\n&lt;p&gt;Season ticket loan&lt;/p&gt;\n&lt;p&gt;Childcare vouchers&lt;/p&gt;\n&lt;p&gt;Staff restaurants&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We look forward to receiving your application.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Ketan Sonigra / Sarah Baskett Job titleClinical Lead - Intensive Case Management / Manager of HTTEmail address ketan.sonigra@slam.nhs.uk Additional contact information&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Ketan Sonigra - Clinical Lead Intensive Case Management - ketan.sonigra@slam.nhs.uk&lt;/p&gt;\n&lt;p&gt;Sarah Baskett - Service manager Home Treatment Team - sarah.baskett@slam.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123472.png", "name": "South London and Maudsley NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123472"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Ladywell Unit, Ladywell Hospital, Lewisham / London", "postalCode": "SE13 6LW"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4536", "longitude": "-.016997"}}, "title": "Highly Specialist Practitioner Psychologist / BABCP Registered CBT Th", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254304", "validThrough": "2020-11-10T23:59:59+0000"}