{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "49036", "minValue": "49036", "unitText": "YEAR", "value": "£49,036"}}, "datePosted": "2020-11-05T14:39:51+0000", "description": "&lt;h1&gt;ISLE OF WIGHT NHS TRUST&lt;br /&gt;LOCUM FOR SERVICE (LAS) - GENERAL SURGERY ST3+ Level&lt;br /&gt;FULL-TIME&lt;/h1&gt;\n&lt;p&gt;We are looking to recruit a high calibre LAS ST3+ in General Surgery until October 2021 in the first instance and can be extended by mutual agreement. The post is being advertised as it is currently vacant following unsuccessful placement by the Wessex Deanery.&lt;/p&gt;\n&lt;p&gt;Although the post will not formally be recognised as a training post and will not attract an NTN, the post holder will be eligible for the same training and educational opportunities as those appointed through Health Education Wessex. There is a full postgraduate education programme at St Mary’s.&lt;/p&gt;\n&lt;p&gt;Applicants must have full GMC registration and Licence to practice and although not essential, MRCS is desirable.&lt;/p&gt;\n&lt;p&gt;The post is subject to the 2016 Junior Doctor Terms and Conditions of employment.&lt;/p&gt;\n&lt;p&gt;The post holder will participate in the 1:8 weekend 24 hour non-resident on-call rota with enhancements under the T&amp;Cs. When in the department you may rotate between surgical firms.&lt;/p&gt;\n&lt;p&gt;St Mary’s Hospital is a busy rural DGH providing a wide range of services for the local population of some 138,000, a figure that doubles during summer months. The Trust is an accredited Cancer Unit for breast, lung and GI cancers.&lt;/p&gt;\n&lt;p&gt;Single accommodation is available to rent in a modern residential block on the St Marys Hospital site.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For an informal discussion in relation to this position, please contact Mr Steve Parker, Lead Clinician or Julianna Hayward, Operational Manager on 01983 822099 ext. 2090.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Isle of Wight NHS Trust - Medical Recruitment", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=135474"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Newport, Isle of Wight", "postalCode": "PO30 5TG"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7111", "longitude": "-1.30088"}}, "title": "LAS Specialty Registrar General Surgery (ST3+)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258143", "validThrough": "2020-11-19T23:59:59+0000"}