{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum / pro rata"}}, "datePosted": "2020-10-28T11:17:28+0000", "description": "&lt;p&gt;This is an exciting opportunity to work with adults with severe and/or complex mental health difficulties across our new Crisis Resolution and Home Treatment service and our in-patient teams. The post involves using and developing your psychological assessment and intervention, training, supervision and teamwork skills to deliver excellent psychological care.&lt;/p&gt;\n&lt;p&gt;You will provide psychological assessments, formulations and therapy for the Aylesbury Crisis Resolution and Home Treatment team and Sapphire Ward (acute male in-patients). The post will involve consultation, training and supervision for other psychological therapists, including assistant and trainee clinical psychologists,and colleagues in the wider multidisciplinary teams.&lt;/p&gt;\n&lt;p&gt;You will work with the Clinical Lead, Team Manager and your team to ensure that the Buckinghamshire Psychological Therapies Pathway achieves its key objectives of delivering integrated, safe, accessible, responsive, effective and caring services to people in Buckinghamshire. You will ensure the service you provide is of a high quality and meets national guidance as well as meeting local and nationally agreed plans. We are particularly interested in increasing the use of NICE approved evidence based therapeutic approaches within the team, including CBT and DBT, MBT and CAT. If not already acquired, we would be keen to support applicants in completing further post qualification training to allow accreditation with bodies such as BABCP.&lt;/p&gt;\n&lt;p&gt;You will receive expert clinical supervision and will have access to a wide range of CPD activities. There are excellent opportunities for service development, evaluation/research and teaching/training. We have close ties to the Oxford Doctorate Course in Clinical Psychology.&lt;/p&gt;\n&lt;p&gt;The post is based at The Whiteleaf Centre, our modern, purpose built, mental health facility in Aylesbury. Buckinghamshire is well located with excellent transport links to London, Oxford and the Midlands and within the Chiltern Hills, an area of outstanding natural beauty.&lt;/p&gt;\n&lt;p&gt;We would also consider applicants interested in part of the post or seeking part time hours, with a minimum requirement of 18.75 hours.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDr John PimmJob titleClinical and Professional Lead for Bucks Psychological Therapies PathwayEmail addressjohn.pimm@oxfordhealth.nhs.ukTelephone number07798893900&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Oxford Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122233"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Whiteleaf Centre, Aylesbury", "postalCode": "HP20 1EG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.8208", "longitude": "-.802517"}}, "title": "Clinical Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246270", "validThrough": "2020-11-11T23:59:59+0000"}