{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pa pro rata"}}, "datePosted": "2020-10-13T14:01:14+0100", "description": "&lt;p&gt;Do you have experience in working in an Emergency Department and want to develop your skills and put them into practice? Or perhaps you are a newly qualified nurse or an experienced nurse looking for a new challenge?&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If so then why not come and join one of England’s top performing Emergency Departments where we can offer you a supportive, friendly and educationally focused work place. Maidstone and Tunbridge Wells NHS Trust comprises of 2 Emergency Departments – one at Maidstone Hospital and one at Tunbridge Wells Hospital. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Maidstone Hospital and Tunbridge Wells Hospital Emergency Departments are recruiting nurses and we would love you join our friendly, hardworking team of nurses and clinical support workers&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What’s so good about our Emergency Departments&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;We are consistently in the top 10 of the best performing trusts for ED targets in the country.&lt;/li&gt;\n&lt;li&gt;You will complete an Emergency Department specific induction programme.&lt;/li&gt;\n&lt;li&gt;We offer a 6 month preceptorship period, which is supported by the RCN Emergency Nursing Competencies.&lt;/li&gt;\n&lt;li&gt;We have a Practice Development Team who will support you as you progress through your career and guide you towards your learning goals. They will help you develop the core skills needed and consolidate previous experiences&lt;/li&gt;\n&lt;li&gt;We run an in-house Emergency Care course with accreditation from Greenwich University.&lt;/li&gt;\n&lt;li&gt;We offer a robust career development programme, with an emphasis on individualised CPD. This gives you the opportunity to create a career in emergency care in the direction that you want.&lt;/li&gt;\n&lt;li&gt;Tunbridge Wells is a designated Trauma Unit and is part of the SELKAM Trauma Network&lt;/li&gt;\n&lt;li&gt;Maidstone Hospital has recently been made one of the designated Hyper Acute Stroke Units for Kent&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We are running a recruitment open day on:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Saturday 7th November 2020 at Tunbridge Wells Hospital in the Discharge Lounge at 09.30am&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We would love you to come along and meet us and find out how our Emergency Departments work and what we can offer you with your career development. You will have the opportunity to talk to current members of our nursing team from both sites and have a tour of the ED. Informal visits for the Maidstone site can be arranged. You will be fast tracked through the recruitment process with interviews being held on the day or if you prefer, a virtual interview can be arranged for a different date.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The day will follow the below schedule &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;09.30 - Arrival &lt;br /&gt;10.00 - Welcome presentation&lt;br /&gt;10.30 - Meet with the teams&lt;br /&gt;11.30 - Tour of the Hospital&lt;br /&gt;12.30 - Interviews &lt;br /&gt;14.00 - End of event&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Why should you come and work at MTW NHS Trust?&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;You will be joining a fantastic nursing team praised by the CQC for their care &amp; compassion.&lt;/li&gt;\n&lt;li&gt;We actively support and encourage staff development at all levels.&lt;/li&gt;\n&lt;li&gt;In our Trust we prioritise our people and offer good management support with excellent staff development programmes.&lt;/li&gt;\n&lt;li&gt;As a key player in clinical teams there is the opportunity to collaborate and develop patient pathways.&lt;/li&gt;\n&lt;li&gt;We practice effective care and those principles within excellent supportive teams help us deliver this in a demanding daily environment.&lt;/li&gt;\n&lt;li&gt;We preserve yours and patients safety and are involved in a number of national safety campaigns.&lt;/li&gt;\n&lt;li&gt;We promote nursing professionalism and trust!&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;This is a perfect opportunity for us to showcase our departments to you and for you to see what we can offer you. Don’t miss out, &lt;strong&gt;sign up now&lt;/strong&gt; to ensure your place and take the next step towards joining the MTW team and becoming the nurse you want to be.&lt;/p&gt;\n&lt;p&gt;We look forward to meeting you!&lt;/p&gt;\n&lt;p&gt;* if attending the Open Day please bring along with you either 2 photographic &amp; 1 proof of address or 1 photographic &amp; 2 proofs of address or your personal Identification Documents and evidence of Professional Registration if applicable.&lt;/p&gt;\n&lt;p&gt;You will be expected to attend the Trust’s Induction Programme for RNs, RMs and ODPs (which starts on the first day of employment). The programme is full-time (please contact the programme lead if this is problematic: nicola.henthorn@nhs.net), lasts for two weeks and will involve travelling to both Trust sites. The programme includes supernumerary shifts in the clinical area and classroom-based study days which run from 9am to 5pm.&lt;/p&gt;\n&lt;p&gt;Please note that appointment to this post will be subject to a satisfactory Disclosure &amp; Barring Service Check at &lt;strong&gt;enhanced level. (Enhanced level now includes regulated checks against vulnerable adults and children)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are passionate in supporting our staff to develop and have great opportunities for career progression. We take equality and diversity seriously and seek to empower all diverse groups within our trust. We seek to develop a culture where diversity in all its forms is celebrated. We are committed to ensuring that women are empowered to work at all levels of management and that working patterns are as flexible as possible giving all members of staff opportunity to flourish in using their skills for our patients. We work across our trust to enable those who consider themselves to have a disability both visible and invisible to have access to all they need to thrive in their work environment. We work with Stonewall to embed an inclusive and accepting culture for all lesbian, gay, bisexual and transgender staff. We have 78 nationalities working in our trust and we are proud of this. We are active in embracing the ethnic and cultural diversity in our trust. We work to empower people with any protected characteristic to have opportunities to work in an environment that helps them to contribute to the best of their ability, recogn&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120635.png", "name": "Maidstone and Tunbridge Wells NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120635"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Tunbridge Wells Hospital, Tunbridge Wells", "postalCode": "ME16 9QQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2737", "longitude": ".484004"}}, "title": "Emergency Department Open Day - Saturday 7th November 2020", "url": "https://www.jobs.nhs.uk/xi/vacancy/916224595", "validThrough": "2020-11-06T23:59:59+0000"}