{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 pa"}}, "datePosted": "2020-11-05T16:15:15+0000", "description": "&lt;p&gt;&lt;strong&gt;Scheduled and Planned Care Directorate&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Intensive Rehabilitation Services&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;strong&gt;Registered Mental Health Nursing x 2 posts&lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;We encourage both nurses with experience of working in Rehabilitation and nurses who require a Preceptorship Post to apply for this exciting opportunity.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary: Band 5 £24,907 – £30,615 per annum (dependant on experience)&lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;Location: Forest Close, Oughtibridge, Sheffield, S35 0JW.&lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;Hours: 37.5 hours per week (2 Full time posts available) will consider part-time&lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;Post Ref:  457-20-107-QN&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Forest Close is a 30 bedded Rehabilitation and Recovery Unit, which aims to deliver high quality, effective rehabilitation and recovery to individuals whose needs cannot currently be met by less intensive mainstream Adult Mental Health Services. We are looking to recruit two dynamic and motivated RMN’s to join the team. The focus of the unit will be on the treatment and care of people with major and complex mental health needs as close to their communities &amp; support networks as possible, and the clinical team:&lt;br /&gt;• Empowers people to make informed choices regarding their individual Process of recovery, within a structured environment.&lt;br /&gt;• Provides personalised intensive optimistic therapeutic programmes based on the principles of the Recovery model.&lt;br /&gt;• Actively encourages patients to self manage their own health needs as far as possible with appropriate help &amp; support.&lt;br /&gt;• Utilises outcome tools such as Collaborative Care Planning.&lt;br /&gt;Registered Nurse Mental Health&lt;br /&gt;As part of a multi-disciplinary team your role will be to assess, plan, implement and evaluate programmes of care and support, based on the principles of Recovery and Psycho-Social Interventions.&lt;br /&gt;You will be responsible for managing and directing planned intervention strategies with a demonstrable commitment to a non-punitive, value based approach to care delivery. Your role will also include staff support, supervision and ensuring that the highest professional nursing standards are maintained. You will be expected to work a flexible shift pattern consisting of internal rotation.&lt;br /&gt;You will be responsible for the delivery of effective, high quality and patient focused care within the ward environment through the assessment of care needs and the development, implementation and evaluation of programmes of care.&lt;br /&gt;You will provide support for, and assist the Team in the ongoing management of the Unit, and the ongoing development of services provided&lt;br /&gt;You will work as an effective member of the multi-disciplinary team, maintaining high standards of care.&lt;br /&gt;Registered Nurse Mental Health (Preceptorship Posts)&lt;/p&gt;\n&lt;p&gt;If you are a Registered Mental Health Nurse or about to register, vacancies exist at Forest Close for preceptorship posts. You should possess knowledge of The Mental Health Act 1983 and clinical risk assessment skills. You must also be able to demonstrate excellent communication skills and be able to work as part of a multidisciplinary team. Additionally, you should exhibit a commitment to personal and professional development.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Sheffield Health and Social Care NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120808"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Sheffield", "postalCode": "S35 0JW"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.421", "longitude": "-1.52012"}}, "title": "RMH Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258502", "validThrough": "2020-11-16T23:59:59+0000"}