{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum pro rata"}}, "datePosted": "2020-11-04T14:16:07+0000", "description": "&lt;p&gt;We are looking for an enthusiastic and motivated individual to join our 2nd Stage Recovery Team. The Main/Day Theatre Departments are busy units providing a range of Services across a number of specialities. The unit has two Main Theatres and three Day Surgery Theatres. &lt;br /&gt;&lt;br /&gt;The Department has a friendly and supportive environment, which is strongly centred on teamwork and patient care. The Theatre team are all dedicated to helping the people of their communities and are proud to work in one of the most diverse, dynamic and beautiful counties in the UK.&lt;/p&gt;\n&lt;p&gt;Successful candidates would be required to hold a RGN qualification or Diploma/Degree in Operating Department Practice and provide evidence of professional development, with a desire to work within the operating theatre department. Ideally the candidate will have experience of working within the operating theatre, however, full support and training would be given to any candidate who is motivated to join our team.&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;Bronglais General Hospital in Aberystwyth, Ceredigion, is uniquely situated in the middle of the West coast of Wales and stands as a model of rural healthcare being one of the smallest acute District General Hospitals in the UK. As well as serving the population of Ceredigion, it also serves the neighbouring counties of Powys and South Gwynedd.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;The hospital has developed a reputation of innovation and forward-thinking and has led the way in adopting new technology to enhance clinical services. The Front of House scheme for Bronglais General Hospital, including enabling works, totals more than £38million of investment directly into Ceredigion healthcare. It provides the following services in either new build accommodation or substantially upgraded facilities: Accident &amp; Emergency Department (A&amp;E), a 14 bed Clinical Decisions Unit (CDU) Theatres, Maternity Department, Outpatients Department and an Integrated Pathology Service.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Aberystwyth is a unique place to live where the peace and quiet of rural living is balanced with a vibrant outdoor life style where the University town buzzes with excitement. The town offers a variety of places to enjoy, from the hills and stunning beaches to a pier, castle ruins and a harbour. There is so much on offer from surfing in the morning to watching a dramatic sunset from the Iron Age fort taking in the striking views of nearby Cardigan Bay, as featured in the hit BBC1 drama Hinterland.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Hywel Dda University Health Board is one of seven acute Health Boards in Wales. It provides primary and secondary care services for 384,000 residents within its borders in the counties of Carmarthenshire, Pembrokeshire and Ceredigion. Bronglais General Hospital also provides acute and long-term speciality services for residents living in the adjacent areas of the counties of Powys and Gwynedd.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameKieran HallJob titleSenior Clinical ManagerEmail addressKieran.Hall@wales.nhs.ukTelephone number01970 613824Additional contact information&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123194.gif", "name": "Hywel Dda University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123194"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bronglais General Hospital, Aberystwyth", "postalCode": "SY23 1ER"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4161", "longitude": "-4.07159"}}, "title": "Registered Nurse - Day Surgery/2nd Stage Recovery", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256190", "validThrough": "2020-11-19T23:59:59+0000"}