{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44780", "minValue": "37638", "unitText": "YEAR", "value": "£37,638 - £44,780 p.a. inc"}}, "datePosted": "2020-11-03T13:45:46+0000", "description": "&lt;p&gt;Would you like to work as a Health Visitor within one of the most interesting, diverse and vibrant areas of London?&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;These are exciting times for our Health Visiting service. We maintain a team-focussed approach that comprises of support from Lead Health Visitors, Band 7 Team Coordinators and GP Cluster leads, as well as members of the wider skill mix team.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Our health visitors are leaders of the Healthy Child Programme, offering early intervention and support to children and families within Hackney and the City.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are looking for Health Visitors to work within our teams and want candidates who share our values and vision for high quality, personalised health visiting care. You will be responsible for delivering the Healthy child Programme and will be aligned to a GP cluster team.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We offer great opportunities for ongoing learning and development for our staff providing a comprehensive induction programme, preceptorship for newly qualified Health Visitors, regular management and safeguarding supervision and appraisal. We also offer a very attractive inner London weighting allowance.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;As a Health Visitor within Hackney and the City you will be the named Health Visitor for a caseload of children linked to a GP practice. You will act as the named link to the GPs and Early Years Settings &amp; Nurseries and will be responsible for managing vulnerable children, attending Child protection Case Conferences, Core group, Child in Need meetings and other professional meetings.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Within your role you will lead on key interventions and health promotion activities, for example, delivery of integrated development reviews using the ASQ questionnaire. Additionally you will oversee the health promotion work undertaken by the nursery nurse team working closely with our parents and children’s centres to deliver personalised advice and support.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;In order to continue developing the service we have ensured that:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;All staff are trained in the ‘Solihull’ approach looking at the neurological development of a child and its impact on parenting.&lt;/li&gt;\n&lt;li&gt;All Health Visitors are offered membership of the Institute of Health Visiting.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Interview Date: TBC&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Jo Eley (Health Visiting Lead): Email: joanna.eley1@nhs.net / Ph: 07789 865129&lt;/p&gt;\n&lt;p&gt;or&lt;/p&gt;\n&lt;p&gt;Christeen Bartlett (Health Visiting Lead): Email: christeen.bartlett1@nhs.net / Ph: 07500 994436&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120604.jpg", "name": "Homerton University Hospital NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120604"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Community Sites, London", "postalCode": "E9 6SR"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5506", "longitude": "-.046072"}}, "title": "Health Visitor", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254187", "validThrough": "2020-11-17T23:59:59+0000"}