{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "49036", "minValue": "49036", "unitText": "YEAR", "value": "£49,036 per annum"}}, "datePosted": "2020-11-03T17:16:03+0000", "description": "&lt;p&gt;Applications are invited for a Clinical Research Fellow (CT1-3 Level) based at the Maudsley Hospital/ Institute of Psychiatry.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the team:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;A new vacancy has been created for a post to play a leading role in clinical research studies within the Psychiatric Imaging Group. The team is headed by Prof Oliver Howes and consists of clinicians and researchers specialising in clinical research in psychotic disorders using cutting-edge imaging and other techniques. Projects include working with other leaders in the field including Professors Thomas Barnes, and Stephen Lawrie and Drs Drake, and Fernandez-Egea and Pappa.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the role:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;A &lt;strong&gt;Clinical Research Fellow&lt;/strong&gt; is required to play a leading role in the conduct and management of clinical studies, including the NIHR funded ATLANTIS study. The post holder will be responsible for patient recruitment, and acquiring clinical and other measures, and other aspects of the conduct of the studies. The projects include a clinical trial of the potential of adjunctive treatment for treatment resistance, studies of the mechanisms underlying symptoms, and of novel treatment approaches. The post-holder will have opportunities to get involved in data analysis and develop their research interests within the projects.&lt;/p&gt;\n&lt;p&gt;Training in research methods will be provided, and the post-holder will develop skills in using gold-standard diagnostic and clinical ratings, which will be useful for future research and clinical practice. There is the potential for the post-holder to develop a PhD/MD project if appropriate.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the location:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The South London and Maudsley NHS Foundation Trust is one of 3 Foundation Trusts within Kings Health Partners Academic Health Sciences Centre and is committed to innovation, effective interventions and improved service user outcomes. As well as providing excellent mental health services for the local community. The Trust is committed to maintaining its national status as a provider of specialist mental health services for people living across the UK.&lt;/p&gt;\n&lt;p&gt;The role will be based at the Maudsley Hospital and Institute of Psychiatry, Denmark Hill in South London. The role involves travel to other sites and may involve visits to patients in the community e.g. home visits, inpatient units, community bases as appropriate. It will also require travel to other study sites nationally when required.&lt;/p&gt;\n&lt;p&gt;Our Trust headquarters are located at Denmark Hill less than 5 minutes from the train station (zone 2). We also provide services and operate across other locations, such as London boroughs of Croydon, Lambeth, Lewisham and Southwark; and substance misuse services for residents of Bexley, Lambeth, Greenwich and Wandsworth.&lt;/p&gt;\n&lt;p&gt;Post will be initially for a period of 12 months with possibility of extension to 36 months.&lt;/p&gt;\n&lt;p&gt;Start date to be confirmed.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Oliver Howes - Consultant - Email address - oliver.howes@slam.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123472.png", "name": "South London and Maudsley NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123472"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Maudsley Hospital and IoPPN, London", "postalCode": "SE5 8AZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4687", "longitude": "-.091415"}}, "title": "Clinical Research Fellow (CT3 equiv)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254910", "validThrough": "2020-12-27T23:59:59+0000"}