{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "49325", "minValue": "43712", "unitText": "YEAR", "value": "£43,712 - £49,325 pa plus HCAS"}}, "datePosted": "2020-10-30T12:16:57+0000", "description": "&lt;p&gt;An exciting opportunity has arisen to work as the Adult Social worker on the Channi Kumar Mother and Baby Unit and the Tyson West 2 Eating Disorders ward at the Bethlem Royal Hospital.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the 2 units:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Channi Kumar Mother and Baby Unit&lt;/strong&gt; is a 13-bed unit was set up for women who develop or have a relapse of serious mental illness during pregnancy or following the birth of their baby.&lt;/p&gt;\n&lt;p&gt;The multidisciplinary team, consists of nursing, medical, nursery nurses, psychologists, Occupational Therapists, offers a wide range of treatment, therapy and care. One unique factor on our MBU is the work of a developmental psychologist who works closely with the mothers and infants.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Tyson West 2 Eating Disorders unit&lt;/strong&gt; is a 15-bed unit which offers a range of therapeutic interventions for patients with an eating disorder &amp; their carer&#39;s, including Cognitive Behaviour Therapy, Cognitive Analytic Therapy and Family Therapy.&lt;/p&gt;\n&lt;p&gt;The team, is made up of nurses, healthcare assistants psychologists, occupational therapists, psychotherapists, social workers and administrators.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the role:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for an assertive, dynamic, approachable and driven individual to take on this challenging role. As the adult social worker, you will be responsible for providing a focused adult mental health social work service at the South London and Maudsley mother and baby unit and the Eating Disorders Inpatient unit.&lt;/p&gt;\n&lt;p&gt;To work closely with the children’s adult social worker and the PMOA Safeguarding Lead to provide and coordinate the delivery of an integrated adult social work provision across the two specialist services. To be an active and vital member of the multi-disciplinary team using knowledge and skills to support colleagues in the delivery of care, assessment and treatment to mothers and their families. To liaise with, advise and support a range of external and partnership agencies both voluntary and statutory. To provide children and families social care and expertise and legislative knowledge to the service. To deliver these services in accordance with current legislation, local authority and Trust policies and procedures. To fulfil statutory and other requirements of a social worker as and when appropriate.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the location:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Both the MBU and EDU are based on the beautiful grounds of the Bethlem Royal Hospital in Beckenham. On site there is a staff canteen and secure bike lock facilities. There are nearby transport links into the city and it is a short bus ride to vibrant Croydon.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Benefits&lt;/strong&gt;:&lt;/p&gt;\n&lt;p&gt;We are committed to ensuring our staff get the most out of their benefits package and understand the importance of a healthy work life balance. There is an extensive range of excellent benefits for you and your family. We want you to feel like you are part of a close knit team at SLaM. It’s important to us that you valued and appreciated and that are why we have a comprehensive benefits package on offer&lt;/p&gt;\n&lt;p&gt;Some of our benefits are highlighted here:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Generous pay, pensions and leave, &lt;/strong&gt;we offer a comprehensive pay, pensions and leave package which is dependent on the role and length of service.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Work life balance, &lt;/strong&gt;flexible working and support a range of flexible options, such as: part-time working and job sharing.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Career development, &lt;/strong&gt;There are plenty of opportunities to progress your career and we support your development through a number of programmes such as mentoring, coaching, positive people management, collective leadership and other talent programmes&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Car lease, &lt;/strong&gt;our staff benefits from competitive deals to lease cars&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Accommodation, &lt;/strong&gt;our staff benefits from keyworker housing available which is available on selected sites&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;NHS discounts, &lt;/strong&gt;with discounts up to 10% from a variety of well-known retail brands though Health Service Discounts website.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Other benefits include:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Counselling services&lt;/li&gt;\n&lt;li&gt;Wellbeing events&lt;/li&gt;\n&lt;li&gt;Long service awards&lt;/li&gt;\n&lt;li&gt;Cycle to work scheme&lt;/li&gt;\n&lt;li&gt;Season ticket loan&lt;/li&gt;\n&lt;li&gt;Childcare vouchers&lt;/li&gt;\n&lt;li&gt;Staff restaurants&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We look forward to receiving your application&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Rebecca Horton, General Manager&lt;/p&gt;\n&lt;p&gt;Email address becky.horton247@slam.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number 07525236687&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123472.png", "name": "South London and Maudsley NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123472"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bethlem Royal Hospital, Beckenham", "postalCode": "BR3 3BX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3809", "longitude": "-.029726"}}, "title": "Adult Social Worker - Specialist services", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250137", "validThrough": "2020-11-06T23:59:59+0000"}