{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-11-02T14:01:24+0000", "description": "&lt;p&gt;Blackpool Teaching Hospitals in collaboration with Blackpool Council are looking for a highly motivated and committed Band 5 physio to work across the intermediate care pathways. We require an enthusiastic individual with a can do attitude, who has the ability to work within our friendly team putting high quality patient care first.&lt;/p&gt;\n&lt;p&gt;Commitment to undertake ongoing in-service training and development is essential. You should be motivated, keen to learn and ready to embrace change. Our commitment to you is to provide the environment for this to happen. If you are motivated to deliver high standards of care and have a passion for rehabilitation then this could be the post for you.&lt;/p&gt;\n&lt;p&gt;There is a dedicated team of therapy staff who benefit from support from a clinical team leader. . Regular in-service training and supervision is provided and we would expect the post holder to take an active part in both with responsibility for the specific supervision of junior staff. You would hold an extensive caseload of routine and complex cases with responsibility for the assessment and treatment and delegation to junior / support staff as appropriate.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The team is a fully integrated team of Nurses, Physiotherapists, Occupational Therapists, Rehab Support Workers and Social Workers.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for an enthusiastic member of staff with the flexibility for working with a wide range of conditions and situations. An excellent ability to communicate at the appropriate level, verbally and in writing, with colleagues, senior clinicians, carers and patients is essential. You must be both methodical and organised with skills in working under pressure, as part of a multi- professional and agency team and at times working in isolation.&lt;/p&gt;\n&lt;p&gt;This post is part time including weekends and bank holidays on a rota basis.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameRebecca PearceJob titleClinical LeadEmail addressrebecca.pearce2@nhs.netTelephone number01253 477855&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Blackpool Teaching Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120954"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "ARC Residential Intermediate Care Service, Blackpool", "postalCode": "FY4 4RF"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8018", "longitude": "-3.00291"}}, "title": "physiotherapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252313", "validThrough": "2020-11-16T23:59:59+0000"}