{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 to £110,683 pa"}}, "datePosted": "2020-10-27T16:15:34+0000", "description": "&lt;p&gt;This is a 10PA locum appointment for a Consultant within the Department of Infection &amp; Travel Medicine at St James’s University Hospital for 6 months in the first instance.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The post will be based at St James University Hospital.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Infectious Diseases Department in Leeds provides inpatient and outpatient services for the people of Leeds and surrounding areas. The Department provides a 7 day a week Infectious diseases service to the West Yorkshire Region. There are approximately 750 admissions per annum which are nearly all non-elective. In addition, the Department provides significant outpatient activity in Infectious Diseases, TB and HIV. The inpatient ward acts as the Primary Treatment Centre for the West Yorkshire Regional HIV Network, and so takes admissions of HIV patients from around the region. There is a well-established OPAT service run in partnership with Leeds Community Health NHS Trust. Further detail of the service is provided at the end of the Job Description.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Within Infectious Diseases, duties include inpatient care of patients with severe infection on a dedicated ward, an outreach service providing advice on infection especially bacteraemia to other clinical areas and antibiotic stewardship. We are looking for staff interested in engaging and contributing to service changes that support safe and timely care for patients.A high degree of flexibility is also currently required whilst Infectious Diseases expertise remains a core component of the LTHT acute COVID-19 response &amp; trial programme, and as clinical services continue to evolve.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;St James’s is a tertiary hospital within the Leeds Teaching Hospitals NHS Trust with an extensive range of other clinical specialties including Oncology and Transplantation. There are close links with specialties based at Leeds General Infirmary, such as TB medicine within Leeds Chest clinic and Microbiology. The Infectious Diseases department takes part in a range of observational and interventional NIHR Portfolio studies, in particular in the areas of antimicrobial resistance, brain infections and influenza.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The ideal applicants for this post will be able to demonstrate the following attributes: strong knowledge and skills in Infectious Diseases, positive response to the challenges of service development, resilience and flexibility in the face of rapid change, excellent interpersonal and communication skills. They will be able to work cooperatively and happily with colleagues both at consultant level and across the multidisciplinary team. They will have a strong commitment to undergraduate and postgraduate teaching and an ability to demonstrate an understanding of the role of research in driving up clinical quality.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The successful applicant should possess MRCP (or equivalent) and should be included on the Specialist Register or within 6 six months of being admitted to the Register for trainees if currently in a training programme within the UK, or have references which have been authorised by the Deputy Medical Director and Clinical Director.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Applicants should have established skills in Infectious Diseases and its related specialties including HIV, TB and Travel Medicine. A strong commitment to undergraduate and postgraduate teaching and a research interest is desirable. Excellent communication and team working skills, a strong commitment to teaching and service development are essential.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Consideration will be given to applicants who wish to work full or part time and those wishing to job share.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Enquiries to:&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Avishkar Hiraman&lt;/p&gt;\n&lt;p&gt;Business Manager&lt;/p&gt;\n&lt;p&gt;Infectious Diseases &amp; Travel Medicine, OPAT, HIV &amp; GUM, LTHT Lead for Leeds Sexual Health&lt;/p&gt;\n&lt;p&gt;Emergency &amp; Specialty Medicine Clinical Service Unit&lt;/p&gt;\n&lt;p&gt;T: 075 8427 0134, 0113 20 66306&lt;/p&gt;\n&lt;p&gt;E: &lt;span&gt;a.hiraman@nhs.net&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Other enquiries to:&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Dr Penny Lewthwaite, Specialty Lead in Infectious Diseases&lt;/p&gt;\n&lt;p&gt;T: 0113 20 64164&lt;/p&gt;\n&lt;p&gt;E: &lt;span&gt;penny.lewthwaite@nhs.net&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Dr Amy Evans, Lead Clinician for GUM &amp; Infectious Diseases&lt;/p&gt;\n&lt;p&gt;T: 079 8642 7019&lt;/p&gt;\n&lt;p&gt;E: &lt;span&gt;amy.evans10@nhs.net&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Dr Sarah Davey, Interim Clinical Director for ESM Clinical Service Unit&lt;/p&gt;\n&lt;p&gt;T:0113 20 66692&lt;/p&gt;\n&lt;p&gt;E: &lt;span&gt;sarah.davey3@nhs.net&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Lucy Pittaway, General Manager for ESM Clinical Service Unit&lt;/p&gt;\n&lt;p&gt;T: 0113 20 66692&lt;/p&gt;\n&lt;p&gt;E: &lt;span&gt;lucy.pittaway@nhs.net&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122056.jpg", "name": "Emergency & Specialty Medicine", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122056"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St James University Hospital", "postalCode": "LS9 7TF"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8073", "longitude": "-1.51908"}}, "title": "Locum Consultant in Infectious Diseases", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245364", "validThrough": "2020-11-11T23:59:59+0000"}