{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "49325", "minValue": "43712", "unitText": "YEAR", "value": "£43,712 - £49,325 per annum inc HCAS pro rata"}}, "datePosted": "2020-11-02T17:01:03+0000", "description": "&lt;p&gt;&lt;span&gt;Applications are invited for this 6 – session (3 days a week) permanent Band 7 Child Psychotherapy/ Family &amp; Systemic Psychotherapist post based at Hillingdon CAMHS, Minet Clinic.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The post holder would be expected to undertake generic assessments, specialist child psychotherapy assessment and treatment of children and adolescents offering short term treatment packages, some longer term work with complex cases, psychodynamic state of mind assessments.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The work environment is lively and there is a history of good multi-disciplinary team-working where differences of training and profession are valued and respected.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The post holder would also be required to participate in the daily duty screening rota. The post holder would be expected to have a clear job plan reflecting both clinical and non-clinical activities.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;In return, the post holder would receive regular clinical, professional and line management supervision as well as weekly peer supervision. The post holder would be expected to work across the three sub-teams of Neuro-developmental, Emotional Disorders and the Enhanced Treatment Team but the majority of the cases would be taken from the Enhanced Treatment Team (ETT).&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;It is required that applicants are members of the Association of Child Psychotherapists with an Association of Child Psychotherapists’ accredited training. This post would suit an experienced or a newly qualified Child and Adolescent Psychotherapist who has experience of generic and/or specialist CAMHS work and who is able to manage a varied clinical caseload including cases with complex and challenging presentations and disorders.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameCarol BroughtonJob titleConsultant Child PsychotherapistEmail addresscarol.broughton@nhs.netTelephone number01895256521Additional contact information&lt;/p&gt;\n&lt;p&gt;Carol Broughton Consultant Child Psychotherapist or Chris Ugochukwu CAMHS Team Manager on 01895256521&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central and North West London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120736"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hillingdon CAMHS, Hayes", "postalCode": "UB3 3NR"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5117", "longitude": "-.40901"}}, "title": "Child Psychotherapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252965", "validThrough": "2020-11-16T23:59:59+0000"}