{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753-£51,668"}}, "datePosted": "2020-10-30T09:01:45+0000", "description": "&lt;p&gt;&lt;strong&gt;JOB SUMMARY: &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The post holder will act as the Clinical Lead for the integrated Rapid Response team. They will be a key member of the management team and they will develop and focus on developing health and social care pathways that prevent unnecessary acute hospital admissions and enable patients to remain safe and supported at home and prevent premature admissions into long term care facilities. The post holder will be expected to deputise in the absence of the Team Manager from an operational perspective,&lt;/p&gt;\n&lt;p&gt;The post holder will act as an expert clinical resource to other colleagues and they will provide clinical supervision to clinical staff within the team and manage any clinical incidents which occur or risks in relation to clinical service delivery.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;They will also be expected to carry out advanced clinical assessments, history taking, diagnosis, plan and deliver treatment and prescribe and evaluate. Working as part of a multidisciplinary team and across the primary, secondary and social care interfaces in Warrington, the post holder will be responsible for co-ordinating the delivery of urgent health care needs of people at risk of hospitalisation or requiring a facilitated timely discharge and supporting a more intensive level of care in the intermediate care environment.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;What we offer&lt;/p&gt;\n&lt;p&gt;We offer a great package with inclusion in the following benefits to name but a few:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;NHS Pension Scheme&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Up to 6 weeks annual leave with the opportunity to purchase an additional 4 weeks annual leave&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Access to a Staff Health &amp; Wellbeing Hub which offers advice, support and schemes including Occupational Health services which include self-referral access to medical assessment facilities, Physiotherapy and a Counselling Helpline service which can be accessed 24 hours a day, 7 days a week&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Staff Salary Sacrifice Scheme including a Childcare Vouchers Scheme&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;A to Z list of staff benefits and discounts&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Opportunities to join our Staff Champions and Staff Engagement Group&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Optional Annual Health Checks, Flu Vaccines and Healthy Lifestyle Initiatives&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Special leave provisions, including some over and above statutory entitlements&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Flexible working options to help staff achieve a work/life balance&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Please ensure that you read&lt;strong&gt; the Job Description which also includes the person specification before applying for this post.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For an informal chat or further information regarding this post please contact: Jannine Grundy : jannine.grundy1@nhs.net&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please note:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If the advertised post requires a DBS check the successful candidate will incur the cost of the DBS check which will be taken in three equal monthly instalments from salary.&lt;/p&gt;\n&lt;p&gt;We advise that you complete and submit your application form as soon as possible, because should we experience a high level of interest in the post it may be closed early.&lt;/p&gt;\n&lt;p&gt;Any applicant who applies for a position online will be contacted thereafter using the email address provided upon login. Please ensure that after application you check your emails often to ensure that you do not miss any communications from Bridgewater Community Healthcare NHS Foundation Trust&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Bridgewater is an equal opportunities employer: &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We value and respect the diversity of our employees and aim to recruit a workforce that reflects our local communities, we therefore welcome applications from everyone with the necessary attributes for the job, irrespective of age, disability, gender/gender identity, sexual orientation, ethnicity, religious belief or other personal circumstance. We are committed to improving the working lives of our employees and we have an active flexible working policy and welcome applications for job share and flexible working. An interview is guaranteed to any applicant with a disability who meets the essential criteria of the person specification. If you require any reasonable adjustments to the application process please contact the Recruiting Manager for this post.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Bridgewater Community Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121090"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Irwell Rd", "postalCode": "WA5 7YS"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4172", "longitude": "-2.6189"}}, "title": "Clinical Lead", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249399", "validThrough": "2020-11-15T23:59:59+0000"}