{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-10-19T10:17:10+0100", "description": "&lt;p&gt;&lt;strong&gt;Strategy Analyst, Analytics, Greener NHS team &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are recruiting a Strategy Analyst, to join the Analytics team in NHS England and NHS Improvement’s, Greener NHS programme, which sits within the Primary Care, Community Services and Strategy Directorate.&lt;/p&gt;\n&lt;p&gt;This is an incredibly exciting time to join the Greener NHS programme following the commitment by the NHS in its multiyear plan Delivering a ‘Net Zero’ National Health Service to become the world’s first carbon net zero national health system and the appointment of the NHS first Chief Sustainability Officer. This commitment and multiyear plan reflects growing evidence of the health impacts of climate change and air pollution and recognition that it is not enough for the NHS to treat the problems caused by air pollution and climate change – from asthma to heart attacks and strokes – it needs to play a part in tackling them at source. It builds on the NHS existing sustainability commitments in the NHS Long Term Plan.&lt;/p&gt;\n&lt;p&gt;Modelling and analytics were at the centre of the Greener NHS programme’s work and will be a critical enabler for delivery supporting the periodical review of progress and aims to increase the level of ambition over time.&lt;/p&gt;\n&lt;p&gt;This role is part of a dynamic team supporting the NHS to solve some of its toughest problems and secure a sustainable greener future. The Greener NHS team works closely with both corporate and regional teams across NHS England and NHS Improvement, with local health systems, Trusts and other stakeholders, including other data and analytics teams. They are uniquely placed to look across the health and care system, to better understand and reduce the environmental impacts of health and care, and save thousands of lives and hospitalisations across the country.&lt;/p&gt;\n&lt;p&gt;The postholder will be part of a small analytics team with responsibility for delivery of the data, analytics and modelling needs for the Greener NHS programme. They will support the continued development and improvement of modelling and analysis of the NHS carbon footprint and forecasts, the development and embedding of sustainability data and analytics into NHS England and NHS Improvement’s data and analytics environment.&lt;/p&gt;\n&lt;p&gt;We are seeking a highly motivated analytical professional who can work collaboratively across organisational boundaries and build relationships across the health system, academia and sustainability community. You will have analytical and technical skills, ability to structure problems and develop appropriate analytical solutions. You will have experience of supporting analytical projects, demonstrating the ability to manage competing priorities and tight deadlines for yourself. You will also demonstrate an understanding of sustainability and climate change issues.&lt;/p&gt;\n&lt;p&gt;Some travel throughout England may be required.&lt;/p&gt;\n&lt;p&gt;For further details&lt;/p&gt;\n&lt;p&gt;Email address: england.sdu@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/126694.png", "name": "NHS England and NHS Improvement", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126694"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Skipton House, London", "postalCode": "SE1 6LH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4963", "longitude": "-.100723"}}, "title": "Strategy Analyst", "url": "https://www.jobs.nhs.uk/xi/vacancy/916231766", "validThrough": "2020-11-09T23:59:59+0000"}