{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 per annum"}}, "datePosted": "2020-11-04T13:01:07+0000", "description": "&lt;p&gt;EAST LANCASHIRE CHILD AND ADOLESCENT MENTAL HEALTH SERVICE&lt;/p&gt;\n&lt;p&gt;Mental Health Practitioner - Mental Health in Schools&lt;/p&gt;\n&lt;p&gt;East Lancashire - Primary &amp; Secondary Schools&lt;/p&gt;\n&lt;p&gt;Recently rated outstanding by the CQC, ELCAS are excited to be recruiting supervising practitioners for the new Mental Health in Schools Support Teams in East Lancashire which will commence in September 2020. The Mental Health Support Teams are part of an exciting trailblazer project funded by NHS England, Health Education England and partners, with the aim of improving the mental health and wellbeing of children and young people in the community.&lt;/p&gt;\n&lt;p&gt;There is a specific focus on developing more access to helping and improving the general culture of emotional support within all primary schools in Burnley and Pendle, and secondary schools in Hyndburn, Rossendale and Ribble Valley.. Working alongside community partners the Mental Health Support Teams will be integrated with community ELCAS team and based in primary &amp; secondary educational settings across East Lancashire..&lt;/p&gt;\n&lt;p&gt;The supervising practitioner role for MHST will be to support the delivery of all interventions provided by the Education Mental Health Practitioners, ensuring that a wide range of evidence based interventions are used to support young people’s mental health and to ensure integration within is seamless and transparent. You will actively supervise the trainee Education Mental Health Practitioners as well as delivering short term evidence based interventions within the schools setting.&lt;/p&gt;\n&lt;p&gt;We are seeking to appoint enthusiastic and dynamic supervising practitioners who are passionate about children’s mental health, with a demonstrable track record of CAMHS clinical and supervisory experience. You will have experience of supervising clinicians and will be a CAMHS/IAPT professional registered with a professional body such as the NMC or HCPC.&lt;/p&gt;\n&lt;p&gt;The successful candidates must be willing to undertake Postgraduate Certificate in Children &amp; Young People&#39;s IAPT Supervision but the initial IAPT training may be available for the right candidates. The training will commence in September 2020.&lt;/p&gt;\n&lt;p&gt;At ELCAS (East Lancashire Child and Adolescent Services) our vision is to be a centre of excellence providing high quality Child and Adolescent psychological and mental health services that exceed people’s expectations. This vision is being delivered. We have been accredited by the Royal College of Psychiatrists’ Quality Network for Community CAMHS (QNCC) since 2016. In February 2019 the CQC rated us as Outstanding in providing Effective, Caring, Responsive and Well-led services – rating us as Outstanding overall.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameLindsey BonnickJob titleOperational LeadEmail addressLindsey.Bonnick@elht.nhs.ukTelephone number01282 804806&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "East Lancashire Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120742"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Across East Lancashire Sites, Across East Lancashire Sites", "postalCode": "BB10 2PQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8098", "longitude": "-2.22817"}}, "title": "Mental Health Practitioner (Schools) East Lancashire", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255950", "validThrough": "2020-11-18T23:59:59+0000"}