{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 plus HCAS pro rata for part time"}}, "datePosted": "2020-10-28T21:30:14+0000", "description": "&lt;p&gt;We are looking for enthusiastic and motivated band 6 Occupational Therapists (OT) who are keen to gain valuable experience or develop further in the exciting field of paediatrics. The successful candidate would work alongside our large and supportive professional Occupational Therapy team using a person centred, occupation based, holistic approach.&lt;/p&gt;\n&lt;p&gt;We have positions available within the Brentwood and Thurrock Community Children&#96;s Teams, part of the well-established specialist Children&#96;s OT team covering the South West Essex area.&lt;/p&gt;\n&lt;p&gt;The post holder will have a degree in Occupational Therapy, be HPC registered and should demonstrate a knowledge of the main treatment approaches, research and best evidence based practice in Children&#96;s OT. They will be motivated to develop their own learning and to contribute to service development. They will thrive on working as part of a team and will demonstrate excellent communication skills.&lt;/p&gt;\n&lt;p&gt;The post holder will be part of a fully integrated team (Occupational Therapy, Physiotherapy, Speech and Language Therapy, Specialist Health Visiting, Specialist School Nursing) with the benefits of having both a locality lead and a professional lead Occupational Therapist.&lt;/p&gt;\n&lt;p&gt;The Children&#96;s OT service is committed to providing excellent opportunities for clinical development and continuous learning.&lt;/p&gt;\n&lt;p&gt;Our service covers 3 specialist areas :&lt;/p&gt;\n&lt;p&gt;-Children with Autistic Spectrum Disorder (ASD) and/or sensory processing difficulties affecting function.&lt;/p&gt;\n&lt;p&gt;-Children with Neuro-developmental conditions such as ADHD, DCD, ASD with associated motor difficulties affecting function.&lt;/p&gt;\n&lt;p&gt;-Children with Physical and Neurological conditions such as Cerebral Palsy, Muscular Dystrophy, Downs Syndrome.&lt;/p&gt;\n&lt;p&gt;As part of our development programme, you will have opportunities to develop skills in all of these specialist areas. This will be supported through joint working and shadowing, regular supervision, in-service training, self- directed learning and access to appropriate external training. &lt;br /&gt;.&lt;br /&gt;The main responsibilities of the post: &lt;br /&gt;&lt;br /&gt;• To be responsible for managing allocated caseload independently, showing ability to prioritise appropriately.&lt;br /&gt;• Deliver specialist OT to children with physical and developmental conditions aged 0-19 in the Thurrock or Brentwood areas.&lt;br /&gt;• To work collaboratively with family/carers, colleagues and all agencies involved in the child’s care, in order to provide the highest level of care and safeguarding.&lt;br /&gt;• To access clinical professional development opportunities relevant to learning needs and clinical specialism.&lt;br /&gt;• To contribute to service development including audit, training and development of colleagues and students.&lt;br /&gt;&lt;br /&gt;This post will be subject to a probationary period. Internal applicants are exempt from the probationary period (unless you are an internal applicant currently part way through a probationary period or currently a bank member of staff).&lt;br /&gt;&lt;br /&gt;At NELFT we set very high standards to ensure we provide quality services. We require prospective employees to carry out an online literacy and numeracy test, equivalent to NVQ Level 2. For more information regarding our assessments, please visit our website. If you are successful at interview for this post, you will be required to undertake an assessment for these skills during the pre-employment checks&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Starting with NELFT&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;NELFT place a great deal of importance on new starters being properly welcomed and inducted into the Trust. All new starters will join the Trust on the first Monday of each month and will undertake a comprehensive induction of up to two weeks which will include mandatory training, systems training and the allocation of equipment. As part of the process new starters will have the opportunity to also meet the executive team, senior managers and attend a number of drop in sessions focussing in engagement, health and wellbeing and key processes. The induction will be held at our head office in Rainham, Essex.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;span&gt;&lt;strong&gt;High Cost Area Supplement – Essex&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;This post also attracts payment for High Cost Area Supplement of 5% of the basic salary (with a minimum of £1,034 to a maximum of £1,791)&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameJane SelbyJob titleOperational Lead Thurrock Community Children&#96;s Team/ Professional Lead OT BB+TEmail addressjane.selby@nelft.nhs.ukTelephone number01375 364427 07711425774Additional contact information&lt;/p&gt;\n&lt;p&gt;Jane Selby&lt;br /&gt;Thurrock Integrated Children&#96;s Therapy Team Lead / Professional Lead OT BB&amp;T&lt;br /&gt;&lt;br /&gt;Telephone number:01375 364427&lt;br /&gt;e-mail address:jane.selby@nelft.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NELFT NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120606"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Thurrock Community Hospital, Thurrock, Essex", "postalCode": "RM16 2PX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.496", "longitude": ".336337"}}, "title": "Specialist Children&#96;s Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247583", "validThrough": "2020-11-11T23:59:59+0000"}