{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365- £37,890"}}, "datePosted": "2020-10-23T08:52:41+0100", "description": "&lt;p&gt;Wheelchair Service - Occupational Therapist/ Physiotherapist/ Rehabilitation Engineer&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;An opportunity has arisen within the Wheelchair Services Team based in Lowestoft serving the population of Gt Yarmouth and Waveney . The Wheelchair service works with people aged from 36 months upwards. We work with our local Clinical Commissioning Group to deliver the National Service Specification. &lt;br /&gt;&lt;br /&gt;The role involves working in partnership with the patient to ascertain the patient &#39;s specific mobility needs and goals, utilising specialist assessment skills to identify the most appropriate intervention. This role would be suitable for a therapist with existing specialist skills in postural and seating management or an experienced therapist who has a desire to develop these specialist skills? &lt;br /&gt;Previous experience in neurology or paediatrics would be an advantage in this role.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be able to demonstrate their ability to work both independently and part of a small team. Good communication skills, time management skills and an ability to travel are all essential requirements of this role. In addition to clinical assessment and prescription of wheelchairs and equipment, you will be participating in multi agency meetings and liaising with other health and social care providers. This role would involve line managment of a more junior clinician.&lt;/p&gt;\n&lt;p&gt;This is an exciting time to join the service as we develop further implementation of the personal wheel chair budgets.&lt;/p&gt;\n&lt;p&gt;As a learning organisation there are opportunities for personal and professional development. &lt;br /&gt;&lt;br /&gt;For further information or an informal visit please contact service lead Angela Ruddy via angelaruddy@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/127294.png", "name": "East Coast Community Healthcare CIC", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127294"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Lowestoft", "postalCode": "NR33 0HF"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4677", "longitude": "1.7436"}}, "title": "Wheelchair Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916239732", "validThrough": "2020-11-06T23:59:59+0000"}