{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-10-26T14:46:37+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for the post of Senior Assistant Psychologist at the Hellingly Centre, within Sussex Partnership NHS Foundation Trust&#39;s Forensic Healthcare Services.&lt;/p&gt;\n&lt;p&gt;The Hellingly Centre is a purpose built Medium Secure Unit for people aged over 18 years who have mental health problems and who have become involved with the criminal justice system. We assess and manage people whose conditions cannot safely be treated other than in a secure or supervised environment. The Hellingly Centre has four specialist wards, including a male medium secure admissions ward, male medium secure treatment ward, a female medium secure ward and a male low secure ward. Each ward is looked after by staff from a range of professional backgrounds.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;The successful post holder will work as part of the Psychology and Psychological Therapies team in delivering a range of individual and group interventions to support patients in their recovery, in addition to completing assessments and contributing to the work of their Multidisciplinary Team. They will receive weekly clinical supervision with a Senior Psychologist, as well as having opportunities to work alongside a number of members of the psychological therapies team.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;This post would suit a motivated and enthusiastic individual who is keen to develop their skills and experience in fields of clinical and forensic psychology.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDr Louise RobertsJob titleConsultant Clinical PsychologistEmail addresslouise.roberts@sussexpartnership.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121074.jpg", "name": "Sussex Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121074"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hellingly Centre, Hellingly", "postalCode": "BN27 4ER"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8889", "longitude": ".268666"}}, "title": "Senior Assistant Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242955", "validThrough": "2020-11-09T23:59:59+0000"}