{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum"}}, "datePosted": "2020-10-15T11:46:44+0100", "description": "&lt;p&gt;&lt;span&gt;&lt;span&gt;This is an exciting opportunity for a Clinical or Counselling Psychologist with clinical and supervision experience in inpatient and community settings. Your time will be split between a community Adult Mental Health Team and the adult inpatient units. You will be a full member of an established adult inpatient ward playing a key role in clinical leadership and development, supervision and training. You will also work in one of the locality Adult Mental Health teams providing specialist assessment and psychological treatments.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;This role is crucial in ensuring that patients get access to high quality psychological treatments within the adult inpatient wards and Adult Mental Health Teams. On the inpatient unit, you will have responsibility for working with the Consultant Psychiatrist, modern matrons and ward teams to deliver assessments and treatment for individual and groups. You will also be offering reflective space and supervision to inpatient staff. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;This new post has been developed to ensure the inpatient wards achieve level 3 AIMS accreditation. As such you will work closely with other senior psychological therapists and senior clinical staff to deliver the further development of the service model.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;In the locality Adult Mental Health team, you will work as part of the integrated team providing specialist individual and group psychological treatments. You will also be offering supervision and be involved in audit and teaching.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;We offer accredited supervision and monthly opportunities to meet psychological therapy colleagues from across the county for reflective practice groups; clinical updates and professional development, as well as excellent CPD opportunities.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Liam Cuttell, Team manager on 01865 90&lt;/p&gt;\n&lt;p&gt;Jo Ryder, Clinical and Professional Lead on 01865 901000&lt;/p&gt;\n&lt;p&gt;Nokuthula Ndimande, Senior matron on 01865 901000.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Oxford Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122233"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Warneford Hospital / Littlemore Mental Health Centre, Oxford", "postalCode": "OX3 7JX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7508", "longitude": "-1.2223"}}, "title": "Senior Clinical or Counselling Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916228021", "validThrough": "2020-12-03T23:59:59+0000"}