{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 per annum"}}, "datePosted": "2020-11-05T14:46:37+0000", "description": "&lt;p&gt;As part of new investment into our Community Mental Health services across Mid Notts we are delighted to be able to offer a number of full and part time opportunities for Community Support Workers in the Mansfield and Ashfield area.&lt;/p&gt;\n&lt;p&gt;The Local Mental Health Teams provide individual packages of care to patients and their families in the community with individualised recovery approaches.&lt;/p&gt;\n&lt;p&gt;As a Community Support Worker you will be assisting in the provision of care and approaches that enhance patient outcomes. You will be part of a Multi-disciplinary team ensuring that high standards are maintained and improved upon with the support of the Team Leader. Staff supervision, appraisals and performance management will be areas of focus to ensure individual and team outcomes are achieved.&lt;/p&gt;\n&lt;p&gt;Applicants should be be passionate about supporting adults with mental health difficulties and their families to improve their health status . You must have a NVQ III in Health and Social care, care certificate or equivalent experience and have knowledge of Mental Health. We are seeking highly motivated and creative individuals holding a strong interest in developing both personally and professionally.&lt;/p&gt;\n&lt;p&gt;The posts can be offered on a full or part-time basis, with a minimum of 15 hrs up to 37.5hrs per week.&lt;/p&gt;\n&lt;p&gt;A full UK driving license and vehicle for business use is required for this post; however reasonable adjustments will be made for disabled individuals in line with the Equality Act 2010.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Ian Lerway - Team Leader&lt;/p&gt;\n&lt;p&gt;Email address: ian.lerway@nottshc.nhs.uk / Telephone number: 0115 9560858&lt;/p&gt;\n&lt;p&gt;or&lt;/p&gt;\n&lt;p&gt;Becky Beecroft - Clinical Leader&lt;/p&gt;\n&lt;p&gt;Email address: becky.beecroft@nottshc.nhs.uk / Telephone: 0115 9560858&lt;/p&gt;\n&lt;p&gt;*The closing date given is a guide. We reserve the right to close the post early once we have received a sufficient number of applicants, so we advise you to submit your application early to prevent disappointment. &lt;/p&gt;\n&lt;p&gt;*We will be requesting references by email.  Please ensure you include email addresses and contact numbers for your referees to avoid delay in the recruitment process.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120975.jpg", "name": "Nottinghamshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120975"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Sutton in Ashfield", "postalCode": "NG17 4JT"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.1347", "longitude": "-1.23809"}}, "title": "Community Support Worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258175", "validThrough": "2020-11-23T23:59:59+0000"}