{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 - £19,337"}}, "datePosted": "2020-10-16T15:16:21+0100", "description": "&lt;p&gt;&lt;strong&gt;Healthcare Assistant&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Band 2 – Full Time Permanent Positions available &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you are caring, compassionate, adaptable and innovative, then St Mary’s Isle of Wight Isolation ward needs you.&lt;/p&gt;\n&lt;p&gt;The unit was newly opened in March 2020 to meet the needs of patients who were Isolated due to COVID 19 within the hospital environment. Initially set up on a short-term basis, with the aim of providing a first class quality care to patients who are anxious, have clinically deteriorated and diagnosed with COVID 19. The ward has progressed to incorporate the Trust COVID-19 recovery plan which maintains the Isolation ward to be able to adapt to the Islands changing health care needs, to make the island safe.&lt;/p&gt;\n&lt;p&gt;In the short time of being opened, Isolation ward has already made a positive difference to the experience of Covid 19 Patients. The unit first had amazing redeployed members of the NHS trust who have gone back to the substantive positions, which has now created vacancy’s for people to join our newly formed motivated team on a journey.&lt;/p&gt;\n&lt;p&gt;The Isolation unit have been recognized for their contributions within the Trust and their outstanding team work. We take a diverse range of patient with the Trust, medical, surgical, orthopaedic gynaecological, urological and ENT. This means we are able to develop people within their role with lots of skills, able to use across all specialties. We promote a culture of learning and respect to each other valuing everyone’s contributions in this constantly changing climate we are in.&lt;/p&gt;\n&lt;p&gt;After coming together in the island’s time of need we are now looking for individuals who are first and foremost passionate about providing respectful and compassionate evidence based care. You will have high standards of person centred care and be someone who can work within a large but mutually supportive team. You will be someone with excellent communication skills who is able to put people at the centre of all you do, even in times of extreme distress. We are looking for people who are not scared of working in a safe high paced and challenging environment, and being proud of the care they are able to deliver.&lt;/p&gt;\n&lt;p&gt;We are a large team and all staff members are to be flexible with their working hours covering days, night and weekends where required. We also have access to regular clinical supervision with additional support and training.&lt;/p&gt;\n&lt;p&gt;For further information or to arrange an informal visit please contact Ward Sister, Mandy Webb on Tel: 534294.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/127355.jpg", "name": "Isle of Wight NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127355"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Isle of Wight", "postalCode": "PO30 5TG"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7111", "longitude": "-1.30088"}}, "title": "Healthcare Assistant - Isolation Ward", "url": "https://www.jobs.nhs.uk/xi/vacancy/916230817", "validThrough": "2020-11-19T23:59:59+0000"}