{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "75914", "minValue": "75914", "unitText": "YEAR", "value": "£75,914 per annum"}}, "datePosted": "2020-10-29T10:16:01+0000", "description": "&lt;p&gt;An exciting opportunity has arisen to join the HEE East of England Regional Nursing &amp; Midwifery Team as Deputy Head of Nursing/Midwifery. The successful candidate will work closely with the Regional Chief Nurse, wider nursing team and wider Team to ensure the delivery of the HEE mandate across the East of England. You will be an experienced, credible, senior Nursing /Midwifery leader and will be supported to thrive, build networks and develop the workforce transformation programmes to support the delivery of the regional response of 50,000 additional nurses by 2024.&lt;/p&gt;\n&lt;p&gt;As Deputy Head of Nursing/Midwifery, you will have a strong work ethic, an ability to manage multiple projects to tight time scales, and the confidence to present complex data and themes to senior colleagues across the region. You will lead and set strategy for a range of agreed programmes, using your clinical knowledge, expertise, and leadership to deliver innovation and transformation. You will work collaboratively with stakeholders, arm’s length bodies, CQC, education providers and other key partners to drive the delivery of the strategy across the region, and to ensure the delivery of agreed outcomes within timescales. You will also deputise for the Regional Chief Nurse and members of the Senior Leadership Team at local and national level.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The successful candidate should:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Be a Registered Nurse / Midwife with current registration with the NMC.&lt;/li&gt;\n&lt;li&gt;Be able to evidence strong leadership skills, expert clinical knowledge and experience of leading wide-scale complex programmes across a system.&lt;/li&gt;\n&lt;li&gt;Have a track record of commissioning and/or implementing education programmes across complex settings including negotiating changes to traditional modes of delivery.&lt;/li&gt;\n&lt;li&gt;Have experience of leading projects involving multiple partners and across organisational boundaries.&lt;/li&gt;\n&lt;li&gt;Have significant experience of managing a team and achieving objectives by working with others not under direct line management control.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Applicants will commence at the bottom of Band 8d with a full-time starting salary of £75,914 with a pay step increase after 5 years’ service.&lt;/p&gt;\n&lt;p&gt;These salaries are offered in accordance with NHS Terms and Conditions and the HEE Pay Progression Policy and are subject to annual cost of living review.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;strong&gt;If you like what you have read and think you have the skills and experience we need then don&#39;t delay, apply today! We get lots of applications for our roles and so we sometimes have to close our posts early. Don&#39;t miss out!&lt;/strong&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;These are exciting times, and this is a big agenda with a big ask, but if you want to shape the future nursing and midwifery workforce, working with compassionate and committed colleagues this could be the opportunity you have been looking for.&lt;/p&gt;\n&lt;p&gt;Please do get in touch if you have queries or would like to have an informal discussion.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Therese Davis, Regional Head of Nursing&lt;/p&gt;\n&lt;p&gt;Email: Therese.Davis@hee.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Health Education England", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127514"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "2-4 Victoria House, Cambridge", "postalCode": "CB21 5XB"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1848", "longitude": ".19314"}}, "title": "Regional Deputy Head of Nursing and Midwifery", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247875", "validThrough": "2020-11-12T23:59:59+0000"}