{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "per annum pro rata + 5% of basic salary, subject t"}}, "datePosted": "2020-10-27T16:01:54+0000", "description": "&lt;p&gt;If you are an enthusiastic, motivated, and conscientious individual who is committed to improving services for people who are experiencing a mental health crisis in Hertfordshire, then we want you!&lt;/p&gt;\n&lt;p&gt;This is a genuinely exciting time to join us as we have recently received investment to develop an age inclusive Crisis Resolution and Home Treatment Service, in the East of Hertfordshire. We are actively seeking to appoint team members with a wide range of experience and skills. Right now we are actively seeking to recruit team members who have recent experience of working with older people, in either ward or community settings, in order to ensure that we are well placed to deliver high quality care to patients irrespective of age.&lt;/p&gt;\n&lt;p&gt;The service ‘gate keeps’ all admissions to acute mental health wards, aiming to provide care in the least restrictive manner by offering an alternative to hospital admission through intensive home treatment for service users aged 18 and over, including people aged over 65 with a functional illness. Where required, the team support planned admission to wards and work closely with wards to facilitate timely discharge back to the community and where appropriate, to a host family.&lt;/p&gt;\n&lt;p&gt;You’ll have experience of working with service users both working age adults and people over the age of 65 who have presented with a mental health crisis. We’d like to see a real passion for mental health crisis services, and the difference they can make to service users and carers. It’s a challenging role, in a challenging environment, but we believe it will provide a talented and ambitious person with real scope to develop and influence practice.&lt;/p&gt;\n&lt;p&gt;The Trust itself is a leading provider of mental health and learning disability services and we’ve been rated ‘Outstanding’ by the CQC. We’re a strongly values-based organisation, so that you, and anyone that comes into contact with our services, will experience consistently welcoming, kind, positive, respectful and professional treatment.&lt;/p&gt;\n&lt;p&gt;You’ll be provided with a full induction and training package before commencing in the role. You have the support and benefit from excellent promotion prospects, some state of the art clinical environments and the opportunity to be part of a fantastic multidisciplinary team of staff who are genuinely committed to improving the lives of our service users and carers. We have an excellent range of staff benefits.&lt;/p&gt;\n&lt;p&gt;If this post interests we want to hear from you!&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Phil Lisboa - Team Leader, East Crisis Assessment Team - 01707 364005&lt;/p&gt;\n&lt;p&gt;Gilanda Welch - Service Manager - 07585887584&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120841.png", "name": "Hertfordshire Partnership University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120841"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Rosanne House, , Welwyn Garden City", "postalCode": "AL8 6JE"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.804", "longitude": "-.208743"}}, "title": "CATT Worker / CPN", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245324", "validThrough": "2020-11-10T23:59:59+0000"}