{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19337", "unitText": "YEAR", "value": "£19,337 to £21,142 per annum"}}, "datePosted": "2020-11-03T14:03:35+0000", "description": "&lt;p&gt;&lt;strong&gt;Job Title – Peripatetic Health Care Assistant – Band 3&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Base – Wotton Lawn Hospital, Gloucester&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary – Band 3: £19,737 - £21,142 per annum&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours per week – Various Hours Available up to 37.5 per week &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are currently recruiting to a team of Health Care Assistants who work across all of the wards at one of our main mental health inpatient sites. You will be based at Wotton Lawn Hospital in Gloucester. This exciting opportunity has arisen for motivated and flexible individuals to work as part of a peripatetic team providing cover across day, night and weekend shifts according to the needs of the service. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Wotton Lawn Hospital is an 88 bed acute mental health hospital situated near the centre of Gloucester and provides working age adult inpatient services for the county of Gloucestershire.&lt;/strong&gt;&lt;strong&gt; The hospital has four admission wards, a nurse-led psychiatric intensive care unit (PICU)and a low secure unit (LSU). Service users are supported by a variety of healthcare workers including nurses, doctors and allied health professionals such as psychologists, art therapists, physiotherapists, occupational therapists and sports exercise therapists.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This opportunity will provide the successful candidates with the chance to work within highly motivated multi-disciplinary teams under the direction and supervision of qualified staff, assisting them in delivering patient care. An essential part of your role will be to observe, report and record changes in the service users’ behaviour as well as their physical and mental health. You will at times need to assist with personal care and activities of daily living. There will be also opportunities for further training and progression into higher grades for the right candidates.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;As a Health Care Assistant you will be responsible for participating and assisting in the delivery of care / services to patients and service users as part of a Mental Health and Social Care Health Service. Health Care Assistant, Social Care Workers and other Healthcare Support Workers employed by the Trust are required to follow the guidance set out in Code of Conduct for Health Care Assistants/ Health Care Support Workers to provide safe and compassionate care of a high standard, and to challenge others who are not. You will receive direct supervision and partake in reflective practice / training on a regular basis and be required to work towards the Care Certificate standards.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The qualification, training &amp; experience requirements for the role are underlined in the Job Description/Person Specification.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further information regarding these vacancies, please contact Sue Hewlett, Staff Bank Manager on 0300 4218370 or sue.hewlett@ghc.nhs.uk&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The qualification, training &amp; experience requirements for the role are underlined in the Job Description/Person Specification.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing date: 22nd November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Shortlisting date: 23rd November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As a Health Care Assistant/ Support Worker you will be responsible for participating and assisting in the delivery of care / services to patients and service users as part of a Mental Health and Social Care Health Service. Health Care Assistant, Social Care Workers and other Healthcare Support Workers employed by the Trust are required to follow the guidance set out in Code of Conduct for Health Care Assistants/ Health Care Support Workers to provide safe and compassionate care of a high standard, and to challenge others who are not. You will receive direct supervision and partake in reflective practice / training on a regular basis and be required to meet the Care Certificate standards.&lt;/p&gt;\n&lt;p&gt;This post requires the post holder to be able to undertake all statutory and mandatory training and post holders must be able to undertake physical interventions. Fitness for physical intervention will be assessed by Occupational Health.&lt;/p&gt;\n&lt;p&gt;A valid UK driving licence plus the use of own transport for business purposes is essential. For qualifying staff the Trust has a Lease Car Scheme in place and also offers a popular Salary Sacrifice Car Scheme with our partner Tusker.&lt;/p&gt;\n&lt;p&gt;To ensure you fully understand how the Trust, as a Data Controller, will process and store your data please read the attached document ‘ Applicant and Staff Privacy Notice’ prior to applying for the role.&lt;/p&gt;\n&lt;p&gt;Candidates for any staff appointment shall, when making application, disclose in writing to the Trust whether they are related to any governor. Failure to disclose such a relationship may disqualify a candidate and, if appointed, may render him/her liable to dismissal.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120776.png", "name": "Gloucestershire Health and Care NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120776"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Gloucester", "postalCode": "GL1 3WL"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.867", "longitude": "-2.22789"}}, "title": "Peripatetic Health Care Assistant - Band 3", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254259", "validThrough": "2020-11-22T23:59:59+0000"}