{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683"}}, "datePosted": "2020-11-06T10:46:39+0000", "description": "&lt;p&gt;&lt;strong&gt;Shrewsbury and Telford Hospital NHS Trust&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Consultant Gastroenterologist&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are inviting applications for this replacement post to meet our increasing demand for Gastroenterology services within Shropshire. We are looking for enthusiastic and motivated colleagues to help develop existing services to provide the highest quality of care for all patients.&lt;/p&gt;\n&lt;p&gt;We have 1 post available. The first post is for a Consultant Gastroenterologist to replace a colleague transitioning to a specialist endoscopist role.&lt;/p&gt;\n&lt;p&gt;The post holder will integrate with the current specialities offered by the existing team, which include: inflammatory bowel disease, nutrition, hepatology, GI physiology, bowel screening, EUS, ERCP, BCSP and colonic EMR.&lt;/p&gt;\n&lt;p&gt;The post will be given the opportunity to develop sub speciality interests that complement those of the current team. This can be explored further during pre-application enquiries.&lt;/p&gt;\n&lt;p&gt;Applicants must possess recognised training and broad experience in Gastroenterology and General (Internal) Medicine and full registration with the GMC. Applicants must be on the GMC’s Specialist Register, or be within 6 months of achieving CCT in Gastroenterology and General (Internal) Medicine.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Department &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The department is currently made up of 12 consultants. The team is supported by specialist nurses in upper GI cancer, nutrition, endoscopy, viral hepatitis, bowel screening, IBD and research in addition to a junior medical team which includes 4 specialist trainees. We have two JAG accredited endoscopy units at the Royal Shrewsbury and Princess Royal Hospitals. We provide outpatient and endoscopy services in both hospitals. Gastroenterology and Hepatology inpatients are admitted to a war on the Shrewsbury site which is co-located with surgery.&lt;/p&gt;\n&lt;p&gt;Currently, consultants also provide AMU in-reach and inpatient referrals service for patients at both the Royal Shrewsbury and Princess Royal Hospitals. Gastrointestinal bleeds are only admitted to the Royal Shrewsbury Hospital. Out of hours activity for consultants is limited to endoscopy and review of specific gastroenterology inpatients at weekends with no contribution to the acute medical take.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Our Hospitals&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Our Hospitals are located in Shrewsbury and Telford and are brimming with exemplary teams of hardworking individuals.&lt;/p&gt;\n&lt;p&gt;It is a particularly exciting time to join the Trust as we have recently started working collaboratively with the Virginia Mason Hospital in Seattle. We are one of only 5 UK hospitals to receive this support, from what is regarded as the safest hospital in the world. This collaboration means employees can benefit from the KPO (Kaizen Promotion Office) and value Stream work, gaining valuable help and guidance regardless of your level of expertise. It poses a unique opportunity to make a difference and we hope you will want to be a part of our journey. More about this can be found under further links.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Shropshire&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Shropshire is a beautiful county located between the West Midlands and North Wales. Whilst rural and home to the Shropshire Hills it is anything but sleepy. The county is bustling with idyllic towns including Shrewsbury, Oswestry, Bridgnorth and Ludlow, with plenty to do regardless of your interests. More information can again be found under further links.&lt;/p&gt;\n&lt;p&gt;We are ideally located between the north and the south making travelling around the UK extremely easy. As well as being only a short distance from major cities and busy transport links including Birmingham airport, our county also borders with beautiful north Wales which is abundant in outdoor activities, brilliant beaches, and thrilling scenery.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;We want you to find out more about the department and our hospitals, and we invite you to contact us with any questions you may have, or arrange a visit. For an informal discussion, please contact:&lt;/p&gt;\n&lt;p&gt;Dr Elizabeth Harrison, Clinical Lead and Consultant Gastroenterologist on 01743 261000 Extension 1480 elizabeth.harrison8@nhs.net&lt;/p&gt;\n&lt;p&gt;Ms Sabeena Khanna, HR Business Partner Scheduled care on 01952 641222 ext 4826 sabeena.khanna@nhs.net&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We look forward to hearing from you.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120882.png", "name": "Shrewsbury and Telford Hospital NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120882"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Shrewsbury, Shrewsbury", "postalCode": "SY3 8XQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.7094", "longitude": "-2.79375"}}, "title": "Consultant Gastroenterologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259287", "validThrough": "2020-12-06T23:59:59+0000"}