{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 pro rata per annum"}}, "datePosted": "2020-11-03T10:46:41+0000", "description": "&lt;p&gt;&lt;strong&gt;Advanced Physiotherapist with a special interest in chronic pain - 27 hours per week&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;A fantastic opportunity has arisen for dedicated and self-motivated Physiotherapist with a special interest in spinal conditions to join our Integrated Therapy Team within Stockport NHS Foundation Trust. This post is split across MSK Physiotherapy based at Kingsgate House and Outpatient Therapies based at Stepping Hill Hospital. The post holder will be responsible for the provision of an advanced specialist Physiotherapy service for patients referred with chronic pain using a holistic approach at Kingsgate House and working directly with the multi-disciplinary Pain Management service at Stepping Hill Hospital.&lt;/p&gt;\n&lt;p&gt;The Musculoskeletal and Outpatient Therapy Services are busy and forward thinking providers of Community Outpatient Physiotherapy across thirteen clinic sites in Stockport as well as within secondary care. We receive referrals for acute and chronic conditions from GPs, ESPs, Orthopaedic Consultants, Pain Clinic and occupational health.&lt;/p&gt;\n&lt;p&gt;Our Clinicians offer individual Out Patient Assessment and Treatment across a variety of Musculoskeletal Conditions within a diverse population and promote self-management, as well as providing a variety of exercise groups within our gym facilities. You will be able to consolidate and build on your clinical and management skills. We have an established appraisal system with which to actively support your Continued Professional Development.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;The successful candidate will have excellent communication skills and be able to work well both autonomously and as part of a multi-disciplinary team on behalf of a Consultant led Pain Team. They will be able to show evidence of specialist knowledge in and extensive experience of working in an Outpatient Musculoskeletal Physiotherapy environment with experience of pain management programs being advantageous. They will be responsible for managing their own patient caseload and supervision of junior staff and students. They will also be expected to contribute to service development initiatives and be involved in regular audits&lt;/p&gt;\n&lt;p&gt;The Trust is committed to safeguarding and promoting the welfare of children, young people and vulnerable adults and expects all staff and volunteers to share this commitment and promote safeguarding by implementing the Trust’s policies and procedures, acting promptly on concerns, communicating effectively and sharing information appropriately.&lt;/p&gt;\n&lt;p&gt;If successful this vacancy will require an enhanced DBS check at a cost of £43.50. This cost will be deducted from your first Trust salary &lt;br /&gt;&lt;br /&gt;In addition to this it will be a condition of your employment that you will join the DBS update service and pay the annual subscription fee of £13.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameSarah BrooksAdditional contact information&lt;/p&gt;\n&lt;p&gt;For further information please contact Sarah Brooks, Outpatient Therapy Team Leader at SHH on 0161 419 4060 or Andrea Yule, MSK Physiotherapy Team Leader at Kingsgate House on 0161 204 4696&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Stockport NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122553"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Stepping Hill Hospital / Kingsgate House, Stockport", "postalCode": "SK2 7JE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3838", "longitude": "-2.13202"}}, "title": "Advanced Physiotherapist with a special interest in chronic pain", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253535", "validThrough": "2020-11-10T23:59:59+0000"}