{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum"}}, "datePosted": "2020-10-23T15:16:25+0100", "description": "&lt;p&gt;&lt;strong&gt;Are you a Consultant Psychiatrist who is dedicated and passionate about improving mental health services? Are you looking for your next role as a dynamic clinical leader in general adult Psychiatry?&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;We have an exciting opportunity for a Consultant Psychiatrist to join the Intensive Service, based at the Long Fox Unit, Weston General Hospital.&lt;/p&gt;\n&lt;p&gt;The Intensive service operates 24 hours a day, 365 days a year and is the gate keeping and discharging agent for inpatient services, providing expert assessment to individuals experiencing mental health crisis. As the Consultant for this service, you will deliver direct interventions to service users including emergency assessment, diagnoses and treatment of mental and physical health needs. You will manage the delivery of intensive home treatment and alternatives to hospital admission.&lt;/p&gt;\n&lt;p&gt;North Somerset Mental Health has a forward thinking and inclusive medical community, committed to ‘Listening into Action’. Unblocking the way for medics to make changes for the better. We are committed to your development and helping you to achieve your career aspirations. You will be encouraged and supported to be involved in service leadership and management. We offer one of the most competitive and flexible benefits packages.&lt;br /&gt;&lt;br /&gt;North Somerset is located at the gateway to the South West and offers the best of seaside and country living combined with the benefits of being close to the vibrant cities of Bristol, Bath and Exeter. It has easy travel routes to Devon, Cornwall, South Wales, London and beyond via the M4 and M5, a central train station in Weston-Super-Mare and several smaller stations across the area and is situated close to Bristol International Airport.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Dr Iwona Kolsut, Medical Lead, Tel:01275 335300&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121159.jpg", "name": "Avon and Wiltshire Mental Health Partnership NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121159"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Long Fox Unit, Weston-super-Mare", "postalCode": "BS24 7FY"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3566", "longitude": "-2.91102"}}, "title": "Consultant Psychiatrist - Intensive Services", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241079", "validThrough": "2020-11-09T23:59:59+0000"}