{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-10-28T13:16:01+0000", "description": "&lt;p&gt;This is an ideal opportunity for someone to work as a senior community mental health practitioner in a community mental health team for older people. The post is open to suitable applicants from nursing, occupational therapy or social work.&lt;/p&gt;\n&lt;p&gt;The team works with people who have either organic or functional mental health problems. You will be a core member of the community mental health team, responsible for your own caseload, working as a care co-ordinator providing assessments and delivering intervention in line with clearly identified clinical pathways. You will have a positive approach to delivering care and team working, promoting recovery , independence and well-being. As a Band 6 you will be expected to offer clinical leadership and supervision to other staff and students, taking responsibility for the day to day support of the team.&lt;/p&gt;\n&lt;p&gt;The ideal candidate will be well motivated and be able to demonstrate best practice in community mental health service delivery for older people. You will be supported through supervision from the leadership team. There are opportunities to be involved in service development to improve the quality of the service both within the team and across the Locality. There is a strong team working ethos within the team and you would be expected to contribute to and support this.&lt;/p&gt;\n&lt;p&gt;Based at Huntington House the team works across Monday to Friday 9-5 and covers both the North and East of York as well as surrounding rural areas including Pocklington and Easingwold. Due to the nature of the role it is essential that applicants are able to travel independently across the locality and have access to a suitable vehicle for business purposes. If necessary, adjustments can be considered in accordance with the Equality Act 2010.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Lynne Maskill, Team Manager lynne.maskill@nhs.net&lt;/p&gt;\n&lt;p&gt;01904 556704 / 07766414651&lt;/p&gt;\n&lt;p&gt;Lena Knowles, Advanced Nurse Practitioner, 01904 556704 or 07388372923&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122252.jpg", "name": "Tees, Esk and Wear Valleys NHS Foundation Trust ", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122252"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Huntington House, York", "postalCode": "YO32 9XW"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.9867", "longitude": "-1.05116"}}, "title": "Senior Community Mental Health Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246724", "validThrough": "2020-11-15T23:59:59+0000"}