{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82096 - 110,683 per annum inclusive"}}, "datePosted": "2020-10-30T09:19:58+0000", "description": "&lt;p&gt;&lt;strong&gt;Consultant Geriatrician, Honorary Visiting Senior Lecturer&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for a forward-thinking Consultant Geriatrician to complete an experienced and dynamic team of 7 at the Princess Alexandra Hospital. We would welcome applications from existing or newly trained Consultants who have an interest in holistic elderly care, particularly for elderly patients requiring surgery, and who also have an eye for quality improvement and research. Please note that previous pedigree in research although desirable, is not essential for the Anglia Ruskin University Honorary Visiting role, and this will be developed with the successful candidate, with dedicated time set aside within the job plan. There will be opportunities to lead on the provision of exceptional quality of life for our senior population, and to demonstrate geriatric expertise across different specialties and in the community. The successful candidate will be encouraged to work as part of an established multidisciplinary team and will help develop new models of care within acute elderly pathways. There will be opportunities to visit a tertiary centre on a monthly basis.&lt;/p&gt;\n&lt;p&gt; Elderly care at the Princess Alexandra is designed to give the best, ethical, timely care, first time. Services include our front-door (same-day-emergency-care) service, short stay unit as well as ortho-geriatric ward services, community clinics, Parkinson’s Disease clinics and general clinics, all designed to support our patients in their later years by meeting their changing needs seamlessly and avoiding crisis moments.&lt;/p&gt;\n&lt;p&gt;This is an opportunity to join an organisation in which clinicians are at the forefront of management and service development. Princess Alexandra is a great place to work. It has an expanding population with growing healthcare needs which will be matched by service expansion and new ways of working. The Trust is heavily engaged with local providers and the CCGs to innovate with new models of integrated care. There are opportunities to live in a place that suits you, be it London, Cambridge, or the many picturesque villages of Essex and Hertfordshire with their excellent schools. Rail connections are excellent and both Stansted and Luton airports are only a short distance away.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Name&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Dr Kapila Gunasekera&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job title&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Lead Clinician, Elderly Care&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Email&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;kapila.gunasekera@nhs.net&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Telephone number&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;01279 444455 extension 2223, 2765&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Additional contact information&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Dr Robert Ghosh, Associate Medical Director: 01279 444455 extension 2590 or email directly robertghosh@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121503.PNG", "name": "The Princess Alexandra Hospital NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121503"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Harlow, Harlow", "postalCode": "CM20 1QX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7713", "longitude": ".086331"}}, "title": "Consultant Geriatrician, Honorary Visiting Senior Lecturer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249461", "validThrough": "2020-11-27T23:59:59+0000"}