{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-10-29T15:01:01+0000", "description": "&lt;p&gt;An exciting and challenging opportunity has arisen for an enthusiastic person to become part of the Lung Function service at Northumbria Healthcare NHS Foundation Trust. The position will be 37.5hrs full time for a 12 month fixed term contract to cover maternity leave. We are looking for a highly motivated and experienced Respiratory Physiologist to work with us, to provide a high quality of care to all of our patients, on the Wansbeck General Hospital, North Tyneside General Hospital and outlying sites. You will need to have the ability to work both independently and as part of a team. In addition, the flexibility to work around clinic times is essential. The successful candidate will need to be experienced in diagnostic tests, spirometry, lung volumes, gas transfer, skin tests, challenge testing, walk tests and other specialised tests including CPET. To be involved in sleep study set up and analysis, CPAP issue, maintenance and patient support. To offer support for all clinical needs, provide a service for specialities outside of respiratory medicine and to be involved in research investigations.&lt;/p&gt;\n&lt;p&gt;As well as carrying out clinical investigations, the role will include strategic planning and service development; providing supervision and ongoing education for other members of staff. You must have a BSc in Clinical Physiology (or equivalent), ARTP certification, as well as evidence of CPD. RCCP or HCPC registration is desirable for this post. Flexibility, team-working ability and good organisational skills are key to this post. If you wish to develop your career and you like your work to be different every day, then this opportunity to be part of a large, dynamic and expanding service may just be the opportunity you are looking for. If you would like to discuss this post, please contact Mark Anderson.&lt;/p&gt;\n&lt;p&gt;The post is subject to the Agenda for Change: NHS Terms and Conditions of Service Handbook.&lt;/p&gt;\n&lt;p&gt;For further information please contact: Mark Anderson on 0344 811 8111 ext 32657&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing Date: 12th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Mark Anderson&lt;/p&gt;\n&lt;p&gt;Senior Chief respiratory Physiologist&lt;/p&gt;\n&lt;p&gt;mark.anderson@nhct.nhs.uk&lt;/p&gt;\n&lt;p&gt;For further information please contact: Mark Anderson on 0344 811 8111 ext 32657&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Northumbria Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120801"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wansbeck General Hospital, Ashington", "postalCode": "NE63 9JJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "55.1843", "longitude": "-1.54662"}}, "title": "Highly Specialist Respiratory Clinical Physiologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248793", "validThrough": "2020-11-12T23:59:59+0000"}