{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Band Equivalent"}}, "datePosted": "2020-11-01T01:04:49+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;JOB TITLE: &lt;/span&gt;&lt;/strong&gt;&lt;strong&gt;Mental Health Nurses&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Berkshire Healthcare Foundation Trust is urgently recruiting for band 6 Mental Health Nurses to provide support to the Slough Community Mental Health Team. The post-holder is expected to fill a care co-ordination role.&lt;/p&gt;\n&lt;p&gt; The post holder will operate within the principles of recovery and as such support each patient to develop a Wellness Recovery Action Plan and Recovery STAR and reduce dependence on Secondary Mental Health Services enabling a planned integration into local community facilities and then discharge as part of the patient’s recovery plan.&lt;/p&gt;\n&lt;p&gt;As an experienced mental health practitioner, the post holder will direct and supervise junior staff and/or students and resources within their area of responsibility and take an active participation in clinical quality assurance and learning programmes.&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To have clinical responsibility for a case load as specified by the Locality Team Leader.&lt;/li&gt;\n&lt;li&gt;To assess service user needs, plan effectively, monitor and evaluate interventions using evidence-based practice which is relevant to individual needs and within a framework of research and audit.&lt;/li&gt;\n&lt;li&gt;To participate in duty work on a rota basis with other team members when necessary.&lt;/li&gt;\n&lt;li&gt;To support service users to comply with medication regimes, and where appropriate to administer depot medication.&lt;/li&gt;\n&lt;li&gt;To provide interventions in the most appropriate settings according to service user need and choice, including client’s own homes, community venues, and CMHT premises.&lt;/li&gt;\n&lt;li&gt;To provide the necessary supervision of other professionals and students where applicable.&lt;/li&gt;\n&lt;li&gt;To develop effective partnerships within the multidisciplinary team across other agencies.&lt;/li&gt;\n&lt;li&gt;To ensure the implementation of Trust and national policies in particular with regard to CPA and risk strategies.&lt;/li&gt;\n&lt;li&gt;To collect and provide statistical data as required.&lt;/li&gt;\n&lt;li&gt;To maintain comprehensive case records in line with Trust requirements and using Electronic Social Care Recording system.&lt;/li&gt;\n&lt;li&gt;To maintain a holistic approach with clients and work with them in all aspects of their lives in a variety of settings, in order to promote health and maximise independence.&lt;/li&gt;\n&lt;li&gt;To be aware of the professional responsibilities in relation to the UKCC Code of Practice and Nursing and Midwifery Council guidelines.&lt;/li&gt;\n&lt;li&gt;To effectively implement Trust policies and procedures and ensure adherence to them.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Location: &lt;/strong&gt;based at New Horizons, Slough.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Shifts/Hours:&lt;/strong&gt; Monday to Friday, 9am to 5pm. &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Band 6 – Example Rate&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Day Rate - £20.35 per hour&lt;/p&gt;\n&lt;p&gt;Night/Sat Rate - £26.16 per hour&lt;/p&gt;\n&lt;p&gt;Sun/Bank Holiday Rate - £31.97 per hour&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;In return for your hard work and your professional, caring and reliable service you will have access to the following benefits:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Competitive, weekly pay&lt;/li&gt;\n&lt;li&gt;Access to the NHSP Stakeholder Pension&lt;/li&gt;\n&lt;li&gt;Paid annual leave and statutory maternity pay&lt;/li&gt;\n&lt;li&gt;Training and development opportunities&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Registration with NHS Professionals is subject to employment history and reference checking and offers of registration are therefore conditional upon the receipt of satisfactory references.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further information about the role, please contact &lt;/strong&gt;&lt;strong&gt;BerkshireHealthcare@NHSProfessionals.nhs.uk&lt;/strong&gt;&lt;strong&gt;.&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NHS Professionals - Flexible Workers", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121069"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Slough CMHT", "postalCode": "SL2 5BX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5201", "longitude": "-.597697"}}, "title": "Mental Health Nurses", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251150", "validThrough": "2021-01-02T23:59:59+0000"}