{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum + Inner London HCAS"}}, "datePosted": "2020-11-02T19:30:14+0000", "description": "&lt;p&gt;&lt;strong&gt;Mental Health Practitioner – Health in Justice Liaison and Diversion Services&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Employer:&lt;/strong&gt; Barnet, Enfield &amp; Haringey Mental Health NHS Trust&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Department: &lt;/strong&gt;Health in Justice Liaison and Diversion mental health services&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location:&lt;/strong&gt; based across various sites at north and central London&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Posts: &lt;/strong&gt;1 x Band 6 Permanent Contract&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for a forward thinking and motivated mental health practitioner to work within the Police and court services across north and central London sites which is part of Barnet, Enfield and Haringey Mental Health Trust. The post holder will remain flexible working across the north and central London sites which include police custody suites, magistrate’s court and British Transport Police situation over a total of seven sites. The post holder will provide an all age autonomous screening and assessment service at the respective sites; respond professionally to requests for information and assistance; utilise their discretion as an independent professional and understand the importance of partnership working within the police and court services. A strong awareness of the care pathway for vulnerable children and adults is essential when undertaking the mental health practitioner role within Liaison and Diversion services.&lt;/p&gt;\n&lt;p&gt;Our service passionately believes in the importance of quality improvement which is about creating a culture where everyone has a voice and where service users and staff work together to make a difference for those whom are most in need of the service.&lt;/p&gt;\n&lt;p&gt;You will be able to undertake comprehensive mental health and risk assessments; develop effective risk management plans, provide brief interventions and be confident in signposting individuals whom come through the range of services and require follow up outside of the scope of Liaison and Diversion services. Knowledge of broader mental health services is important in delivering this role in an effective manner and there is an emphasis on working with other professional disciplines, sharing knowledge and skills whilst advocating for the service user. Understanding of relevant legislation is important to this role.&lt;/p&gt;\n&lt;p&gt;The post holder will have a strong awareness of confidentiality and information sharing guidelines at all times. This information may be both complex and sensitive and require excellent communication and negotiation skills to provide the service as an autonomous and independent senior practitioner within these environments. The applicant will be responsible for assessment of information in partnership with the criminal justice system and other agencies to determine the level of risk to people with mental health issues or other vulnerabilities.&lt;/p&gt;\n&lt;p&gt;This is a fantastic opportunity to be involved in the further evolution and development of an established service that is progressive and supportive of its staff. You will receive ongoing professional support and development in this exciting and challenging area of work.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please note that as this role is working alongside police additional high-level security vetting is a requirement of the role. The role will require security clearance to SC level with the Metropolitan Police Service and / or the British Transport Police. Full DBS clearance will be required for this position.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The service runs 7 days per week from 8am to 9pm at most sites which includes bank holidays and weekends with opportunity for flexible working arrangements.&lt;/p&gt;\n&lt;p&gt;The successful candidate would ideally start as soon as possible following interview, successful employment checks and vetting.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name:Jim Beck&lt;/p&gt;\n&lt;p&gt;Job title: Service Manager&lt;/p&gt;\n&lt;p&gt;Email address: jim.beck2@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number: 0208 213 7708&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Barnet Enfield and Haringey Mental Health Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120621"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "London", "postalCode": "EN2 8JL"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6663", "longitude": "-.103613"}}, "title": "Mental Health Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253065", "validThrough": "2020-11-16T23:59:59+0000"}