{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51393", "minValue": "45780", "unitText": "YEAR", "value": "£45,780 - £51,393 p.a inclusive of HCA"}}, "datePosted": "2020-10-27T10:01:50+0000", "description": "&lt;p&gt;Guy&#39;s and St Thomas&#39; NHS Trust (GSTT) has embarked upon a comprehensive cancer strategy that will shape the future of services for the next generation of cancer patients. We strive to become a world class cancer service, delivering internationally distinctive services that are patient centred, research driven and clinically lead. The cancer centres at GSTT and Queen Mary&#39;s Hospital, Sidcup (QMH), have been created so that we can realise this vision.&lt;br /&gt;&lt;br /&gt;An exciting opportunity has arisen for a highly motivated and enthusiastic individual to join our cancer services pharmacy team. You will be part of a growing multi-professional team that provides specialist cancer and palliative care to patients at GSTT.&lt;br /&gt;&lt;br /&gt;You will work alongside other specialist oncology pharmacists to provide a clinical pharmacy service to oncology and haematology inpatient wards and outpatient clinics, support the Consultant Pharmacist in Palliative and End of Life Care to deliver specialist pharmacy services to hospices, and supervise the safe and accurate dispensing of aseptically prepared systemic anti-cancer therapies, on a rotational basis. &lt;br /&gt;We currently supply over 35 000 individual patient doses each year and work closely with the cancer services directorate to integrate pharmacy services into the patient pathway. &lt;br /&gt;&lt;br /&gt;Candidates should have demonstrable competencies in hospital clinical pharmacy practice, excellent communication skills and commitment to pharmaceutical care. Furthermore candidates should be highly organised and have undertaken a Diploma in Clinical Pharmacy (or equivalent).&lt;/p&gt;\n&lt;p&gt;For Further Information Lisa Yuen (Highly Specialist Haemato-oncology Pharmacist) 020 7188 2027 or via email lisa.yuen@gstt.nhs.uk, or Kathryn Paterson (Highly Specialist Pharmacist for Oncology Surgery) 07738 262695&lt;/p&gt;\n&lt;p&gt;Closing Date: 8 November 2020 at Midnight&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameLisa Yuen or Kathryn PatersonAdditional contact information&lt;/p&gt;\n&lt;p&gt;Lisa Yuen (Highly Specialist Haemato-oncology Pharmacist) 020 7188 2027 or via email lisa.yuen@gstt.nhs.uk or Kathryn Paterson (Highly Specialist Pharmacist for Oncology Surgery) 07738 262695&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121066.jpg", "name": "Guy's and St. Thomas' NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121066"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Guy&#39;s Hospital, London", "postalCode": "SE1 9RT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5046", "longitude": "-.088964"}}, "title": "Specialist Oncology Pharmacist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243914", "validThrough": "2020-11-08T23:59:59+0000"}