{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24907", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 per annum"}}, "datePosted": "2020-11-06T16:16:24+0000", "description": "&lt;p&gt;&lt;span&gt;Do you thrive on &lt;/span&gt;&lt;span&gt;being busy? Are you a highly organised individual looking for a new exciting opportunity? &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We’re seeking a highly efficient, motivated individual, with excellent organisational and communication skills, to provide Personal Assistant support to the Director of Performance and Delivery in the North East and Yorkshire region. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Working in a fast-paced and dynamic environment, you’ll undertake a variety of tasks including collating information, producing briefings and reports; organising and administering Regional meetings and managing correspondence. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will need experience of managing busy diaries and producing quality work to demanding timescales. You will need to demonstrate an ability to build positive relationships with colleagues and key stakeholders across the organisation and beyond, inspiring trust, confidence and respect. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This role is within the Regional Business Management function and you will also be expected to undertake tasks relating to the wider work of the function. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Previous experience as a Personal/Executive Assistant or in a support role to senior management is essential. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We offer an inclusive, supportive working environment and are fully supportive of on-going training and development opportunities to progress your career. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This is a full time position with an expected start date of December 2020. The post-holder will be expected to travel around the region and nationally, as required. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Applicants will commence at the bottom of Band 5 with a full-time starting salary of £24,907, with pay step increases after 2 years’ service and 4 years’ service.&lt;br /&gt;&lt;br /&gt;These salaries are offered in accordance with NHS Terms and Conditions and the HEE Pay Progression Policy and are subject to annual cost of living review.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;If you like what you have read and think you have the skills and experience we need then don&#39;t delay, apply today! We get lots of applications for our roles and so we sometimes have to close our posts early. Don&#39;t miss out! &lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Name: Susan Holland&lt;/p&gt;\n&lt;p&gt;Job title: Personal Assistant&lt;/p&gt;\n&lt;p&gt;Email address: Susan.holland@hee.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number: 01912754787&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Health Education England", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127514"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Waterfront 4, Newcastle Upon Tyne", "postalCode": "NE15 8NY"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.9689", "longitude": "-1.71259"}}, "title": "Personal Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916260580", "validThrough": "2020-11-15T23:59:59+0000"}