{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 per annum excl HCA"}}, "datePosted": "2020-11-02T14:16:21+0000", "description": "&lt;p&gt;Are you a nurse whose NMC registration has lapsed and who misses working as a nurse and the rewards and challenges of caring for patients? Look no further. Together with our partner City, University of London we can help return you to the nursing profession.&lt;/p&gt;\n&lt;p&gt;We have a number of opportunities for previously Registered Nurses who would like to undertake a Return to Practice nursing course and then immediately resume their career as a Band 5 nurse.&lt;/p&gt;\n&lt;p&gt;We work closely with our partner at City, University of London to offer and support re-registration through the completion of a Return to Practice (RTP) course. The next course date is: 27th January 2021.&lt;/p&gt;\n&lt;p&gt;There are two pathways for this programme: Voluntary and employed.&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;The voluntary pathway allows you to complete the required placement hours on a non-paid voluntary basis at your chosen hours per week. City, University of London will process all DBS and occupational health checks for this route. Upon successful completion of the course you can apply for a Band 5 post.&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;The employed pathway allows you to be employed and paid as a band 3 for the required placement and theory hours. Candidates will be required to complete between 22.5 hours up to full time hours per week. When you successfully obtain your NMC registration you will be guaranteed  a band 5 position.&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;University fees are currently paid by Health Education England and a bursary of £650 one-off payment is provided to all successful candidates midway through the course.&lt;/p&gt;\n&lt;p&gt;Upon successful completion of the course you are guaranteed an interview and are able to offer various contracts including full time, part-time and flexible working to suit your needs. We also have rotational programmes that we would be able to offer. Upon registration we will support your development as a registered nurse through a preceptorship period and beyond.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please Be Aware: To be eligible to apply your NMC registration must have lapsed.&lt;/strong&gt;For further information about this course, please refer to City, University of London return to practice information online.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameCollette RowleyJob titleNurse RecruitmentEmail addresscollette.rowley@nhs.netTelephone number0207 288 3169Additional contact information&lt;/p&gt;\n&lt;p&gt;Mercy Okougha MSc., PGCHE, BSc, Cert.Man., RN&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Lead Nurse Student Experience &amp; Talent Management.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Tel: 0207 288 3647&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;email: mercy.okougha@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121035.JPG", "name": "Whittington Health", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121035"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Whittington Health NHS Trust, London", "postalCode": "N19 5NF"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5667", "longitude": "-.138149"}}, "title": "Return to Practice Band 3", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252381", "validThrough": "2020-11-22T23:59:59+0000"}