{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "42969", "minValue": "32478", "unitText": "YEAR", "value": "£32,478 - £42,969 £31,841 to £42,126 pa"}}, "datePosted": "2020-11-02T17:15:53+0000", "description": "&lt;p&gt;Clinical Fellow in Trauma &amp; Orthopaedics&lt;/p&gt;\n&lt;p&gt;There is an exciting opportunity for 5 (five) SHOs (Clinical Fellows) based at Queens Hospital, to start at Barking, Havering and Redbridge NHS Trust (BHRUT) with immediate effect for either fixed term contract or substantive appoinment. The post is designed to provide wide range of training to the prospective candidate to enhance their training and portfolio, and be able to progress in their surgical career in trauma and orthopaedics.&lt;/p&gt;\n&lt;p&gt;BHRUT is one of the largest Associate Teaching Hospitals, providing acute care for over 700,000 people from across 2 main sites – Queens and King George Hospitals, as well as peripheral sites at Barking, Dagenham and Brentwood. We are a major Neurosciences centre, and are undergoing significant further development as a tertiary referral centre for North East London and Essex, including additional critical care capacity.&lt;/p&gt;\n&lt;p&gt;The Orthopaedic Department at our Trust has made great strides in progressing to a gold standard centre for Education and Training. This is for Foundation, Core Surgical Trainees. The department in conjunction with Medical Education have instituted a Transformation Plan which has benefited FY trainees. The Trust has been chosen by Health Education England (HEE) and Royal College of Surgeons to be a Pilot site in London for Improving Surgical Training (IST) from 2018 which leads to exciting opportunities for the successful candidate.&lt;/p&gt;\n&lt;p&gt;It offers an excellent opportunity to consolidate and build on existing clinical skills in Orthopaedics. Experience in Trauma &amp; Orthopaedics at ST/CT level or equivalent is desirable.&lt;/p&gt;\n&lt;p&gt;The department consists of 14 orthopaedic consultants providing both emergency and elective care across major sub-specialties in lower limb, and upper limb. The Specialist Registrar and SHO workforce form an essential part of delivery of high quality care and augments the senior grade structure around both training and service needs for both tiers. The department has developed an excellent in-house training programme covering intra-operative and theoretical skills around management of orthopaedic conditions. The Division of Surgery at BHRUT recognises that NHS organisations need to adapt roles to the changing demands of the market.&lt;/p&gt;\n&lt;p&gt;The Department has overseen the successful recruitment Trust doctors through the National Interviews to Higher Surgical Training. That exemplifies the quality of training and opportunities for progression.&lt;/p&gt;\n&lt;p&gt;The post has additional educational funding, which would add to career progression.&lt;/p&gt;\n&lt;p&gt;The main clinical duties of the applicant include managing and treating the elective and emergency general orthopaedic admissions under Consultant supervision. They will support on-call and elective work (such as Operating theatres and Clinics) in trauma and orthopaedics.&lt;/p&gt;\n&lt;p&gt;In addition, our Trust is in an excellent location, close to Central London and well situated in the South East. As well as all the advantages of being close to the city, you will discover that Essex has a beautiful countryside as well as excellent schools, transport links, amenities and residential areas. The Trust has on-site nursery facilities.&lt;/p&gt;\n&lt;p&gt;Applicants must have full GMC Registration.&lt;br /&gt;&lt;br /&gt;Only short listed candidates will be notified. We reserve the right to bring forward the closing date, should we have an overwhelming response.&lt;/p&gt;\n&lt;p&gt;The Trust aims to provide a comprehensive 7 day service to patients and this may affect the working patterns currently being advertised for this post. Any changes made to working patterns will be made for the benefit of patient care, and notification of these changes will be explained to you throughout the recruitment process.&lt;/p&gt;\n&lt;p&gt;We are an equal opportunity employer welcoming applications from all sections of the community. Applicants who consider they have a disability will be short listed for interview if they meet the essential criteria. We also operate strict screening procedures for posts with access to vulnerable adults and children.&lt;/p&gt;\n&lt;p&gt;&quot;The Trust buildings and grounds are fully Smoke Free; staff, patients and visitors are asked not to smoke any form of tobacco on Trust premises, though e-cigarettes may be used (“vaping” outside hospital buildings&quot;)&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Mr Krishna Vemulapalli&lt;/p&gt;\n&lt;p&gt;Clinical Lead T&amp;O&lt;/p&gt;\n&lt;p&gt;T: 01708 435000 | Ext 6373&lt;/p&gt;\n&lt;p&gt;Krishna.vemulapalli@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Barking, Havering and Redbridge University Hospitals Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120782"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Queens Hospital, Romford", "postalCode": "RM7 0AG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5686", "longitude": ".178941"}}, "title": "Clinical Fellow in  Trauma &amp; Orthopaedics", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253012", "validThrough": "2020-11-12T23:59:59+0000"}