{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "36738", "minValue": "29888", "unitText": "YEAR", "value": "£29,888 - £36,738"}}, "datePosted": "2020-10-23T13:01:00+0100", "description": "&lt;p&gt;An Exciting opportunity has arisen to join our Neurosurgical team at George&#39;s University NHS foundation Trust in the heart of Tooting. We are seeking motivated and enthusiastic individuals to join are established team. The Neurosurgical wards are based in the Atkinson Morley wing of the hospital, the history of which extends back to 1869 and has since become one of the most advanced Neurosurgical centres in the country, and was involved in the development of the CT scanner.&lt;/p&gt;\n&lt;p&gt;Our Neurosurgical wards Brodie and Mckissock are 30 and 21 bed respectively and provide comprehensive services covering a full range of neurosurgical conditions including simple and complex cranial and spinal conditions. We also provide a surgical service for movement disorders as well as large radiology department performing interventional procedures. We provide care to patients with a variety of needs including short and long term conditions and we are well equipped to manage acutely unwell and deteriorating patients in our fast paced dynamic working environment.&lt;/p&gt;\n&lt;p&gt;We are looking for both experienced band 5 nurses who have completed their preceptorship program looking for continuing development in a speciality, as well as newly qualified nurses looking to work towards there preceptorship. Successful candidates will demonstrate St George&#39;s University Hospitals NHS trust values – Excellent, Kind, Responsible and Respectful.&lt;/p&gt;\n&lt;p&gt;In turn we will offer you the opportunity to enrol on the trusts preceptorship program as well as taking part in the trusts band 5 development program. There are also numerous development opportunities within our department, we have pioneered a specialist programme geared specifically at neurosurgical nursing. We are also able to offer degree and masters level courses such as the acutely unwell adult course and neurosciences nursing course.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;For further details/ information contact: Matron John Dela Luna on 02086724635&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "St George's University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121185"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St Georges, London", "postalCode": "SW17 0QT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4267", "longitude": "-.175721"}}, "title": "Staff Nurse- Neurosurgery", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240632", "validThrough": "2020-11-06T23:59:59+0000"}