{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-10-30T15:16:17+0000", "description": "&lt;p&gt;An exciting opportunity has arisen within BCHC’s Dental Division for a Dental Nurse Tutor to join the School of Dental Nursing based at Birmingham Dental Hospital. The Dental Nurse Tutor will contribute primarily to the delivery and assessment of Dental Nursing apprenticeships and will also play a part in the implementation and delivery of Postgraduate and Continuing Professional Development Programmes for Dental Team members.&lt;/p&gt;\n&lt;p&gt;The post holder will work in close collaboration with fellow Dental Nurse Tutors, Dental Matrons, Dental Nurse Management Team, Learning and Development Team as well as a large team of clinical staff and students. The post holder will be an experienced Dental Nurse and hold a recognised assessment and teaching qualification. The post holder will need to evidence their Continuing Professional Development as part of their application. The Trust supports staff personal and professional development as part of its ‘&lt;em&gt;Great Place to Work’&lt;/em&gt; strategic objective. Please refer to the enclosed job description and person specification before submitting your application.&lt;/p&gt;\n&lt;p&gt;IMPORTANT&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Please ensure you check your Trac account regularly as this is how we will communicate with you during the shortlisting and selection process&lt;/li&gt;\n&lt;li&gt;Please ensure all sections of the application form are completed fully. Please particularly ensure that you provide full details of all referees including business email address, telephone contact details and postal address&lt;/li&gt;\n&lt;li&gt;Please be aware that BCHC utilises a third party recruitment system (TRAC). When applying via NHS Jobs, your submitted application will be imported into TRAC and any correspondence will be sent via TRAC. We advise that you check your junk/spam emails.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Be Part of Our Team...&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Birmingham Community Healthcare NHS Foundation Trust (BCHC) has more than 5000 staff working across Birmingham and the West Midlands in a wide range of community nursing and specialist healthcare roles. BCHC delivers over 100 clinical services, in people&#39;s homes, health centres, clinics and inpatient facilities. We deliver a wide range of services for children, young people, parents and families as well as adults and community services, two community hospitals, services for people with learning disabilities, the internationally recognised West Midlands Rehabilitation Centre and one of Europe’s leading Dental Hospitals and School of Dentistry. We deliver all of this with a commitment to integrated, personalised care that is rooted in our local communities. We have an ambition to deliver outstanding, integrated care as one of the key NHS providers in the West Midlands.&lt;/p&gt;\n&lt;p&gt;If you want to ‘Be Part of Our Team’ and work with a Foundation Trust which is continuously striving for better care and healthier communities, we want to hear from you.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameLaverne AppletonJob titleDental MatronEmail addresslaverne.appleton@nhs.netTelephone number0121 466 5234&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/125654.jpg", "name": "Birmingham Community Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=125654"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Birmingham Dental Hospital &amp; School of Dentistry, Birmingham", "postalCode": "B5 7EG"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.464", "longitude": "-1.89969"}}, "title": "Band 6 Dental Nurse Tutor", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250714", "validThrough": "2020-11-29T23:59:59+0000"}