{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890"}}, "datePosted": "2020-10-26T14:47:10+0000", "description": "&lt;p&gt;&lt;span&gt;The Single Point of Discharge service at Blackpool Teaching Hospitals NHS Foundation Trust are delighted to offer exciting and new opportunities following a successful 10 month pilot and invite applications for experienced, highly enthusiastic individuals to join our team.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Single Point of Discharge (SPoD) provides hospital based staff a central route to refer and access community based services to support and facilitate patient discharges, working closely with t&lt;/span&gt;&lt;span&gt;he Home First team to complete assessments of patients within their own environment to identify support required to manage and meet their ongoing needs.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;As a Band 6 Single Point of Discharge Co-ordinator you will be involved in developing pathways and processes to triage patients, working towards the vision of ‘Right patient, right place, right time’ improving the hospital to home experience promoting a ‘Home First’ culture.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will be responsible for the identification and co-ordination of appropriate discharge pathways for patients, developing integrated working relationships with Health and Social Care colleagues. You will also be required to complete assessments of patients within their own environment to determine ongoing rehabilitation, care or equipment needs emphasising ‘Home First’ principles.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Candidates will need to be forward thinking and have a problem solving approach, with excellent communication/interpersonal skills and the ability to work in a fast paced environment. They will also work with other members of the multi-disciplinary team in order to provide a patient-centred service working to identify patient needs to facilitate a safe and timely discharge. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Successful applicants will have access to clinical supervision, in-service training and will be supported in their learning and development with an individualised job plan.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The post will include weekend working and Bank Holiday cover on a rota basis.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This is an exciting opportunity to join a new and developing service to ensure patients receive enhanced discharge planning, continuity of care and a seamless transition between care providers beyond the acute hospital environment. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameCharlotte HamerJob titleSingle Point of Discharge Service ManagerEmail addresscharlotte.hamer@nhs.netTelephone number01253 954444&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Blackpool Teaching Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120954"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Blackpool Teaching Hospitals NHS Foundation Trust, Blackpool", "postalCode": "FY3 8NR"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8207", "longitude": "-3.01626"}}, "title": "Single Point of Discharge Co-ordinator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242978", "validThrough": "2020-11-09T23:59:59+0000"}