{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum"}}, "datePosted": "2020-11-05T13:31:32+0000", "description": "&lt;p&gt;We are looking for a dynamic, experienced and flexible Advanced Nurse/Clinical Practitioner to join our Physical Healthcare Team at HMP Gartree.&lt;/p&gt;\n&lt;p&gt;We are looking for people who share our values&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;We are non-judgmental&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;We are caring&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;We have integrity&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;We put the patient first&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;We are committed to team work&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;We are proud to work for the NHS&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Do you share these values? If so, read on …………&lt;/p&gt;\n&lt;p&gt;We expect you entered the healthcare profession as you wanted to have the opportunity to make a real difference to the lives and lifestyles of a group of people who have often neglected their own physical health and well-being. Healthcare at HMP Gartree gives you the opportunity to make this difference to a group of people who traditionally have physical and social morbidity but have also faced multiple barriers to accessing appropriate healthcare.&lt;/p&gt;\n&lt;p&gt;Working at HMP Gartree, in Leicestershire, you will be part of a highly motivated and skilled team who provide integrated healthcare (physical healthcare, mental health and substance misuse services) to around 700 men. The physical health team consists of a Clinical Matron, Senior Nurses, Nursing staff, Healthcare Assistants and GP providers.&lt;/p&gt;\n&lt;p&gt;The directorate provides healthcare to seven Prisons and one Immigration Removal Centre in the counties of Lincolnshire, Leicestershire and Nottinghamshire. As such you are part of a large peer group of 400+ healthcare professionals with access to appropriate peer support, supervision and excellent opportunities for learning and development.&lt;/p&gt;\n&lt;p&gt;Nottinghamshire Healthcare NHS Foundation Trust enjoys a good reputation as an employer offering applicants the opportunity of an interesting role in a developing and stimulating environment but also with access to a range of established terms and conditions of service and access to continuing professional development and access to NHS pension scheme.&lt;/p&gt;\n&lt;p&gt;Advanced Clinical Practitioners working within Offender Health will have the clinical opportunities to manage patients with complex co-morbid needs alongside other health professionals. ACPs within Offender Health will form part of a peer network for clinical supervision, training opportunities, Directorate service improvement Initiatives and contribute to the quality care received by our patients. The introduction of ACPs within this specific field of work opens opportunities for a different service delivery for patients who require advanced assessment, clinical reasoning and decision making. Having the opportunity to work alongside skills other professionals in an integrated team (RMNs, Substance Misuse Practitioners, Psychologists, Wellbeing Practitioners) is an exciting opportunity to improve the holistic and collaborative interventions delivered to a complex patient group.&lt;/p&gt;\n&lt;p&gt;Staff Blog from a Practice Nurse in Offender Health:&lt;/p&gt;\n&lt;p&gt;“The difference from working as a practice nurse in a detention centre or prison is that there is so much more happening.&lt;/p&gt;\n&lt;p&gt;Much of the healthcare provided is nurse led which allows the nurse to develop, gain confidence and mature and be much more than a practice nurse. I feel lucky to work in Offender Health. It can be sad, uplifting, exhausting, fun, draining…. But never boring”.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Our DBS check is free, you have no fees to pay!&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Free DBS for all appointees&lt;/p&gt;\n&lt;p&gt;Free parking on site at HMP Gartree&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If you still aren’t sure whether this is for you - get in touch anyway and come and see for yourself .&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameMeta NormanJob titleMatron, Physical HealthEmail addressMargaret.Norman@nottshc.nhs.ukTelephone number01858426677Additional contact information&lt;/p&gt;\n&lt;p&gt;Bev Bradshaw, Head of Healthcare - bev.bradshaw@nottshc.nhs.uk - 01858 426802&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120975.jpg", "name": "Nottinghamshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120975"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "HMP Gartree, Market harborough", "postalCode": "LE16 7RP"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.496", "longitude": "-.960958"}}, "title": "Advanced Clinical Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257890", "validThrough": "2020-11-19T23:59:59+0000"}