{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157"}}, "datePosted": "2020-11-05T16:16:22+0000", "description": "&lt;p&gt;Due to internal promotion we have an exciting opportunity for you to join our catering management team. Are you passionate about food and want to make a difference to our patient’s and staff meal experience? Then this may be the job for you.&lt;/p&gt;\n&lt;p&gt;Sandwell &amp; West Birmingham NHS Trust in house catering services are looking to recruit an experienced band 4 Catering Manager primarily based at City Hospital with the ability to work across sites at Sandwell and Rowley Regis hospitals. This is a full time position Monday to Friday although may involve the occasional weekend working.&lt;/p&gt;\n&lt;p&gt;The role will report to the site Catering Manager and will be responsible for assisting in the daily delivery of the patient and staff meal service and associated catering staff.&lt;/p&gt;\n&lt;p&gt;Responsibilities:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;In conjunction with the site catering manager the day to day responsibility for providing a high quality catering service to patients, staff and visitors&lt;/li&gt;\n&lt;li&gt;Assist in responsibility for completion of staff rosters, staff welfare, training and performance management&lt;/li&gt;\n&lt;li&gt;Insure SLA and KPI are set and met.&lt;/li&gt;\n&lt;li&gt;Input into managing and maintaining site budgets&lt;/li&gt;\n&lt;li&gt;Reduction of waste&lt;/li&gt;\n&lt;li&gt;Assist with the delivery of the trusts sustainability catering strategy&lt;/li&gt;\n&lt;li&gt;To meet food safety requirements and comply with HACCP.&lt;/li&gt;\n&lt;li&gt;Assist with planning and development of retail menus&lt;/li&gt;\n&lt;li&gt;Excellent organisation, communication and customer services skills&lt;/li&gt;\n&lt;li&gt;Good level of computer literacy&lt;/li&gt;\n&lt;li&gt;A proven track record of delivering objectives and targets on time&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;This provides an exciting opportunity for a talented and passionate Assistant Catering Manager to come onboard and join the team to deliver excellent standards of catering and hospitality&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120738.gif", "name": "Sandwell and West Birmingham Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120738"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Sandwell and West Birmingham NHS Trust, City Hospital, Birmingham", "postalCode": "B18 7QH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4898", "longitude": "-1.92942"}}, "title": "Catering Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258522", "validThrough": "2020-11-19T23:59:59+0000"}