{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 to £110,683 pa"}}, "datePosted": "2020-11-04T11:45:16+0000", "description": "&lt;h1&gt;&lt;span&gt;Royal United Hospitals Bath NHS Foundation Trust&lt;/span&gt;&lt;/h1&gt;\n&lt;h2&gt;&lt;span&gt;Women and Children’s Division&lt;/span&gt;&lt;/h2&gt;\n&lt;h1&gt;&lt;span&gt;Consultant in Sexual Health (8 PA post)&lt;/span&gt;&lt;/h1&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Applications are invited for one less-than full time (8 PA) NHS locum Consultant post to join a team of two Sexual Health Consultants (8.0 WTE) in Bath.  You will be working in a Trust which is committed to providing high quality care and is at the forefront of innovative practice in the region.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This is an exciting opportunity for an enthusiastic individual to join our Integrated Sexual Health Team.  This 8 PA Locum Consultant post in Sexual Health is mainly based at the Riverside Health Centre.  It is the intention to set up some joint HIV clinical work with the HIV tertiary referral unit at North Bristol NHS Foundation Trust as part of the clinical commitment towards this post. The incumbent will join a multi-professional team Consultant-led integrated service to include management of HIV.  The post-holder will support the delivery of clinical care for the integrated service and in particular management of complex HIV care.  The post-holder will also be involved in continued service development, governance and quality improvement in line with local, national and professional guidelines.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;There are numerous opportunities for undergraduate and postgraduate training and the appointed candidates would be expected to contribute to undergraduate and postgraduate training. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Candidates for the post must be registered medical practitioners and on, or eligible to join the Specialist register for Genito -urinary medicine or within six months of the date of the advisory appointments committee.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Good communication skills, a non-judgemental approach, ability to be flexible, enthusiasm for the job and ability to work as part of a Multi-disciplinary team are key.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Bath and the surrounding countryside is an exceptionally pleasant environment in which to work and live with superb cultural and leisure activities nearby. There are excellent state and private schools in and around the city. With easy rail links to London, Bristol and Cardiff, the M4 and M5 motorways, and of flights from Bristol airport to UK and Continental destinations, Bath is a cultural hotspot and an extremely sought after location to live in and work.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;For an informal discussion please contact Dr Arnold Fernandes or Dr Kate Horn on 01225 826835 or 01225826840. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Application closure date:  18&lt;/span&gt;&lt;span&gt;th&lt;/span&gt;&lt;span&gt; November, 2020&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Shortlisting to be completed by:  26&lt;/span&gt;&lt;span&gt;th&lt;/span&gt;&lt;span&gt; November, 2020&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Interview scheduled for:  9&lt;/span&gt;&lt;span&gt;th&lt;/span&gt;&lt;span&gt; December, 2020&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121339.png", "name": "Royal United Hospitals Bath NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121339"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bath", "postalCode": "BA1 2BT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3823", "longitude": "-2.36754"}}, "title": "Locum Consultant in Sexual Health and HIV Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255652", "validThrough": "2020-11-18T23:59:59+0000"}