{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum/pro rata"}}, "datePosted": "2020-10-29T13:46:06+0000", "description": "&lt;p&gt;We are looking to recruit newly qualified or registered Mental Health Nurses to join our well established and highly skilled multi-disciplinary team at Marlborough House Adolescent Inpatient unit based in Swindon Wiltshire.&lt;/p&gt;\n&lt;p&gt;Marlborough House is a specialist tier 4 service for children and young people ages 11 to 18 year olds, provided by Oxford Health NHS Foundation Trust.&lt;/p&gt;\n&lt;p&gt;You will have excellent communication skills with a positive attitude. We recognise that our team members are our greatest asset and we are keen that you feel supported and encouraged to fulfill your potential.&lt;/p&gt;\n&lt;p&gt;With a reputation for excellence and providing a range of evidence based care, our service offers a stepped model of care which is tailored to the individual’s needs for stabilisation and recovery. We offer a range of therapies and experiences to assist in each young person’s recovery journey and work in partnership with families and our community colleagues.&lt;/p&gt;\n&lt;p&gt;If you are a dedicated passionate individual who is committed to improving outcomes for children and young people then this is the job for you. We can offer you both personal and clinical development opportunities, in addition to regular professional and clinical supervision, personal development reviews and support for continual professional development activities.&lt;/p&gt;\n&lt;p&gt;You will be required to work shifts which will include nights. Our shift patterns are as follows: early shifts 07:00-14:45, late shifts 13:15-21:00 Twilight shift 15:00- 23:00 and night shifts are 20:40-07:20&lt;/p&gt;\n&lt;p&gt;This role requires a willingness and ability to role model healthy eating behavior with patients and support as trained/required.&lt;/p&gt;\n&lt;p&gt;Also required is a level of fitness and ability to competently perform Physical Interventions and/or Breakaway techniques (practical and theory) following training.&lt;/p&gt;\n&lt;p&gt;As part of the interview process, young people on the unit may be giving each applicant a brief tour of the premises and will also be asking a few interview questions they have prepared themselves.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Tom Waterfield or Lorna McGuigan: Telephone No: 01865 903480&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Oxford Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122233"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Marlborough House, Swindon", "postalCode": "SN1 4JS"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5501", "longitude": "-1.79727"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248532", "validThrough": "2020-11-12T23:59:59+0000"}