{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683"}}, "datePosted": "2020-10-20T15:47:24+0100", "description": "&lt;h2&gt;&lt;strong&gt;Locum Consultant Gastroenterologist &lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;We are looking for a Locum Consultant Gastroenterologist pending substantive recruitment. The role is for a fixed term period of 12 months initially, with potential for extension depending on the outcome of the substantive recruitment process. This post presents an exciting opportunity to join a dynamic growing department practicing from a newly built state of the art hospital.&lt;/p&gt;\n&lt;p&gt;You will join the existing 6 consultants providing Gastroenterology care to our population of 400,000 in Swindon and the surrounding rural areas.&lt;/p&gt;\n&lt;p&gt;The successful applicants will support in the delivery of high quality, endoscopy care in an accredited JAG Endoscopy unit, undertake outpatient clinics, and inpatient care on an 18 bedded Gastroenterology Ward. The successful applicants will also provide a Consultant service in general Gastroenterology although a sub-specialist interest is welcomed in Specialised Endoscopy, Nutrition or Inflammatory Bowel Disease.&lt;/p&gt;\n&lt;p&gt;The newly designed job plan has a consultant of the week model (COW) enabling an in-patient Gastroenterology Consultant led service 5 days a week Monday – Friday 0900-1700.&lt;/p&gt;\n&lt;p&gt;As a consultant within the Medical Division you are not required to take part in the general medical acute on call rota, you will however be part of the GI bleed rota.&lt;/p&gt;\n&lt;p&gt;We are passionate about Education &amp; Training and supporting our Junior Doctors, all consultants are encouraged to be involved in the training of Specialists Registrars, Core Medical Trainees, Foundation Doctors and the expanding number of middle grade Clinical Fellow Doctors.&lt;/p&gt;\n&lt;p&gt;Great Western Hospital is proud to support many varied NIHR Portfolio and Commercially funded Research Studies. We have an active Research &amp; Innovation Department in place to support you with both the Multi-Specialty Clinical Delivery and Research Management &amp; Governance elements.&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Swindon, Wiltshire and the Cotswolds&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Swindon is a thriving town set between the Cotswolds to the North and West, the Upper Thames valley to the East and the Marlborough Downs to the South. London, Bristol and Oxford are all within easy reach, approximately one hour by car with good links by public transport. The rail journey to London Paddington from Swindon is approximately 55 minutes and Heathrow Airport is only an hour away from Swindon.&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;How to Apply&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Before you apply, please feel free to visit the trust, discuss your ideas and ask any questions you may have. Dr Andrew Claridge, Gastroenterology Clinical Lead can be contacted on 01793 607363, email &lt;span&gt;andrew.claridge1@nhs.net&lt;/span&gt; or you can contact Dr Stephen Haig, Associate Medical Director, email s.haig@nhs.net. &lt;/p&gt;\n&lt;p&gt;It is desirable for candidates to be within 6 months of CCT at the time of interview or currently hold CCT or equivalent. As such the post holder should be trained in all aspects of Gastroenterology.&lt;/p&gt;\n&lt;p&gt;This advert will close on 1st December 2020.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120810.png", "name": "Great Western Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120810"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Swindon", "postalCode": "SN3 6BB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5382", "longitude": "-1.72768"}}, "title": "Locum Consultant Gastroenterologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916235127", "validThrough": "2020-12-01T23:59:59+0000"}