{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 pro rata per annum"}}, "datePosted": "2020-10-29T11:17:32+0000", "description": "&lt;p&gt;&lt;strong&gt;Palliative Care Respite Carer - 18 hours per week&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An opportunity has arisen to join the Palliative Care Respite Team (PCRT) for a band 3 Health Care Assistant. The 18 hour post consists of providing two night sits over a seven day period. The candidate will be required to be flexible to meet the needs of the service. The PCRT provides care and support for people who have life limiting illnesses. We work closely and we liaise with other services to provide the best possible care to patients and carers. These services include District Nurses, Specialist Palliative Care Team, Hospice and the Enhanced Support Team. The service provides a person centred approach in the persons own home. The service places particular importance to allow people to be cared for and to die in their preferred place of choice. We give support to carers by relieving them of their caring responsibilities for a short period of time either during the day or overnight.&lt;/p&gt;\n&lt;p&gt;The PCRT are based at Regent House, Heaton Lane in Stockport. The successful candidate will be expected to work independently and also as an integral member of the multi- disciplinary team. Experience of caring for patients and supporting their families at the end of their life is preferable. The role can be both physically and emotionally demanding however can be very rewarding.&lt;/p&gt;\n&lt;p&gt;The Trust is committed to safe guarding and promoting the welfare of children, young people and vulnerable adults and expects all staff and volunteers to share this commitment and promote safe guarding by implementing the Trusts Policies and Procedures, acting promptly on concerns, communicating effectively and sharing information appropriately.&lt;/p&gt;\n&lt;p&gt;If successful this vacancy will require an enhanced DBS check at a cost of £43.50. This cost will be deducted from your first Trust salary &lt;br /&gt;&lt;br /&gt;In addition to this it will be a condition of your employment that you will join the DBS update service and pay the annual subscription fee of £13.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameCarole HardimanJob titlePalliative Respite Team LeaderEmail addresscarole.hardiman@nhs.netTelephone number07881553307Additional contact information&lt;/p&gt;\n&lt;p&gt;Carole Hardiman, Palliative care Respite Team Coordinator on 07881553307&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Stockport NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122553"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Community, Stockport", "postalCode": "SK4 1BS"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4095", "longitude": "-2.16411"}}, "title": "Palliative Care Respite Carer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248073", "validThrough": "2020-11-12T23:59:59+0000"}