{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 to £19,337 pa"}}, "datePosted": "2020-10-23T11:07:30+0100", "description": "&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Homecare Support Worker - Band 2 - Support To Go Home - 37.5 hours per - Permanent&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;We currently have vacancies for permanent Band 2 Home Care Support Workers within the Support to Go Home Team based at the West Suffolk Hospital where you can enjoy the benefits of being employed by an award winning NHS Trust.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Support to go Home service is a short term bridging care service to prevent delays in patients returning home. The Successful candidates will be an integral part of the team, working alongside individuals in their own homes to provide care and to support their safe recovery. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The basis of this role will be aiming to enable someone to be as independent as possible with daily living tasks, including personal care, meals and mobility. The team also provide care for end of life patients.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;An ability to travel to rural locations to carry out this post is essential. West Suffolk Hospital pool cars will be available to travel to patients homes.&lt;/p&gt;\n&lt;p&gt;There is also the exciting opportunity to complete the generic worker development programme to progress to a Band 3 Senior Home Care Support Worker.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The post is available full- time or part- time. The service works over 7 days between the hours of 7.30am – 10.00pm. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Working as part of the West Suffolk NHS Foundation Trust you will be part of a friendly and forward-thinking service with a well-developed appraisal system and structured support from senior staff. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Training and development are actively encouraged. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;For further information please contact Jenny McCaughan on 01284 713568.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;&lt;strong&gt;CAR PARKING&lt;/strong&gt; - This post &lt;strong&gt;does&lt;/strong&gt; entitle you to apply to park on the Hospital site. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;To view the Job Description and Person Specification for this position, please click on the Job Description link (below). You should use the Additional Information section of your application to state how you meet the requirements of the Person Specification.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;The successful candidate for this post will be required to apply for a Disclosure &amp; Barring Service (DBS) Disclosure at &lt;strong&gt;Enhanced&lt;/strong&gt; level. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;span&gt; For Band 1 and Band 2 posts, the cost of the DBS Disclosure will be met by the Trust. However, any employees at Band 1 and Band 2 who leave the Trust within six months of commencing their post will have a £10 administration fee deducted from their final salary. For posts at Band 3 and above, the cost of the Disclosure will be met by the appointed employee and deducted in instalments from their salary over a period of three months. If the employee leaves the Trust within three months of commencing their post, any outstanding payments will be deducted from their final pay.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;All applicants should click on the link entitled “How will my application be processed?” prior to submitting their application form.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The closing date for this vacancy may change if we receive a strong response. Please ensure that you apply for any post you are interested in as soon as possible.&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "West Suffolk NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120941"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bury St. Edmunds", "postalCode": "IP33 2QZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.2317", "longitude": ".709205"}}, "title": "Homecare Support Worker - Band 2 - Support to go Home", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240230", "validThrough": "2020-12-23T23:59:59+0000"}