{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum pro rata"}}, "datePosted": "2020-10-29T12:55:23+0000", "description": "&lt;p&gt;&lt;span&gt;Bank as and when required.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;A Band 5 Bank Community Staff Nurse opportunity has arisen with us at North Carlisle District Nursing Team. The successful candidate will work with our evolving Community Team, as part of the developing Integrated Care Community (ICC) you will be based at Carlisle Healthcare and serve the local population of Carlisle. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This role requires you to demonstrate the skills and knowledge to support the provision of high quality care, to support patients with complex needs within the community setting, and to support the Team Lead to provide clinical leadership and operational management of the community nurse team along with management of the clinical caseload for the team. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;ICCs aim to address the challenges of an aging population and increasing demand on health and care services by providing more out of hospital care and empowering people to take control of their health and wellbeing. This will require new ways of working to focus on preventing ill health and ensure services are sustainable for the future. These new ways of working will follow the same approach across all eight ICCs with flexibility to tailor services to the needs of the local people.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This is an excellent opportunity for dedicated and committed registered nurses who are looking to develop their clinical skills and expertise in caring for patients, working closely with health and social care colleagues to prevent hospital admission, facilitate hospital discharge and promote independence through reablement and management of long term conditions. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are able to provide an individually tailored preceptorship program to experienced nurses.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Daily working hours are between 8:00 and 23:00. We are based in a new and modern medical centre in North Carlisle and on a daily basis treat a wide and varied range of patients over the age of 18. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Are you ready for a challenge? If you have the appetite to work as part of a team that is setting out on this transformational journey, the skills required to meet the role of a community nurse and want to play a part in our change story we would love to hear from you. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;The Trust will provide a twelve month preceptorship period for all newly registered healthcare professionals.&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;Healthcare Professionals returning to practice, moving into new roles or changing clinical environments, may access an agreed preceptorship period.&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;span&gt;Please ensure that you document evidence of meeting all the essential criteria in the supporting information.&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;If sufficient response is received this post could be closed earlier than the specified closing date, please apply as soon as possible to ensure that your application is considered.&lt;/span&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;span&gt;The Trust is committed to safeguarding adults and children therefore if the post is subject to the Rehabilitation of Offenders Act (ROA) 1974 (Exceptions) Order 1975 (as amended) the successful candidate(s) will be subject to a criminal records check with the Disclosure and Barring Service (DBS). The cost of the DBS must be met by the successful candidate(s) through salary deduction. DBS charges are as follows &lt;strong&gt;if applicable to the post:&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Standard Check: £26 + Administration cost of £4.20 = deducted at £10.20 from 1st month salary and £10 deducted from salary over following 2 months.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Enhanced Check: £44 + administration cost of £4.20 = £15.20 deducted from 1st month salary and £11 deducted from salary over following 3 months.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;As part of the one of the largest employers in the UK NCIC future employees will have also access to the following benefits.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;A lease car may be available for this position; further details will be provided upon appointment if applicable.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;27 day holiday scheme rising to 33 after 10 years &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Flexible working Scheme &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Excellent opportunities for development &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Competitive NHS Pension scheme&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Access to NHS discounts with retailers and leisure companies&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;EAP (Employee Assistance Programme) a free, confidential counselling and information service to assist with personal or work-related problems&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;These schemes are subject to availability&lt;/span&gt;&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120898.png", "name": "North Cumbria Integrated Care NHS Foundation Trust (NCIC)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120898"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Carlisle, Cumbria", "postalCode": "CA1 2NS"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.8832", "longitude": "-2.91921"}}, "title": "Bank Community Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248402", "validThrough": "2020-11-12T23:59:59+0000"}