{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "25365", "minValue": "22987", "unitText": "YEAR", "value": "£22,987 - £25,365 per annum (inclusive of HCAS)"}}, "datePosted": "2020-11-06T12:16:19+0000", "description": "&lt;p&gt;&lt;strong&gt;Children &amp; Young People’s Primary Well-being Practitioner Trainees (training posts)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Agenda for Change Band 4&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Fixed Term – 1 year&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We have a number of exciting training opportunities for people who wish to make a make a major contribution to child and adolescent mental health services in Berkshire. The vacancies arise through funding from Health Education England to introduce and train Psychological Well-Being Practitioners (PWPs) to work in Child and Adolescent Mental Health services (CAMHS) in England. PWPs have been employed in adult psychological therapy services since 2008. They provide brief low intensity psychological interventions for people with anxiety and depression as part of a stepped care service. This is the third year of a programme to roll out this new workforce to CAMHS.&lt;/p&gt;\n&lt;p&gt;The training posts are initially funded for a year but the aim is to develop evidence that will assist in seeking recurrent funding thereafter. The posts are all full time including time spent in training at the University of Reading. Intensive supervision and on the job training will be provided by dedicated PWP supervisors and Clinical colleagues within CAMHS.&lt;/p&gt;\n&lt;p&gt;We are looking to recruit to 3 training posts based within the Neurodevelopmental teams (Autism Assessment Team and ADHD Team) and 1 post that will be based within the new CAMHS Getting Help Service in the Slough locality.&lt;/p&gt;\n&lt;p&gt;The Neurodevelopmental Teams provide assessments for autism and ADHD as well as on-going review of young people with an ADHD diagnosis who are receiving medical intervention. The service works closely with partner agencies in the community including both statutory and charity organisations to develop and provide information and support for children, young people and their families at all stages of the assessment process. Clinicians in the teams include consultant psychiatrists, paediatricians, clinical psychologists, mental health nurses, speech and language therapists, mental health practitioners and assistant psychologists.&lt;/p&gt;\n&lt;p&gt;The CAMHS Getting Help Team is one of a number of new teams that are being developed to work alongside existing health and LA funded services to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Offer an integrated pathway at early help level, reducing the fragmentation that exists within the current system and enhancing the evidence-based clinical offer.&lt;/li&gt;\n&lt;li&gt;Coordinate the current emotional wellbeing and mental health training offer to better upskill the wider system workforce to enable prevention and early intervention of behavioural and mental health difficulties&lt;/li&gt;\n&lt;li&gt;Open up workforce development opportunities for the Berkshire East system, utilising the current Health Education England funded CYP IAPT programmes for the development of low intensity therapists.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The neurodevelopmental and CAMHS Getting Help teams sits within the wider Children, Young people and Families service which includes CAMHS, speech and language therapy, occupational therapy, public health nursing and specialist children’s healthcare services.&lt;/p&gt;\n&lt;p&gt;The role of the trainee children’s wellbeing practitioners is to provide brief evidence based and CBT informed interventions for children and young people who are presenting with mild-moderate anxiety, low mood, and behavioural difficulties in the community or those waiting for an autism and/or ADHD assessment or who have already received a diagnosis or either/both.&lt;/p&gt;\n&lt;p&gt;In the Neurodevelopmental Team there is also an opportunity to provide support to parents and carers on SHaRON which is the online support platform for parents and carers who have a child with autism or who are waiting for an autism assessment.&lt;/p&gt;\n&lt;p&gt;Successful applications will hold:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A good degree in Psychology or other relevant subject&lt;/li&gt;\n&lt;li&gt;Experience of working with children and an understanding of how to talk with them&lt;/li&gt;\n&lt;li&gt;Some experience of working within a mental health setting or school pastoral care&lt;/li&gt;\n&lt;li&gt;Strong communication skills&lt;/li&gt;\n&lt;li&gt;Good IT skills&lt;/li&gt;\n&lt;li&gt;The ability to work cohesively within a small team&lt;/li&gt;\n&lt;li&gt;Motivation to learn and to be challenged&lt;/li&gt;\n&lt;li&gt;The ability to use feedback and adapt accordingly&lt;/li&gt;\n&lt;li&gt;Good organisational skills&lt;/li&gt;\n&lt;li&gt;The professionalism and sensitivity to work with children, young people and families facing problems with anxiety and depression&lt;/li&gt;\n&lt;li&gt;Commitment to using data and relevant measures to assess clinical outcome&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Candidates will need to be ready to start academic training in January 2020. Interviews will be held jointly with the University of Reading and succesful candidates will be required to complete the application form for a place on the Postgraduate Certificate in Child and Young Persons Psychological Wellbeing Practice.&lt;/p&gt;\n&lt;p&gt;Interviews to be held at University of Reading, Whiteknights, Reading&lt;/p&gt;\n&lt;p&gt;on Monday 16/12/19 and Friday 20/12/19.&lt;/p&gt;\n&lt;p&gt;If you have previously applied for a similar post in Berkshire and were not shortlisted, please do not re-apply.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120886.PNG", "name": "Berkshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120886"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Reading", "postalCode": "RG6 6BZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4408", "longitude": "-.936464"}}, "title": "Trainee Psychological Wellbeing Practitioner (CYP)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259621", "validThrough": "2020-11-13T23:59:59+0000"}