{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44121", "minValue": "44121", "unitText": "YEAR", "value": "£44,121 pro rata"}}, "datePosted": "2020-10-29T10:02:18+0000", "description": "&lt;p&gt;The Birmingham Solihull Training Hub are looking to recruit a First Contact Practitioner (FCP) Physiotherapist Facilitator (or MSK FCP) to support the development of the physiotherapy workforce across GP practices and Primary Care Networks in our STP footprint.&lt;/p&gt;\n&lt;p&gt;The post holder will support the advancement of the physiotherapist role within primary care and will be responsible for a portfolio of projects relating to recruitment and development of primary care FCP Physios with key stakeholders including primary care employers, Primary Care Networks (PCN), BSOL CCG, Health Education England (HEE), Health Education Institutes (HEI), HCPC and NHS England.&lt;/p&gt;\n&lt;p&gt;The Facilitator post is an interactive role, developed in response to the demands of primary care, new emerging roles for FCP Physios in primary care and the latest GP Contract Additional Roles Programme.&lt;/p&gt;\n&lt;p&gt;The successful candidate will need to be a registered member of the HCPC (Health and Care Professions Council) and educated to degree/diploma level in Physiotherapy.&lt;/p&gt;\n&lt;p&gt;You will be expected to support practices/PCN with the recruitment and subsequent development of the physiotherapists. This will include, but not limited to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;offer advice to general practice on what the role can do and how they fit into the wider primary care team&lt;/li&gt;\n&lt;li&gt;provide support to staff employed into practices/PCNs&lt;/li&gt;\n&lt;li&gt;work with practices and the universities in setting up student placements.This involves supporting staff with mentorship and working closely with the universityto ensure the students experience the best primary care can offer&lt;/li&gt;\n&lt;li&gt;deliverphysiotherapists forums and CPD, providing a platform of support to the new roles and opportunities to network&lt;/li&gt;\n&lt;li&gt;support the Training Hub with any related programmes being developed around the role of the physiotherapists in primary care.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;If you meet the criteria above and also have the ability to organise, prioritise your workload effectively and exercise sound judgement when faced with conflicting pressures then we want to hear from you.&lt;/p&gt;\n&lt;p&gt;This role will be required for 15 hours per week over two days. The days required for this role will be flexible and to be agreed on offer. This is on a 12 month fixed term contract with the potential to be extended on successful funding being obtained.&lt;/p&gt;\n&lt;p&gt;This role may involve some home/remote working.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central Advertising - General Practitioners", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130654"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Birmingham", "postalCode": "B31 3HB"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4018", "longitude": "-1.96201"}}, "title": "FCP Physiotherapist Facilitator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247832", "validThrough": "2020-11-06T23:59:59+0000"}