{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "TBC"}}, "datePosted": "2020-10-26T09:32:33+0000", "description": "&lt;p&gt;Trinity Surgery&lt;/p&gt;\n&lt;p&gt;Receptionist and Repeat Prescription Clerk Vacancy&lt;/p&gt;\n&lt;p&gt;Full Time 37.5 hours per week&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Plus holiday and sickness cover&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are looking to recruit a receptionist/ repeat prescription clerk to join our busy, friendly Practice.&lt;/p&gt;\n&lt;p&gt;The ideal candidate needs to be well-motivated and efficient; will possess good people skills and enjoy working in a busy environment. They must be able to communicate clearly and effectively and have the ability to work well within a determined team.&lt;/p&gt;\n&lt;p&gt;Previous experience of working in a GP Practice, knowledge of the SystmOne clinical system, medical terminology, read coding and the Quality and Outcomes Framework (QoF) are advantageous; multi-lingual skills may be beneficial. Accuracy and attention to detail are essential.&lt;/p&gt;\n&lt;p&gt;Reception responsibilities include assisting and directing patients in accessing the appropriate service or healthcare professional in a courteous, efficient and effective way whilst projecting a positive and friendly image to patients both in person and via the telephone; offering general assistance to the practice team and undertaking wide-ranging administrative duties to assist in the day to day running of the practice including the provision of clerical support to clinical staff and other members of the practice team.&lt;/p&gt;\n&lt;p&gt;Repeat prescription duties include the processing of prescriptions accurately and in a timely manner in accordance with practice guidelines.&lt;/p&gt;\n&lt;p&gt;If you possess the above qualities, are willing and eager to learn new skills and are flexible in your approach to work we would like to hear from you.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central Advertising - General Practitioners", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130654"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wisbech", "postalCode": "PE13 3UZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6659", "longitude": ".164093"}}, "title": "Medical Receptionist and Repeat Prescription Clerk", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241867", "validThrough": "2020-11-08T23:59:59+0000"}