{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "14826", "minValue": "14826", "unitText": "YEAR", "value": "£8.82 per hour"}}, "datePosted": "2020-11-02T10:24:54+0000", "description": "&lt;p&gt;We are currently seeking &lt;strong&gt;Support Workers &lt;/strong&gt;to join&lt;strong&gt; our Adult Mental Health &amp; Learning Disability Service&lt;/strong&gt; at&lt;strong&gt; Conifer Lodge Care Home, &lt;/strong&gt;located in&lt;strong&gt; Wisbech, &lt;/strong&gt;22 miles from&lt;strong&gt; Peterborough.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Conifer Lodge is a care home with nursing that provides care, treatment and rehabilitation for adults aged 18 and upwards with; &lt;strong&gt;mild to moderate intellectual&lt;/strong&gt; &lt;strong&gt;disabilities,&lt;/strong&gt; &lt;strong&gt;co-morbid mental health problems, Autistic Spectrum Conditions and complex needs.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We provide comprehensive assessment and treatment programmes working collaboratively with patients and their families or carers.&lt;/p&gt;\n&lt;p&gt;Conifer Lodge combines a friendly, therapeutic environment focusing on rehabilitation and community reintegration and supports those who may have moved on from a hospital environment.&lt;/p&gt;\n&lt;p&gt;Based in the market town of Wisbech, north of Cambridge it is located just a &lt;strong&gt;20 minute walk from&lt;/strong&gt; &lt;strong&gt;the centre of Wisbech&lt;/strong&gt; and is 40 miles from Cambridge.&lt;/p&gt;\n&lt;p&gt;We’re looking for caring and committed individuals who want to work with a company that understands how important &lt;strong&gt;Support Workers&lt;/strong&gt; are to our patients/residents recovery.&lt;/p&gt;\n&lt;p&gt;Many of our patients arrive with complex and challenging needs. Huntercombe &lt;strong&gt;Support Workers&lt;/strong&gt; work in small teams with nurses, doctors, therapists and other experts, and together they make a world of difference to people’s lives.&lt;/p&gt;\n&lt;p&gt;When you join The Huntercombe Group as a&lt;strong&gt; Support Worker&lt;/strong&gt;, you will be part of a company that is &lt;strong&gt;understanding&lt;/strong&gt;, &lt;strong&gt;strives towards excellence&lt;/strong&gt;, is &lt;strong&gt;innovative&lt;/strong&gt;, &lt;strong&gt;reliable&lt;/strong&gt; and &lt;strong&gt;accessible &lt;/strong&gt;and above all &lt;strong&gt;puts people first&lt;/strong&gt;.&lt;/p&gt;\n&lt;p&gt;Most patients and residents are referred &lt;strong&gt;via NHS and local authorities&lt;/strong&gt;. We play an integral part in contributing to new models of care outlined in the &lt;em&gt;Five Year Forward View.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;As a &lt;strong&gt;Support Worker&lt;/strong&gt; working in our &lt;strong&gt;Adult Mental Health &amp; Learning Disability Service &lt;/strong&gt;your main duties will be:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To assist the senior trained staff in their day-to-day duties and clinical related tasks&lt;/li&gt;\n&lt;li&gt;Maintaining and developing a high standard of care for our patients/residents by being aware of their individual needs and care programmes&lt;/li&gt;\n&lt;li&gt;Contributing towards effective communication, by reporting to the nurse in charge any information given by the patient/resident or relative of any incident or observation which may affect our patients physical/mental well-being&lt;/li&gt;\n&lt;li&gt;Providing practical assistance to our patients/residents in carrying out everyday living tasks whilst encouraging them to develop their daily living skills and realising their potential to live as independently as they find possible&lt;/li&gt;\n&lt;li&gt;To be actively involved with the day to day routine in individual and group activities&lt;/li&gt;\n&lt;li&gt;To practice within a legal framework encompassing statutory, organisational policy and guidelines.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;To Join The Huntercombe Group as Support Worker you will be:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Empathetic and have a desire to make a difference&lt;/li&gt;\n&lt;li&gt;Passionate about forming therapeutic relationships&lt;/li&gt;\n&lt;li&gt;Committed to a person-centred approach to recovery&lt;/li&gt;\n&lt;li&gt;Enthusiastic about working as part of a dedicated team&lt;/li&gt;\n&lt;li&gt;Resilient and able to work under pressure&lt;/li&gt;\n&lt;li&gt;An effective communicator with good written and verbal skills&lt;/li&gt;\n&lt;li&gt;Willing to take ownership for the delivery of quality care and demonstrate leadership qualities&lt;/li&gt;\n&lt;li&gt;Legally entitled to work in the UK&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;An enhanced DBS (England) or PVG/Disclosure Scotland (Scotland) Disclosure will be required for all successful applicants. Costs will be met by the Company.&lt;/p&gt;\n&lt;p&gt;If you like what you have read, are dynamic, forward thinking and keen to learn, with a confident ‘CAN DO’ approach in all you do, please click &lt;strong&gt;Apply&lt;/strong&gt; now.&lt;/p&gt;\n&lt;p&gt;Social Care&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/130001.jpg", "name": "The Huntercombe Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130001"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wisbech, Cambridgeshire", "postalCode": "PE13 1LL"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6585", "longitude": ".147713"}}, "title": "Support Worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251562", "validThrough": "2020-12-02T23:59:59+0000"}