{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum pro rata"}}, "datePosted": "2020-11-02T08:45:31+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;em&gt;So, you’re eager to learn more about Neurology nursing opportunities at North Bristol NHS Trust. Here are some of the reasons we’re unique…&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Based at Southmead, Bristol’s flagship hospital; The Neurology Department is responsible for providing outpatient and inpatient services to the whole of Bristol for adults with neurological problems. The Institute is the regional centre for Neurological services serving the South West of England. It provides specialised services for a wide spectrum of Neurological conditions&lt;/li&gt;\n&lt;li&gt;The Institute of Clinical Neurosciences (ICN) is responsible for promoting and coordinating clinical research and is based at Southmead Hospital Bristol. Its Chairman is Professor Scolding, Burden Professor of Clinical Neurosciences. An active programme of research in clinical neuroscience is conducted both at North Bristol NHS Trust and at the University of Bristol.&lt;/li&gt;\n&lt;li&gt;Since the 1940s the Institute has consistently been at the forefront of technical advances. The service has an excellent national and international reputation, with patient referrals from across the South West, throughout the UK and worldwide.&lt;/li&gt;\n&lt;li&gt;Our nurses are supported to progress their career within neurosciences. Within our bespoke rotations, nurses can move across the division or across the trust, and experienced nurses have the opportunity to complete University accredited specialist neuroscience courses.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;But it’s not just our neurology service which is impressive; our trust itself is pioneering in its approach to healthcare. Let us tell you a little more about it… &lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Our health and wellbeing initiatives, devised by our dedicated staff wellbeing team, encompass lifestyle support, physical support and psychological support, and have been nationally recognised by REBA.&lt;/li&gt;\n&lt;li&gt;We value staff feedback; in the results of our 2019 staff survey, our response rate was &lt;strong&gt;higher than the national average &lt;/strong&gt;and highlighted we had improved in all the areas staff told us were priorities in 2018. Out of the 90 questions asked, we had made 73 improvements from the previous year with 69% of staff would recommend our organisation as a place to work (6% better than the national average.&lt;/li&gt;\n&lt;li&gt;Our nurses don’t shy away from a challenge in aid of Southmead Hospital Charity. They cycle, run, row and race in aid of a fantastic cause, or sing in our staff choir and compete in ‘Southmead Does Strictly’.&lt;/li&gt;\n&lt;li&gt;We’re committed to supporting staff on their career journey with us offering personalised training packages and bespoke specialty rotations. We also support internal transfers for those who wish to gain experience in a new specialty or further develop their skills.&lt;/li&gt;\n&lt;li&gt;Staff are consulted on equity issues across the trust within their staff equality and development groups, with mentoring and support to succeed. Our trust is supporting the development of Bristol’s LGBT+ manifesto and a case study of good practice has been reported to NHS England in response to a government review of public services and Trans people.&lt;/li&gt;\n&lt;li&gt;Our clinical environment is award-winning in its approach to healthcare design; each patient room has a view, many of which are naturally ventilated and 75% of rooms in our Brunel Building are single and en-suite. With nurses in mind, our clinical spine carefully separates staff and patient areas, with a generous staff canteen extending out to a rooftop terrace.&lt;/li&gt;\n&lt;li&gt;Bristol is consistently voted the best place to live in the UK, with vibrant local music, arts and gastronomic scenes, a wide range of modern and state of the art shopping, recreation and leisure facilities, a wealth of great local family days out, fantastic transport links for local, national and internal holidays, and it has a rich history. If you prefer country, village or smaller town living, NBT is also easily commutable from a range of attractive locations in North Somerset, South Gloucestershire and South Wales.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Right, that’s enough about us. Let’s focus on you. Are you…&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A registered nurse eager to channel your experience into a new and exciting role?&lt;/li&gt;\n&lt;li&gt;A newly qualified ready to take the leap from theory to the clinical setting, supported by a structured preceptorship and an inspirational team?&lt;/li&gt;\n&lt;li&gt;An experienced neurology nurse with the passion and talent to progress clinically and professionally?&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;So, are we right for each other? Here are your next steps…&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Submit your application via this advert.&lt;/li&gt;\n&lt;li&gt;Book a place at our engagement events to tour Southmead Hospital, meet the teams you could be working with, and understand the trust’s approach to patient care.&lt;/li&gt;\n&lt;li&gt;Follow us on social media to join in the conversation and gain an insight into life at our trust. Search @NBTNursing on Twitter, Facebook, LinkedIn and Instagram.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Email: Nursing@nbt.nhs.uk&lt;/p&gt;\n&lt;p&gt;Number: 0117 414 4550&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Looking for Flexible Working options? &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Contact&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120777.jpg", "name": "North Bristol NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120777"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southmead Hospital, Bristol", "postalCode": "BS10 5NB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4973", "longitude": "-2.59295"}}, "title": "Registered Nurse- Neurology - Experienced and Newly Qualifying Nurses", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251347", "validThrough": "2020-12-14T23:59:59+0000"}