{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-10-27T16:01:45+0000", "description": "&lt;p&gt;An opportunity has arisen for a Mammographer to join our multi-professional team at Princess Anne Hospital Breast Unit, part of University Hospital Southampton NHS Foundation Trust (UHS). The service delivers both primary breast screening and symptomatic mammography. The breast unit is fully digital with three mammography units, one being a tomosynthesis system. In addition we have three mobile units to provide primary screening to our catchment area.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;ABOUT THE TEAM&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are a friendly multi-disciplinary team committed to providing a first class service to our patients at our base unit and mobile units. Additionally we provide cover for the Symptomatic clinics at Princess Anne Hospital. The department supports skill mix and we employ Assistant practitioners and Radiographers in role extension. The department is committed to personal and professional development with everyone supported in CPD.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;WHAT YOU’LL DO&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;In this role you will work within a multi-professional team, providing a high quality service. You will be rotated through all aspects of breast care work, including screening, assessments, mobile work and symptomatic clinics. We have three mobile screening units rotating through different sites on our three year round length so flexibility and the ability to drive will be essential.&lt;/p&gt;\n&lt;p&gt;It is a requirement for the applicant to have a relevant Radiography Degree and Postgraduate Certificate in Mammography&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;WHAT WE’RE LOOKING FOR&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;HCPC registered&lt;/li&gt;\n&lt;li&gt;Degree (BSc Honours in Radiography or equivalent qualification)&lt;/li&gt;\n&lt;li&gt;PgC in Mammography&lt;/li&gt;\n&lt;li&gt;Job – share, part time hours will be considered&lt;/li&gt;\n&lt;li&gt;Willingness to take part in a flexible rota&lt;/li&gt;\n&lt;li&gt;Team work ethic&lt;/li&gt;\n&lt;li&gt;You will need to be able to drive, be willing to travel to our remote locations and have a full driving license&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;WHAT WE CAN OFFER YOU&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As one of the largest acute teaching Trust’s in England, we can offer learning and development opportunities to help you achieve the career you aspire to. We believe you deserve the best possible surroundings in which to do your job and we want to support you in doing your job to the best of your ability.&lt;/p&gt;\n&lt;p&gt;As a Trust, we support flexible working and will consider requests taking into account the needs of the service. You’ll have an opportunity to discuss this at interview. Our LiveWell and inspire programme offers opportunities, support and advice, including smoking cessation services, exercise and activity classes, and support for mental health.&lt;/p&gt;\n&lt;p&gt;UHS employees are able to access a huge range of NHS discounts, are entitled to a minimum of 35 days paid holiday (pro rata) on appointment, can access on-site nursery facilities (subject to availability), and we offer a generous pension scheme.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;ABOUT OUR TRUST AND SOUTHAMPTON&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;UHS is rated ‘Good’ by the CQC and in the latest national NHS Staff Survey, we were in the top 10 acute trusts for staff engagement and for staff recommending the hospital as a place to work or receive care.&lt;/p&gt;\n&lt;p&gt;Southampton is an attractive place to live and work situated on the south coast, with an international airport and only an hour on the train from central London. The New Forest National Park and the beaches of the Jurassic coast are also right on our doorstep. The city offers living costs 20% lower than those in London, 13 schools rated outstanding by Ofsted and 13 nearby green spaces to enjoy.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;ADDITIONAL INFORMATION&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Interviews will be held on Monday, 30 November 2020.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Stephanie Gow&lt;/p&gt;\n&lt;p&gt;Advanced Practitioner Radiographer&lt;/p&gt;\n&lt;p&gt;Stephanie.Gow@uhs.nhs.uk&lt;/p&gt;\n&lt;p&gt;X3127&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121042.gif", "name": "University Hospital Southampton NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121042"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Princess Anne Hospital, Southampton", "postalCode": "SO14 2AA"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8992", "longitude": "-1.40402"}}, "title": "Mammographer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245317", "validThrough": "2020-11-10T23:59:59+0000"}