{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "23121", "minValue": "21789", "unitText": "YEAR", "value": "£21,789 - £23,121 per annum, inc HCA"}}, "datePosted": "2020-11-04T16:16:30+0000", "description": "&lt;p&gt;&lt;span&gt;King’s College Hospital NHS Foundation Trust part of King&#39;s Health Partners Academic Health Sciences Centre (AHSC), is one of the UK’s largest and busiest teaching hospitals with a turnover of nearly £1 billion, 1.5 million patient contacts a year and more than 12,600 staff based across 5 main sites in South East London and Kent.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Trust provides a full range of local hospital services across its different sites, and specialist services from King’s College Hospital (KCH) site in Camberwell and the Princess Royal University Hospital (PRUH) site in Bromley, Orpington Hospital, and some services at Beckenham Beacon and Queen Mary’s Sidcup.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Trust is recognised internationally for its work in liver disease and transplantation, neurosciences, cardiac, haemato-oncology, fetal medicine, stroke, major trauma, and Emergency Department.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We currently have a vacancy for a full-time Pharmacy Assistant to join the pharmacy team working at the Princess Royal University Hospital in Orpington, Kent. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The post will include working in the Dispensary, Aseptic Services and Stores and Distribution. During each rotation you will gain practical experience, assisting in the delivery of the service in each section. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You may also be required to work on other sites within the Trust including Beckenham Beacon and Orpington hospital.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Applicants must be self-motivated and show a willingness to learn and be trained. You must be able to pay close attention to detail and consistently produce work to the required standard within set deadlines. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The successful candidates will be hard working, have good verbal and written communication skills, be a strong team player and able to work using their own initiative, within the limits of the job role. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will be expected to participate in the extended hours rota which includes working weekends and bank holidays.&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Name Esme Barber&lt;/p&gt;\n&lt;p&gt;Job title Pharmacy Dispensary Manager&lt;/p&gt;\n&lt;p&gt;Email address esme.barber@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number 01689 864004&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "King's College Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120921"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Princess Royal University Hospital, Orpington", "postalCode": "BR6 8ND"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3657", "longitude": ".059653"}}, "title": "Rotational Pharmacy Assistant Technical Officer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256601", "validThrough": "2020-11-15T23:59:59+0000"}