{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "6724", "minValue": "6724", "unitText": "YEAR", "value": "A4C Band 5 (£24,907 - £30,615) + Unsocial per Sect"}}, "datePosted": "2020-10-23T11:16:24+0100", "description": "&lt;p&gt;&lt;em&gt;&lt;strong&gt;Are you a Newly Qualified Paramedic graduating from a University in the UK?&lt;/strong&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Have you finished now or are due to finish your Paramedic Science course in 2020? If so, we really want to hear from you.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Have you completed a HCPC approved Paramedic Programme allowing you to register as a Paramedic? We have fantastic opportunities for Newly Registered Paramedics across EMAS. The East Midlands is a fantastic region with great transport links. The region has easy access to three major airports. The housing prices are competitive, with great rental opportunities and a wide range of urban and rural ambulance stations.&lt;/p&gt;\n&lt;p&gt;Our EMAS NQP consolidation programme is now established and you will receive a comprehensive clinical induction along with supported preceptorship hours and a range of continuing professional development. As an NQP you will follow a structured 24 month consolidation period before progressing to Band 6. EMAS works with a wide range of Universities and really values its graduate workforce.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What we need from you…&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Firstly, a genuine commitment to providing excellent patient care and embracing our Trust values. You will have completed a Cert HE, Dip HE, FdSc or BSc (Hons) in Paramedic Science (or be close to doing so) which will lead to HCPC registration. We understand that we may need to support you to obtain C1 and emergency ambulance driving, but we can explore this at interview.&lt;/p&gt;\n&lt;p&gt;** Please only apply on this advert if you are due to qualify in 2020.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;EMAS NHS Trust operates a smoke-free environment.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Deborah Tweddle, Job title: Ambulance Operations Manager, Email address: deborah.tweddle@emas.nhs.uk, Telephone number: 07887 574296,&lt;/p&gt;\n&lt;p&gt;Additional contact information: EMAS Recruitment Team - recruitmentteam@emas.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "East Midlands Ambulance Service NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121632"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Leicestershire, Leicestershire", "postalCode": "LE4 3BS"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6894", "longitude": "-1.12824"}}, "title": "Newly Qualified Paramedic - Leicestershire", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240273", "validThrough": "2020-11-08T23:59:59+0000"}