{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "73664", "minValue": "63751", "unitText": "YEAR", "value": "£63,751 - £73,664 per annum"}}, "datePosted": "2020-11-06T14:01:39+0000", "description": "&lt;p&gt;&lt;span&gt;The East of England Region is looking for an experienced, passionate and highly organised IT/ Digital leader to join the Diagnostics Programme in the regions’ Strategy and Transformation team as an Improvement Lead, on a fixed term basis until 31 March 2021, with a potential to extend further. This team focuses on providing leadership, advice and guidance, and support to the region and its constituent STPs and ICS’ covering restoration of key diagnostic services, particularly in Imaging and Endoscopy and uses digitally enabled transformation and supporting digital technology programmes through specific project assignments. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The role supports the business in driving transformation as well as value for money in planning, commissioning and service. The role is designed to build a combination of subject matter expertise and technical skills to develop a strong service delivery. The postholder will ensure that rigorous project management, benefits realisation and a communications strategy are embedded in this programme to ensure the work is recognised nationally. You will also contribute to the design and delivery of a programme that will prioritise innovations that make the most difference and accelerate partners for implementation within the area of Diagnostics and any other, as required.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will be proud of your work and understand the benefits of excellent project management in the delivery of complex programmes of work. During the Covid-19 pandemic the recovery and sustainability of diagnostic services is a high priority for the region. The successful applicant will enjoy working at pace to support the region with this important work. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;All roles are currently home based due to the impact of COVID-19. This role is nominally based at home but may require a small amount of travel to trust sites within East of England region to work collaboratively with partners, so the post-holder will need to be happy to work flexibly.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Please note this contract is currently fixed term until the 31st March 2021, with a possibility of extension. The reason for the fixed term contract is to support Covid-19 workstreams.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;For an informal discussion please contact Mary Emurla, Regional Diagnostics Recovery Lead &lt;/span&gt;m.emurla@nhs.net&lt;span&gt; or Aparna Belapurkar, Assistant Director of programmes and CT and MRI lead on &lt;/span&gt;aparna.belapurkar@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/126694.png", "name": "NHS England and NHS Improvement", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126694"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Victoria House, Fulbourn", "postalCode": "CB21 5XA"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1848", "longitude": ".19314"}}, "title": "Improvement Lead", "url": "https://www.jobs.nhs.uk/xi/vacancy/916260045", "validThrough": "2020-11-22T23:59:59+0000"}