{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 per annum"}}, "datePosted": "2020-11-02T14:16:24+0000", "description": "&lt;h2&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Nursing Associate / Assistant Practitioner&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;Newton Abbot community Hospital has 2 x 30 bedded inpatient wards.&lt;/p&gt;\n&lt;p&gt;Templer Ward is a 30 bedded general medical/rehabilitation ward for predominantly older adults. Patients are either admitted directly or transferred fro local Acute Trusts for ongoing care and rehabilitation prior to discharge from Hospital.&lt;/p&gt;\n&lt;p&gt;HAVE YOU RECENTLY QUALIFIED OR ABOUT TO QUALIFY AS A NURSING ASSOCIATE WITH A FOUNDATION DEGREE AND LOOKING FOR AN OPPORTUNITY TO HELP ESTABLISH AND DEVELOP THIS ROLE WITHIN A COMMUNITY HOSPITAL?&lt;/p&gt;\n&lt;p&gt;Are you looking for a fresh challenge and would like to continue your journey of professional development within unit that is passionate about its workforce? to work alongside and in collaboration with an MDT to give high standards of care?&lt;/p&gt;\n&lt;p&gt;If so we are looking to recruit an enthusiastic, forward thinking, committed and motivated Nursing Associate with excellent communication skills to join our nursing team.&lt;/p&gt;\n&lt;p&gt;The successful candidates will provide patient centred, evidence-based care; maintain high care delivery standards and efficient, safe management of patients within our busy ward.&lt;/p&gt;\n&lt;p&gt;The nursing associate will provide support to the registered nurse by caring for patients and enhance the quality of hands on care offered. Nursing associates will be accountable for their own practice.&lt;/p&gt;\n&lt;p&gt;Their key purpose is to demonstrate a level of analysis, judgement and implement care that is in the majority non-routine requiring a significant theoretical knowledge under the supervision of registered practitioners. You will receive an induction and undertake a preceptorship period of support.&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity to develop the role within an innovative and open-minded team committed to supporting you.&lt;/p&gt;\n&lt;p&gt;for further information or to arrange an informal visit please contact Sister Fiona soltysik on 01626 324608&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120957.jpg", "name": "Torbay and South Devon NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120957"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Newton Abbot", "postalCode": "TQ12 2TS"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.5392", "longitude": "-3.61225"}}, "title": "Nursing Associate / Assistant Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252383", "validThrough": "2020-11-16T23:59:59+0000"}