{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21735", "minValue": "14507", "unitText": "YEAR", "value": ":£8.63 - £12.93 Per Session"}}, "datePosted": "2020-10-27T14:09:38+0000", "description": "&lt;p&gt;&lt;strong&gt;Looking for an exciting job opportunity within healthcare?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Are you passionate about what you do and believe that everyone makes a difference? If so, look no hbk as this could be the job for you.&lt;br /&gt; &lt;br /&gt; An exciting opportunity has arisen for a Bank Multi-skilled Service Support Staff to join the Worcestershire out of hours (OOH) service on a part time basis across our busy&lt;strong&gt;Christmas period&lt;/strong&gt;.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This role will run between November to the end of January.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;There will be no fixed hours offered as this is ad-hoc work. YOU must be available to work Christmas day, boxing day, new year’s eve and new year’s day.&lt;br /&gt; &lt;br /&gt; &lt;strong&gt;This is a Bank contract to work as an when required including nights and weekends&lt;/strong&gt;&lt;br /&gt; &lt;br /&gt; Hourly rate for this role is:&lt;br /&gt; Week day:£8.63&lt;br /&gt; Week Night:£12.05&lt;br /&gt; Weekend Day:£9.25&lt;br /&gt; Weekend Night: £12.93&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The role will be working out of WR3 8TJ, covering Redditch, Worcester, Kidderminster, Malvern and Evesham.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt; Practice Plus Group currently delivers an Out of Hours (OOH) Service across Worcestershire. The OOH service is an appointment based service that is accessed via the national NHS 111 service. Patients are assessed via the 111 team and if it’s clinically appropriate, they will get referred on to our OOH service.&lt;br /&gt; &lt;br /&gt; The “Out of Hours” period is deemed as being after 18.30pm to 08.00am the following morning on weekdays, and all day Saturday’s, Sunday’s and bank holidays.&lt;br /&gt; &lt;br /&gt; &lt;br /&gt; &lt;strong&gt;Within this job you will be responsible for:&lt;/strong&gt;&lt;br /&gt; &lt;br /&gt; &lt;strong&gt;Reception Job Summary:&lt;/strong&gt;&lt;br /&gt; To prepare and open a centre for patients and doctors arrival.&lt;br /&gt; To ensure patients are seen in a professional manner following the guidelines issued by Practice Plus Group.&lt;br /&gt; To provide a receptionist role to the doctor and the patient and enter data onto the IT system.&lt;br /&gt; &lt;br /&gt; &lt;strong&gt;Driver Job Summary:&lt;/strong&gt;&lt;br /&gt; To chauffeur visiting clinicians to and from home visits/PCC sites within the Practice Plus Group operating area and also to assist in our PCCs as a receptionist.&lt;br /&gt; This is an essential service not an emergency service and therefore drivers do not have special priorities over other road users.&lt;br /&gt; Drivers must carry out all driving duties in a safe and legal manner ensuring that the vehicle is driven and passengers are carried in full compliance with current driving regulation and codes principally the Road Traffic Act and the Highway Code.&lt;br /&gt; A clean driving licence is preferred.&lt;br /&gt; &lt;br /&gt; &lt;strong&gt;Co-ord Assist Job Summary:&lt;/strong&gt;&lt;br /&gt; To Assist the Coordinator support the links and interface between Primary Care and the Practice Plus Group “Out of Hours” service to ensure a seamless delivery of out of hours care.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About Practice Plus Group:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Practice Plus Group was founded in 1982. Today our healthcare services include treatment centres, prison health services, GP practices, NHS walk-in centres, GP out-of-hours and CATS and diagnostic facilities. This means that we provide a greater range of specialist care services than any other organisation in the UK.&lt;br /&gt; &lt;br /&gt; Practice Plus Group is the largest independent provider of urgent care services in England incorporating OOH&#39;s, single point of access and referral management. We deliver excellent, high value patient care on behalf of the NHS for over eight million patients across England.&lt;br /&gt; &lt;br /&gt; We work with the NHS to deliver high quality healthcare services, reducing waiting times and giving the patient a greater level of choice. We also take healthcare services closer to where people live and work – increasing the efficiency and quality of the services we deliver and helping to reduce waiting times.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Job Requirements:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;In order for you to be considered for the job, as a minimum we are looking for you to:&lt;br /&gt; • Have a good general standard of education.&lt;br /&gt; •Good Organisational &amp; administration skills&lt;br /&gt; • Have good IT skills, including keyboard/typing skills&lt;br /&gt; • Have a good telephone manner and excellent communication skills&lt;br /&gt; •Ability to work effectively under pressure&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Additional Information:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Please note that offers of employment are subject to receipt of satisfactory references and DBS check.&lt;br /&gt; &lt;br /&gt; At Practice Plus Group, we actively promote diversity and equal opportunities.&lt;br /&gt; &lt;br /&gt; Applicants must have the right to work in the EU&lt;br /&gt; &lt;br /&gt; Practice Plus Group reserve the right to close this advert early, if a sufficient number of applications have been received.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "Practice Plus Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130136"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Worcestersire", "postalCode": "WR1 1HB"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1973", "longitude": "-2.22192"}}, "title": "Bank Multi-skilled Service Support Staff - Christmas Temp Position", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244883", "validThrough": "2020-12-31T23:59:59+0000"}