{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 p.a. (pro rata)"}}, "datePosted": "2020-11-02T10:32:37+0000", "description": "&lt;p&gt;We are Manchester Local Care Organisation - an exciting, public sector organisation that is bringing together NHS community health services and social care services in the city. We’re driven by the aim of improving the health of local people in Manchester by working across organisational boundaries.&lt;/p&gt;\n&lt;p&gt;The first health and social care staff have been deployed to us from April 2018 and are now starting to work in new ways across the city. Our teams work as one in the neighbourhoods they serve – delivering and designing services in partnership with local people. We also provide key services that work across wider localities and city-wide. We believe that our pioneering approach will make a massive difference to the health of people in our city and we are looking for you to join our team and help us do this.&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for a permanent band 5, qualified Speech and Language Therapist to deliver assessments, diagnoses and interventions to children and their families in a variety of locations but primarily within specialist support schools. The Manchester Speech and Language Therapy Service is a city-wide service providing support to children aged 0-16 years (or up to 19 years if the young person attends a Manchester Special Support School ) who have speech, language and communication needs, including difficulties with feeding and swallowing, social communication.&lt;/p&gt;\n&lt;p&gt;With a good theoretical knowledge of paediatric communication impairments, and an understanding of the issues affecting an inner city, multi-ethnic community, you will have a particular enthusiasm to work with children who have additional needs within specialist support schools.&lt;/p&gt;\n&lt;p&gt;You will have experience of working with children and their families and possess excellent time management, problem-solving, analytical and reflection skills. With current knowledge of the implications of the 2014 Children&#39;s and Families Act, and a particular knowledge of SEND you will also have a thorough working knowledge and use of up-to-date assessment procedures and therapy techniques.&lt;/p&gt;\n&lt;p&gt;Working alongside key partners such as parents, schools and other health workers in managing the child&#39;s needs you will be based within a team within the larger citywide service. In Manchester many of the patients are from families whose mother tongue is not English. You will require access to a vehicle for work purposes.&lt;/p&gt;\n&lt;p&gt;The Manchester SALT team is a large, well-established and supportive department. There is a good CPD process including clinical support and mentoring. There are opportunities to attend internal SIG&#39;s and peer support groups. We also offer a comprehensive induction programme, 1-1’s and annual appraisals to develop knowledge and skills where appropriate.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameJennie RocheJob titleAdditional Needs Team Co-ordinatorEmail addressjennie.roche@mft.nhs.ukTelephone number07875273939Additional contact information&lt;/p&gt;\n&lt;p&gt;Philippa Green 0161-248-1235&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Manchester University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121137"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Manchester, Manchester", "postalCode": "M19 3BX"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4464", "longitude": "-2.18852"}}, "title": "Speech and Language Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251616", "validThrough": "2020-11-23T23:59:59+0000"}