{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 Per Annum"}}, "datePosted": "2020-10-16T09:52:19+0100", "description": "&lt;p&gt;There are several exciting opportunities for Mental Health Nurses, Learning Disability Nurses and also General Nurses at Band 5 to apply to work in North and West Cumbria mental health inpatient services.&lt;/p&gt;\n&lt;p&gt;Essential requirements of the post are;&lt;/p&gt;\n&lt;p&gt;First level Registered Mental Health/Learning Disability/General Nurse - RMN/LD/General Nurse (adult nursing).&lt;/p&gt;\n&lt;p&gt;You will have problem solving ability and change management skills with the ability to fulfil the function of primary/co-primary nurse working in a 24 hour system of care. A professional manner, appearance and the ability to work as part of a team are vital.&lt;/p&gt;\n&lt;p&gt;You must also have knowledge and commitment to evidence based practice, clinical governance and a clear understanding of the safeguard and protection systems in place for vulnerable service users.&lt;/p&gt;\n&lt;p&gt;There are 6 mental health/learning disability wards over the Carlisle and West Cumbria sites that provide a wide range of specialized care. We provide excellent care for adults and older adults with a varied need.&lt;/p&gt;\n&lt;p&gt;Edenwood is a 6 bedded assessment and treatment unit for people with a learning disability and or autism, challenging behaviour and mental health problems. Edenwood will provide high quality, evidence based care. The care will be holistic, transparent andperson-centred .Our aim is understanding people with a Learning Disabilities individualneeds whilst respectfully enabling recovery from a challenging period in their life. Together the team will nurture and empower the individual to achieve citizenship.&lt;/p&gt;\n&lt;p&gt;Rowanwood is a 10 bed mixed psychiatric intensive care unit based at the Carleton clinic in Carlisle. The units providemental health care and treatment for people whose acute distress, absconding risk andsuicidal or challenging behavior needs a secure environment beyond that which can normally be provided on an open psychiatric ward. High staffing ratios allow for intensive input to resolve issues quickly.&lt;/p&gt;\n&lt;p&gt;Hadrian Unit is a high risk needs-led acute psychiatric ward for the whole of Cumbria based at the Carleton Clinic in Carlisle. It has 22 bedsproviding assessment, care and treatment by a multi-disciplinary team. The ward delivers a range of recovery focused interventions to support individuals with managing difficulties with their mental health, the care provided is patient centered and supported by a multi professional team. We work with individuals to promote staying well and relapse prevention. It offers emotional, practical and educational support to both individuals, carers and family members. We link in with community services, social care services and third sector providers to support transition into the community.&lt;/p&gt;\n&lt;p&gt;Ruskin Unit is a 15 bedded Nurse Led Assessment Unit situated in the Carleton Clinic. The mixed sex unit is for older persons suffering from an Organic Mental Illness, such as dementia, and deals with the assessment of enduring mental health problems.&lt;/p&gt;\n&lt;p&gt;Oakwood is a 12 bed mixed older adult functioning assessment unit for an older person with age related needs and enduring mental health problems that are not organic. Oakwood focuses on recovery by building a therapeutic relationship with the person and their family.&lt;/p&gt;\n&lt;p&gt;Yewdale Unit is aneeds-led acute psychiatric ward based at the Whitehaven hospital on the west coast of Cumbria. It has 16 mixed gender bedsproviding assessment, care and treatment by a multi-disciplinary team. The ward delivers a range of recovery focused interventions to support individuals with managing difficulties with their mental health, the care provided is patient centered and supported by a multi professional team. We work with individuals to promote staying well and relapse prevention. It offers emotional, practical and educational support to both individuals, carers and family members. We link in with community services, social care services and third sector providers to support transition into the community.&lt;/p&gt;\n&lt;p&gt;We offer an induction package, clinical supervision, individualised support (based on a self-assessment tool) around the specialist skills required to meet the needs of our patients and this is provided by all members of the multi-disciplinary team.&lt;/p&gt;\n&lt;p&gt;Informal enquiries/visits are welcomed. Please contact Rikki McDowall and Karen Beattie Clinical nurse managers. Carlton Clinic, Carlisle, Cumbria CA1 3SX. Tel: 01228 602 000.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121049.jpg", "name": "Cumbria, Northumberland, Tyne and Wear NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121049"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Carlisle, Cumbria", "postalCode": "CA1 3SX"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.8749", "longitude": "-2.88374"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916229501", "validThrough": "2020-11-30T23:59:59+0000"}