{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Negotiable"}}, "datePosted": "2020-11-04T08:19:12+0000", "description": "&lt;h1&gt;CROFTON and SHARLSTON MEDICAL PRACTICE&lt;/h1&gt;\n&lt;h1&gt;&lt;span&gt;&lt;span&gt;WAKEFIELD WEST YORKSHIRE WF4 1HJ&lt;/span&gt;&lt;/span&gt;&lt;/h1&gt;\n&lt;p&gt;&lt;strong&gt;Welcome to the Rhubarb Triangle!&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Where do Pomfret cakes come from?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Are you a rugby league fan?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are offering an exciting opportunity for an enthusiastic salaried GP, to join a well-organised two site practice. We are in a semi-rural area near Wakefield with good motorway links to surrounding cities. We are looking to increase our team of doctors. We currently have 4 partners and 2 salaried GPs and we are looking to appoint a further salaried GP for 6 sessions per week.&lt;/p&gt;\n&lt;p&gt;We are a high QOF achiever with a list size of 10700 and offer a full range of enhanced services. We are members of a well-established PCN which has its own on the day triage system for our patients.&lt;/p&gt;\n&lt;p&gt;Our excellent practice nurse team manages all chronic conditions and we also have a minor ailments nurse, network pharmacist, in-house pharmacy technician, social prescriber, care-co-ordinator and First Contact Practitioner, (qualified physio).&lt;/p&gt;\n&lt;p&gt;The CCG also provides an afternoon home visiting service for all practices Monday to Friday.&lt;/p&gt;\n&lt;p&gt;Our aim is always to be paper lite and we have an administrative team who help make this happen and we are currently operating a digital first system for all patient contact.&lt;/p&gt;\n&lt;p&gt;We are also a training practice and teaching / learning is not just a trainer to trainee, we also encourage the habit of learning from each other and regularly share peer reviews. Our “teaching” also includes sharing good practice and also lessons learned and reviews on how things could be done differently – all part of everyone’s on-going development.&lt;/p&gt;\n&lt;p&gt;If you are a hard-working committed GP who would like to play an active role within our team and help us maintain our values and deliver high quality care then we would welcome you.&lt;/p&gt;\n&lt;p&gt;Competitive salary offered, negotiable depending on experience.&lt;/p&gt;\n&lt;p&gt;If you would like to visit us to see what our practice is like, and have the opportunity to speak to our team, then please do not hesitate to contact our Practice Manager to arrange.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please be aware this job advert will close when sufficient applications have been received&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central Advertising - General Practitioners", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130654"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wakefield", "postalCode": "WF4 1HJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.6566", "longitude": "-1.427"}}, "title": "Salaried GP", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255081", "validThrough": "2020-12-18T23:59:59+0000"}