{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "77126", "minValue": "41360", "unitText": "YEAR", "value": "£41,360 - £77,126 per annum pro rata"}}, "datePosted": "2020-11-04T10:16:25+0000", "description": "&lt;p&gt;&lt;strong&gt;SPECIALITY DOCTOR IN NEUROPSYCHIATRY&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;Full time - 10 sessions per week&lt;br /&gt;Base: Neuropsychiatry, Hafan y Coed, University Hospital Llandough, Cardiff&lt;br /&gt;&lt;br /&gt;Applications are invited for a Specialty Doctor in Neuropsychiatry in Cardiff and Vale University Health Board Mental Health Services, Welsh Neuropsychiatry Service.&lt;/p&gt;\n&lt;p&gt;The post-holder will work as part of this specialist Mental Health Service which provides care and treatment to clients with Neuropsychiatric presentations following an acquired brain injury.&lt;/p&gt;\n&lt;p&gt;You will work within a multi disciplinary team including nursing team, occupational therapy, physiotherapy, speech and language therapy, and psychology as part of the Welsh Neuropsychiatry Service, the only specialist Neuropsychiatry service in Wales and providing input to the inpatient ward, outpatient, day and community services.&lt;/p&gt;\n&lt;p&gt;The post holder will work in close collaboration with the Consultant in Neuropsychiatry. Duties will include the assessment and the supervision of patients admitted to the 11 bedded Neuropsychiatry Ward at Hafan y Coed, University Hospital Llandough and the assessment of patients attending the Day Unit for Neuropsychiatric assessment and ongoing rehabilitation.&lt;/p&gt;\n&lt;p&gt;Successful applicants will be expected to participate in administration, CPD, audit and teaching. Full registration with the General Medical Council is essential.&lt;/p&gt;\n&lt;p&gt;Cardiff and Vale University Health Board is a teaching UHB, being associated with the Cardiff University School of Medicine and there is, in addition, an active Postgraduate Department for Psychiatry based at University Hospital Llandough.&lt;/p&gt;\n&lt;p&gt;Cardiff and Vale University Health Board reserve the right to close this vacancy after 24 hours if a large number of suitable applications are received. Therefore we encourage early applications to ensure consideration for this post. &lt;br /&gt;&lt;br /&gt;We are committed to flexible working and equal opportunities. &lt;br /&gt;&lt;br /&gt;Cardiff and Vale UHB is a Smoke Free Health Board. Smoking is banned across all of the UHB sites, and while some smoking shelters have been retained these are for the use of distressed patients and visitors only. Staff are therefore not able to smoke in the hospital grounds or on any other UHB premises. &lt;br /&gt;&lt;br /&gt;When applying for this post it is essential that you read the Job Description and Person Specification (where available) and use the “supporting information” space to demonstrate how your skills, knowledge and experience meet the requirements of the person specification. &lt;br /&gt;&lt;strong&gt;PLEASE NOTE&lt;/strong&gt;: Only those candidates who clearly demonstrate how they meet the person specification will be shortlisted for this job. &lt;br /&gt;&lt;br /&gt;Your local library can provide you with a FREE service, to assist you in setting up an email address to enable you to view all vacancies and apply on-line. &lt;br /&gt;&lt;br /&gt;Applications for this post will be welcomed from Welsh speaking candidates. Whilst the ability to speak Welsh is not essential, it is desirable for non-medical posts and the successful applicant will be supported through the personal development plan process if they wish to develop an understanding of the language.&lt;/p&gt;\n&lt;p&gt;References will be required to cover a minimum of three years of previous employment and/or training&lt;/p&gt;\n&lt;p&gt;A satisfactory disclosure check will be required of the successful applicant&lt;/p&gt;\n&lt;p&gt;In view of Border Immigration Agency regulations, all applicants must state their current immigration status including expiry dates&lt;strong&gt;.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameGwen PhillipsJob titleAssistant Clinical DirectorTelephone number029 2182 4615/4616Additional contact information&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Interested applicants should contact:&lt;br /&gt;Gwen Phillips Assistant Clinical Director, &lt;br /&gt;Tel. 029 2182 4615/4616&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Dr Seth Mensah, Consultant Neuropsychiatrist &lt;br /&gt;Tel. 029 2182 4615/4616&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123193.jpg", "name": "Cardiff and Vale University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123193"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "University Hospital Llandough, Penarth", "postalCode": "CF64 2XX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4496", "longitude": "-3.20264"}}, "title": "Specialty Doctor in Neuropsychiatry", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255347", "validThrough": "2020-11-25T23:59:59+0000"}