{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum pro rata"}}, "datePosted": "2020-10-30T11:46:15+0000", "description": "&lt;p&gt;&lt;strong&gt;THIS POST IS FIXED TERM FOR 14 MONTHS DUE TO MEET THE NEEDS OF THE SERVICE. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Velindre Cancer Centre is an exciting, caring and friendly place to work and develop your career. We are making major changes for the future so we can treat more patients, help more people live longer with cancer and treat more people closer to their homes. We are planning a new Velindre Cancer Centre near to our current site. It’s a unique setting with a special environment that will provide many benefits to the well-being of our patients. The changes will create development opportunities allowing our people to work across a number of sites in new and different ways and with greater flexibility.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for a Macmillan Welfare Rights Advisor on a fixed term contract.&lt;/p&gt;\n&lt;p&gt;The post is recruited and employed by Velindre Cancer Centre in partnership with Macmillan Cancer Support. The Macmillan Welfare advisor &lt;em&gt;will work as part of the wider Supportive Care Team. This is a busy, fast paced service. Working to requirements of the Advice Quality Standard (AQS) and Macmillan Targets. &lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;You will work as part of a team of Welfare Rights Advisers. You will be responsible for a case load of clients who are affected by a cancer diagnosis. You &lt;/em&gt;will undertake case work. Assisting clients to access their entitlements to welfare benefits and other sources of financial help. Substantial recent benefit casework experience is an essential requirement of this job, preferably to the standard of the Advice Quality Standard (AQS).&lt;/p&gt;\n&lt;p&gt;You will work in close partnership with health and other professionals to advise the client group. You will also be involved in delivering training and information sessions and producing information materials. Experience in these areas would be an advantage.&lt;/p&gt;\n&lt;p&gt;A desire to promote income maximisation and an understanding of the causes and effects of poverty are essential.&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; Welsh and/or English speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt;Closing Date: 12/11/2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Hayley Price&lt;/p&gt;\n&lt;p&gt;Email address: Hayley.Price4@wales.nhs.uk&lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;Hayley Price&lt;/p&gt;\n&lt;p&gt;Hayley.Price4@wales.nhs.uk&lt;/p&gt;\n&lt;p&gt;02920615888&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123256.jpg", "name": "Velindre Cancer Centre", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123256"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Velindre Cancer Centre, Cardiff", "postalCode": "CF14 2TL"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5164", "longitude": "-3.22902"}}, "title": "Welfare Benefits Advisor", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250017", "validThrough": "2020-11-12T23:59:59+0000"}