{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum"}}, "datePosted": "2020-10-28T13:46:01+0000", "description": "&lt;p&gt;Bushey Fields Hospital, Dudley, DY1 2LZ&lt;/p&gt;\n&lt;p&gt;Job Ref No: 10 Programmed Activities.&lt;/p&gt;\n&lt;p&gt;Applications are invited for a full time Consultant in Old Age Psychiatry based at Bushey Fields Hospital Dudley to join 2 existing Consultants. This existing post is within a well-established supportive service working both on the in-patient wards and in the community, having retained the Continuity of Care model. The Consultant will lead a team of other doctors; CPNs; Social Workers and Occupational Therapists, and together with the existing workforce cover the communities of Dudley, Stourbridge and Halesowen in the Black Country. We are also developing new models and methods of working which will include liaison to primary care within the MCP model, and have developed an Old Age Home Treatment Team.&lt;/p&gt;\n&lt;p&gt;There are opportunities for someone with an enthusiasm for leadership to become involved in all other aspects of career development such as medical management and research. As a training and teaching Trust there are opportunities to teach postgraduate psychiatric and GP trainees and undergraduates from Birmingham and Grenada Universities and newly formed links with Aston Medical School. Links to local Universities have always been strong and input to Birmingham and Wolverhampton Universities is welcomed.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further information and/or to arrange an informal visit, please contact Dr Usman Khalid, Associate Medical Director (Tel no: 01384 324571).&lt;/strong&gt;&lt;strong&gt; Closing date: 23.10.2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDr Usman KhalidJob titleAssociate Medical DirectorEmail addressusman.khalid@nhs.netTelephone number01384 324571&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120845.png", "name": "Black Country Healthcare NHS Foundation Trust (formerly known as Black Country Partnership Foundation Trust)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120845"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bushey Fields Hospital, Dudley", "postalCode": "DY1 2LZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5029", "longitude": "-2.11685"}}, "title": "Consultant Psychiatrist - Older Adults", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246804", "validThrough": "2020-11-16T23:59:59+0000"}