{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Band 7"}}, "datePosted": "2020-10-08T15:36:34+0100", "description": "&lt;h1&gt;&lt;strong&gt;&lt;span&gt;Hospital Palliative Care Nurse Specialist – Paediatric (UHL) &lt;/span&gt;&lt;/strong&gt;&lt;/h1&gt;\n&lt;h1&gt;&lt;strong&gt;&lt;span&gt;Up to 37.5 hours per week Monday – Friday&lt;/span&gt;&lt;/strong&gt;&lt;/h1&gt;\n&lt;h1&gt;&lt;strong&gt;&lt;span&gt;On Call Rota&lt;/span&gt;&lt;/strong&gt;&lt;/h1&gt;\n&lt;h1&gt;&lt;span&gt;&lt;strong&gt;Band &lt;/strong&gt;&lt;strong&gt;&lt;span&gt;7 &lt;/span&gt;&lt;strong&gt;Agenda for change&lt;/strong&gt;&lt;/strong&gt;&lt;/span&gt;&lt;/h1&gt;\n&lt;p&gt;Join our incredible team of Rainbows Nurses as we launch our exciting new range of services which aims to meet the needs of more families across the East Midlands than ever before.&lt;/p&gt;\n&lt;p&gt;When Covid-19 hit, it changed everything for our families. We had to respond by changing everything we do. We are introducing a range of new services which our families desperately need to make sure we can still be there for them during the most difficult of times. These new nursing roles are all part of new service model which aims to meet the needs of more families, not just within in the Hospice building, but also in our local hospitals and reaching out in to our communities.&lt;br /&gt; &lt;br /&gt; The demand for the incredible care Rainbows provides is increasing and is more important than ever. Come and be part of something amazing. Come and be part of the Rainbow.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;If you are a Paediatric Registered Nurse Level 1 we would like to hear from you. &lt;/span&gt;&lt;span&gt;You will have a Degree or Equivalent experience, plus a Palliative Care Qualification or willingness to work towards. &lt;/span&gt;&lt;span&gt;Proven leadership skills, excellent communication skills and the ability to demonstrate high standards of clinical care are essential, as well as evidence of continuing professional development within the last 12 months.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Rainbows Hospice for Children and Young People is a 10 bedded Nurse led unit based in Loughborough Leicestershire. We are a multidisciplinary team that provides holistic, family centred short beaks, palliative and end of life care for children and young people (aged 0-25) from across the East Midlands who have complex and palliative care needs, including those who are technology and ventilator dependent. We also provide care to our children and young people at home. Our Family Support Team offers bereavement and community support for the whole family.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;In this role you will be responsible for providing information, support, advice and specialist knowledge to children, young people and their families.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;You will act as a resource to the multi-professional team influence palliative care, symptom management and end of life care development across University Hospitals of Leicester (UHL). &lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;“Working here at Rainbows allows me to deliver the nursing and care I always dreamed of. If I can make a small difference, make their day better in the smallest way, then that’s enough for me” Anne-Marie, Nurse. At Rainbows, patient led care is at the centre of what we do, ensuring that our children and young people have fun, socialise and make the most of the time they have&lt;strong&gt;.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;In addition to NHS matched salaries, we offer a range of benefits including a health cash plan, free parking and, as we are a directional employer, the opportunity to continue with your NHS pension.&lt;/p&gt;\n&lt;p&gt;All positions are subject to an enhanced and barred DBS check.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For more information about this role, or to arrange an informal visit, please contact&lt;strong&gt;Tony Martin (Head of Nursing) or Jo Sims (Head of Family Support and Outreach)&lt;/strong&gt; on 01509 638000.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/130576.jpg", "name": "Rainbows Hospice for Children and Young People", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130576"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Leicestershire", "postalCode": "LE11 2HS"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.7461", "longitude": "-1.21577"}}, "title": "Hospital Palliative Care Nurse Specialist – Paediatric (UHL)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916218927", "validThrough": "2020-11-30T23:59:59+0000"}