{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 pa"}}, "datePosted": "2020-11-03T13:46:24+0000", "description": "&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Band 6 Physiotherapist&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;30 hours per week&lt;br /&gt;&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Are you looking for an opportunity to use and build on your rehabilitation skills?&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are looking for someone to join us at an exciting time as we begin to work collaboratively with community colleagues in the development of a model to deliver Early Intervention in the home, with input from multiple disciplines and organisations. This team’s aim will be to rehabilitate and re-able older people to achieve their maximum level of independence, as well as facilitating quick discharges from the Acute (both pre and post admission).&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are seeking an enthusiastic Physiotherapist with excellent communication skills to join our Early Intervention Community Team. The successful candidate will work as part of the team supported by qualified Therapists and Nursing staff to promote early supported discharges, providing assessment on the ward and rehabilitation in the patient’s own home.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The successful candidate will work as part of a well-established and respected Therapy and Nursing team, to assess for appropriate admissions and to promote early supported discharges, providing rehabilitation on the ward or in the patients’ own home. You will have a breadth of experience working in the acute hospital setting, but you may also have experience working in the community.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Ideally candidates would have approximately 12-months post qualification experience. The post holder will require a flexible approach and the ability to work autonomously as well as in a team. Excellent organisational and time management skills are essential.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will need to have a full driving licence and access to a vehicle.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are committed to continued professional and career development of all staff. The Trust is committed to providing a 7 day therapy service. This role includes participation in a weekend cover rota.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If you would like to discuss this post, please contact Sarah Goodchild, EICT Therapy Lead or Matthew Craven, Clinical Team Lead on 0121 4240982 or via e-mail &lt;/strong&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;sarah.goodchild@heartofengland.nhs.uk / matthew.craven@heartofengland.nhs.uk &lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120989.jpg", "name": "University Hospitals Birmingham (Heartlands, Good Hope, Solihull)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120989"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Birmingham", "postalCode": "B9 5SS"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4802", "longitude": "-1.82996"}}, "title": "Band 6 - Physiotherapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254195", "validThrough": "2020-11-22T23:59:59+0000"}