{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 gross per annum"}}, "datePosted": "2020-10-22T17:05:35+0100", "description": "&lt;p&gt;The Suffolk Community Perinatal Mental Health Team provide prevention, detection and management of mental health problems that complicate pregnancy and the postpartum year. These include new-onset problems, recurrences of previous problems in women who have been well for some time and in women with existing mental health problems who become pregnant. Promoting the relationship with the infant and its emotional and physical well-being and development are central to the care provided by perinatal mental health services.&lt;/p&gt;\n&lt;p&gt;The Suffolk Community Perinatal Mental Health Team are looking to recruitone band 6 Mental Health Nurse Practitioners. These are full-time permanent posts. We are a countywide service currently based at West Suffolk Hospital in Bury St Edmunds but will be relocating to a community base in the future. This is an excellent opportunity to become involved in a national expansion of community perinatal services.&lt;/p&gt;\n&lt;p&gt;The Suffolk Community Perinatal Mental Health Team offers an exciting opportunity to work within a specialist multi-disciplinary setting, working closely with key partners in health, social care and other sectors. We are looking for a qualified nurse practitioner who will be a key player within our team.&lt;/p&gt;\n&lt;p&gt;This is an opportunity to develop new skills and knowledge. The service provides education and training opportunities.&lt;/p&gt;\n&lt;p&gt;If you would like to know more about the role click the job description, then click APPLY to start your candidate experience today!&lt;/p&gt;\n&lt;p&gt;We can offer you the full range of NHS benefits and in addition:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Financial support with relocation cost (subject to terms &amp; condition)&lt;/li&gt;\n&lt;li&gt;Up to 307 hours holiday entitlement (subject to length of service)&lt;/li&gt;\n&lt;li&gt;Cycle scheme tax-free bikes and accessories&lt;/li&gt;\n&lt;li&gt;Childcare voucher scheme&lt;/li&gt;\n&lt;li&gt;Support with revalidation&lt;/li&gt;\n&lt;li&gt;Post graduate training opportunities&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;em&gt;Interview dates are yet to be confirmed; you will be contacted via email . These emails may go to your SPAM, so please keep checking all your emails if applying.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Please visit our Facebook and Twitter page @NSFTjobs&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Kevin Moran, Deputy Service Manager for Suffolk Community Perinatal Mental Health Team on 01284 719704 or at kevin.moran@nsft.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121326.png", "name": "Norfolk and Suffolk NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121326"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "West Suffolk Hospital, Bury St Edmunds", "postalCode": "IP33 2QZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.2317", "longitude": ".709205"}}, "title": "Senior Community Mental Health Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916239464", "validThrough": "2020-11-08T23:59:59+0000"}