{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Band 6"}}, "datePosted": "2020-10-20T10:31:22+0100", "description": "&lt;h1&gt; &lt;/h1&gt;\n&lt;p&gt;Whittington Health Trust are looking for Bank 6 Chemotherapy Nurses to join their staff bank. Whittington Health Trust was the highest performing Trust in the London Cancer network in both 2015 and 2016 National Cancer Patient Experience Survey (NCPES). Cancer services at Whittington Health promote streamlined integrated pathways tailored to patients’ needs that emphasise shared decision-making and patient empowerment. There is a focus on early diagnosis and holistic recovery care packages.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen at Whittington Health within our Chemotherapy Unit. We are looking for qualified nurses with oncology or IV administration experience, who wishes to specialise their skill set within Chemotherapy Administration to join Whittington Health’s Temporary Bank..&lt;/p&gt;\n&lt;p&gt;We are looking for nurses with a genuine passion for the care of Oncology, Haematology and Rheumatology patients embarking on Systemic Anti-Cancer Treatments (SACT)&lt;/p&gt;\n&lt;p&gt;You will be responsible for:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Administering cytotoxic drugs as per local/national protocols&lt;/li&gt;\n&lt;li&gt;Contribution to the care of patients requiring administration of chemotherapy and/or supportive treatments&lt;/li&gt;\n&lt;li&gt;Assessing, developing, implementing and evaluating patient /client care&lt;/li&gt;\n&lt;li&gt;Contributing to effective team working and supervise qualified and/or unqualified staff&lt;/li&gt;\n&lt;li&gt;Be able to work autonomously as a bank nurse within the unit, to ensure that all Systemic Anti-Cancer Treatments (SACT) are administered as prescribed&lt;/li&gt;\n&lt;li&gt;Ensuring the needs of patients are recognised and met through assessment, planning, implementation and evaluation of care using Holistic Nursing Assessment in order to meet the physical, psychological, social and spiritual needs&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Required Skills&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;NMC Registration&lt;/li&gt;\n&lt;li&gt;6 months experience in a similar NHS setting&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;If you would like to join the Whittington Health Oncology team please do register and apply for this vacancy today.&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121035.JPG", "name": "Whittington Health", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121035"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Whittington", "postalCode": "N19 5NF"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5667", "longitude": "-.138149"}}, "title": "Bank Band 6 Chemotherapy Nurse Whittington", "url": "https://www.jobs.nhs.uk/xi/vacancy/916233874", "validThrough": "2020-11-30T23:59:59+0000"}