{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum"}}, "datePosted": "2020-11-03T14:16:23+0000", "description": "&lt;p&gt;We have an exciting opportunity for a Consultant Psychiatrist to join the North West Sussex &#39;Core-24&#39; Mental Health Liaison Team (MHLT). The team is part of the North West Sussex Crisis and Urgent care hub and the post holder will be working closely with Acute, CRHTT and community colleagues. This role covers the emergency department and wards at Princess Royal Hospital, Haywards Heath and the Urgent Treatment Centre, Crawley Hospital. The Crisis and Urgent Care hub teams are CRHTT, Street Triage, Haven and MHLT. They are remarkably capable teams and exceptionally well led.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please note this post attracts a Relocation Package of up to £8000. Information on these can be obtained from the Medical Staffing Team on 0300 304 0393.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;At Sussex Partnership we are committed to providing opportunities for &lt;strong&gt;flexible working&lt;/strong&gt;. If you would like to work differently or different hours to as advertised, please get in touch to discuss this in more detail.&lt;/p&gt;\n&lt;p&gt;You will be part of a friendly and supportive multidisciplinary team that consists of other Consultants, Nurse’s, Social Workers, Occupational Therapists, Psychologists and peer support workers. You will be working with other acute partners (BSUH and SCFT) in the local area as well as Trust Dementia and Older People&#39;s mental health services.&lt;/p&gt;\n&lt;p&gt;The Trust strives to maximise clinical time for doctors, so you will benefit from direct administrative support as well as the admin established for the whole hub.&lt;/p&gt;\n&lt;p&gt;This role can also support any interest in research, development, medical education or special interests that you may have. We strongly believe in creating roles that provide a service but also give you the opportunity to develop your own areas of special interest.&lt;/p&gt;\n&lt;p&gt;There is only so much we can say to you in an advert, so would love to speak to you about this role in more detail.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Please note the Job Description is still with the Royal College for approval. If there are any small changes we will ensure all applicants receive the final version before interview.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDr Ram KamatJob titleClinical Lead, North West SussexEmail addressRam.Kamat@sussexpartnership.nhs.ukTelephone number07471227930Additional contact information&lt;/p&gt;\n&lt;p&gt;Clare Stoneman - MHLT service manager - 07500 816540 - Clare.Stoneman@sussexpartnership.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121074.jpg", "name": "Sussex Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121074"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Princess Royal Hospital, Haywards Heath", "postalCode": "RH16 4EX"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.9912", "longitude": "-.09105"}}, "title": "Consultant in Liaison Psychiatry", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254290", "validThrough": "2020-11-24T23:59:59+0000"}