{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "84103", "minValue": "70794", "unitText": "YEAR", "value": "£70,794-£84,103 (pro-rata)"}}, "datePosted": "2020-10-23T11:58:57+0100", "description": "&lt;p&gt;Are you professional and highly motivated with a drive for delivering excellent care? Are you looking to move into an exciting and rewarding role for the Ministry of Defence?&lt;/p&gt;\n&lt;p&gt;Here at DMS Whittington, we have a vacancy for a part time (18.5 hours per week) Civilian Medical Practitioner. As a Civilian Medical Practitioner, you will be providing primary and occupational healthcare in line with General Medical Council (GMC) standards to ensure that the organisational and Principal/Senior Medical Officer&#39;s objectives are achieved to optimise patient care.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;You will be &lt;/strong&gt;&lt;strong&gt;Working within the guidelines of General Medical Council:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To provide general healthcare to all registered patients during normal practice hours.&lt;/li&gt;\n&lt;li&gt;Maximise the levels of health, wellbeing and employability of Service personnel to ensure the needs of the single Services are met.&lt;/li&gt;\n&lt;li&gt;Undertake mandatory medical examinations and provide appropriate occupational healthcare and advice, and all supporting administrative duties.&lt;/li&gt;\n&lt;li&gt;You will provide appropriate preventative medical advice to both individuals and Chain of Command.&lt;/li&gt;\n&lt;li&gt;Appropriately supervise the management of communicable diseases, including monitoring and reporting through single Service chains.&lt;/li&gt;\n&lt;li&gt;Provide primary care emergency treatment to any patient who may require this within the Establishment.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Essential Criteria&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Registration with the UK GMC, and on the GP Register.&lt;/li&gt;\n&lt;li&gt;Be proficient in relevant IT systems (training provided)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Doctors will provide Certificate of Prescribed Equivalent Experience or Statement of Acquired Rights (now known as CCT) from the Joint Committee in Post Graduate Training in General Practice (JCPGT(GP)). To hold this certificate they will also have to hold a Post Graduate Training Certificate in General Practice and a Certificate of General Practice Vocational Training (GPVT). Doctors need all above to be registered on GMC as GP.&lt;/p&gt;\n&lt;p&gt;Memberships: Current GMC registration: on GP register and with a licence to practise.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The following experience is desirable&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Knowledge of medical IT systems used within the Defence Medical Services&lt;/li&gt;\n&lt;li&gt;Occupational health, in particular military occupational health.&lt;/li&gt;\n&lt;li&gt;Musculoskeletal medicine (where appropriate) Experience of Armed Forces Medicine, relevant to the single Service environment, i.e. Underwater and Diving Medicine, Aviation Medicine.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Selection process&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The selection at sift stage will be CV based.&lt;/p&gt;\n&lt;p&gt;Please ensure you demonstrate that you have the required skills, qualifications and memberships in your CV and that you have saved it using your surname then first name prior to submitting your application.&lt;/p&gt;\n&lt;p&gt;At interview, you will be tested against the following Behaviours:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Communicating and Influencing&lt;/li&gt;\n&lt;li&gt;Making Effective Decisions&lt;/li&gt;\n&lt;li&gt;Leadership&lt;/li&gt;\n&lt;li&gt;Changing and Improving&lt;/li&gt;\n&lt;li&gt;Managing a Quality Service&lt;/li&gt;\n&lt;li&gt;Delivering at Pace&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Travel to interview costs will not be reimbursed.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Benefits&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A competitive salary&lt;/li&gt;\n&lt;li&gt;Paid holiday entitlement&lt;/li&gt;\n&lt;li&gt;Free Parking&lt;/li&gt;\n&lt;li&gt;Access to Gym&lt;/li&gt;\n&lt;li&gt;Hairdresser and Barber&lt;/li&gt;\n&lt;li&gt;Costa Cafe and convenience store&lt;/li&gt;\n&lt;li&gt;On site Canteen&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Further Information&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;There is no requirement to deploy as this is met by our uniformed personnel, but you will form the continuity of care required by our patients when based at home.&lt;/p&gt;\n&lt;p&gt;Please be aware that if you are found successful you will be asked to provide evidence of your immunity to Hepatitis B.&lt;/p&gt;\n&lt;p&gt;Successful candidates must meet the security requirements before they can be appointed. The level of security needed is security check.&lt;/p&gt;\n&lt;p&gt;All employees joining Ministry of Defence who are new to the Civil Service will be subject to a 6-month probation period (unless otherwise advised) effective from the employment start date.&lt;/p&gt;\n&lt;p&gt;Please note the salary will be pro-rata for this part time position.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please ensure you have read all the details in the important information link prior to applying.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/132174.png", "name": "Ministry of Defence (Defence Medical Services)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132174"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Lichfield Staffordshire", "postalCode": "WS14 9PY"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6613", "longitude": "-1.77514"}}, "title": "Civilian Medical Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240402", "validThrough": "2020-11-15T23:59:59+0000"}