{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 per annum pro rata"}}, "datePosted": "2020-10-20T14:56:46+0100", "description": "&lt;h1&gt;&lt;strong&gt;The role&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;We are looking for a Band 4 CAMHS Assistant Practitioner, based in our North Devon CAMHS team in Barnstaple to work in the neurodiversity pathway, who can bring skills, experience and enthusiasm to meet the needs of children/young people with complex social, emotional, neurodiversity and mental health needs.&lt;/p&gt;\n&lt;p&gt;Working to meet high demand, assessment and risk in our neurodiversity pathway, you will work in clinical, community and home-based treatment settings providing a mental health/neurodiversity support role to young people, their families and carers and schools. You will offer clinic, community and home-based interventions, e.g completing school observations, attending wider agency meetings, assessment clinics, risk assessing/monitoring and safety planning with the young person, their family and the wider community team.&lt;/p&gt;\n&lt;p&gt;You will work closely with clinicians to contribute and implement a comprehensive assessment, including risk assessment, care planning and delivering evidence- based interventions/care packages to suit the individual needs of the young person. You will help to identify early signs of further deterioration by monitoring the young person’s progress, level of functioning and mental state and alert the appropriate staff involved in their care.&lt;/p&gt;\n&lt;p&gt;You will engage and support the young person to identify interests and goals, supporting them in accessing activities and support within their local community. You will implement care plans in collaboration with the young person and therapeutic packages as devised by clinicians within the team and be managed/supervised by team clinicians.&lt;/p&gt;\n&lt;p&gt;Interview date is to be confirmed.&lt;/p&gt;\n&lt;h1&gt;&lt;strong&gt;About you&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;You will hold the essential qualifications in the Person Spec and have evidence of additional relevant health training with Young People experience. You will work with a multi-disciplinary team and develop relationships across agencies to meet the needs of children and families. The ability to adapt communication and intervention style to meet individual need is important and you will have knowledge of safeguarding and child protection procedures. We’re looking for an individual who is passionate about working with children/young people with the confidence to intervene to meet a range of neurodevelopmental and mental health needs.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;This post may be offered as a training opportunity for candidates who do not already hold a Foundation Degree or have equivalent qualification. Candidates applying for this as a training opportunity must hold a minimum of Level 3 in Health &amp; Social Care or equivalent and meet the Programme requirement for both English and Maths, details of which can be found in the specific Programme information.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Where this is offered as a training post the starting salary will be at £19,737. You will be supported to complete the qualification within two years from your date of enrolment, after which your salary will be adjusted to £21,892 which would be the starting salary of someone who already holds the qualification.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;The Foundation Degrees we offer are undertaken in conjunction with our Educational Partners and we offer one intake a year in September. To enable successful candidates to join the Programme they will need to be enrolled with the Provider no later than one month before the Programme commences. As there is only one date for enrolment on to this Programme, depending on your actual start date within the Trust, you may be on a training contract for more than the two years of the Programme.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;The fees for the two year Foundation Degree are met by the Trust.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Successful completion of the Foundation Degree will enable you to work in a Band 4 role within the Trust; should you be interested in further career development these qualifications are accredited for entry into degree programmes in Mental Health Nursing, Learning Disability Nursing and Occupational Therapy.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Information about this accreditation process is available from our PE Department dpt.practiceeducation@nhs.net&lt;/em&gt;&lt;/p&gt;\n&lt;h1&gt;&lt;strong&gt;About us&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;In this role, employed by Devon Partnership Trust, you will be working for Children and Family Health Devon who have been tasked with catalysing the collaboration and integration across the full health, education, care and voluntary sector to have a long-lasting impact on every child and family’s future health, happiness and aspirations. Children and Family Health Devon is part of an Alliance that is unique and brings together six leading providers of adult and children’s community, acute and mental health services in Devon, along with key voluntary sector organisations and academic partners.&lt;/p&gt;\n&lt;h1&gt;&lt;strong&gt;Our offer to you&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;&lt;strong&gt;Benefits of working at Devon Partnership Trust:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Commitment to career development&lt;/li&gt;\n&lt;li&gt;Wide range of leadership development opportunities&lt;/li&gt;\n&lt;li&gt;Up to&lt;strong&gt;41 days of paid leave&lt;/strong&gt;per year, depending on length of NHS service, includes bank holidays&lt;/li&gt;\n&lt;li&gt;Generous&lt;strong&gt;NHS pension scheme&lt;/strong&gt;with employer contributions of up to 14.5% of pensionable pay&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;NHS pay&lt;/strong&gt;progression&lt;/li&gt;\n&lt;li&gt;Good&lt;strong&gt;maternity, paternity and adoption leave&lt;/strong&gt;over and above the statutory minimum requirements&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Sick pay&lt;/strong&gt;up to a maximum of six months full pay and six months half pay&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Childcare vouchers&lt;/strong&gt;– annual savings&lt;/li&gt;\n&lt;li&gt;Commitment to&lt;strong&gt;flexible working&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;24/7 free&lt;strong&gt;confidential advice&lt;/strong&gt;and&lt;strong&gt;support service&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;Freedom to speak up&lt;strong&gt;‘Guardian Service’&lt;/strong&gt;, enabling you to safely discuss any concerns impacting on patient care&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Preceptorship schemes&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;Exclusive&lt;strong&gt;health service discounts&lt;/strong&gt;for NHS staff&lt;/li&gt;\n&lt;li&gt;Stagecoach –&lt;strong&gt;bus transport discounts&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;Salary sacrifice&lt;strong&gt;cycle scheme&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;Access to free&lt;strong&gt;recovery and wellbeing courses&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h1&gt;&lt;strong&gt;Living here&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;Devon provides a unique, varied and beautiful environment. The coastal area of North Devon provides excellent opportunities for water sports. The National Parks, Dartmoor and Exmoor, are havens for country lovers. Exeter is a thriving University city offering culture and city life. There are excellent rail, road and air connections, with a regional airport in Exeter.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120813.png", "name": "Devon Partnership NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120813"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Barnstaple", "postalCode": "EX31 3UD"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.0645", "longitude": "-4.0882"}}, "title": "CAMHS Assistant Practitioner - Neuro Pathway", "url": "https://www.jobs.nhs.uk/xi/vacancy/916234875", "validThrough": "2020-11-06T23:59:59+0000"}