{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62286", "minValue": "59678", "unitText": "YEAR", "value": "£59,678 - £62,286 Per annum"}}, "datePosted": "2020-10-30T15:31:29+0000", "description": "&lt;p&gt;We are recruiting 2 x Senior Programme Leads to join the Advice and Guidance team of the COVID-19 Public Health Advice, Guidance and Expertise function.&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity to play a role in the national COVID-19 response.&lt;/p&gt;\n&lt;p&gt;The postholder will play a key role in supporting the Head of Programme by trouble shooting immediate, short and medium-term issues to develop appropriate solutions. Issues will involve systems, processes and/or people and situations in which priorities can change at short notice.&lt;/p&gt;\n&lt;p&gt;The post holder will work with colleagues across government and will need to forge strong relationships with external stakeholders. The senior programme lead will work on a range of key project areas that are central to the delivery of the PHE’s work, with regular opportunities to develop important national projects for which they will have the day to day responsibility for running and delivering.&lt;/p&gt;\n&lt;p&gt;A key component of the SPM role is the ability to work with colleagues who are heavily focused on responding to the Covid-19 pandemic and dealing with the delivery of immediate and essential functions to protect the public’s health.&lt;/p&gt;\n&lt;p&gt;The posts are fixed-term until 30th September 2021 and successful applicants can be based at any Public Health England office.&lt;/p&gt;\n&lt;p&gt;Option 1 – Internal (PHE, DH and MHRA)&lt;/p&gt;\n&lt;p&gt;This vacancy is open to employees who already hold the substantive grade for the post and were appointed to the Civil Service on merit following a fair and open competition; or were appointed to a permanent Civil Service post through an exception in the Civil Service Commissioners’ rules.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/127774.jpg", "name": "Public Health England", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127774"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wellington House, London", "postalCode": "SE1 8UG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5018", "longitude": "-.10881"}}, "title": "Senior Programme Lead", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250755", "validThrough": "2020-11-13T23:59:59+0000"}