{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 to £44,503 pa"}}, "datePosted": "2020-10-27T09:15:15+0000", "description": "&lt;p&gt;We are looking for an enthusiastic, passionate and driven Nurse or Physiotherapist with Primary care experience in respiratory to join our award winning and friendly multi-disciplinary team. The post holder will successfully lead our Primary Care, Advice, Complex case and Education (P.A.C.E) service. This service is a designated service to support primary care in the management of COPD and Asthma patients through education, advice and guidance and complex case clinics.&lt;/p&gt;\n&lt;p&gt;The West Hampshire Community Integrated Respiratory Service is commissioned by West Hants CCG to deliver respiratory care and were awarded runner up team of the year by the Association of Respiratory Nurse Specialist (ARNS) in 2019. This is an exciting time to be joining the team, as not only will this role focus on P.A.C.E delivery, the post holder will be integral to the development of a pilot for a Respiratory Diagnostic Pathway to help inform future commissioning and development of the service.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be highly motivated and be able to motivate others. They will be able to evidence excellent communication with patients, families and professionals and be committed to excellence in the work place.&lt;/p&gt;\n&lt;p&gt;The post holder will deliver high quality, evidenced based care and achieve outcomes set out in the service contract. They will be passionate about the development of respiratory care and be able to contribute to the management and strategic development of the service in support of the Clinical Service Lead.&lt;/p&gt;\n&lt;p&gt;As a service we pride ourselves on the teaching and the development of our staff. All staff will be expected to embrace the opportunities to learn and develop skills and knowledge to enhance respiratory care.&lt;/p&gt;\n&lt;p&gt;West Hampshire Community Integrated Respiratory Service are part of Southern Health NHS Foundation Trust. Our aim is to provide high quality, safe services which improve the health, wellbeing and independence of the people we care for. We deliver these services to our community so you will feel a real sense of achievement and that your work makes a difference to local people’s lives.&lt;/p&gt;\n&lt;p&gt;A car driver is essential as the post will involve travelling across the region.&lt;/p&gt;\n&lt;p&gt;If you are committed to providing high quality patient care, and enjoy working in a fast-paced, ever-changing environment, with a highly professional and supportive team you must apply for this role.&lt;/p&gt;\n&lt;p&gt;For more information or to arrange an informal visit please contact Rachel Hardstaff, on 07557 033440 or email rachel.hardstaff@southernhealth.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Southern Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120646"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Fenwick Long Term Conditions Unit", "postalCode": "SO43 7NG"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8793", "longitude": "-1.58376"}}, "title": "Respiratory Primary Care Liaison Lead", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243788", "validThrough": "2020-11-10T23:59:59+0000"}