{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 + 5% HCA"}}, "datePosted": "2020-10-29T09:08:12+0000", "description": "&lt;p&gt;Band 7 RGN&#39;s substantive position within Woking &amp; Walton Community Hospitals.&lt;/p&gt;\n&lt;p&gt;Full time hours across 7 days may include bank holidays. Working in the community hosptial predominantly based in Walton.&lt;/p&gt;\n&lt;p&gt;We are looking for an enthusiastic and motivated RGN to join our highly regarded Community Services.&lt;/p&gt;\n&lt;p&gt;Walton and Woking Community Hospitals are easily accesible just of Jct 11 of the M25, and Jct 3 M3. We provide responsive community rehabilitation and sub acute care to patients across the beautiful Thames and surrounding regions.&lt;/p&gt;\n&lt;p&gt;Working in our Multi-Professional team you will use your nursing practice to assess, investigate, diagnose, treat and prescribe rehabilitation packages of care to support patients to retuen to their own environment and preventing unnecessary acute hospital admissions.&lt;/p&gt;\n&lt;p&gt;Although expected to work autonomously you will not be alone, the team is supported by a clinical Senior Matron, therapists, experienced and skilled rehab assistants. &lt;br /&gt;The wards are also supported my a consultant and speciality doctors. work alongside A&amp;E consultants, GP’s Physiotherapists, Occupational Therapists, Community nursing and Social Care practitioners In this challenging role you will provide a holistic approach by:&lt;br /&gt;• Assessing, stabilising, treating and managing patients in our community hospital environment &lt;br /&gt;• Providing support such as advice, guidance and training on professional nursing issues, and taking part in clinical governance , using reflective practice, nursing research, audit and clinical supervision&lt;br /&gt;• Work in a collaborative and integrated manner with other stakeholders to ensure a seamless service delivery&lt;br /&gt;You&lt;br /&gt;The qualities we are looking for in applicants are:&lt;br /&gt;• Excellent communication and time management skills&lt;br /&gt;• Ability to work both independently and also as part of the wider multidisciplinary team&lt;br /&gt;• 1st Level Registration&lt;br /&gt;• Demonstrate ongoing professional development and a commitment to providing high quality, safe and effective care that meets the needs of patients&lt;br /&gt;• Ability to relate to patients and colleagues in a sensitive manner&lt;br /&gt;• Flexible approach to work with the ability to work across a seven day service. &lt;br /&gt;• Advanced nurse practitioner qualification or willingness to work towards&lt;br /&gt;• Open to new ideas and training&lt;br /&gt;• Have access and use of a car with ability to work across different locations&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123532.JPG", "name": "CSH Surrey", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123532"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Woking and Walton Community Hospital", "postalCode": "GU22 7HS"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.315", "longitude": "-.556519"}}, "title": "Band 7 Ward Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247690", "validThrough": "2020-11-12T23:59:59+0000"}