{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 to £21,142 pa"}}, "datePosted": "2020-10-29T08:33:53+0000", "description": "&lt;h2&gt;&lt;strong&gt;Band 3 Phlebotomy Supervisor&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;span&gt;Are you enthusiastic, reliable and looking to progress your career within a dedicated Phlebotomy Service? If so we may have the right opportunity waiting for you within our Phlebotomy Service. We are looking for a highly motivated individual who is enthusiastic and reliable to join our busy phlebotomy service. As a motivated individual you will demonstrate excellent communication skills along with basic IT skills which are both essential for this post. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Come and join our team in Leeds and become part of ‘The Leeds Way’ sharing our vision and values. Our Trust is recognised for our staff engagement, great care and rated &lt;strong&gt;GOOD&lt;/strong&gt; by the Care Quality Commission.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Leeds Teaching Hospitals NHS Trust is one of the largest acute health providers in the UK and based in one of the fastest growing and vibrant cities in the north.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The post requires commitment to professional behaviours, motivation and a flexible approach to working hours and duties. The ability to work as a member of a team and work without direct supervision are also skills that are required for this role.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This post primarily is to supervise our community and domiciliary service in and around Leeds so there will be a requirement to work in the community setting as well as cross site working depending on service demand with a main base at SJUH. There may be on occasion the requirement to support other supervisors within the service to maintain a safe and effective service for our patients.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;A full driving licence is essential for this post.&lt;br /&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interviews are likely to take place virtually.&lt;br /&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;To discuss the role further please contact Jane Heilds or Nikki McNicholas Telephone 0113 206 7389.&lt;br /&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;&lt;em&gt;Internal care support staff&lt;/em&gt;&lt;/strong&gt;&lt;em&gt; currently employed by Leeds Teaching Hospitals NHS Trust, who wish to work in a different area, at the same AfC Band, job description and person specification should contact their Matron and employ the internal transfer process.&lt;br /&gt;&lt;/em&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;span&gt;&lt;span&gt;&lt;em&gt;We may share information, as appropriate, that you have provided in your application form with external partners or other organisations help to facilitate your recruitment process. &lt;/em&gt;&lt;br /&gt;&lt;/span&gt;&lt;/span&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122273.jpg", "name": "Nursing Cohort", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122273"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St James University Hospital", "postalCode": "LS9 7TF"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8073", "longitude": "-1.51908"}}, "title": "Community Phlebotomy Supervisor (XR03)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247649", "validThrough": "2020-11-12T23:59:59+0000"}