{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 pa (based on full time hours)"}}, "datePosted": "2020-10-02T13:30:22+0100", "description": "&lt;p&gt;&lt;strong&gt;Hours: &lt;/strong&gt;37.5 hours per week&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location: &lt;/strong&gt;Havant Health Centre&lt;/p&gt;\n&lt;h1&gt;Calling all Mental Health Nurses!&lt;/h1&gt;\n&lt;h1&gt;Are you an enthusiastic, compassionate and committed to service delivery and improvement?&lt;/h1&gt;\n&lt;h1&gt;Do you want to be part of a friendly and supportive team, who will welcome you in to their family from day one?&lt;/h1&gt;\n&lt;h1&gt;Do you have the ability to work under pressure whilst providing excellent communication skills?&lt;/h1&gt;\n&lt;h2&gt;If you answered &#39;Yes&#39; to the above and have what it takes then we may have the perfect position for you!&lt;/h2&gt;\n&lt;p&gt;Havant &amp; Waterlooville OPMH CMHT are a forward thinking team that encourages both staff development as well as being person and patient centred. We are a dynamic team with a wealth of experience and backgrounds, who cover a big area of South East Hampshire up to the boarders of west Sussex and Portsmouth city. We are well connected for travel with Havant Train station just a five minute walk away and the M27, A3 and other main roads all close by.&lt;/p&gt;\n&lt;p&gt;Due to recent changes in the team we are currently looking for motivated and enthusiastic practitioners to join our local Older Peoples Community Mental Health Team. The post involves working within the wider team covering Hayling, Havant and Waterlooville providing skilled assessment &amp; treatment interventions to older people with mental health problems. &lt;/p&gt;\n&lt;p&gt;To be a successful applicant you will need to be a registered mental health nurse, preferably with some experience in the care of older people with mental health problems.  You must have a genuine interest in working with older people and be able to demonstrate a real commitment to providing high quality and compassionate care to patients and their families.  You will play an important role in the team as we aspire to provide excellent patient care and develop our services in line with national and local drivers. &lt;/p&gt;\n&lt;p&gt;You will be expected to work within the wider multidisciplinary team providing and implementing programmes of care and evaluating and communicating effectively with other parts of the service. You will be required to support both Health Care Support Workers and Students within the work place. &lt;strong&gt;A full driving license is required. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;In return for your flexibility and commitment we can offer excellent training and personal development support.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you would like to discuss this further then please call Arron Shelton on 02392 344616 or email Arron.Shelton@southernhealth.nhs.uk&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;Happy to talk flexible working&lt;/strong&gt;-&lt;strong&gt; all requests for flexible and part time working will be considered.&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Follow us on Facebook and on Twitter:&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;facebook.com/SouthernHealthNHS&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;@&lt;/strong&gt;Southern_NHSFT&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Due to the anticipated high number of applications for this post we reserve the right to close the vacancy before the closing date&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Southern Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120646"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Havant", "postalCode": "PO9 2AZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8511", "longitude": "-.978004"}}, "title": "Community Psychiatric Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916210717", "validThrough": "2020-11-13T23:59:59+0000"}