{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "53668", "minValue": "47753", "unitText": "YEAR", "value": "£47,753 - £53,668 pa inc"}}, "datePosted": "2020-10-26T08:17:21+0000", "description": "&lt;h1&gt;Clinical/Forensic Psychologist, Clinial Lead, Band 8a&lt;/h1&gt;\n&lt;p&gt;LONDON PATHWAY PARTNERSHIP (LPP) – PERSONALITY DISORDER SERVICE&lt;/p&gt;\n&lt;p&gt;HMP Standford Hill Pathways Enhanced Resettlement Service (PERS)&lt;/p&gt;\n&lt;p&gt;1.0 wte/37.50 hours per week&lt;/p&gt;\n&lt;p&gt;London Pathways Partnership (LPP) is a consortium of five NHS Trusts delivering services in London and across three prisons as part of the national Offender Personality Disorder (OPD) Pathway programme. The HMP Swaleside Pathways Services are for ‘high risk high harm’ personality disordered offenders from London and the South of the country. The service involves assessment, formulation, psychological and psycho-social interventions, the development of an ‘enabling’ and psychologically-informed environment, and active service user involvement as well as training, case consultation and pathway management. The service operates a psychologically informed planned environment (PIPE) for men participating in therapeutic activities as well as a separate therapies service, an outreach service for behaviourally unsettled men (Swaleside Outreach Service) and the Pathways Enhanced Resettlement Service (PERS) for men in open (D category) conditions.&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for a specialist clinical or forensic psychologist with an interest in personality disorder and/or complex care, ideally with post qualification experience to take on the Clinical Lead position within the HMP Standford Hill PERS service (0.6wte). PERS support men on the OPD Pathway to manage their transition into and out of open D Category conditions. The service employs a model of ‘joint operations’ and the postholder will work closely with prison colleagues to deliver an integrated service and to develop appropriate pathways through custody and into the community for service users. The post provides numerous opportunities to develop consultation, liaison, research and training skills and clinical expertise and experience in the delivery of therapeutic interventions with this complex service user group.&lt;/p&gt;\n&lt;p&gt;The post holder will also work into the Treatment Service at HMP Swaleside (0.4wte) as a senior clinician delivering therapies to men within the OPD Pathway Services at Swaleside. Training and accredited supervision will be provided, as required, in the core therapies delivered by the service. The post holder will also work closely with the wider forensic psychological therapies team at the Bracton Centre, and will also have additional opportunities to work within the Pathways Services at HMP Swaleside. The post will be hosted by Oxleas NHS Foundation Trust, which has a national reputation for excellence, and offers wide-ranging opportunities for mental health practitioners within its teams.&lt;/p&gt;\n&lt;p&gt;For further information please contact Dr Jake Shaw, Associate Director/Consultant Forensic Psychologist on jake.shaw@nhs.net, or 01795804181&lt;/p&gt;\n&lt;p&gt;Oxleas NHS Foundation Trust operates a Probationary Period, further details are available on request.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120829.png", "name": "Oxleas NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120829"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "LPP Pathways Service, HMP Standford Hill &amp; HMP Swaleside, Eastchurch", "postalCode": "ME12 4AX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3938", "longitude": ".855035"}}, "title": "Clinical/Forensic Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241723", "validThrough": "2020-11-09T23:59:59+0000"}