{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 pro rata"}}, "datePosted": "2020-11-03T15:01:11+0000", "description": "&lt;p&gt;&lt;span&gt;Cove Ward is an established 15 bedded acute mental health unit with a multi-disciplinary team providing reablement and recovery for patients in Cornwall. It provides an innovative opportunity to support our patients to receive high quality care and remain close to home.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are currently seeking a Band 5 occupational therapist who is passionate about working with people admitted to the ward to support their transition to home, helping them develop satisfying roles and routines in their local community.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Cove Ward will provide care, treatment and support to any person experiencing mental illness and need admission. Some people may also present with physical and cognitive impairments. This post-holder will provide specialist occupational therapy assessments and interventions to maintain and restore patients’ roles, routines and skills that are disrupted by their illness. They will contribute a specific occupational therapy perspective to planning and facilitating discharge; working with the local Home Treatment Team, community mental health services and other organisations to facilitate discharge and prevent future admissions is a key part of the role. Candidates will need to be able to demonstrate how they would provide an innovative, creative and evidenced based service model within this environment.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You could be part of this multi-disciplinary team, working to bring innovative, quality solutions to support people with mental health conditions. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Additionally, the in-patient occupational therapy service has a monthly best practice meeting which supports service innovation and evidence-based practice.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;There will be regular supervision with the professional lead occupational therapist and opportunities for CPD.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Whether you’re already living in Cornwall or looking to relocate, you could take the next step in your career and benefit from living in a beautiful part of the country whilst making a real difference to patients. We are proud of our innovative and patient safety focused culture.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;For further details / informal visits contact:&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Joby Plant – Cove Ward Manager by emailing joby.plant@nhs.net or 01209 318 988.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameJoby PlantJob titleCove Ward ManagerEmail addressjoby.plant@nhs.netTelephone number01209 318 988&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120947.png", "name": "Cornwall Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120947"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Cove Ward, Longreach House, Redruth", "postalCode": "TR15 3EU"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.2294", "longitude": "-5.24442"}}, "title": "Occupational Therapist - Band 5", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254469", "validThrough": "2020-11-17T23:59:59+0000"}