{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "25615", "minValue": "24210", "unitText": "YEAR", "value": "£24,210 - £25,615 p.a inc HCA"}}, "datePosted": "2020-11-04T16:46:14+0000", "description": "&lt;p&gt;St Thomas’ Emergency Department is situated on the south bank of the Thames in central London. It serves a large and diverse population, average yearly attendances being 140,000. The department is a level 2 trauma unit and incorporates an Urgent Care Centre. The department has just completed a £20 million rebuild project. This has created one large emergency floor including the ED, an Acute Admission Ward, a 18 bedded Clinical Decision Unit, a separate Paediatric ED, a Psychiatric Liaison Team and a dedicated Development Team.&lt;/p&gt;\n&lt;p&gt;The department received an Outstanding Rating by the CQC in 2016.&lt;/p&gt;\n&lt;p&gt;This is an excellent opportunity for you to join a dynamic and established team in a full time position of 37.5 hours.&lt;/p&gt;\n&lt;p&gt;Your main duties will involve carrying out assigned tasks as part of clinical team in support of registered nurses and to undertake some aspects of care provision without direct supervision. Ensuring the safety and well being of services users, and always working in a manner that promotes dignity and person centered care principles which embodied the Trust values and behaviour.&lt;/p&gt;\n&lt;p&gt;Under the direction of trained staff maintain and develop own skills including Monitoring and recording of vital signs to include blood pressure using NEWS2 -Recording of ECG. Bladder scanner, Simple, aseptic dressings including removal of cannulas. Monitoring and recording of blood glucose levels. Cannulations and Venepuncture.&lt;/p&gt;\n&lt;p&gt;If you have a keen interest in working in a busy and challenging environment and want to enhance the reputation of our Unit, then this is the job for you.&lt;/p&gt;\n&lt;p&gt;In return we will offer you a progressive working environment and opportunities for development.&lt;/p&gt;\n&lt;p&gt;Closing date: 17th November 2020&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;Interview date: 23rd November 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDebbie de LabauveJob titleMatronEmail addressdebbie.delabauve@gstt.nhs.ukTelephone numberext 88486Additional contact information&lt;/p&gt;\n&lt;p&gt;Debbie de Labauve - ED Matron (debbie.delabauve@gstt.nhs.uk) or Chris Ford - ED Matron(Christopher.ford@gstt.nhs.uk)&lt;/p&gt;\n&lt;p&gt;02071887188 ext 88486&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121066.jpg", "name": "Guy's and St. Thomas' NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121066"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St Thomas, London", "postalCode": "SE1 7EH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4979", "longitude": "-.119645"}}, "title": "Senior Nursing Assistant - Emergency Department", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256716", "validThrough": "2020-11-17T23:59:59+0000"}