{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "43772", "minValue": "37570", "unitText": "YEAR", "value": "£37,570-£43,772pa"}}, "datePosted": "2020-11-02T14:16:44+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for a Senior Clinical Nurse Specialist with an independent prescribing qualification (V300) to join our new service in Milton Keynes working in partnership with Addaction, one of the leading drug prevention and treatment agencies in the UK.&lt;br /&gt;&lt;br /&gt;This is a unique opportunity to be part of the development and delivery of an integrated substance misuse service combining the elements of education, prevention, treatment and recovery within substance misuse treatment pathways. This includes those entering the service via the criminal justice system.&lt;br /&gt;&lt;br /&gt;The post holder will also act as a senior staff member in the multi-disciplinary team taking responsibility for the delivery of high standards of nursing care to clients assessed according to their clinical needs and in accordance with up-to-date evidence-based practice and relevant Trust clinical protocol and policies.&lt;br /&gt;&lt;br /&gt;The post holder will ensure that the delivery of the care and management of this client group is undertaken in compliance with the Care Quality Commission Standards for quality and safety.&lt;/p&gt;\n&lt;p&gt;You will be a highly experienced and qualified nurse with previous experience of working with service users with a range of drug and alcohol issues.&lt;/p&gt;\n&lt;p&gt;You will possess the relevant skills and attributes to facilitate service user engagement in the service. You must have a strong commitment to partnership working and building networks and be able to work sensitively within a culturally diverse environment.&lt;br /&gt;&lt;br /&gt;You must be willing to work with individuals with common mental health problems and substance misuse problems. Many service users will also have additional complex mental and physical health needs.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;James Smith, Lead Nurse, CNWL Addictions&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central and North West London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120736"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Farthing Grove, Netherfield, Milton Keynes MK6 4JH, Milton Keynes", "postalCode": "MK6 4JH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.0226", "longitude": "-.733973"}}, "title": "Senior Clinical Nurse Specialist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252398", "validThrough": "2020-11-16T23:59:59+0000"}