{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "73664", "minValue": "63751", "unitText": "YEAR", "value": "£63,751 - £73,664"}}, "datePosted": "2020-10-16T11:30:55+0100", "description": "&lt;p&gt;&lt;strong&gt;&lt;span&gt;Consultant Paramedic&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Base Location:&lt;/span&gt;&lt;/strong&gt; Crawley Headquarters&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Salary:&lt;/span&gt;&lt;/strong&gt; Band 8c as per Agenda for Change&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Type of contract:&lt;/span&gt;&lt;/strong&gt; Permanent&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Hours per week:&lt;/span&gt;&lt;/strong&gt; 37.5 hours per week&lt;/p&gt;\n&lt;p&gt;Reflecting the utmost importance that we attach to the quality of care and experience that each patient receives, we are keen to implement the highest standards of urgent and emergency care across the South East Coast.&lt;/p&gt;\n&lt;p&gt;An exceptional opportunity has arisen for an experienced Consultant Paramedic to join the Senior Medical Directorate leadership team as the lead Consultant Paramedic for Clinical Education and Training. This role demonstrates the Trust commitment to providing good clinical educational leadership at the heart of how we operate. We have ambitious plans for the future as we seek to meet the growing demands for our service to provide the care our population deserve.&lt;/p&gt;\n&lt;p&gt;The role of the Consultant Paramedic, Clinical Education and Training is key in ensuring all our patients are given safe, high-quality, evidence-based, individualised care. We are looking for a Consultant Paramedic who is passionate, dynamic, highly driven, motivated and experienced to ensure the delivery of a comprehensive vision for the development of our Clinical Education Department and its associated staff. As an expert practitioner, you will promote clinical leadership to the teams and contribute to the delivery of patient care.&lt;/p&gt;\n&lt;p&gt;This role requires demonstrable experience working within education and developing clinical programmes that will ensure that our staff are able to deliver excellent patient care. You will need to demonstrate significant experience working across the education sector, both within pre hospital care and education institutions, with Health Education (England and/or the devolved nations), Higher Education and excellent knowledge of developing clinical courses that meet all our regulatory standards.&lt;/p&gt;\n&lt;p&gt;Working clinically, you will be a visible and skilled clinical leader who is able to inspire and develop clinical practice to drive up standards of care. We are open to new ideas and encourage innovation and creativity within this role.&lt;/p&gt;\n&lt;p&gt;By possessing excellent communication, interpersonal and problem-solving skills and the ability to constructively challenge, the post holder will enthuse, influence, enable and encourage others.&lt;/p&gt;\n&lt;p&gt;We are looking for a Consultant Paramedic who shares our values and ambitions. The ideal candidate will have an exemplary track record as a clinical leader and manager, with the proven ability to inspire, motivate and promote teamwork at all levels across the medical and non-medical workforce as the organisational lead for clinical education and training.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Closing date: &lt;/span&gt;&lt;/strong&gt;15th November 2020&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Assessment Location: &lt;/span&gt;&lt;/strong&gt;Crawley (Location TBC)&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Assessment date: &lt;/span&gt;&lt;/strong&gt;30th November 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Dr Fionna Moore, Executive Medical Director&lt;/p&gt;\n&lt;p&gt;fionna.moore@secamb.nhs.uk / 07826903669&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121186.jpg", "name": "South East Coast Ambulance Service NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121186"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Kent, Surrey, Sussex, Crawley", "postalCode": "RH10 9BG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.1327", "longitude": "-.168947"}}, "title": "Consultant Paramedic - Clinical Education &amp; Training", "url": "https://www.jobs.nhs.uk/xi/vacancy/916229899", "validThrough": "2020-11-15T23:59:59+0000"}