{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "20795", "minValue": "18813", "unitText": "YEAR", "value": "£18,813 to £20,795 per annum/pro rata"}}, "datePosted": "2020-10-27T11:46:18+0000", "description": "&lt;p&gt;Hospital Home Care Community Clinical Therapy Support Worker&lt;/p&gt;\n&lt;p&gt;Are you a dynamic, motivated, resilient individual with exceptional clinical skills?&lt;/p&gt;\n&lt;p&gt;Are you passionate about providing a high quality service?&lt;br /&gt;&lt;br /&gt;UHMB are looking for Community Clinical Therapy Support staff to help support patients to return home using the trusts supported discharge model and continue the patient’s rehabilitation pathway in the community. Our service also provides high quality outreach care at home for our patients whilst they are awaiting their permanent care provider to begin.&lt;br /&gt;&lt;br /&gt;You will work independently in the community to support patients who are medically optimised to return home from the hospital setting. You will support patients and their families with activities of daily living including personal care, meal preparation and medication support along with working with patients on their rehabilitation goals.&lt;/p&gt;\n&lt;p&gt;You will be supported by the Hospital Home Care Clinical Lead, Hospital Home Care Clinical Supervisor and Coordinator and other essential community support services including Occupational Therapists and District Nurses. This will enable the patient’ rehabilitation journey to continue in the community and for patient’s to be cared for in their own home.&lt;br /&gt;&lt;br /&gt;Duties will include but are not limited to:&lt;br /&gt;• Supporting patients with an exercise programme and therapy treatments following assessment by Occupational Therapist and/or Physiotherapist &lt;br /&gt;• Assisting patients to develop and maintain their daily living skills and independence as part of their rehabilitation goals.&lt;br /&gt;• Assessing the patient’s progress and reporting back to the Therapist Lead.&lt;br /&gt;• Assisting with personal care&lt;br /&gt;• Providing household services including meal preparation&lt;br /&gt;• Promptly reporting any changes which may affect the health or wellbeing of a patient and liaising with other care providers to meet the patient’s needs.&lt;/p&gt;\n&lt;p&gt;We are able to offer as part of this role:&lt;br /&gt;• Comprehensive training package&lt;br /&gt;• Reimbursement for recorded travel and mileage&lt;br /&gt;• Job satisfaction&lt;br /&gt;&lt;br /&gt;You will be required to travel to patients homes within rural locations – please note having your own transport/the ability to travel is an essential requirement to this role and you will require to have business on your vehicle insurance.&lt;br /&gt;&lt;br /&gt;Anyone newly appointed staff to this trust will be subject to the completion of a satisfactory 6 month probation period (this includes bank staff). This will give the new staff member an opportunity to become familiar with the role and working environment.&lt;br /&gt;&lt;br /&gt;Please note this post is fixed term until 31st March 2021&lt;/p&gt;\n&lt;p&gt;We have three established teams who cover cross bay with base locations at Furness General Hospital, Westmorland General Hospital and Royal Lancaster Infirmary and although we are looking to recruit to all sites, we are particularly keen to recruit to the South Lakes area Please indicate on your application your preferred base location. &lt;br /&gt;&lt;br /&gt;Hours of operation will be from 08:00-21:00, 7 days a week (this may be subject to future extension to incorporate night visits). We are able to offer a variety of contracted hours including 24 hr / 30 hr and 36 hr contracts. Please state clearly on your application the contracted hours you would prefer.&lt;br /&gt;&lt;br /&gt;Please also make it clear that you hold a UK driving license and are prepared to take out business insurance.&lt;br /&gt;&lt;br /&gt;If you think that this could suit you and you would like to discuss this further please get in touch.&lt;/p&gt;\n&lt;p&gt;Previous applicants need not apply.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDebra GreenJob titleHospital Home Care ManagerEmail addressdebra.green@mbht.nhs.ukTelephone number0796823220Additional contact information&lt;/p&gt;\n&lt;p&gt;Debra Green&lt;br /&gt;Hospital Home Care Manager&lt;br /&gt;Mobile: 07968623220&lt;br /&gt;&lt;br /&gt;OR &lt;br /&gt;&lt;br /&gt;Catherine Woods &lt;br /&gt;Hospital Home Care Clinical Lead&lt;br /&gt;Tel: 07971066555&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University Hospitals of Morecambe Bay NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121712"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Cross Bay, Cross bay including FGH / RLI and South Lakes area", "postalCode": "LA9 7RG"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.3067", "longitude": "-2.73255"}}, "title": "Community Clinical Therapy Support Worker - Hospital Home Care", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244292", "validThrough": "2020-11-16T23:59:59+0000"}