{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 £24,907 to £30,615"}}, "datePosted": "2020-10-08T11:16:17+0100", "description": "&lt;p&gt;Do you want to work in a supportive team which puts the patient at the heart of everything we do?&lt;/p&gt;\n&lt;p&gt;Are you committed to improving patient care through knowledge, skills, compassion and empathy?&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Then Ward 16 could be the ward for you&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are a modern, forward thinking 24 bedded ward, caring for adults with complex medical needs, our patients may require robust discharge planning to ensure they are discharged into a caring and safe environment.&lt;/p&gt;\n&lt;p&gt;We are a developing and dynamic ward that can offer extensive learning opportunities in medicine for older people nursing. Predominantly the ward cares for elderly, vulnerable adults where we offer a safe, secure and dementia friendly environment.&lt;/p&gt;\n&lt;p&gt;Alongside our medical patients we care for dermatology patients of all ages with conditions that require hospital inpatient treatment and opthamology patients that require inpatient treatments out of hours.&lt;/p&gt;\n&lt;p&gt;We also have a 3 bedded overnight stay area for Endoscopy patients, which enables us to develop further skills to add to your portfolio.&lt;/p&gt;\n&lt;p&gt;The ward is supported by a strong medical team, as well as an experienced and well established ward team. We have our own ward physiotherapist, occupational therapist, complex case manager and pharmacist to facilitate seamless well led discharges.&lt;/p&gt;\n&lt;p&gt;You role will include providing exceptional safe, personal and effective care for patients, accurate medication management, liaising with multi-disciplinary team members with regard to discharge planning and working closely with the patient and their family to assist them in the rehabilitation and discharge process.&lt;/p&gt;\n&lt;p&gt;As a registered nurse you will provide the supervision and development of nursing students, trainee nurse associates and health care assistants carrying out direct patient care and maintaining a safe environment for patients and staff.&lt;/p&gt;\n&lt;p&gt;The candidate should have an interest in medicine for older people nursing and be a level 1 Registered General Nurse who can show patience and understanding when working with vulnerable adults. The candidate should be able to demonstrate being a team worker with good communication skills, conscientious, honest, caring and passionate about their nursing career.&lt;/p&gt;\n&lt;p&gt;In return we can offer a great learning environment for newly qualified and experienced members of staff with the opportunity to develop within your role through preceptorship and coaching.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameStephanie RobertsJob titleWard managerEmail addressstephanie.roberts@elht.nhs.ukTelephone number01282 803560&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "East Lancashire Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120742"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Burnley", "postalCode": "BB10 2PQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8098", "longitude": "-2.22817"}}, "title": "Staff Nurse - Ward 16", "url": "https://www.jobs.nhs.uk/xi/vacancy/916218005", "validThrough": "2020-11-09T23:59:59+0000"}