{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 pa (based on full time hours)"}}, "datePosted": "2020-11-02T10:45:24+0000", "description": "&lt;p&gt;&lt;strong&gt;*********£2,500 ‘Golden Hello’ Payment**********&lt;/strong&gt;&lt;strong&gt;&lt;br /&gt;&lt;/strong&gt;&lt;strong&gt;Awarded with this vacancy!&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Apply now and if you are successfully recruited you will receive £2,500- does not apply to current Hampshire and Isle of Wight NHS Staff&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Are you passionate about Older People’s Mental Health? If so why not come and join our Friendly and Supportive team at Gosport War Memorial Hospital?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for Mental Health Nurses to come and join our teams on Poppy and Rose Wards. Poppy ward is a dementia ward whilst Rose ward focuses on functional Mental Health within a frailty model.&lt;/p&gt;\n&lt;p&gt;It’s an exciting time to join us as we expand our nursing team, you will have a role to play as we aspire to provide excellent patient care. We are looking for people who are able to demonstrate a passion for the care of patients and their families. If you have an interest in caring for patients with functional mental health needs or dementia then this is the role for you!&lt;/p&gt;\n&lt;p&gt;In return for your hard work we are keen to help support and develop your career. You will rotate across both our wards so that you have the opportunity to gain experience within each specialty. As such you will have the opportunity to develop and enhance your skills across either both areas and we will support staff to develop both your Mental Health and Physical health skills. If you are a newly qualified member of staff then we also have a comprehensive Preceptorship to ensure that you have the support that you need.&lt;/p&gt;\n&lt;p&gt;Staff wellbeing is also incredibly important to us and ensuring you have a good work and home life balance is a priority. We do ask staff to work flexibly across day (7am-3pm or 1pm-9pm) and night (8:45pm-07:15am) shifts. However, if you require flexible working do get in touch- all requests for flexible and part time working will be considered.&lt;/p&gt;\n&lt;p&gt;All staff will be asked to work flexibly across a range of day and night shifts providing care to older people with functional mental health needs or with dementia.&lt;/p&gt;\n&lt;p&gt;If you would like to arrange a tour of our unit and would like the opportunity to meet our staff please contact Jan Wickens on 023 82603253 or email: jan.wickens@southernhealth.nhs.uk,&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Follow us on Facebook and on Twitter:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;facebook.com/SouthernHealthNHS&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;@Southern_NHSFT&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Southern Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120646"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Gosport", "postalCode": "PO12 3PW"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7931", "longitude": "-1.14807"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251637", "validThrough": "2020-11-30T23:59:59+0000"}