{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907-£30,615"}}, "datePosted": "2020-10-27T10:16:17+0000", "description": "&lt;p&gt;As part of an exciting new collaboration with Sussex Partnership NHS Foundation Trust and YMCA Downslink, we are looking to recruit two Psychological Wellbeing Practitioners (PWPs) for our adult Improving Access to Psychological Therapies (IAPT) Long Term Conditions (LTC) pathway in Brighton and Hove.&lt;/p&gt;\n&lt;p&gt;We have an excellent track record in IAPT service delivery, having delivered the nationally-recognised and high performing Time to Talk and Time to Talk Health services in West Sussex.&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity to join our service at a time of significant growth and expansion, based on the NHS Long Term Plan (2019), which sets out an ambitious path to transform the nation’s physical and mental health over the next decade, representing vital progress towards parity of esteem between mental and physical health.&lt;/p&gt;\n&lt;p&gt;You’ll be part of an exciting multidisciplinary team consisting of PWPs, CBT Therapists, Counsellors, Administrators, Managers, Employment Advisors and colleagues in physical healthcare teams. You’ll be supported by an experienced Senior PWP, with LTC training provided if needed, alongside ongoing professional support and Continuing Professional Development (CPD) events, enabling you to deliver the best service and develop your career.&lt;/p&gt;\n&lt;p&gt;In response to the recent challenge of COVID-19 we’ve quickly adapted our service to enable the continued provision of step 2 psychological therapies, providing the team with laptops and mobile phones, enabling effective home working. As the situation evolves we plan to move to a blended model, keeping the innovations that have worked well. We envisage staff working one or two days a week from home while being willing and able to travel throughout Brighton and Hove as required, as we need to have a high level of visibility as well as engagement with physical health teams. We’re commissioned to provide services Monday-Friday 8am to 8pm and all staff are required to contribute towards this.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDebbie BarnettJob titleClinical LeadEmail addresssc-tr.ltcreferrals@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Sussex Community NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120877"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Brighton General Hospital, Brighton", "postalCode": "BN2 3EW"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8309", "longitude": "-.114138"}}, "title": "Psychological Wellbeing Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243976", "validThrough": "2020-11-08T23:59:59+0000"}