{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44780", "minValue": "37638", "unitText": "YEAR", "value": "£37,638 - £44,780 pa inc HCAS"}}, "datePosted": "2020-10-30T11:00:49+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;span&gt;Band 6 Clinical Research Nurse CRF &lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for 2 full time Clinical Research Nurses to join our friendly Team.&lt;/p&gt;\n&lt;p&gt;The Clinical Research Facility (CRF) nurses play a key role in the delivery of clinical research at St. George’s Hospital, developing and creating robust systems and processes to enable clinical research to run smoothly, efficiently and whilst ensuring the highest of standards are maintained.&lt;/p&gt;\n&lt;p&gt;The post holders will be key members of the CRF clinical research delivery team and provide research and clinical care for participants taking part in research studies within a range of therapeutic areas including diabetes and musculoskeletal. Previous experience in these specialities will be of value to the applicant. The post holders will support a portfolio of studies, with the support of senior staff.&lt;/p&gt;\n&lt;p&gt;This role involves liaison with Principal Investigators and other members of the multidisciplinary team to provide high quality data collection and clinical care, with a commitment to participant safety and welfare. The post holders will be expected to advocate for patients and empower them to make informed choices concerning their involvement in clinical research studies by providing advice and information. The post holders will work with a high level of autonomy, taking delegated responsibility from clinicians for clinical decision making, and will work closely with investigators and multidisciplinary staff.&lt;/p&gt;\n&lt;p&gt;We are very keen to meet potential applicants and would be very happy to facilitate informal visits or answer enquiries regarding the post.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameMark MenciasJob titleSenior Clinical Research NurseEmail addressmark.mencias0@stgeorges.nhs.ukTelephone number020 8725 1992Additional contact information&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "St George's University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121185"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St George’s University Hospitals NHS Foundation Trust, Tooting", "postalCode": "SW17 0QT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4267", "longitude": "-.175721"}}, "title": "Clinical Research Nurses  - CRF", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249846", "validThrough": "2020-11-13T23:59:59+0000"}