{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "36738", "minValue": "29888", "unitText": "YEAR", "value": "£29,888 - £36,738 p.a inc HCA"}}, "datePosted": "2020-11-02T15:32:21+0000", "description": "&lt;p&gt;An exciting and appealing opportunity has arisen within the Gynaecology Department at Guy&#39;s and St Thomas&#39; NHS Foundation Trust for an Assistant Service Manager. The role is ideal for candidates that are looking for a challenge and an opportunity to make a positive and impactful contribution to the service. Candidates who are interested must have a proactive approach, excellent organisation and time management skills, written and verbal communication skills, and be a team player with a collaborative approach and a can-do attitude at all times.&lt;/p&gt;\n&lt;p&gt;The post holder will be responsible for the day-to-day running of the outpatient service including the line management of 9 administrative staff. This role will involve the line management of staff, overseeing daily clinics ensuring maximum utilisation of clinics, ensuring patients have a positive experience when attending the outpatients department, validation of the PTL, rota management and other administrative duties. In addition, the post holder must be willing to undertake any audits/projects to assist the team when necessary, in conjunction with the Service Manager.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NamePratiksha PatelJob titleService ManagerEmail addressPratiksha.patel@gstt.nhs.ukTelephone number020 7188 3681Additional contact information&lt;/p&gt;\n&lt;p&gt;Informal conversations/visits can be arranged after shortlisting has been completed by contacting Pratiksha Patel, Service Manager for Gynaecology via email Pratiksha.patel@gstt.nhs.uk.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121066.jpg", "name": "Guy's and St. Thomas' NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121066"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Guy&#39;s Hospital, Lodon", "postalCode": "SE1 9RT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5046", "longitude": "-.088964"}}, "title": "Assistant Service Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252640", "validThrough": "2020-11-06T23:59:59+0000"}