{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615"}}, "datePosted": "2020-10-19T15:53:19+0100", "description": "&lt;p&gt;&lt;strong&gt;Shropshire Care Group&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Occupational Therapist&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Community Interventions Pathway (West Shropshire)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Band 5&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;37.5 hrs per week&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Permanent&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;An exciting opportunity has arisen for a band 5 occupational therapist to work within the &lt;strong&gt;Community Interventions Pathway&lt;/strong&gt; covering the west of Shropshire.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The post will be based at Severnfields Health Village in Shrewsbury but you will be expected to work across the West of the County as needs arise (Shrewsbury, Ludlow and Oswestry). &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Community Interventions Pathway is one of a number of clinical pathways within community mental health services which, in addition to meeting service user needs, allows development of skills within the specialism.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;What we are looking for&lt;/strong&gt;: &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;We are looking to recruit a forward thinking and dynamic Occupational Therapist who is recovery-focused and has an interest in supporting patients experiencing a mental illness. Successful applicants will be able to function autonomously and in multidisciplinary teams. There will be an expectation that the post holder will work flexibly, possess excellent communication and interpersonal skills and effective clinical reasoning.&lt;/p&gt;\n&lt;p&gt;The post will involve a responsibility for your own caseload of varying complexity where there will be balance between generic and profession specific work. There is also opportunity to take part in co-facilitating group work as one of the interventions offered within the pathway. The environment can be fast paced and challenging, however, highly rewarding. Your role will involve working with other agencies, families, carers and local communities. Experience of working within a community mental health setting is desirable.&lt;/p&gt;\n&lt;p&gt;The post-holder will be familiar with occupational therapy models of practice, including the Model of Human Occupation, and will make use of a range of standardised assessments.&lt;/p&gt;\n&lt;p&gt;Additionally, applicants should be willing to undertake further training to meet the needs of the client group. A commitment to continued professional development is essential.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What we can offer you:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Preceptorship&lt;/li&gt;\n&lt;li&gt;Regular supervision from within the leadership structure of the team&lt;/li&gt;\n&lt;li&gt;Clear and robust AHP governance structures&lt;/li&gt;\n&lt;li&gt;Self-directed professional development with in - house and external training&lt;/li&gt;\n&lt;li&gt;Regular specialist meetings&lt;/li&gt;\n&lt;li&gt;Promote innovations locally and nationally.&lt;/li&gt;\n&lt;li&gt;Evidence base, outcome measures, audit.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The usual hours of work will be Monday to Friday 9am - 5pm but you will be expected to be flexible within your working approach and delivery.&lt;/p&gt;\n&lt;p&gt;A valid UK driving license plus the use of your own car for business purposes is essential due to the large rural nature of our catchment area; for qualifying staff the Trust has a lease car scheme in place.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If you would like any further information, or wish to arrange an informal visit, please contact Nicola Faulkner, Pathway Operational Lead / Occupational Therapist – Tel 0300 303 3426&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Midlands Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121040"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Shrewsbury", "postalCode": "SY1 4RQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.7275", "longitude": "-2.71977"}}, "title": "Band 5 Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916233010", "validThrough": "2020-11-16T23:59:59+0000"}