{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "per annum"}}, "datePosted": "2020-11-04T17:15:48+0000", "description": "&lt;p&gt;&lt;em&gt;A unique and exciting opportunity has arisen for skilled and motivated Mental Health Nurses to be part of our new Enhanced Primary Care Team in Thurrock (EPCT). You will be at the forefront of establishing this innovative development in Primary Care.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;As a highly competent and proficient practitioner, you will have the ability to work in collaboration with a Senior Mental Health Nurse and you would have the ability to provide evidence based psychological and non-psychological treatments for common mental health disorders.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Proactive in your desire to work collaboratively, you will be based in the EPCT line managed by a Team Manager within the Primary Care Mental Health Services. The team offers a range of interventions from highly skilled professionals such as Advanced Nurse Practitioners, Advanced Clinical Pharmacists, Advanced Physiotherapists, Physician associates and Paramedics. Operationally led by two GP’s, the Individual will work in close partnership with other Professionals within the local Mental Health services such as IAPT, CMHTs and Recovery Service colleagues.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;You will work with service users and carers, close to their home, to deliver highly accessible and responsive interventions via flexible referral routes. The key principles of the team are to offer interventions within Primary Care to promote a truly integrated, holistic approach to care.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;With a clear focus upon prevention, early detection and intervention, you will be passionate about promoting self-management, through empowerment and partnership working with service users, embracing the person centred approach to recovery. The interventions you offer will be outcome focussed and time limited, with the overall aim of recovery and self-management.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt; Using sound clinical judgement in the delivery of evidence based treatments; you will promote better management of serious mental health conditions as well as the management of common mental health disorders. Excellent skills of assessment and knowledge of local services is essential to this role as you will be the gate keeper and guardian for referral to secondary services and also act as interim support for people stepping down back to Primary Care&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for motivated staff who share our Trust values of &lt;strong&gt;Positive, Welcoming, Respectful, Involving, Kind and Accountable. In return EPUT can offer you a range of benefits including;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Salary Sacrifice schemes including Childcare Vouchers, lease cars and Cycle to Work&lt;/li&gt;\n&lt;li&gt;Season Ticket Loans&lt;/li&gt;\n&lt;li&gt;Participation in the Working Longer Review supporting staff to work longer&lt;/li&gt;\n&lt;li&gt;NHS discounts for staff&lt;/li&gt;\n&lt;li&gt;Weekly health &amp; wellbeing articles&lt;/li&gt;\n&lt;li&gt;Equality and Diversity Sub-Groups where staff can raise issues relating to equality at work&lt;/li&gt;\n&lt;li&gt;Equality Champions who are there to support other staff requiring support at work&lt;/li&gt;\n&lt;li&gt;Occupational Health and Counselling providers which includes 24 hour counselling support line for staff and access to a wide range of support and advice about a range of issues including finance and debt, consumer rights, housing, welfare and family rights and domestic violence&lt;/li&gt;\n&lt;li&gt;Active members of a range of national bodies which support health and wellbeing of the workforce (Age UK, Stonewall, Disability Two ticks, Mindful Employer)&lt;/li&gt;\n&lt;li&gt;An active Staff Side Body to represent staff issues and a range of recognised staff/professional unions.&lt;/li&gt;\n&lt;li&gt;Successful achievement of the National IIP Health and Wellbeing Award&lt;/li&gt;\n&lt;li&gt;Excellent Training facilities and opportunities, working closely with a number of Universities to support staffs professional development&lt;/li&gt;\n&lt;li&gt;Feature in the top 100 employers index for HSJ&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameMatt AuckburallyJob titleService ManagerEmail addressmamade.auckburally@nhs.netTelephone number01702 538289&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120994.jpg", "name": "Essex Partnership University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120994"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Grays Hall, Grays", "postalCode": "RM17 5TT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4813", "longitude": ".330414"}}, "title": "MENTAL HEALTH PRIMARY CARE NURSE", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256794", "validThrough": "2020-11-25T23:59:59+0000"}