{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "43857", "minValue": "28593", "unitText": "YEAR", "value": "£17.01 - £26.09 Per hour"}}, "datePosted": "2020-10-30T14:16:42+0000", "description": "&lt;p&gt;Registered Bank Staff Nurse, Trust wide, Band 5,&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;So, you’re eager to learn more about working as a Bank Nurse at North Bristol NHS Trust. Here are some of the reasons we’re unique…&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;We are a centre of excellence for health care in the South West in a number of fields as well as being one of the largest hospital trusts in the UK&lt;/li&gt;\n&lt;li&gt;NBT is a Major Trauma centre and regional specialist for Neurosciences, Renal, Burns and Plastics, Orthopaedics and Urology.&lt;/li&gt;\n&lt;li&gt;Our values mean we are passionate about great care at North Bristol Trust and our patients know our primary focus is to provide ‘Exceptional Healthcare, Personally Delivered’&lt;/li&gt;\n&lt;li&gt;State of the art facilities- you will be based within our award winning Brunel building, which has recently won Best Acute Hospital Development at the 2017 Building Better Healthcare Awards in London and Best Healthcare Design over 25,000sqm at the European Healthcare Awards&lt;/li&gt;\n&lt;li&gt;An excellent location - the Trust resides within one of the most vibrant cities in the UK, Bristol. Voted the best city to live in 2017, the city is famous for its year round festivals, award-winning cycle tracks, exceptional gastronomy, stunning cityscapes and awe-inspiring street art.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;But it’s not just our Trust which is exciting; our Trust Nursing bank is innovative, impressive and inclusive. Let us tell you a little more about it…&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;As an NBTextra nurse you can work flexibly to suit your individual circumstances.&lt;/li&gt;\n&lt;li&gt;Our NBTeXtra nurses are valued members of our team and have access to exceptional benefits; access to the NHS Pension scheme, free DBS and full training, induction and revalidation support. We also have competitive rates available for shifts Trust wide\n&lt;ul&gt;\n&lt;li&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;ul&gt;\n&lt;li&gt;£17.01* per hour – Week Days&lt;/li&gt;\n&lt;li&gt;£21.55* per hour - Nights and Saturdays&lt;/li&gt;\n&lt;li&gt;£26.09* per hour – Sundays and Bank Holidays&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;*All rates are inclusive of annual leave allowance&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;You will increase your skill set by working with multidisciplinary teams to deliver all aspects of patient care, and you’ll work with consultants, junior doctors, AHPS, You will receive paid orientation and induction (2 days on site induction (social distancing observed) and e-learning accessible from home).&lt;/li&gt;\n&lt;li&gt;All NBTextra nurses also receive free uniform.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Right, that’s enough about us… let’s focus on you. Do you…&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Hold RN (adult) registration with current NMC license to practice&lt;/li&gt;\n&lt;li&gt;Have recent acute hospital experience within the last 18-24 months&lt;/li&gt;\n&lt;li&gt;Have a drive to work hard, enthusiasm and the ability to commit to a 2 week induction programme if successful&lt;/li&gt;\n&lt;li&gt;Have Right to work in UK (with relevant Adaptation/ONP if applicable)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;So, are we right for each other? Here are your next steps…&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Submit your application via this advert&lt;/li&gt;\n&lt;li&gt;Follow us on social media to join in the conversation and gain an insight into (search @NBTNursing on Twitter, Facebook, Linkedin and Instagram)&lt;/li&gt;\n&lt;li&gt;Contact us to find out more: NBTeXtra@nbt.nhs.uk or 0117 414 6000&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Contact us to find out more: NBTeXtra@nbt.nhs.uk or 0117 414 6000&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120777.jpg", "name": "North Bristol NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120777"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Trustwide, Bristol", "postalCode": "BS10 5NB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4973", "longitude": "-2.59295"}}, "title": "Bank Staff Nurse - Band 5", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250517", "validThrough": "2020-12-07T23:59:59+0000"}