{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "38000", "minValue": "35000", "unitText": "YEAR", "value": "£35,000 - £38,000 per annum"}}, "datePosted": "2020-09-29T13:36:03+0100", "description": "&lt;p&gt;Are you a Registered Charge Nurse looking for a new opportunity to work in an organisation that will help to develop you to achieve your goals to become the best you can be? If so, join usat Potters Bar Clinic and change lives for the better.&lt;/p&gt;\n&lt;p&gt;As a Registered Charge Nurse, you will lead and co-ordinate the quality and management of nursing care for adults and adolescents with mental health conditions.&lt;/p&gt;\n&lt;p&gt;With previous experience in a similar setting from the NHS or private care, you will be responsible for the clinical environment and managing the clinical services throughout the wards and units.&lt;/p&gt;\n&lt;p&gt;Your career within Elysium will be enjoyable and rewarding as you develop specialist skills and make a real difference for some of the most vulnerable people in society. It’s a career that you can take pride in and enjoy. It’s what delivering great healthcare should feel like.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Your responsibilities&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Provide strong and robust leadership in the clinical environment&lt;/li&gt;\n&lt;li&gt;Monitor the performance and conduct of staff and to take corrective action when necessary.&lt;/li&gt;\n&lt;li&gt;Maintain and evidence standards of competence as defined by the NMC, to remain registered.&lt;/li&gt;\n&lt;li&gt;Promotes quality approaches making others aware of the impact of quality&lt;/li&gt;\n&lt;li&gt;Understands own role, its scope and how this may change and develop over time in developing a high-quality organisation&lt;/li&gt;\n&lt;li&gt;Reviews effectiveness of own team and helps and enables others to work as a team&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;To be successful in this role, you&#39;ll need:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;First level nurse with evidence of professional development, relevant skills and knowledge.&lt;/li&gt;\n&lt;li&gt;Awareness of the wider Healthcare economy and political environment.&lt;/li&gt;\n&lt;li&gt;Relevant experience in a similar environment.&lt;/li&gt;\n&lt;li&gt;Proven track record of leadership skills.&lt;/li&gt;\n&lt;li&gt;RMN/RNLD Qualification&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Where you will be working&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location&lt;/strong&gt;: 190 Barnet Road, Potters Bar, Hertfordshire, EN6 2SE&lt;/p&gt;\n&lt;p&gt;Join the team at Potters Bar Clinic providing care for young people and adults with acute mental health needs and personality disorders in an established 24-hour care environment. The CAMHS Tier 4 Low Secure services are for young people aged 13–18.&lt;/p&gt;\n&lt;p&gt;Potters Bar Clinic is located in a residential area, only one minute drive from the M25 and a short bus ride from Potters Bar Train Station – with a bus stop right outside, making it an easy commute for most.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;What you will get&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Annual salary of £35,000 - £38,000 per annum&lt;/li&gt;\n&lt;li&gt;The equivalent of 33 days annual leave – plus your birthday off!&lt;/li&gt;\n&lt;li&gt;Free meals and parking&lt;/li&gt;\n&lt;li&gt;Wellbeing support and activities&lt;/li&gt;\n&lt;li&gt;Career development and training&lt;/li&gt;\n&lt;li&gt;Pension contribution&lt;/li&gt;\n&lt;li&gt;Life Assurance&lt;/li&gt;\n&lt;li&gt;Enhanced Maternity Package&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;There is also a range of other benefits including retail discounts and special offers, car leasing without a credit check, holiday financing and much more.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About your next employer&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will be working for an established, stable and agile company with a unique approach to the delivery of care.&lt;/p&gt;\n&lt;p&gt;Each and every employee is valued and supported, as everyone has an important role to play in the success of Elysium. It is only with the dedication, passion and hard work from staff that excellent care programs that truly benefit the service users can be delivered.&lt;/p&gt;\n&lt;p&gt;With a network of over 70 services across England and Wales, providing four services including: Mental Health, Neurological, Learning Disabilities &amp; Autism, Children &amp; Education, there is opportunity for you to grow and move with Elysium.&lt;/p&gt;\n&lt;p&gt;Elysium Healthcare follows safer recruitment of staff for all appointments. It is a requirement that all staff understand it is each person’s individual responsibility and are committed to promoting and safeguarding the welfare of service users.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Elysium Healthcare", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133794"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Potters Bar, Hertfordshire", "postalCode": "EN6 2SE"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6861", "longitude": "-.178665"}}, "title": "Charge Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916204650", "validThrough": "2020-11-30T23:59:59+0000"}