{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "34000", "minValue": "34000", "unitText": "YEAR", "value": "Up to £34,000 Dependent on experience"}}, "datePosted": "2020-11-02T08:56:27+0000", "description": "&lt;p&gt;We’re currently looking for a qualified Cognitive Behavioural Therapist on our Eating Disorder Unit and to add to our friendly family - we are one of the Priory Groups largest hospitals and we pride ourselves on having the best teams.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt; ABOUT THE ROLE…&lt;br /&gt; You will join the Psychology department working on the Eating Disorders Units. Priory is the UK&#39;s largest independent provider of Eating Disorder Services. We have a national offering of both outpatient and specialist residential services and also offer day care provisions.&lt;br /&gt; The successful applicant will work with a multi-disciplinary therapies team, including Psychologists, Family Therapy and Assistant Psychologists, which is embedded within a wider multi-disciplinary team of clinical professionals. The care and treatment provided address both the physical consequences of the eating disorder, as well as the related underlying psychological and social factors. The basic aim of treatment is to help to restore a healthier eating pattern whilst providing psychological support to help with the feelings that emerge during this process. The applicant will be involved in delivering both group and individual evidenced based therapies (for example CBT and MANTRA).&lt;br /&gt; Suitable candidates will have interest in and knowledge of therapeutic approaches to eating disorders. Some previous experience with this client group is desirable, but not essential, and some additional training could be provided subject to the successful completion of a probationary period. The post holder will need to be able to form positive relationships with colleagues and be interested in working in teams.&lt;br /&gt; There are excellent CPD and training opportunities for employees within this service, and funded and accredited training opportunities will be available and agreed as part of the role (subject the completion of a probationary period). Attendance at national conferences and research interests are also encouraged.&lt;br /&gt; Working hours are 37.5 hours per week&lt;br /&gt; &lt;br /&gt; ABOUT THE HOSPITAL…&lt;br /&gt; Priory Hospital Cheadle Royal has 14 different wards and cares for 151 patients. Each ward has a dedicated Multi-Disciplinary Team which includes a Consultant Psychiatrist, Speciality Doctor, Ward Manager, Psychologist, Occupational Therapist and support services including RMN and experienced Healthcare Assistants. Our primary aim is to support and care for our patients providing a full clinical pathway for patients onsite.&lt;br /&gt; We operate a comprehensive inpatient mental health service comprising Acute, Psychiatric Intensive Care Services (PICU), Personality Disorder, Eating Disorders and Rehabilitation and Recovery.&lt;br /&gt; Acute We have 2 acute mental health units for both adult males and females. There is a 24 hour admission service to support local NHS services and PICU wards. The ethos of our acute wards is to provide support in a crisis and offer therapeutic engagement.&lt;br /&gt; &lt;br /&gt; PICU We have 3 adult PICU units that specialise in the treatment of patients who cannot be managed in acute settings, transfers from other PICU units and prisons. We have a service for female patients who have a severe mental illness and are in the acute phase of illness. This service excels in treating the most complex individuals with a person centred approach. We also have 2 PICU wards for adult male patients who have a severe mental illness, dual diagnoses and complex presentation.&lt;br /&gt; Eating Disorder Unit Our EDU consists of 2 wards and a day care service providing treatment for Anorexia Nervosa and Bulimia Nervosa. We are a principle provider to the NHS in the North of England, focussing on positive physical and psychological outcomes through full service provision offering intensive multidisciplinary assessment and treatment. This includes physical monitoring, management of re-feeding syndrome, weight restoration, symptom interruption, meal plan management, NG feeding, Individual/Group and family Psychological interventions.&lt;br /&gt; Rehab &amp; Recovery We have 2 services– an intense rehabilitation service which is suitable for males over 18 years old with psychosis and who have complex needs including treatment resistance, behaviours that challenge, multiple admissions and significant impairment of independent living skills. Our step-down service provides a graded hierarchy of independent living designed to facilitate a seamless transition to community living.&lt;br /&gt; Personality Disorder This is a locked rehabilitation unit that runs a comprehensive Dialectical Behaviour Therapy (DBT) programme for the treatment of female patients with Emotionally Unstable Personality Disorders (EUPD). Patients may also have a co-morbid mental disorder such as psychosis, substance misuse, eating disorders and complex PTSD.&lt;br /&gt; Bespoke Service The hospital also has a bespoke unit that has been designed specifically for one patient with complex needs. The unit runs based on a Positive Behavioural Support (PBS) model.&lt;br /&gt;&lt;br /&gt; ABOUT OUR BENEFITS…&lt;br /&gt; &lt;br /&gt; A career with Priory Cheadle Royal not only enables you to manage your own career pathway whilst paying a competitive salary, we also have a range of other benefits such as:&lt;br /&gt; &lt;br /&gt; • 25 days annual leave (plus 8 Bank holidays) increasing with length of service&lt;br /&gt; • Birthday leave&lt;br /&gt; • Free on site parking&lt;br /&gt; • Subsidised meals&lt;br /&gt; • Contributory pension scheme&lt;br /&gt; • Priory Perks discount portal&lt;br /&gt; • Long Service recognition&lt;br /&gt; • Dedicated career pathway&lt;br /&gt; • Enhanced sick pay and maternity pay after 1 years service&lt;br /&gt; • Wellbeing committee&lt;br /&gt; • Comprehensive Induction&lt;br /&gt; • CPD courses and support&lt;br /&gt; &lt;br /&gt; For further information, please contact Dr Rebecca Dunn, Head of Psychological Services, 0161-428-9511.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Priory Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133434"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Manchester", "postalCode": "SK8 3DG"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.375", "longitude": "-2.22149"}}, "title": "CBT Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251359", "validThrough": "2020-11-30T23:59:59+0000"}