{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 per annum"}}, "datePosted": "2020-11-05T12:16:54+0000", "description": "&lt;p&gt;This exciting full time Band 6 role supports the Baby Friendly Lead for Blackburn with Darwen to ensure optimal standards around early infant feeding and relationship building across the Borough and East Lancashire Hospitals Trust, particularly in health visiting and children&#39;s centre services. This is a unique opportunity to focus on the promotion, support and protection of breastfeeding, whilst ensuring the maintenance Baby Friendly Initiative (BFI) UK standards. As GOLD BFI accredited services we welcome progression and innovation to improve care and experiences.&lt;/p&gt;\n&lt;p&gt;We are looking for an enthusiastic midwife with fantastic communication skills and the ability to motivate and empower others. You will have a sound knowledge of the BFI standards and relevant experience. You will work collaboratively with all relevant partners across Pennine Lancashire and the Local Maternity System.&lt;/p&gt;\n&lt;p&gt;The role will include specialist clinical work, BFI standards implementation, progression and audit, teaching all grades of staff using our extensive curriculum and being involved in any related public health / Q.I. projects. Great organizational skills and the ability to work autonomously and also as a multi-team member are essential.&lt;/p&gt;\n&lt;p&gt;So if you are keen to meet local and national infant feeding targets, eager to promote best practice and service user experiences, have a desire to support informed choices, provide specialist infant feeding support, keen to teach and educate others and be involved in related projects, then this may be the post for you.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDonna ButlerJob titleBaby Friendly Lead Blackburn with DarwenEmail addressdonna.butler@elht.nhs.ukTelephone number07595099819&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "East Lancashire Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120742"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Across East Lancashire Sites, Across East Lancashire Sites", "postalCode": "BB10 2PQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8098", "longitude": "-2.22817"}}, "title": "Baby Friendly Specialist Midwife", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257635", "validThrough": "2020-11-19T23:59:59+0000"}