{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 Pro rata per annum"}}, "datePosted": "2020-10-23T08:17:07+0100", "description": "&lt;p&gt;South East DriveAbility offers a service which provides assessment and advice on driving, car adaption and car choice and is one of the services offered by Kent Community Health NHS Foundation Trust. An opportunity has arisen to recruit a 3 day a week (0.60 wte) Occupational Therapist to join our established team in the South East of England.&lt;/p&gt;\n&lt;p&gt;Working from East Sussex Outreach Centres you will be joining an innovative and nationally recognised service to undertake driving and passenger assessments, offering advice and recommendations to clients referred by the Driver Vehicle &amp; Licensing Agency, Motability, Rehabilitation Companies, Access to Work, Public Carriage Office, Health Professionals and self-referring clients. We offer opportunities to develop both clinical and professional skills to effectively manage the care of clients, in their being able to drive safely and maintain their independence within the community. Our service responds to the driving needs of clients of all ages, therefore you will be required to demonstrate effective interpersonal and communication skills. Applicants must be enthusiastic, motivated and be able to work autonomously, as well as part of a team.&lt;/p&gt;\n&lt;p&gt;The Trust will support personal development as well as study towards the Post Graduate Certificate in Outdoor Mobility and Driving Assessment (&lt;em&gt;subject to funding from the Department for Transport&lt;/em&gt;) for substantive post holders.&lt;/p&gt;\n&lt;p&gt;An induction course, mentorship support and supervision are also available from senior members of the team.&lt;/p&gt;\n&lt;p&gt;Interviews will be held on 30 November 2020&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Lynn Park&lt;/p&gt;\n&lt;p&gt;Job title Clinical Lead Occupational Therapist&lt;/p&gt;\n&lt;p&gt;Email addresslynnpark@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number 0300 0134 886&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120633.png", "name": "Kent Community Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120633"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "South East DriveAbility, First Floor, Aylesford Logistics Centre, Aylesford", "postalCode": "ME20 6XS"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3071", "longitude": ".450854"}}, "title": "Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916239673", "validThrough": "2020-11-15T23:59:59+0000"}