{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 pa"}}, "datePosted": "2020-10-13T18:16:10+0100", "description": "&lt;p&gt;An exciting opportunity has arisen for a Band 5 CPN to become a member of the multidisciplinary Community Mental Health Team working in the Louth area. with Older Adults.&lt;/p&gt;\n&lt;p&gt;The post holder will be self–motivated, enthusiastic and empathic to the needs of service users. You will be required to have excellent communication skills, be resourceful, and highly motivated.&lt;/p&gt;\n&lt;p&gt;The service model through which Older Adult assessment and treatment is delivered in the Community embraces new ways of working which provide interventions in the most appropriate environment, at the most relevant time, to contribute to recovery where possible.. The team provides an accessible, equitable and quality service, based on evidence-based practice for older people presenting with, complex mental health problems, Organic and Functional, requiring more frequent intervention and management and often with co-morbid physical problems.&lt;/p&gt;\n&lt;p&gt;The service embraces “living well with dementia”.&lt;/p&gt;\n&lt;p&gt;The post holder will be expected to be independently mobile, and be able to work flexibly to meet the needs of the service users; you will be provided with professional and clinical supervision from the Team Coordinator in the preceptorship process (if required); and have access to relevant training.&lt;/p&gt;\n&lt;p&gt;The applicant will have the RMN qualification, ideally experience of working with the Older Adult client group, and working in the community setting is desirable.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;For further details contact Chris Rooney or Jason Ingamells on 01507 608319 0r 01522707338 or &lt;/em&gt;&lt;em&gt;christopher.rooney@nhs.net&lt;/em&gt;&lt;em&gt; or &lt;/em&gt;&lt;em&gt;jason.ingamells1@nhs.net&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120663.jpg", "name": "Lincolnshire Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120663"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Windsor House, Louth", "postalCode": "LN11 0LF"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3766", "longitude": "-.007557"}}, "title": "Community Psychiatric Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916225262", "validThrough": "2020-11-09T23:59:59+0000"}