{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683"}}, "datePosted": "2020-11-04T18:08:43+0000", "description": "&lt;p&gt;&lt;strong&gt;West Hertfordshire Hospitals NHS Trust&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Associated University (UCL) NHS Provider Trust&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Fixed term Consultant Dermatologist 10PAs&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are seeking an enthusiastic Consultant Dermatologist to join our Dermatology Team. This is a fixed term post initially for 6 months.   The successful candidate will join an established team of 13  Consultants,1 Associate Specialist, Junior Staff and  Specialist Nurses providing outpatient and inpatient care. Services available include day case surgery, paediatric dermatology, phototherapy, photodynamic therapy, patch testing and iontophoresis. Specialist Joint Leg Ulcer, vulval and male genital dermatoses clinics are held and we have an outreach Plastic Surgery service from the Royal Free Hospital.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The post-holder will work with colleagues to support and develop Dermatology services for the local population. The Dermatology Centre at Watord is a dedicated facility with consulting rooms, phototherapy suite, two skin surgery theatres, day treatment area, secretarial and consultant offices. The trust also has dermatology services at Hemel Hempstead and St Albans Hospital. The post holder would be expected to work at a maximum of 2 sites.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will have completed Specialist Training (or equivalent) and be entered on the Specialist Register of the GMC, or have a CCT date in Dermatology within six months of the date of the interview.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Watford General Hospital, Hemel Hempstead Hospital and St. Alban&#39;s City Hospital are situated in a pleasant part of Hertfordshire and afford easy access to London (1/2 an hour by train) and to other parts of England via the M1 and M25 Motorways.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Informal visits are encouraged and should be arranged through Dr Kapila Batta, Dermatology Clinical Lead, Tel: 01923 217139&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "West Hertfordshire Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120820"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Watford", "postalCode": "WD18 0HB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6491", "longitude": "-.404449"}}, "title": "Locum consultant in Dermatology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256851", "validThrough": "2020-11-11T23:59:59+0000"}