{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683"}}, "datePosted": "2020-11-06T13:31:21+0000", "description": "&lt;p&gt;&lt;strong&gt;Consultant Neurologist with an interest in Multiple Sclerosis&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This post is designed to build close working relationships between the neurology department and the speciality services within UHL, including emergency services. You will work clinically in acute neurology when on call, working with other teams to ensure that neurology patients are seen in a timely manner and have access to specialist neurological opinion.&lt;/p&gt;\n&lt;p&gt;There is also the option to work in an ambulatory care setting linking with specialists in emergency care and specialist nurses to review patients urgently. This is a developing role and the applicants will have the opportunity to work with colleagues to ensure this service is embedded into and contributes to development of acute care pathways.&lt;/p&gt;\n&lt;p&gt;In addition to contributing to general and acute neurology care, you will develop services for patients in their neurology subspecialty clinic. The priorities for expansion at present are for the multiple sclerosis, epilepsy and movement disorders services. This will complement other specialist services currently provided by the department, which include the neuromuscular, and headache service as well as neuro-ophthalmology, neurogenetics, neuro-otology and designated botulinum toxin clinics for dystonia and chronic migraine. Full secretarial support will be provided and the consultant will share equally with colleagues in the training of the junior staff. The post will involve a commitment to undergraduate teaching and the appointee will be expected to participate in the audit and research activities of the department.&lt;/p&gt;\n&lt;p&gt;You will be part of the non-resident on call rota and this will run on a 1 in 7 rotation with the existing Neurology Consultant team. The aim of this is to ensure senior cover for specialist registrars on call.&lt;/p&gt;\n&lt;p&gt;You will participate in undergraduate and postgraduate teaching, clinical audit and clinical research.&lt;/p&gt;\n&lt;p&gt;The University Hospitals of Leicester NHS Trust consists of three acute teaching hospitals serving as the single point of provision of Neurology Specialist Care for the population of Leicestershire. It is fully committed to Continuing Medical Education for consultants. We have recently launched our new Quality Strategy – Becoming the Best - which builds on a wide range of improvements over the last few years.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further information and for an informal discussion please contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Dr Ben Simpson - 07968 798759 or email Ben.Simpson@uhl-tr.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120651.jpg", "name": "University Hospitals of Leicester", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120651"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Leicester Royal Infirmary, Leicester", "postalCode": "LE1 5WW"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6278", "longitude": "-1.13479"}}, "title": "Consultant Neurologist with an interest in Multiple Sclerosis", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259932", "validThrough": "2020-12-04T23:59:59+0000"}