{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "94644", "minValue": "82804", "unitText": "YEAR", "value": "£82,804 - £94,644 per annum inclusive of HCAS"}}, "datePosted": "2020-10-22T11:32:23+0100", "description": "&lt;p&gt;Moorfields Eye Hospital are looking to recruit to the role of Director of Service Improvement for a 12 month Maternity Leave cover. post holder will lead the Service Improvement team that will support delivery of the Trust’s transformation programme.&lt;/p&gt;\n&lt;p&gt;The post holder will work with the executive team, senior clinical and operational colleagues to ensure the effective implementation and monitoring of the Trust’s transformation programme to focus on clinical and operational excellence in a way that maximises the engagement of individuals and clinical teams across the Trust.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Exceptional new opportunities at Moorfields&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Moorfields Eye Hospital is a world-class centre of excellence for eye health services, ophthalmic research and education. We are true pioneers in the fight to cure blindness. Every year we treat more than 750,000 patients at City Road in central London and at 31 satellites, and, in partnership with the UCL Institute of Ophthalmology, we lead one of the most impactful ophthalmic research programmes in the world. We train many of the leading eye care clinicians in the UK and internationally, and our reputation for quality and professionalism is second to none.&lt;/p&gt;\n&lt;p&gt;We are embarking on an exciting new journey with the planning of our new Hospital (Oriel) which gives us an opportunity to design new ways of working. As part of this we have undertaken work with McKinsey to design new models of care which we now need to take forward. The post holder would be key to ensuring this happens.&lt;/p&gt;\n&lt;p&gt;This is an exciting time to join Moorfield’s a the start of this new journey helping to design and plan the future of ophthalmology in London.&lt;/p&gt;\n&lt;p&gt;As a senior leader within the organisation they will have a key role in the embedding of the Trusts values, The Moorfields Way.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Alexandra Edwards Job title: PA&lt;/p&gt;\n&lt;p&gt;Email address: alexandra.edwards5@nhs.net Telephone number: 020 7253 3411&lt;/p&gt;\n&lt;p&gt;Ext 6303 / 2271 &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Moorfields Eye Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121181"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Moorfields Eye Hospital, London", "postalCode": "EC1V 2PD"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5272", "longitude": "-.089862"}}, "title": "Director of Service Improvement", "url": "https://www.jobs.nhs.uk/xi/vacancy/916238183", "validThrough": "2020-11-19T23:59:59+0000"}