{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "31,365 to 37,890"}}, "datePosted": "2020-10-29T10:34:13+0000", "description": "&lt;p&gt;&lt;strong&gt;Primary Care Learning Disability Liaison Nurse&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;AfC Band 6&lt;br /&gt;St Martins Hospital, Bath&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Full Time&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Are you a determined, dedicated Primary Care Learning Disability Liaison Nurse looking to join an organisation focused on professional growth and development, whilst ensuring you feel valued each and every day?&lt;/p&gt;\n&lt;h2&gt;Feel Proud&lt;/h2&gt;\n&lt;p&gt;As a Primary Care Learning Disability Liaison Nurse within Virgin Care Bath you’ll join a team who are focused on clinical excellence.&lt;/p&gt;\n&lt;p&gt;The Primary Care Learning Disability Liaison Nurse role exists to ensure that the needs of the person with a Learning Disability are met when they require access to a mainstream health service. This involves communicating with and working in partnership with a range of clinicians / practitioners and services to change systems and educate where appropriate. It also involves close communication and involvement with family, carers, provider services and others.&lt;/p&gt;\n&lt;p&gt;The post holder will join a team of Community Nurses and Clinical Specialists who work within a multi-disciplinary framework to deliver complex health needs assessment and intervention; health facilitation for people with learning disabilities with accompanying challenging behaviours, mental health and profound physical / sensory disabilities across health and social care communities.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Feel Valued&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will feel valued as a Primary Care Learning Disability Liaison Nurse with Virgin Care, receiving access to exclusive rewards and benefits including:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt; AfC 20/21 salary and terms and conditions including an NHS pension&lt;/li&gt;\n&lt;li&gt;Flexible working to provide you with that true work / life balance&lt;/li&gt;\n&lt;li&gt;Access to Virgin Tribe - our staff benefits scheme which grants you access to premier offers and discount off all Virgin products including flights, holidays, gyms and media, along with regular competitions and giveaways.&lt;/li&gt;\n&lt;li&gt;Feel the difference fund - a £100,000 fund to bring ‘Feel the difference’ to life, giving every employee a chance to have their thoughts and ideas heard.&lt;/li&gt;\n&lt;li&gt;Access to MyWellness – a health and lifestyle platform covering mental health awareness and support, healthy recipes &amp; activity challenges&lt;/li&gt;\n&lt;li&gt;Access to bespoke career pathways and opportunities to continue your professional development&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;Feel the Difference&lt;/h2&gt;\n&lt;p&gt;Virgin Care partner with the NHS and local authorities, providing high quality care for more than 1 million people each year up and down the country. We are an ambitious, forward thinking and passionate company who strive to make a real difference to people and our colleagues. We re-invest all of the money we earn to improve the experience, deliver ambitious transformations and empower all of our colleagues to make the changes, no matter how big or small, that make a real difference.&lt;/p&gt;\n&lt;p&gt;So why not click apply to find out where your journey with Virgin Care can take you! If you’d like to discuss the role further, please contact Tracy Rose via email: Tracy.Rose@virgincare.co.uk&lt;/p&gt;\n&lt;h2&gt;Virgin Care&lt;/h2&gt;\n&lt;p&gt;We’re committed to equal opportunities and welcome a broad diversity of talent to apply. We reserve the right to cease any advertising prior to the published closing date for a role that receives a high number of applications.&lt;/p&gt;\n&lt;p&gt;As a Disability Confident Committed company, we work in partnership with the Department of Work and Pensions (DWP) to provide facilities, work environment adjustments and technical solutions to make our business an inclusive place for all.&lt;/p&gt;\n&lt;p&gt;Virgin Care Limited, its subsidiary companies and the Virgin Care LLPs are part of the Virgin Group and provide publicly funded health and social care services. If you would like to know a little more about how we use your information, please see our website’s privacy policy.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Virgin Care", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127354"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bath", "postalCode": "BA2 5RP"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3578", "longitude": "-2.37292"}}, "title": "Primary Care Liaison Community Nurse - Learning Disabilities", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247930", "validThrough": "2020-11-12T23:59:59+0000"}