{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "13768", "minValue": "13768", "unitText": "YEAR", "value": "£13,768.00 per annum"}}, "datePosted": "2020-10-30T14:59:41+0000", "description": "&lt;p&gt;&lt;strong&gt;Rehabilitation Support Worker&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;SPOT SALARY: £13,768&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Falls and Parkinson’s Clinic St Martin’s Hospital Bath&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Are you a thoughtful, dedicated and enthusiastic person based in the Bath area? Are you looking to join an NHS Health and Social Care partner which is striving to make positive changes?&lt;/p&gt;\n&lt;p&gt;We are looking for an enthusiastic person to join this friendly and dynamic multi-disciplinary team based in the Clara Cross Falls, Parkinson’s and Other Related Disorder Clinic in Bath. The team provide adult out-patient interventions for Falls and people with Parkinson’s.&lt;/p&gt;\n&lt;p&gt;And right now, we’re looking for a Rehabilitation Support Worker for 25 hours per weekto be mostly based in the falls clinic to help us continue to change things for the better&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Feel Valued&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will receive £13,768,group pension, mobile phone, enabling fantastic flexible working patterns that can help you lead a perfect work/life balance. We’ll provide you with access to a committed Learning and Development team, and we work closely with Universities and Health Education England to further your potential and support your progression. We will offer a combination of in house eLearning, workshops and courses to support your development.&lt;/p&gt;\n&lt;p&gt;You will become part of the Virgin Tribe. This grants you access to premier offers on Virgin Products such as holidays.&lt;/p&gt;\n&lt;p&gt;You’ll access our central online health and lifestyle platform covering healthy recipes, activity challenges, and support information around mental health.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Feel Proud&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You should have relevantexperience working with older people and knowledge of the health and social services.&lt;/p&gt;\n&lt;p&gt;You will work as part of a multidisciplinary team, maintaining a high standard of patient focused care, reflecting an inter-disciplinary approach to rehabilitation, and a holistic and seamless service. You will develop good communication links with patients and carers and joint working with other services across professional and organisational boundaries, being able to manage sensitive situations, ensuring patient confidentiality and reporting back to a clinician.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will be based primarily in the Clara Cross Centre St Martins Hospital but will also work in service user’s homes.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Feel the Difference&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you’d like to discuss the role further, or request the full job description, please contact Christina Ring via email:Christina.ring@virgincare.co.ukor Ruth Sampson via email: ruth.sampson@virgincare.co.uk&lt;/p&gt;\n&lt;p&gt;You’re welcome to come in for an informal visit, meet our friendly team and ask any queries you may have before you apply.&lt;/p&gt;\n&lt;p&gt;We plan to hold interviews on 19thOctober 2020. We look forward to hearing from you.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We partner with the NHS to make a real difference to people in Bath and we’re building a working environment where colleagues too can really feel the difference. It’s the kind of place where nothing’s too much trouble. Where you’ll feel empowered, listened to, valued and where we’ll support you to bring your best self to work every single day and to deliver high quality care. And that’s just the beginning. Since 2006, we’ve delivered services to millions of people by developing our own unique approach where our patients are at the centre of everything we do.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;As a Disability Confident Committed company, we work in partnership with the Department of Work and Pensions (DWP) to provide facilities, work environment adjustments and technical solutions to make our business an inclusive place for all.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We’re committed to equal opportunities and welcome a broad diversity of talent to apply. We reserve the right to cease any advertising prior to the published closing date for a role that receives a high number of applications. Virgin Care Limited, its subsidiary companies and the Virgin Care LLPs are part of the Virgin Group and provide NHS and social care services. If you would like to know a little more about how we use your information, please see our website’s privacy policy.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Virgin Care", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127354"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bath", "postalCode": "BA2 5RP"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3578", "longitude": "-2.37292"}}, "title": "Rehab support Worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250673", "validThrough": "2020-11-13T23:59:59+0000"}