{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19525", "minValue": "19001", "unitText": "YEAR", "value": "19,001.00 - 19,525.00"}}, "datePosted": "2020-10-23T12:48:10+0100", "description": "&lt;p&gt;&lt;strong&gt;Support Worker&lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;Rapid Response - Gravesham&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Are you a caring and positive Support Worker based in the Kent area? Do you hold a valid UK driving licence and are able drive yourslef within the community? Are you looking to join an NHS Health and Social Care partner which is striving to make positive changes? Would you like to work for an organisation where more than 9 out of every ten 10 of the people who use services would recommend them? At Virgin Care, we’ve created a working environment where everyone can really feel the difference.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;Feel Valued&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;As a Support Worker in our Rapid Response Service you will receive a salary of up to £19,525 pro-rata. We’ll provide you with access to a committed Learning and Development team, and we work closely with Universities and Health Education England to further your potential and support your progression. We will offer a combination of in house eLearning, workshops and courses to support your development, our new and exciting service aims to deliver care closer to home and reduce the risk of avoidable hospital admissions for patients with long term conditions and frailty.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will become part of the Virgin Tribe. This grants you access to premier offers such as discounts on Virgin Products such as holidays.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You’ll access our central online health and lifestyle platform covering healthy recipes, activity challenges, and support information around mental health.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;Feel Proud&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are expanding our current rapid response service to enable us to prevent even more hospital admissions, facilitate early discharge and provide a 2 hour response to referrals. The support worker role will include visiting patients in their own homes and providing care to meet activities of daily living; this will be short term until a care package can be initiated. There will be the expectation that the support worker will undertake technical aspects of nursing care e.g. wound dressings, blood glucose monitoring, insulin administration etc. following a period of training and when deemed competent to do so. The working hours are shifts between the hours of 08.00 – 20.00 and covering 7 days per week.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Working closely with our Rapid response team, Community Nurses, GP&#39;s and other Health care professionals you’ll  be responsible for  delivering care as allocated by the Team Sister without direct supervision for patients within their own homes. You will be expected to deliver, monitor and maintain high standards of care at all times. You’ll care for patients and their families in the way that you believe is best, delivering our high service standards, sharing best practice, and actively improving the way we work.You will also need to have a full driving license and access to a car to complete your duties.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will have the ability to work both independently and also as part of a wider multidisciplinary team. Ideally you will have experience of working within a community setting and of providing personal care. It is expected that you should have strong communication and organisation skills and a flexible approach which will ensure you deliver positive experiences to patients at every stage of their healthcare journey.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;Feel the Difference&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;If you’d like to discuss the role further, or see a copy of the full job description, please contact Tosin Oyelakin on 01474 360 558, or email oluwatosin.oyelakin@virgincare.co.uk&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;em&gt;We partner with the NHS to make a real difference to people in Kent and we’re building a working environment where colleagues too can really feel the difference. It’s the kind of place where nothing’s too much trouble. Where you’ll feel empowered, listened to, valued and where we’ll support you to bring your best self to work every single day and to deliver high quality care. And that’s just the beginning. Since 2006, we’ve delivered services to millions of people by developing our own unique approach where our patients are at the centre of everything we do.&lt;/em&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;em&gt;As a Disability Confident Committed company, we work in partnership with the Department of Work and Pensions (DWP) to provide facilities, work environment adjustments and technical solutions to make our business an inclusive place for all.&lt;/em&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;span&gt;&lt;em&gt; We’re committed to equal opportunities and welcome a broad diversity of talent to apply. We reserve the right to cease any advertising prior to the published closing date for a role that receives a high number of applications. Virgin Care Limited, its subsidiary companies and the Virgin Care LLPs are part of the Virgin Group and provide NHS and social care services. If you would like to know a little more about how we use your information, please see our website’s privacy policy.&lt;/em&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Virgin Care", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127354"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Gravesham Community Hospital", "postalCode": "DA11 0DG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4432", "longitude": ".365561"}}, "title": "Rapid Response Support Worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240593", "validThrough": "2020-11-06T23:59:59+0000"}