{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890"}}, "datePosted": "2020-10-23T13:31:03+0100", "description": "&lt;p&gt;A&lt;strong&gt;re you looking for a new challenge as a Theatre Practitioner?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Salford Care Organisation has state-of-the-art Theatre facilities and combined with the fact that we are a Major Trauma Centre.&lt;/p&gt;\n&lt;p&gt;Over the last 2 years the theatre complex, of 19 theatres, have been refurbished, this means our facilities will be one of the most advanced theatre complex in the country, including the procurement of a 2.2 million pound Da Vinci surgical robot.&lt;br /&gt;&lt;br /&gt;Due to the expansion of our theatre service, opportunities for a Senior scrub practitioner has arisen within the general surgical team.&lt;/p&gt;\n&lt;p&gt;You will have the opportunity to gain a wealth of experience in major trauma.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;You will be flexible, highly motivated and enthusiastic practitioner to join our existing team. &lt;br /&gt;&lt;br /&gt;You will have experience of working in a senior position and will be someone who is able to take a lead in driving forward improvements in the operating theatre and perioperative service. &lt;br /&gt;&lt;br /&gt;This is an exciting opportunity and we need a committed individual who feels they can provide leadership to improve the quality of patient care and staff experience whilst safely reducing costs. &lt;br /&gt;&lt;br /&gt;As a senior practitioner for general surgical scrub you will need to be able to provide clinical leadership to support the evidence based patient centred care, which is of a high standard. &lt;br /&gt;&lt;br /&gt;We are looking for a team member who can demonstrate excellent communication skills and demonstrate team working, with a high standard of organisational skills, and the ability to work independently.&lt;/p&gt;\n&lt;p&gt;You will be capable of making informed clinical decisions, often in complex situations.&lt;/p&gt;\n&lt;p&gt;You will need to be particularly committed to the key role of educating, empowering and supporting people in the theatre environment showing excellent leadership and people management skills&lt;br /&gt;&lt;br /&gt;If you feel you have the people skills and necessary qualities to become part of a forward and innovative thinking team, with ambition to deliver the best theatre service in the UK.&lt;/p&gt;\n&lt;p&gt;In line with the Trust’s Single Equality Scheme we welcome applications from everyone irrespective of ethnic origin, disability, age, gender, gender identity, sexual orientation, disability, nationality, religion, marital status, social back ground or trade union membership. However, as members of ethnicity minority groups and individuals with disabilities are currently under-represented at this level of post, we would encourage applications from members of these groups. Appointment will be based on merit alone.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameMihaela BertesteanuJob titleTeam LeaderEmail addressmihaela.bertesteanu@srft.nhs.ukTelephone number06162061948Additional contact information&lt;/p&gt;\n&lt;p&gt;Mihaela Bertesteanu - Team Leader General Surgery - 0161 206 1948 - mihaela.bertesteanu@srft.nhs.uk&lt;/p&gt;\n&lt;p&gt;Meryl Matthews - Lead Nurse - 0161 206 1615 - meryl.matthews@srft.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121715.jpg", "name": "Salford Royal NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121715"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Salford Care Organisation, Salford", "postalCode": "M6 8HD"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4876", "longitude": "-2.32342"}}, "title": "Senior Theatre Scrub Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240727", "validThrough": "2020-11-08T23:59:59+0000"}