{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Competitive"}}, "datePosted": "2020-10-27T10:45:09+0000", "description": "&lt;p&gt;&lt;strong&gt;Mobile Imaging Service Manager&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;12-18 Month FTC (Maternity Cover)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;PET-CT – UK Mobiles&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Competitive Pay&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;InHealth is one of the UK’s leading healthcare providers and has a strong track record delivering modern and efficient healthcare services.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are currently recruiting for a &lt;strong&gt;Mobile&lt;/strong&gt; &lt;strong&gt;Imaging Services Manager&lt;/strong&gt; to join our Mobile PET-CT team working at a variety of Hospitals across London, Milton Keynes, Reading, Stevenage, Swindon and surrounding areas. This is a full-time position working 37.5 hours a week on a 12–18 month Fixed Term Contract.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What will being a Mobile Imaging Services Manager involve?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As a Mobile Imaging Services Manager you will lead and develop a team to deliver a high-quality imaging service to both patients and referrers. You will be responsible for the smooth running of the Mobile PET-CT team focusing on patient care and ensuring commercial success of the business. You will also proactively manage audits and ensure the team complies with all CQC independent standards.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We really want to hear from individuals who:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Have extensive knowledge of PET-CT&lt;/li&gt;\n&lt;li&gt;Knowledge and experience of Radiation Protection and the latest legislation&lt;/li&gt;\n&lt;li&gt;Have a demonstrable appreciation of patient care and confidentiality&lt;/li&gt;\n&lt;li&gt;Have the ability to work in a multidisciplinary team&lt;/li&gt;\n&lt;li&gt;Understand the Implications of the Data Protection Act and Caldicott Principles&lt;/li&gt;\n&lt;li&gt;Have experience working within a leadership role&lt;/li&gt;\n&lt;li&gt;Have experience working within a clinical environment&lt;/li&gt;\n&lt;li&gt;Have experience of contract management&lt;/li&gt;\n&lt;li&gt;Are competent working with Information Management systems&lt;/li&gt;\n&lt;li&gt;Have experience in People Management including managing sickness absence, performance management, recruitment and selection&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The successful candidate will be happy working from home on occasion and have a suitable work environment.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What’s in it for you?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;A highly competitive salary is given, topped with a generous flexible benefits package including private medical insurance, a company car/car allowance, 27 days holiday (plus bank holidays), cycle to work scheme and much more. We also have an innovative approach to personal and professional development, helping you to be the best version of you and giving you a real career pathway.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Why should you consider working with InHealth?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We can offer you the opportunity to do something you love, with the right support to access the roles you want, through clear career paths and best-in-class training and development. This is an environment where you have accountability for your career and are able to make a real contribution to the organisation and to our patients.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;InHealth&lt;/strong&gt; is an equal opportunities employer and welcomes applications from all areas of the community.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "InHealth Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133774"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "UK Mobiles", "postalCode": "NG5 1PB"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9893", "longitude": "-1.16006"}}, "title": "PET CT Mobile Imaging Services Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244053", "validThrough": "2020-11-30T23:59:59+0000"}