{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24907", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 per annum"}}, "datePosted": "2020-11-06T09:45:58+0000", "description": "&lt;p&gt;&lt;strong&gt;Support and Development Officer (Permanent)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Health Education England (HEE) exists for one reason only: to support the delivery of excellent healthcare and health improvement to the patients and public of England by ensuring that the workforce of today and tomorrow has the right numbers, skills, values and behaviours, at the right time and in the right place.&lt;/p&gt;\n&lt;p&gt;Health Education England’s vision is that everyone associated with health care will be committed to a lifetime of professional development, be proud of the care they provide, support and challenge one another and strive for ever-increasing standards of patient-centred care.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What will you be doing?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen in the Health Education England (HEE) Professional Development Unit based in our Bristol office.&lt;/p&gt;\n&lt;p&gt;The team are responsible for the coordination of postgraduate medical (and some dental) education and training. We are looking for a highly motivated and enthusiastic individual with excellent administrative and organisational skills to be part of a team that supports the junior doctors and dentists in training (throughout the region) and the educationalists programme within the locality.&lt;/p&gt;\n&lt;p&gt;The post-holder will be part of a small team who will work closely with the clinical faculty and professional support unit, Trust admin support and other external stakeholders to ensure the delivery of consistent services within the Professional Development Unit, as aligned to HEE Standard Operating Procedures.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What do you need?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As the Support and Development Officer your duties will include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Providing high quality administrative and project support&lt;/li&gt;\n&lt;li&gt;Reporting and analysis of information to support delivery of programmes.&lt;/li&gt;\n&lt;li&gt;Enabling, promoting and supporting effective running of the secretariat which includes collation of data, financial and project information to improve, inform and support a portfolio of projects, services, and initiatives.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;What benefits do we offer? &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As an employee of HEE we are interested in your overall health, and future, and it’s important that we value and reward the excellent work you do! Some of our benefits include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Lease Car Scheme&lt;/li&gt;\n&lt;li&gt;Cycle Scheme&lt;/li&gt;\n&lt;li&gt;Eye Care Vouchers&lt;/li&gt;\n&lt;li&gt;Health Service Discounts&lt;/li&gt;\n&lt;li&gt;27 days annual leave rising with length of service&lt;/li&gt;\n&lt;li&gt;Flexible benefits to support your wellbeing&lt;/li&gt;\n&lt;li&gt;Competitive NHS Pension Scheme&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;And a lot more!&lt;/p&gt;\n&lt;p&gt;Applicants will commence at the bottom of Band 5 with a full-time starting salary of £24,907, with pay step increases after 2 years’ service and 4 years’ service.&lt;/p&gt;\n&lt;p&gt;These salaries are offered in accordance with NHS Terms and Conditions and the HEE Pay Progression Policy and are subject to annual cost of living review.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;strong&gt;If you like what you have read and think you have the skills and experience we need then don&#39;t delay, apply today! We get lots of applications for our roles and so we sometimes have to close our posts early. Don&#39;t miss out! &lt;/strong&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;Interview date is to be confirmed.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Anne Elliott : anne.elliott@hee.nhs.uk&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Anne Elliott&lt;/p&gt;\n&lt;p&gt;PDU Manager&lt;/p&gt;\n&lt;p&gt;anne.elliott@hee.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Health Education England", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127514"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Park House, Bristol", "postalCode": "BS34 8PR"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5214", "longitude": "-2.53745"}}, "title": "Support and Development Officer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259079", "validThrough": "2020-11-22T23:59:59+0000"}