{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Depending on experience"}}, "datePosted": "2020-10-20T15:11:38+0100", "description": "&lt;p&gt;An exciting opportunity has arisen for an experienced and forward thinking Pharmacy Technician to join Tonbridge Primary Care Network&#39;s expanding pharmacy team. We pride ourselves on providing high quality patient centred care by a well-supported team with a focus on a culture of continued learning and development. We wish to expand our pharmacy team to deliver high quality pharmacy services across our network. The pharmacy team currently comprises of three clinical pharmacists working across our 5 practices serving more than 50,000 patients. We are a dynamic, friendly and supportive PCN.&lt;/p&gt;\n&lt;p&gt;Clinical Pharmacy in General Practice is part of an exciting programme of transformation to develop a new model of care which addresses our ambition to deliver person-centred, coordinated care across the PCN. The clinical pharmacy in general practice model is supported by the direction of national policy including the Five Year Forward View and GP Forward View where there is a need to better utilise the role of pharmacy professionals within primary care to pro-actively help patients stay safe and well and out of hospital as well as helping to reduce the demands on general practice. This is an exciting time to be involved in general practice and to be part of shaping primary care for the future.&lt;/p&gt;\n&lt;p&gt;We are seeking an enthusiastic, patient-focused, highly and independently motivated Pharmacy Technician with a minimum of 2 years’ experience to join our existing PCN pharmacist team and provide quality patient care. The successful candidates will play an important role in complementing our clinical pharmacists and other members of the PCN multi-disciplinary team. This is an evolving job role with huge scope for development as we expand our PCN team further over the years.&lt;/p&gt;\n&lt;p&gt;West Kent Health GP Federation is an established employer and provider and will act as the lead employer for this role and support the work of the Pharmacy Technicians within Tonbridge PCN. The salary is dependent on experience and qualifications and includes NHS Pension. You must be a registered Pharmacy Technician with the GPhC and due to the geographical location you must have a full driving license as travel will be required to surgeries, care homes, and patients across the PCN area.&lt;/p&gt;\n&lt;p&gt;The role is practice based and the successful applicants will work alongside the clinical pharmacists to support the pharmacy agenda. The post holders core role responsibilities will include clinical, technical and administrative activities, including to;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To undertake medicines reconciliation in accordance with practice protocols and to update patients’ medical records / prescribing accordingly.&lt;/li&gt;\n&lt;li&gt;To develop a good working knowledge of the clinical systems used by the practices in order to devise and carry out various audits, drug searches, etc.&lt;/li&gt;\n&lt;li&gt;To support the achievement of the practice’s prescribing Quality and Outcomes Framework targets.&lt;/li&gt;\n&lt;li&gt;Supporting the delivery of specifications that relate directly to the Investment &amp; Impact Funding system.&lt;/li&gt;\n&lt;li&gt;Working with the Clinical Pharmacist and Prescribing Co-ordinators to contribute to the review and development of repeat prescribing protocols / Standard Operating Procedures to improve the efficiency and effectiveness of repeat prescribing systems.&lt;/li&gt;\n&lt;li&gt;To identify areas of good practice and to disseminate this across Tonbridge PCN.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;This role will be based across the 5 GP practices in the Tunbridge Wells area. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary will be dependent on experience&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central Advertising - Other", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130656"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Tonbridge", "postalCode": "TN9 1RE"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.1946", "longitude": ".277528"}}, "title": "Tonbridge PCN Pharmacy Technician", "url": "https://www.jobs.nhs.uk/xi/vacancy/916234940", "validThrough": "2020-11-08T23:59:59+0000"}