{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 £28,691 - £36,738 per annum incl"}}, "datePosted": "2020-10-23T14:00:37+0100", "description": "&lt;p&gt;&lt;strong&gt;SAVE THE DATE: Friday 13th November 2020 at 1pm&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We will be holding our first virtual nursing recruitment day at Royal Free London NHS Foundation Trust on Friday 13th November! If you are interested to meet some of our clinical teams, learn more about the trust, the job opportunities we have on offer, and how we can support your career - please join us via Microsoft Teams at 1pm.&lt;/p&gt;\n&lt;p&gt;At the open day we are going to be introducing our departments, specialities and exciting opportunities available to Royal Free London NHS Foundation Trust staff including:&lt;/p&gt;\n&lt;p&gt;* access to internally run clinical skills; personal development courses and internal Transfer Scheme&lt;/p&gt;\n&lt;p&gt;* access to an internal leadership tool kit and development programme&lt;/p&gt;\n&lt;p&gt;* access to a Band 6 talent management programme for aspiring ward/unit managers&lt;/p&gt;\n&lt;p&gt;* support with applications for nationally run leadership programmes&lt;/p&gt;\n&lt;p&gt;* access to a nationally-recognised preceptorship programme for newly qualified nurses&lt;/p&gt;\n&lt;p&gt;* access to post-registration CPD courses, modules and programmes from our partner universities for career and role model development&lt;/p&gt;\n&lt;p&gt;* support from locally based clinical practice educators/facilitators&lt;/p&gt;\n&lt;p&gt;We have a lively and vibrant working atmosphere, with quick and easy transport links to all our hospitals. Our size and resources enable us to offer a range of attractive benefits as well as unparalleled education and development opportunities for staff at all levels. This includes an extensive portfolio of academic and clinical courses and programmes ranging from ongoing personal development through to clinical excellence and leadership skills. The Royal Free London prides itself on its investment in staff both in terms of developing career and life skills but also its commitment to staff health and well-being.&lt;/p&gt;\n&lt;p&gt;Our mission is to deliver world class care and expertise in our clinical services, underpinned by world class teaching and research. We will continue to measure our progress against our five governing objectives; excellent outcomes, excellent patient and staff experience, excellent value for taxpayers’ money, being safe and meeting our external duties, and building a strong organisation.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please note – if you wish to be interviewed please apply on line and we will contact you to arrange virtual interviews on the different day suitable to you&lt;/strong&gt;. Interviews will not be held at this event but we will advise you how to apply. If you are interested in working with us, apply today.&lt;/p&gt;\n&lt;p&gt;Please submit your application to be emailed a link to the virtual open day event. Links will be sent once the advertisement is closed.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Jasmina Davies - Recruitment and Retention Lead Nurse via email jasmina.davies@nhs.net&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120624.jpg", "name": "Royal Free London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120624"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Free London NHS Foundation Trust (all sites), London", "postalCode": "NW3 2QG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5532", "longitude": "-.165298"}}, "title": "Nursing Recruitment Virtual Open Day", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240823", "validThrough": "2020-11-11T23:59:59+0000"}