{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "17222", "minValue": "17222", "unitText": "YEAR", "value": "£17,222 pro rata per annum fixed salary point"}}, "datePosted": "2020-11-05T11:47:13+0000", "description": "&lt;p&gt;CARE PLUS GROUP&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Community Nursing Admin&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Vacancy based at Val Waterhouse Centre, Kent Street, Grimsby&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Reference Number: 814-20-203&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Clerical Assistant&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;2 posts (up to 37.5 hours total) – hours negotiable. Hours will be between 8.00 am – 5.00 pm Monday – Friday plus weekends and Bank Holidays which are on a rota basis&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Permanent&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary Range 2 £17,222&lt;/strong&gt;&lt;strong&gt;pro rata per annum fixed salary point&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Care Plus Group is a Social Enterprise established since 2011 to deliver community healthcare services following the national separation of provider services from the commissioning arm of the local NHS. One of our core values is that staff and patients are integral to everything we do. As part of this all staff employed by Care Plus Group automatically become members of the Group which means you will be able to give your views and vote on important issues for the organisation. We welcome your application to join us.&lt;/p&gt;\n&lt;p&gt;You will provide a comprehensive administrative support service to the Community Nursing teams. Key elements of the post are to be the first point of contact for telephone enquiries from service users and professionals, taking messages and forwarding to the appropriate source and also the stock control and ordering of stock for each Community Nursing site. Work will generally be carried out under supervision and will be within well established procedures.&lt;/p&gt;\n&lt;p&gt;You will:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;undertake routine clerical duties, e.g. photocopying, scanning, computer work, message taking, telephone enquiries.&lt;/li&gt;\n&lt;li&gt;be responsible for taking accurate messages and relaying to the appropriate persons and inputting message details onto a clinical patient record system (Systmone)&lt;/li&gt;\n&lt;li&gt;be expected to deal with various queries and issues, following agreed processes, referring on to line manager where appropriate.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The essential criteria you must hold are:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Literacy and numeracy level 2&lt;/li&gt;\n&lt;li&gt;Level 2 or equivalent qualification in computer applications&lt;/li&gt;\n&lt;li&gt;Competent in Microsoft office including Word, Outlook &amp; Excel&lt;/li&gt;\n&lt;li&gt;Recent experience of working in an office/reception (within the last year)&lt;/li&gt;\n&lt;li&gt;Experience of working with the public (both face to face and on the telephone)&lt;/li&gt;\n&lt;li&gt;Awareness of confidentiality&lt;/li&gt;\n&lt;li&gt;Ability to work accurately&lt;/li&gt;\n&lt;li&gt;Ability to communicate effectively with people at all levels&lt;/li&gt;\n&lt;li&gt;Ability to take and transcribe accurate notes&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;For further information and an informal discussion please contact &lt;strong&gt;Gail Heyhoe&lt;/strong&gt;on &lt;strong&gt;07775034061&lt;/strong&gt;&lt;strong&gt;&lt;em&gt;.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;CLOSING DATE: 12 November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Please refer to the Job Description and Person Specification for more information, and the criteria required to fulfil the role.&lt;/p&gt;\n&lt;p&gt;Please note that any offer of a post is subject to pre-employment screening.&lt;/p&gt;\n&lt;p&gt;We offer favourable terms and conditions including optional membership to a contributory pension scheme, lease cars, a full induction programme and CPD opportunities. We have Independent Provider closed access to the NHS pension scheme, for further details about eligibility please contact us.&lt;/p&gt;\n&lt;p&gt;Care Plus Group will interview all disabled candidates who meet the minimum criteria for any job vacancy.&lt;/p&gt;\n&lt;p&gt;Please note that if you have not heard from us within 6 weeks of the closing date we regret that you have not been short listed on this occasion.&lt;/p&gt;\n&lt;p&gt;Care Plus Group is an equal opportunities employer. It is our Policy to provide and ensure equal opportunities in the fields of recruitment, employment, training, promotion and job security irrespective of any characteristics which may place an applicant in any minority or disadvantaged group or groups.&lt;/p&gt;\n&lt;p&gt;We are committed to safeguarding the welfare of vulnerable adults and expect the same commitment from all staff and volunteers.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Care Plus Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126194"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Grimsby", "postalCode": "DN32 7DH"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5743", "longitude": "-.071666"}}, "title": "Clerical Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257515", "validThrough": "2020-11-12T23:59:59+0000"}