{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24907", "minValue": "24907", "unitText": "YEAR", "value": "From £24,907 per annum"}}, "datePosted": "2020-11-04T12:01:28+0000", "description": "&lt;p&gt;This is a fixed-term/secondment for 12 months. If you are an internal candidate on a substantive contract you may only apply for a secondment. Please ensure you have the support of your current line manager before applying. At the end of your secondment you will return to your current post at your current grade.&lt;/p&gt;\n&lt;p&gt;The post-holder will work within the IAPT service providing low intensity interventions.&lt;/p&gt;\n&lt;p&gt;We wish to recruit a Qualified Low Intensity Therapist to work as part of the IAPT program across Bath and North East Somerset. You will be enthusiastic, hard working and have the capability to meet specified targets. The post-holder will work within the service to provide high intensity CBT interventions to patients at Step 2 of the IAPT service. LI therapists deliver a variety of CBT interventions, this may include face to face, telephone or video based work as well as group workshops.&lt;/p&gt;\n&lt;p&gt;Banes Primary Care Talking Therapies is a patient focused and pro-active community based service and has strong links with both GPs and our colleagues in secondary care mental health. We have a strong commitment to delivering high quality community oriented services, and to working in partnership with service users, carers, health and social care agencies and voluntary agencies.&lt;/p&gt;\n&lt;p&gt;We are a dynamic, supportive and creative service, who provide a high level of training and supervision to all clinical practitioners at all levels.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:   BANES Talking Therapies Service, Rachael Armstrong or Erin Bloomfield on 01225 675150&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121159.jpg", "name": "Avon and Wiltshire Mental Health Partnership NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121159"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hillview Lodge, Bath", "postalCode": "BA1 3NG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3917", "longitude": "-2.3912"}}, "title": "Band 5 Psychological Wellbeing Practitioner - Hillview Lodge, Bath", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255720", "validThrough": "2020-11-18T23:59:59+0000"}