{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "73664", "minValue": "63751", "unitText": "YEAR", "value": "£63,751 - £73,664"}}, "datePosted": "2020-10-19T14:59:09+0100", "description": "&lt;p&gt;&lt;strong&gt;JOB PURPOSE:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The three acute providers in Birmingham are working together to develop a joint venture to deliver procurement and supply chain services to their organisations. The three organisations initially involved are:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;University Hospitals Birmingham NHS Foundation Trust – the largest acute provider in the country covering both the Queen Elizabeth Hospital in Edgbaston and the group of three hospitals formerly Heart of England NHS Foundation Trust (Heartlands, Good Hope and Solihull hospitals);&lt;/li&gt;\n&lt;li&gt;Birmingham Women’s &amp; Children’s NHS Foundation Trust, the first standalone women’s and children’s Trust in the country.&lt;/li&gt;\n&lt;li&gt;The Royal Orthopaedic Hospital NHS Foundation Trust – a specialist orthopaedic provider.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The combined turnover of the three organisations is over £2.2 billion with non-pay spend of circa £700 million.&lt;/p&gt;\n&lt;p&gt;The purpose of this role is to provide a procurement and supply chain function to assist in the delivery of the vision, business plans, day to day operations and financial and quality targets of the BHA.&lt;/p&gt;\n&lt;p&gt;To develop and implement methodologies to facilitate and monitor contracts.&lt;/p&gt;\n&lt;p&gt;Effectively manage the internal operations and resources to enable the delivery of the saving targets and work-plans. To build professional relationships, implement change and support with the delivery of operational requirements. Enable Procurement to continuously improve the service delivered to stakeholders, enhance expertise and build capability and potential.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University Hospitals Birmingham NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123452"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Birmingham", "postalCode": "B15 2TH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4533", "longitude": "-1.93628"}}, "title": "Head of Procurement", "url": "https://www.jobs.nhs.uk/xi/vacancy/916232790", "validThrough": "2020-11-13T23:59:59+0000"}