{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 to £21,142 pa"}}, "datePosted": "2020-11-04T10:45:18+0000", "description": "&lt;p&gt;&lt;strong&gt;Flow Coordinator – Band 3 – Acute Assessment Unit – 34.5 hours per week – Permanent &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Could you help West Suffolk Hospital to deliver the best quality and safest care to our local community?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The AAU is a blooming, innovative, front door service consisting of 23 assessment trolleys, one bay with cardiac monitoring facilities for higher dependency patients operating 24 hours a day. We have a dedicated multi-professional team accepting referrals from various Clinicians in the Community and Emergency Department, we accept patients with urgent medical needs.  Ambulatory Emergency Care Centre is also co-located to the Unit and provides same day assessment, treatment and discharge of appropriate medical and surgical patients. AAU/AEC is a very busy area with a wide variety of patients seeing on average 50 – 60 patients a day. &lt;/p&gt;\n&lt;p&gt;We are proud of our commitment to staff development. As an AAU Staff Nurse, the post holder will have the opportunity to work alongside our experienced team in emergency care in order to develop yourself to provide fast paced, high standards of care and really make a positive impact to patients’ lives.  The experienced and supportive team on AAU &amp; AEC will assist with your integration, development and will offer you supernumerary time in order to get integrated into the Unit and the Multidisciplinary Team.&lt;/p&gt;\n&lt;p&gt;The band 3 flow coordinator is a pivitol role on AAU supporting the Nurse in charge to ensure that patients are admitted, transferred and discharged in a timely manner.&lt;/p&gt;\n&lt;p&gt;Working as a member of the team in the AAU, the successful candidate will collaborate with key teams/departments to ensure the smooth flow of patients through the Unit and Ambulatory Emergency Care under supervision of the Registered Nurse in charge and to assist in key administration tasks delegated by the Unit Manager or Deputy. The post holder will be expected to work 3 long days a week 11:5 hour shifts predominantly Monday to Friday however the occasional Saturday may be expected. Excellent communication and management skills are essential for this post.&lt;/p&gt;\n&lt;p&gt;Informal visits are welcomed.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further enquiries please contact Michelle Rowley, Acute Assessment Unit Manager on 01284 713972 or via the email attached.&lt;/strong&gt;”&lt;/p&gt;\n&lt;h1&gt;&lt;strong&gt;**In order to improve efficiency, all correspondence relating to this vacancy, &lt;span style=&quot;text-decoration: underline;&quot;&gt;including invitations to interview will be by email only&lt;/span&gt;, via NHS Jobs. Would you therefore please ensure you check your emails on a regular basis**&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;In submitting an application form, you authorise West Suffolk NHS FT to confirm any previous NHS service details via the Inter Authority Transfer (IAT) process, should you be appointed to the post. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;CAR PARKING&lt;/strong&gt; - This post &lt;strong&gt;does not &lt;/strong&gt;entitle you to apply to park on the Hospital site.  The Trust offer parking off site at the Bury St Edmunds Rugby Club, which is serviced by a regular shuttle bus to and from the Hospital.  Details of the bus timetable can be found in the on-line starter pack.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;If required to work on a weekend, the restriction does not apply.  Parking is allowed on site Saturday and Sunday provided a day ticket (£2.10) is clearly displayed.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For posts that include “on call” duties successful candidates will need to   complete an application form for access through the barriers from the car park office.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The successful candidate for this post will be required to apply for a Disclosure &amp; Barring Service (DBS) Disclosure at Enhanced level.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For Band 1 and Band 2 posts, the cost of the DBS Disclosure will be met by the Trust. However, any employees at Band 1 and Band 2 who leave the Trust within six months of commencing their post will have a £10 administration fee deducted from their final salary. For posts at Band 3 and above, the cost of the Disclosure will be met by the appointed employee and deducted in instalments from their salary over a period of three months. If the employee leaves the Trust within three months of commencing their post, any outstanding payments will be deducted from their final pay.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;All applicants should click on the link entitled “How will my application be processed?” prior to submitting their application form.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The closing date for this vacancy may change if we receive a strong response. Please ensure that you apply for any post you are interested in as soon as possible.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "West Suffolk NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120941"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bury St. Edmunds", "postalCode": "IP33 2QZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.2317", "longitude": ".709205"}}, "title": "Flow Coordinator - Band 3 - Acute Assessment Unit", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255425", "validThrough": "2020-11-18T23:59:59+0000"}