{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum pro rata"}}, "datePosted": "2020-11-02T16:55:42+0000", "description": "&lt;h2&gt;&lt;strong&gt;The role&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;We are looking for an Applied Psychologist (Clinical / Counselling / Forensic) / Psychotherapist at Band 8a to join and lead our highly valued Community Forensic Team. The team is based at Easby House in Langdon Hospital and offer high quality, psychological care to individuals with forensic backgrounds, to enable them to manage better in the community.&lt;/p&gt;\n&lt;p&gt;In joining the Community Forensic Team you will be part of a wider group of psychological professionals working across community secure transition services, prison mental health in-reach and the Offender Personality Disorder pathway.&lt;/p&gt;\n&lt;h2&gt;&lt;strong&gt;About you&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;You will be a qualified applied psychologist or psychotherapist with experience of working with people with forensic histories and co-morbid mental health difficulties. You will have the knowledge and skills to deliver evidence based and outcome monitored psychological therapies and will also be able to demonstrate your competence as a reflective practitioner with a passion for working successfully in multi-disciplinary teams. You will have developed skills in supervising other clinicians including trainee, assistant and qualified psychologists. Above all you will be able to demonstrate a commitment to service user participation. You will be developing yourself as a clinical leader and will bring a positive approach to quality improvement and service development with skills in audit and service evaluation.&lt;/p&gt;\n&lt;p&gt;If you would like to learn more about the post and/or visit please contact Dr Russell Norton, Lead Psychologist, russell.norton@nhs.net&lt;/p&gt;\n&lt;h2&gt;&lt;strong&gt;Secure Services&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;We are based at Langdon Hospitalin Dawlish and have 3 Local Delivery Units (LDUs); the Prison Cluster, Inpatient and Community.&lt;/p&gt;\n&lt;p&gt;The Directorate supports people who, as a result of their mental health issues, have had contact with the legal system and need a safe and secure environment that enables them to receive a wide range of treatments, therapies and care to help them recover. This includes contact within Liaison and Diversion services; assessment and treatment within our 3 Devon prisons; secure inpatient care and discharge into the community.&lt;/p&gt;\n&lt;h2&gt;&lt;strong&gt;About us&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;Overall Devon Partnership NHS Trust has been rated as ‘Good’ by the Care Quality Commissioners and we have supported our medical leaders within national roles at the Royal College of Psychiatry and NHS England. Secure Services Directorate has been rated as “Outstanding” by CQC.&lt;/p&gt;\n&lt;p&gt;Our passion and commitment to achieve this shapes our vision, mission and strategy to promote good mental health and wellbeing. Our staff are pivotal in everything we do and we are committed to involving them fully in the development of the Trust and our services. All of our members of staff work to our organisational values.&lt;/p&gt;\n&lt;h2&gt;&lt;strong&gt;Our offer to you&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;Benefits of working at Devon Partnership NHS Trust include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Commitment to career development&lt;/li&gt;\n&lt;li&gt;Wide range of leadership development opportunities&lt;/li&gt;\n&lt;li&gt;Up to &lt;strong&gt;41 days of paid leave &lt;/strong&gt;per year, depending on length of NHS service, includes bank holidays&lt;/li&gt;\n&lt;li&gt;Generous &lt;strong&gt;NHS pension scheme &lt;/strong&gt;with employer contributions of up to 14.5% of pensionable pay&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Incremental pay &lt;/strong&gt;progression&lt;/li&gt;\n&lt;li&gt;Good &lt;strong&gt;maternity, paternity and adoption leave &lt;/strong&gt;over and above the statutory minimum requirements&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Sick pay &lt;/strong&gt;up to a maximum of six months full pay and six months half pay&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Childcare vouchers &lt;/strong&gt;– annual savings of up to £1,19&lt;/li&gt;\n&lt;li&gt;Commitment to &lt;strong&gt;flexible working&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;24/7 free &lt;strong&gt;confidential advice &lt;/strong&gt;and &lt;strong&gt;support service&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Refer a friend and both earn £500 &lt;/strong&gt;- available for selected posts. &lt;em&gt;Terms and conditions apply.&lt;/em&gt;&lt;/li&gt;\n&lt;li&gt;Freedom to speak up &lt;strong&gt;‘Guardian Service’&lt;/strong&gt;, enabling you to safely discuss any concerns impacting on patient care&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Preceptorship schemes&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;Exclusive &lt;strong&gt;health service discounts &lt;/strong&gt;for NHS staff&lt;/li&gt;\n&lt;li&gt;Stagecoach – &lt;strong&gt;bus transport discounts&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;Salary sacrifice &lt;strong&gt;cycle scheme&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;Access to free &lt;strong&gt;recovery and wellbeing courses&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;&lt;strong&gt;Living here&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;South Devon offers a beautiful coastal and countryside location with a wide range of social &amp; leisure opportunities. This ranges from some of the best beaches in the Country, The Moors, Canals and rivers all of which can be accessed easily via foot, car, bike or boat, it’s no wonder Devon can also offer people the space to contemplate, to relax and reinvigorate yourself.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120813.png", "name": "Devon Partnership NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120813"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Dawlish", "postalCode": "EX7 0NR"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.5997", "longitude": "-3.46819"}}, "title": "Psychologist Clinical Counselling Forensic Reg Psychotherapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252944", "validThrough": "2020-11-25T23:59:59+0000"}