{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503"}}, "datePosted": "2020-10-12T14:00:18+0100", "description": "&lt;p&gt;Do you hold a valid NMC or HCPC registration?&lt;/p&gt;\n&lt;p&gt;Do you have recent management experience?&lt;/p&gt;\n&lt;p&gt;Are you an excellent communicator with fantastic relationship building skills?&lt;/p&gt;\n&lt;p&gt;Would you like to make a real difference to our Covid 19 Response Service?&lt;/p&gt;\n&lt;p&gt;Are you looking for a new challenge?&lt;/p&gt;\n&lt;p&gt;Are you based in the Glasgow area?&lt;/p&gt;\n&lt;p&gt;If the answers to the above questions are &#39;yes&#39;, then we have the opportunity for you.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are looking for nurses/healthcare professionals to join us as Clinical Shift Managers in the National Covid Response Service call centres.&lt;/p&gt;\n&lt;p&gt;Currently we have Call Centres open in Newcastle Upon Tyne, Glasgow and Kingston Upon Thames.&lt;/p&gt;\n&lt;p&gt;The Covid Response Service (CRS) supports patients who call the 111 service with coronavirus symptoms or concerns. These callers are directed to call agents specifically recruited to manage coronavirus calls and you will provide clinical support to theses staff&lt;/p&gt;\n&lt;p&gt;The role of the Clinical Shift Manager is to line manage the Clinical Floor Walkers who support the non-clinical call takers with any clinical queries they may have regarding their call. The role also involves auditing of the advice the clinical floor walkers are giving to the call takers, acting as escalation point for clinical queries, investigation of incidents, relationship management with our providers.&lt;/p&gt;\n&lt;p&gt;The postholder will have experience in telephone triage and be comfortable using the ICT systems provided.&lt;/p&gt;\n&lt;p&gt;The service currently operates between 7am – 11pm, 7 days a week As the service provision broadens, these hours may increase to cover a 24 hour period.&lt;/p&gt;\n&lt;p&gt;We are looking for our Team Members to offer us at least 22.5 hours per week (3 x 8 hour shifts).&lt;/p&gt;\n&lt;p&gt;We are happy to offer this role on a bank basis or for an initial fixed term contract until 31 March 2021. There may be the opportunity to extend this depending on service demands.&lt;/p&gt;\n&lt;p&gt;We aim to shortlist and interview candidates as quickly as possible and all interviews will be completed using Microsoft Teams technology.&lt;/p&gt;\n&lt;p&gt;If you have any questions, please email us at 111jobs@scas.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122412.jpg", "name": "South Central Ambulance Service", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122412"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Glasgow", "postalCode": "G31 3AU"}, "geo": {"@type": "GeoCoordinates", "latitude": "55.8641", "longitude": "-4.22325"}}, "title": "Clinical Shift Manager - Glasgow", "url": "https://www.jobs.nhs.uk/xi/vacancy/916222628", "validThrough": "2020-11-15T23:59:59+0000"}