{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum, pro rata"}}, "datePosted": "2020-11-06T08:17:02+0000", "description": "&lt;p&gt;&lt;strong&gt;Base: Sleaford, Lincolnshire&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Are you passionate about providing a high quality service to stroke patients? Are you an ambitious individual who relishes a challenge? Lincolnshire’s Stroke Service has some exciting new developments happening across the county. We are now in a position to expand our service to widen our scope and have received an up-lift in staffing enabling us to create new posts in conjunction with existing vacancy. If you are a team player with a special interest in the area of stroke, look no further, we are now looking to recruit to this exciting vacancy.&lt;/p&gt;\n&lt;p&gt;We are particularly delighted that this post has the opportunity to work across acute and community sites. This will enable us to provide a smooth, seamless service to patients and further integrate teams across the pathway.&lt;/p&gt;\n&lt;p&gt;The innovative Stroke Service provides high quality specialist stroke rehabilitation across Lincolnshire. We are a friendly and supportive team. Your post will require the ability to travel across Lincolnshire, and to work flexibility to meet service needs. You will play a key role in delivering high quality patient centred care and rehabilitation, to people who have recently experienced a stroke, in hospital, their own homes as well as in other community settings. You will be working with a full multidisciplinary team of specialist Physiotherapists, Speech and Language Therapists, Occupational Therapists, Assistant Practitioners and Rehabilitation Assistants. In an exciting development for the service our staffing uplift will also include recruitment of a Dietitian and Clinical Psychologist.&lt;/p&gt;\n&lt;p&gt;Experience of a multidisciplinary team, working with stroke and skills in dysphagia are a key aspect of this role. You would be supported and mentored by your Speech and Language Therapy band 7 and band 6 colleagues. We also have regular clinical supervision, and hold regular local and countywide team meetings; LCHS are committed to supporting continued professional development (CPD). The stroke service has good links with the Speech and Language Therapy service for supervision, countywide networking and CPD opportunities. Through this you will have access to support from other clinical specialists for example in ENT/head and neck, dysfluency and a well-established AAC service.&lt;/p&gt;\n&lt;p&gt;You will be required to have effective travel arrangements and will be required to work weekends to meet the needs of the service&lt;/p&gt;\n&lt;p&gt;It is an exciting time to work in stroke rehabilitation in Lincolnshire. There are many exciting areas of service development happening, all with the aim of improving and shaping the future of the stroke service for patients to be ‘fit for our own families’, building on a model that already works well and is well-respected within the organisation.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameAmy EvansJob titleAdvanced Occupational Therapist / Team LeadEmail addressamy.evans@nhs.netTelephone number01522 3307241 or 07825 110460Additional contact information&lt;/p&gt;\n&lt;p&gt;Or contact &lt;strong&gt;Catherine Stamp, Advanced Speech and Language Therapist on 07580 996166 or catherine.stamp2@nhs.net&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/127394.png", "name": "Lincolnshire Community Health Services NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127394"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Unit 7 The Point, Sleaford", "postalCode": "NG34 8GG"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.0088", "longitude": "-.392531"}}, "title": "Specialist Speech and Language Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258888", "validThrough": "2020-11-22T23:59:59+0000"}