{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 p.a. (pro rata)"}}, "datePosted": "2020-11-02T10:32:15+0000", "description": "&lt;p&gt;We are Manchester Local Care Organisation - an exciting, new public sector organisation that is bringing together NHS community health services and social care services in the city. We’re driven by the aim of improving the health of local people in Manchester by working across organisational boundaries.&lt;/p&gt;\n&lt;p&gt;The first health and social care staff have been deployed to us from April 2018 and are now starting to work in new ways across the city. Our teams work as one in the neighbourhoods they serve – delivering and designing services in partnership with local people. We also provide key services that work across wider localities and city-wide. We believe that our pioneering approach will make a massive difference to the health of people in our city and we are looking for you to join our team and help us do this.&lt;/p&gt;\n&lt;p&gt;To be a Community Nurse is to be part of something amazing, which is why we need special people like you – people who stand out from the crowd. If you put the patient at the heart of everything you do and are: &lt;br /&gt;&lt;br /&gt;- Adaptable to new roles &lt;br /&gt;- Responsive to change &lt;br /&gt;- Always looking to improve &lt;br /&gt;- Excellent listeners&lt;br /&gt;- Fast learners&lt;br /&gt;-Compassionate carers. &lt;br /&gt;&lt;br /&gt;Within MFT, we are currently recruiting a full time staff Nurse to the Integrated Community Nursing site at Etrop Court Wythenshawe . This role will focus on both transitional and on-going care of patients within a community setting:&lt;br /&gt;&lt;br /&gt;&lt;br /&gt;Being a nurse at our trust is about having access to fantastic learning facilities, supported with development opportunities, it means being trusted, recognised, respected and rewarded. &lt;br /&gt;&lt;br /&gt;We offer an exceptional preceptorship package, where our nurses supported to deliver the highest standards of care. We believe this is the way it should be!&lt;br /&gt;&lt;br /&gt;We can offer training, flexibility, friendliness and a caring environment in which to work. We provide a number of benefits, which you can view on the attached document.&lt;br /&gt;&lt;br /&gt;We are happy to employ newly qualified staff nurses .&lt;br /&gt;&lt;br /&gt;Post-holders will also have access to the Academy and LEAD Training Programmes, a unique and innovative concept to develop skillsets, which brings together all of the education and training activities under one umbrella.&lt;br /&gt;&lt;br /&gt;Our commitment is further reinforced by our robust Trust Nurse Revalidation Programme – offering an e-portfolio and dedicated individual support.&lt;br /&gt;&lt;br /&gt;MFT is recognised as a centre of clinical excellence and provides a wide range of health services to the areas of South Manchester,.&lt;br /&gt;&lt;br /&gt;MFT puts patient care at its heart and recruits staff that are open, honest and focused on striving for excellence.&lt;br /&gt;&lt;br /&gt;MFT has built an enviable international reputation on five unwavering principles for clinical excellence, research and development, teaching, learning and for treating patients with compassion, respect and dignity.&lt;br /&gt;&lt;br /&gt;The hours of the service are from 8am until 10pm over 7 days and a variety of shift patterns will be available. &lt;br /&gt;&lt;br /&gt;If you are a already a 1st level registered general nurse or due to compete your training in the next few months, please contact us with any questions or come over for an informal visit.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameJane SysonJob titleDistrict Nurse Team LeaderEmail addressJane.syson@mft.nhs.ukTelephone number07791347970Additional contact information&lt;/p&gt;\n&lt;p&gt;Jane Syson Nurse Team leader&lt;/p&gt;\n&lt;p&gt;07791347970&lt;/p&gt;\n&lt;p&gt;Debbie Smith&lt;/p&gt;\n&lt;p&gt;0161 470 7826&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Manchester University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121137"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wythenshawe Town, Manchester", "postalCode": "M22 5RG"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3789", "longitude": "-2.2608"}}, "title": "Community Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251600", "validThrough": "2020-11-16T23:59:59+0000"}