{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "42712", "minValue": "36070", "unitText": "YEAR", "value": "£36,070 - £42,712 per annum, Incl. HCAS"}}, "datePosted": "2020-11-02T14:31:07+0000", "description": "&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Senior Diagnostic Radiographer, Band 6&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;We have an exciting opportunity for an enthusiastic and highly skilled radiographer to join our forward-thinking and friendly clinical imaging service. The successful candidate will be working within the busy Clinical Imaging department at the West Middlesex University Hospital, as part of the Chelsea and Westminster NHS Foundation Trust. West Middlesex Hospital is situated on the river Thames close to the amenities of Richmond. There are excellent rail links to central London.&lt;/p&gt;\n&lt;p&gt;We are looking to recruit a radiographer with sophisticated communication skills and a patient-centred approach. Using your knowledge and experience you will support and improve patient care and service provisions to the department and Trust.&lt;/p&gt;\n&lt;p&gt;As a band 6 radiographer you will be expected to rotate through general X-ray, CT, mobiles and theatres. There will be opportunity to rotate through cardiac catheter labs, mammography and PACS. You will act as the co-coordinator and supervisor for the general x-ray department and therefore need a high level of confidence and competence in a wide range of radiographic procedures. Being a senior part of the team you will demonstrate a high level of initiative to support all staff and the values of the department and the Trust.&lt;/p&gt;\n&lt;p&gt;We are a teaching hospital and therefore you will interact with and teach radiography students and should demonstrate excellent communication skills and keep up to date with new techniques within radiography. At Chelsea and Westminster NHS Foundation Trust we are committed to staff development and offer a range of exciting opportunities to develop your skills. CPD is actively encouraged. We are also keen to facilitate continual professional development for staff with many available in-house training opportunities.&lt;/p&gt;\n&lt;p&gt;We offer a wide range of services and this is an excellent opportunity to develop your managerial skills and broaden your current skill base whilst working in a supportive team. Opportunities for post graduate studies and career progression in the department are available. Currently we have radiographers reporting in Axial/Appendicular and Fluoroscopy.&lt;/p&gt;\n&lt;p&gt;This role requires participation in the OOH rota and there will be opportunities for additional duties on a voluntary basis. The successful candidate may be required to work extended hours when necessary by the department.&lt;/p&gt;\n&lt;p&gt;This post is full time, alternatively, this could be offered as job share.&lt;/p&gt;\n&lt;p&gt;If you are interested in joining our West Middlesex Hospital radiographic team please contact us to discuss or arrange an informal visit.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameRupert PenwardenJob titleConsultant &amp; Superintendent Radiographer (X-ray &amp; Interventional)Email addressrupert.penwarden@chelwest.nhs.ukTelephone number0208-321-5985Additional contact information&lt;/p&gt;\n&lt;p&gt;Victoria Miller, CT Superintendent Radiographer, victoria.miller@chelwest.nhs.uk&lt;br /&gt;Anton Ivanic, Head of Imaging (WMUH), anton.ivanic@chelwest.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121244.png", "name": "Chelsea and Westminster Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121244"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "West Middlesex University Hospital, Isleworth", "postalCode": "TW7 6AF"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4741", "longitude": "-.326168"}}, "title": "Senior Diagnostic Radiographer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252430", "validThrough": "2020-11-15T23:59:59+0000"}