{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 pro rata"}}, "datePosted": "2020-10-27T12:46:45+0000", "description": "&lt;p&gt;Based at York Hospital, and providing medicines to treat the Trust’s cancer patients, this SATO post requires a highly motivated individual with excellent communication and organisational skills, to make a vital contribution to patient care.&lt;/p&gt;\n&lt;p&gt;The main duty of this role is the dispensing the chemotherapy for patients attending the York, Scarborough and Mobile Chemotherapy Units.&lt;/p&gt;\n&lt;p&gt;Candidates will need knowledge and understanding of health and safety. Knowledge of pharmacy and working in a hospital environment is desirable. The ability to work in a team environment or alone is essential. It is vital that candidates understand the needs of patients and other staff members. Candidates must be flexible to changing work routines, have good verbal and written communication skills. Effective time management and ability to work within time constraints is essential.&lt;br /&gt;&lt;br /&gt;The successful applicant will be required to contribute to the weekend and bank holiday rotas within the department and be involved in the ward top-up service.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Candidates must hold NVQ2 in Pharmacy Services or equivalent qualification.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Rachel Smith&lt;/p&gt;\n&lt;p&gt;Principal Pharmacy Technician&lt;/p&gt;\n&lt;p&gt;rachel.smith3@york.nhs.uk&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;It&#39;s not just the area that&#39;s a great draw.  In addition, as a member of our team you’ll have access to one of the most generous and comprehensive pension schemes in the UK, a minimum of 27 days annual leave (on top of Bank Holidays) and an award-winning package of staff benefits (see link on the right).&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "York Teaching Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120856"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "York", "postalCode": "YO31 8HE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.9706", "longitude": "-1.08365"}}, "title": "Senior Pharmacy Assistant - Cancer Services", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244602", "validThrough": "2020-11-10T23:59:59+0000"}