{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 pa"}}, "datePosted": "2020-10-28T13:29:25+0000", "description": "&lt;h1&gt;Pre-Operative Nurse Practitioner&lt;/h1&gt;\n&lt;h1&gt;&lt;strong&gt;Digestive Disease Clinical Business Unit.&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;An opportunity has arisen for experienced and motivated individual to undertake the above post as part of the Pre-operative Assessment Team at Warrington and Halton NHS Foundation Trust. The successful candidate will provide a specialist pre-operative service to all surgical specialties.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The pre-operative assessment service is nurse lead and therefore clinical examination (heart and chest) and ECG interpretation &lt;strong&gt;is essential&lt;/strong&gt; for this role. Other duties include:- assessing patient’s and liaising with other members of the multi-disciplinary team in planning for admission and discharge.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The role requires you to be an experienced pre-op assessment nurse who is a team player, working effectively alongside a wide range of professionals, as well as working autonomously. You should have a holistic approach to care and the advanced nursing skills to assess and evaluate patients’ suitability for the various forms of anaesthesia.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We’re looking for either a Band 6 pre-operative assessment nurse who is looking for a change or alternatively a Band 5 Pre-operative assessment nurse who is working towards a Band 6 role with the required knowledge and skills already &lt;strong&gt;(clinical examination skills are essential)&lt;/strong&gt;. Evidence of continuing professional development is a requisite for the post and a degree would be desirable, but not essential.&lt;/p&gt;\n&lt;p&gt;This Trust is an equal opportunities employer and welcomes applications from&lt;/p&gt;\n&lt;p&gt;people with disabilities, from ethnic minorities and all other social groups. We&lt;/p&gt;\n&lt;p&gt;operate Family Friendly and Career Break policies&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Trust operates a Smoke Free Policy which does not permit smoking within the Trust premises and grounds/site.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121088.png", "name": "Warrington and Halton Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121088"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Runcorn", "postalCode": "WA7 2DA"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3233", "longitude": "-2.69459"}}, "title": "Pre-Op Nurse Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246765", "validThrough": "2020-11-25T23:59:59+0000"}