{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51069", "minValue": "32478", "unitText": "YEAR", "value": "£32,478 - £51,069 per annum"}}, "datePosted": "2020-11-06T11:46:29+0000", "description": "&lt;p&gt;Surrey &amp; Sussex Healthcare NHS Trust are seeking to appoint a Clinical Fellow post in Respiratory Medicine at middle grade level (ST3 or above) for a period of 1 year. The post would ideally suit a post-CMT level doctor, for example one who has achieved PACES and wishes to gain further medical experience and skills before considering their next career move, or one who has Part 1 and 2 Membership examination and is studying for PACES.&lt;/p&gt;\n&lt;p&gt;These innovative posts bring together educational opportunities, specialist experience and the delivery of enhanced continuity of care and seven day services for our patients.&lt;/p&gt;\n&lt;p&gt;The successful applicant has the unique opportunity to gain a Postgraduate Certificate in Internal Medicine during the appointment, with full funding from HEE- KSS and protected research time. This qualification assures 60 credits towards the 180 credits required for the Masters degree in Internal Medicine recently developed at Brighton and Sussex Medical School. The post also provides additional opportunities for CV enhancement by participation in national and local Respiratory audit, quality improvement and clinical research projects.&lt;/p&gt;\n&lt;p&gt;We are looking for an applicant with experience in General Internal Medicine at CMT or equivalent level. They must be interested in Respiratory Medicine. They should possess the abilities and professional skills to work well in a multi-professional team environment. The post-holder will have designated educational supervisors and JRCPTB e-Portfolio access for completion of formative and summative SLEs and curriculum&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please contact the Respiratory/General Medicine team:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Dr Kofi Nimako &lt;/strong&gt;&lt;strong&gt;k.nimako@nhs.net&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Dr Ben Mearns &lt;/strong&gt;&lt;strong&gt;ben.mearns@nhs.net&lt;/strong&gt;&lt;strong&gt; (01737 768511 x 1666)&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Surrey and Sussex  Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120733"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "East Surrey Hospital, Redhill", "postalCode": "RH1 5RH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2186", "longitude": "-.161262"}}, "title": "Clinical Fellow in Internal &amp; Respiratory Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259487", "validThrough": "2020-11-20T23:59:59+0000"}