{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "32203", "minValue": "26883", "unitText": "YEAR", "value": "£26,883 - £32,203 per annum (pro rata)"}}, "datePosted": "2020-10-28T13:01:09+0000", "description": "&lt;p&gt;&lt;span&gt;We welcome and encourage applications from everyone, including groups currently underrepresented in our workforce and pride ourselves as being an employer of choice.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;To find out more about how we champion diversity and inclusion in the workplace, visit PHE Website &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;On 18 August 2020, the Secretary of State for Health and Social Care announced plans to establish the National Institute for Health Protection and consult on the best future options for strengthening health improvement and other public health functions in the wider system. Public Health England and many of its employees will be in scope for transition to new organisations in Spring 2021. Any new or current employees working for Public Health England during this time, will receive appropriate communications and consultation prior to any formal transfer taking place.  Employees who compulsorily transfer to successor bodies will remain on their existing contractual terms and conditions and this applies both to current employees and those recruited during the transition.  The recruitment, growth &amp; development of our workforce is vital for the continuing success of PHE and the future National Institute for Health Protection.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Open to all external applicants (anyone) from outside the Civil Service (including by definition internal applicants).&lt;/p&gt;\n&lt;p&gt;PHE has an international reputation for excellence in the field of global public health and views its international work as a high priority. PHE’s global public health work aims to protect and improve health in England, contribute to improving health globally, reduce global health inequalities, and strengthen PHE’s role as a global leader in public health.&lt;/p&gt;\n&lt;p&gt;As part of this work, PHE has a number of global public health programmes and projects. One of PHE’s biggest international programmes is the International Health Regulations Strengthening Programme. This Official Development Assistance (ODA) funded project is designed to strengthen public health systems in selected countries and regions.&lt;/p&gt;\n&lt;p&gt;There are currently two vacant Project Support Administrator posts within the IHR Programme Core Team, available on a fixed term basis initially until 31st march 2021.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are looking for…&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for dynamic and motivated individuals who must be flexible, have excellent administrative expertise, and experience in maintaining systems, policies and procedures. Successful applicants must also be able to regularly interact with stakeholders and colleagues. A track-record of delivering good quality work, attention to detail and exceptional organisational skills are essential. He/she must be able to work effectively both independently and as part of the wider global operations team. A background knowledge of Global Public Health is also desirable.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The post holder will…&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The IHR Project administrators will support the IHR Programme team to fulfil and facilitate the Programme’s objectives. This role will not only work across the IHR team and wider Global Public Health (GPH) department, but will also involve supporting a number of other contributors to the IHR Programme from across PHE. This important role will involve being a key point of contact for many critical operational arrangements across the programme, including visa applications, travel bookings, meeting coordination, note taking, diary management, and liaison with international stakeholders.&lt;/p&gt;\n&lt;p&gt;Typical tasks would include:&lt;/p&gt;\n&lt;ol&gt;\n&lt;li&gt;Daily administrative/logistical support to the IHR Programme Team&lt;/li&gt;\n&lt;li&gt;Making necessary arrangements for IHR staff deploying abroad including booking travel and accommodation, visa applications, arranging in country transport with other government departments, and managing/processing expenses and time carding&lt;/li&gt;\n&lt;li&gt;Organisation of pre-departure training of PHE staff and compilation of briefing packs&lt;/li&gt;\n&lt;li&gt;Maintenance of databases for project activities, and assistance in the generation of meeting reports, presentations and project updates&lt;/li&gt;\n&lt;li&gt;Diary management for the programme senior leadership team&lt;/li&gt;\n&lt;/ol&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameSamuel CollinsJob titleIHR Project ManagerEmail addressSamuel.collins@phe.gov.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/127774.jpg", "name": "Public Health England", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127774"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wellington House, London", "postalCode": "SE1 8UG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5018", "longitude": "-.10881"}}, "title": "IHR Project Administrator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246689", "validThrough": "2020-11-11T23:59:59+0000"}