{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 per annum"}}, "datePosted": "2020-10-21T16:16:20+0100", "description": "&lt;p&gt;The Northamptonshire Specialist Perinatal Mental Health Service is excited to be expanding in line with the NHS Long Term Plan ambitions for Perinatal Mental Health. We are excited to be able to recruit a Band 4 support worker who will work as part of the team supporting clinical staff, women and their families. The post holder will also undertake physical health checks to include ECG&#39;s, phlebotomy, side effect monitoring and other procedures as required.&lt;/p&gt;\n&lt;p&gt;The Service operates across the county, with office bases in Northampton and Rushden. Women are seen in children’s centres, their homes and community settings as well as hospitals on occasion. The team provides assessment and intervention to women experiencing or at an increased chance of experiencing moderate to severe mental health conditions during pregnancy and up to 12 months postpartum. The service works closely with Maternity, Health Visiting, GP’s, statutory community services and 3rd sector organisations.&lt;/p&gt;\n&lt;p&gt;The Long Term Plan Ambitions include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Increasing provision of services to women experiencing or at risk of experiencing moderate to severe perinatal mental health conditions&lt;/li&gt;\n&lt;li&gt;Increasing the provision of psychological interventions to women and their families&lt;/li&gt;\n&lt;li&gt;Assessment and signposting of fathers and partners of women open to the service&lt;/li&gt;\n&lt;li&gt;Providing specialist perinatal interventions to a number of mothers, where clinically indicated, up to 24 months postpartum&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Experience of working in the Perinatal Mental Health field is desirable as is knowledge of Perinatal Mental Health Conditions, prevalence rates, treatment interventions and Safeguarding Policies and Procedures. A keen interest and passion for working with women and their families is a must, as is the ability to work closely with a range of professionals from health visiting, Maternity, Children’s Services and the Third Sector.&lt;/p&gt;\n&lt;p&gt;There will be opportunities for further training via local and regional delivered training programmes. We have strong links with the East Midlands Regional Perinatal Network.&lt;/p&gt;\n&lt;p&gt;We have developed an exciting induction programme to meet the Perinatal Competency Framework and provide regular supervision and training for all our staff.&lt;/p&gt;\n&lt;p&gt;The service has quickly mobilised during Covid-19 to offer video assessment and consultation in addition to face to face working.&lt;/p&gt;\n&lt;p&gt;If you want to work as part of our expanding specialised multi-professional team, we want to hear from you.&lt;/p&gt;\n&lt;p&gt;NHFT welcomes applications from people, regardless of age, disability, gender, gender reassignment, race, religion or belief, sexual orientation, marital or civil partnership status or pregnancy or maternity status.&lt;/p&gt;\n&lt;p&gt;We would encourage applications from groups who are currently underrepresented in the organisation. In particular, applications from disabled people (with both visible and non-visible disabilities), people from black and minority ethnic communities and lesbian, gay, bisexual or transgendered (LGBT) people.&lt;/p&gt;\n&lt;p&gt;NHFT is committed to building a diverse workforce, ensuring staff are treated fairly at work and ensuring all staff have the learning and development they need on equality in order to undertake their job role.&lt;/p&gt;\n&lt;p&gt;We aim to use monitoring information provided by our staff and by job applicants to ensure that we do not discriminate in employment and to use this information to plan any Positive Action to address inequality.&lt;/p&gt;\n&lt;p&gt;NHFT supports three staff equality networks to help us to develop our equality practice, as well as providing peer support for staff. These are:&lt;/p&gt;\n&lt;p&gt;NHFT Staff Disability &amp; Allies Network&lt;/p&gt;\n&lt;p&gt;NHFT BME Staff Development Network&lt;/p&gt;\n&lt;p&gt;NHFT LGBT &amp; Allies Network&lt;/p&gt;\n&lt;p&gt;Please ensure you read the job description and person specification attached and that your supporting information reflects the relevant skills and experience you have, as your application will be shortlisted against these criteria.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameNadia GroverJob titleOperational ManagerEmail addressnadiagrover@nhft.nhs.ukTelephone number01604 657735&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Northamptonshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121219"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Campbell House, Northampton or Rectory Road Clinic, Rushden, Northampton", "postalCode": "NN1 3EB"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.2411", "longitude": "-.896195"}}, "title": "Perinatal Mental Health Support Worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916237245", "validThrough": "2020-11-08T23:59:59+0000"}