{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "74661", "minValue": "40037", "unitText": "YEAR", "value": "£40,037 - £74,661"}}, "datePosted": "2020-10-30T12:16:11+0000", "description": "&lt;p&gt;University Hospitals of North Midlands NHS Trust&lt;br /&gt;&lt;br /&gt;Certificate of Eligibility of Specialist Registration (CESR) Rotations in Emergency Medicine&lt;br /&gt;&lt;br /&gt;We are seeking dynamic individuals who will form part of our expanding Emergency Department team to enable us to deliver the highest quality emergency care. We are advertising physician-specific CESR rotations based at University Hospitals of North Midlands. The post is intended to provide the clinician with the support and training required to successfully complete all aspects of the CESR process. It will be possible to provide specific three month secondment-style modules to address relevant educational and competency needs. Secondments include Anaesthesia, ITU, Acute Medicine and Paediatrics.&lt;br /&gt;&lt;br /&gt;The University Hospital of North Midlands NHS Trust (UHNM) was created on 1 November 2014 following the integration of Stafford Hospital (part of the former Mid Staffordshire NHS Foundation Trust) with the University Hospital of North Staffordshire. Serving around three million people across Staffordshire and North Wales, UHNM is one of the largest hospital trusts in the country. Its 10,000 strong workforce provides the full range of emergency treatment, planned operations and medical care from the two hospitals in Stafford (County Hospital) and Stoke-on-Trent (Royal Stoke University Hospital).&lt;br /&gt;&lt;br /&gt;In March 2012, the Royal Stoke University Hospital became a Major Trauma Centre, serving Staffordshire, Shropshire and part of Cheshire. The Trust’s catchment area has now expanded to serve a population of 2.25 million people with the additional three Trauma Units in North Wales providing a large, sustainable major trauma network.&lt;br /&gt;&lt;br /&gt;The £370m state-of-the-art hospital complex opened in March 2012 bringing all acute services (including Neurosurgery and Cardiothoracic Surgery) to a single site. The new Emergency Department offers modern facilities including state of the art diagnostics, an 8 bedded resus and CT scanner within 20 meters of the helipad and a co-located Children’s Emergency Department and Assessment Unit.&lt;br /&gt;&lt;br /&gt;County Hospital has recently opened a brand new Children’s Emergency Centre. The centre, which is specifically available for children, offers urgent medical care and advice from a team specialising in both Emergency Medicine and Paediatrics. The Adult Emergency Department is undergoing a redesign over the next 18 months to provide a fantastic, modern Emergency Department for the population of South Staffordshire.&lt;br /&gt;&lt;br /&gt;More than 160,000 patients attend our Emergency departments. The post holder will be expected to work with other members of the Emergency Medicine Team to provide first class clinical care in Adult and Paediatric Emergency Medicine. You will provide clinical leadership, including delivery of the Clinical Quality Indicators for Emergency Medicine. You will be expected to supervise and teach junior medical staff and nurse practitioners.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;br /&gt;Dr Victoria Burnham, Consultant Lead for CESR on 01782 674412 (ED Secretaries)&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University Hospitals of North Midlands NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122653"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "UHNM, UHNM", "postalCode": "ST4 6QG"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.004", "longitude": "-2.21487"}}, "title": "CESR specialty doctor A&amp;E", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250106", "validThrough": "2020-11-13T23:59:59+0000"}