{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "76751", "minValue": "41158", "unitText": "YEAR", "value": "£41,158 to £76,751 pa"}}, "datePosted": "2020-10-22T13:00:33+0100", "description": "&lt;p&gt;&lt;span&gt;Specialty Doctors in Ophthalmology &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Job Type: Permanent &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Closing date: 3&lt;/span&gt;&lt;span&gt;rd&lt;/span&gt;&lt;span&gt; December 2020&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Interview date: TBC &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Barnsley Hospital NHS Foundation Trust &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are looking for enthusiastic Specialty Doctors to assist with the day-to-day running of our newly established and busy Ophthalmology Department.  You will be rewarded with an excellent professional and personal experience.  Help will be available for candidates wishing to be included into the Specialist Register.  These are permanent posts and the job attracts 10 PAs per week.  Candidates who prefer a part time commitment are also welcome to apply. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This is a very exciting time to join the Ophthalmology Department at Barnsley Hospital NHS Foundation Trust as the Trust has recently been awarded the contract by Barnsley Clinical Commissioning Group to deliver an Ophthalmology Service in Barnsley.  The Trust plans to significantly invest in the redesign of the Ophthalmology Service over the next three years in order to deliver an efficient, patient-centred, one-stop service in partnership with other local Providers. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The successful candidates will have Ophthalmic experience and demonstrate a good grounding in general Ophthalmology.  Experience in cataract surgery would be advantageous.  The posts will provide an opportunity to develop a sub-speciality interest in Medical Retina, Paediatric Ophthalmology and Strabismus as well as Cataract Surgery.  Candidates with training in other complementary sub-specialities, however, are also welcome. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;If you would like to know more about the department or arrange an informal visit, please contact: Miss Anne-Marie Firan, Clinical Lead and Consultant Ophthalmologist 01226 432156&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Barnsley Hospital NHS Foundation Trust is committed to promoting equality of opportunity and fair treatment to all applicants regardless of race, nationality, ethnic origin, gender, marital status, mental or physical disability, religion or belief, sexual orientation, age or offending history.  PLEASE NOTE: all correspondence regarding this vacancy and the interview process will be sent by e-mail. Therefore, you are advised to check your emails/NHS Jobs account regularly following the closing date.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; To speed up the recruitment process please ensure that your references are appropriate and where possible you have provided an email address and telephone number. The Trust is committed to safeguarding adults and children therefore if the post is subject to the Rehabilitation of Offenders Act (ROA) 1974 (Exceptions) Order 1975 (as amended) the successful candidate(s) will be subject to a criminal records check with the Disclosure and Barring Service (DBS). The cost of the DBS must be met by the successful candidate(s) through salary deduction. DBS charges for adverts placed from 1st June are as follows: Standard Check: £26.00 + Administration cost of £3.69 = deduction from salary as a one off payment Enhanced Check: £44.00 + administration cost of £3.69 = £14.69 deduction from 1st months salary, £11.00 deduction from salary over following 3 months.&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120802.png", "name": "Barnsley Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120802"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Barnsley", "postalCode": "S75 2EP"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5583", "longitude": "-1.49958"}}, "title": "Specialty Doctor", "url": "https://www.jobs.nhs.uk/xi/vacancy/916238531", "validThrough": "2020-12-03T23:59:59+0000"}