{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "38081", "minValue": "38081", "unitText": "YEAR", "value": "£38,081"}}, "datePosted": "2020-10-26T12:17:26+0000", "description": "&lt;p&gt;&lt;span&gt;Are you an experienced Charge Nurse or a Registered Nurse looking for a new opportunity to work in an organisation that will help you to develop and achieve your goals to become the best you can be? If so, you’re in luck! Join our team at Stanley house in Bosbury which is a stones throw away from Ledbury!&lt;br /&gt; &lt;br /&gt;Your career within Elysium will be enjoyable and rewarding as you develop specialist skills and make a real difference for some of the most vulnerable people in society. &lt;br /&gt; &lt;br /&gt;It’s a career that you can take pride in and enjoy. It’s what delivering great healthcare should feel like.&lt;/span&gt; &lt;span&gt;&lt;br /&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;What you will be doing&lt;/span&gt;&lt;/strong&gt;&lt;/span&gt; &lt;span&gt;&lt;br /&gt;With previous experience from the NHS or private care, you will provide high-quality care and support to people with progressive neurological conditions, while also supporting your colleagues and promote good teamwork.&lt;br /&gt;&lt;br /&gt;As a Charge Nurse, you’ll lead and coordinate the quality and management of nursing care and delivering of clinical services.&lt;br /&gt;No two days are the same, with plenty to keep you engaged and motivated, but also a good amount of routine.  &lt;/span&gt; &lt;span&gt;&lt;br /&gt;You will have access to the Elysium Wellbeing team, which is on hand to keep you feeling great; be it a chat, massage or group activities. Who doesn’t like a free massage at work?&lt;/span&gt; &lt;span&gt;&lt;br /&gt;There are also career development opportunities, with a huge range of courses that will help you grow and succeed. If you have the aspiration, capability and dedication, we can give you the support and opportunities to help you achieve your career goals.&lt;/span&gt; &lt;span&gt;&lt;br /&gt;Things that you will have&lt;/span&gt; &lt;span&gt;&lt;br /&gt;•A relevant nursing qualification and registration&lt;br /&gt;•A positive attitude and be naturally caring and compassionate&lt;br /&gt;•A commitment to high-quality care and to values and evidence-based practice&lt;br /&gt;•Relevant experience in a similar environment.&lt;br /&gt;•Proven track record of leadership skills.&lt;/span&gt; &lt;span&gt;&lt;br /&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Where you will be working&lt;/span&gt;&lt;/strong&gt;&lt;/span&gt; &lt;span&gt;&lt;br /&gt;Location: Bosbury, Hereford, Herefordshire, HR8 1HB&lt;/span&gt; &lt;span&gt;&lt;br /&gt;You will be working at Stanley House, a service which offers a multidisciplinary approach to its long term care provision and provides the specialised care and expert therapeutic interventions.&lt;/span&gt; &lt;span&gt;&lt;br /&gt;Working as part of the multidisciplinary team, you will support and enable residents to undergo reviews of their specific and/or changing needs. Stanley House offers therapies and activities which include Physiotherapy and Art therapy and receives input from a Professor in Neuropsychiatry and monthly specialist GP clinics.&lt;/span&gt; &lt;span&gt;&lt;br /&gt;This role will require you to work 37.5 hours per week Monday – Friday including on-call duties.&lt;/span&gt; &lt;span&gt;&lt;br /&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;What you will get &lt;/span&gt;&lt;/strong&gt;&lt;/span&gt; &lt;span&gt;&lt;br /&gt;•Annual salary of £38,081&lt;br /&gt;•The equivalent of 33 days annual leave – plus your birthday off!&lt;br /&gt;•Free meals and parking&lt;br /&gt;•Wellbeing support and activities&lt;br /&gt;•Career development and training&lt;br /&gt;•Pension contribution&lt;br /&gt;•Life Assurance&lt;br /&gt;•Enhanced Maternity Package&lt;br /&gt;•Flexible working opportunities&lt;/span&gt; &lt;span&gt;&lt;br /&gt;There is also a range of other benefits including retail discounts and special offers, car leasing without a credit check, holiday financing and much more.&lt;/span&gt; &lt;span&gt;&lt;br /&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;About your next employer&lt;/span&gt;&lt;/strong&gt;&lt;/span&gt; &lt;span&gt;&lt;br /&gt;You will be working for an established, stable and agile company with a unique approach to the delivery of care.  &lt;br /&gt;Each and every employee is valued and supported, as everyone has an important role to play in the success of Elysium. It is only with the dedication, passion and hard work from staff that excellent care programs that truly benefit the service users can be delivered.&lt;/span&gt; &lt;span&gt;&lt;br /&gt;With a network of over 70 services across England and Wales, providing four services including: Mental Health, Neurological, Learning Disabilities &amp; Autism, Children &amp; Education, there is opportunity for you to grow and move with Elysium.&lt;br /&gt;Elysium Healthcare follows safer recruitment of staff for all appointments.&lt;/span&gt; &lt;span&gt; &lt;/span&gt; &lt;span&gt;&lt;span&gt;It is a requirement that all staff understand it is each person’s individual responsibility and are committed to promoting and safeguarding the welfare &lt;/span&gt;&lt;span&gt;of service users. Candidates will be subject to an Enhanced DBS disclosure.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Elysium Healthcare", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133794"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bosbury", "postalCode": "HR8 1HB"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.0857", "longitude": "-2.46114"}}, "title": "Lead Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242397", "validThrough": "2020-12-31T23:59:59+0000"}