{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62001", "minValue": "53168", "unitText": "YEAR", "value": "£53,168 - £62,001 per annum"}}, "datePosted": "2020-10-26T14:46:52+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;em&gt;Are you looking to develop your leadership skills in an exciting new role within critical care? &lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;A rare opportunity has arisen for an innovative and strategically minded individual to clinically lead and develop therapy services within critical care in Cardiff and Vale UHB. &lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Critical Care services are currently located across two sites and form part of an inclusive and collaborative All wales Critical Care Network. The service &lt;/em&gt;&lt;em&gt;supports a number of regional tertiary services including major trauma, neuro-critical care, spinal injuries, haem-oncology, maxillo-facial, vascular, thoracic and upper gastro-intestinal surgery. &lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;It has recognised expertise in advanced respiratory support and has aspirations to offer extra-corporeal oxygenation therapies in the future. There is an established long term ventilation service in University Hospital llandough, which accepts referrals from across Wales and further afield in England.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;The University Hospital of Wales will become the first Major Trauma Centre to launch within Wales in Sept 2020. It will play a key role in leading the way in delivering specialist trauma care. &lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Therapists working within critical care seek to enhance patient clinical and functional outcomes across the whole critical care pathway, in addition to improving the experience of patients, their families and working collaboratively with staff from other UHB&#96;s , across the Network. &lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;The post holder will provide expert clinical leadership to support the delivery of therapy across the critical care pathway. The role is responsible for ensuring the delivery of high quality, safe care and will support the development of clinical pathways within the health board and work collaboratively with other UHB&#96;&#96;s across the All Wales Critical Care Network, through expert knowledge, clinical leadership, research and education.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;The successful person will have excellent communication and influencing skills, a broad experience of working across the whole critical care pathway, supporting education and development of staff, in leading research and have worked successfully with a range of professionals and patients. You will be able to work on your own as well as within a multi-disciplinary team. You will hold a case load and need to be able to plan, deliver and monitor interventions and to communicate sensitively and effectively.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;In return, we are highly committed to staff education and development and you will have opportunities to lead research. We welcome enquiries and encourage you to visit to find out more.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;The ability to speak Welsh is desirable for this post; Welsh and/or English speakers are equally welcome to apply.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Closing date: 15th November 2020&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Emma Cooke, Head of Physiotherapy, 029 20742315 emma.cooke@wales.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123193.jpg", "name": "Cardiff and Vale University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123193"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "UHB wide, Cardiff", "postalCode": "CF14 4XW"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5068", "longitude": "-3.18937"}}, "title": "Consultant Therapist for Critical Care", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242967", "validThrough": "2020-11-15T23:59:59+0000"}