{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum, pro rata"}}, "datePosted": "2020-11-06T11:46:48+0000", "description": "&lt;p&gt;Ever wanted to learn another Language?&lt;/p&gt;\n&lt;p&gt;Do you have the leadership and teamworking skills, to join our dedicated team?&lt;/p&gt;\n&lt;p&gt;Can you empower and support Deaf service users and promote their recovery?&lt;/p&gt;\n&lt;p&gt;An opportunity has arisen for a motivated Registered Mental Health Nurse to be appointed upon Jasmine Suite.&lt;/p&gt;\n&lt;p&gt;We have a passionate and dedicated mixture of highly experienced Deaf , Deafened and Hearing staff within our team.&lt;/p&gt;\n&lt;p&gt;You will require excellent leadership skills and the ability to adapt to the Deaf environment upon a specialist mental health inpatient ward..&lt;/p&gt;\n&lt;p&gt;Communication skills and a willingness and motivation to embrace sign language as the service users first language is essential.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be required to attend Level 1 &amp; 2 BSL training . This is completed in house by all of our permanent staff.&lt;/p&gt;\n&lt;p&gt;Deaf awareness and experience of Deaf culture is desirable upon application, along with any level of British Sign Language (BSL) certification.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;About Our Service&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;The National Deaf Mental Health Service was established in 1993 and known as Denmark House. A National Deaf Service which comprises of a day service and a community team was established.&lt;/p&gt;\n&lt;p&gt;Operating from the Barberry since 2008 our 12 bedded mixed gender ward provides admission for Deaf, Deafened and Deaf/blind people with a mental disorder requiring in-patient treatment.&lt;/p&gt;\n&lt;p&gt;The National Deaf Mental Health Service aims to provide high quality services utilising resources effectively, ensuring that Deaf service users, relatives and carers are given the highest standard of care.&lt;/p&gt;\n&lt;p&gt;The service aims to advise, support and work with other services and organisation’s. This is by ensuring timely, accessible and equitable assessment and care is provided to Deaf service users. We are NHS England funded and accept referrals from across the country.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameGrant BudgeJob titleWard ManagerEmail addressgrant.budge@nhs.netTelephone number01213012465Additional contact information&lt;/p&gt;\n&lt;p&gt;Please inform us if you will be in attendance with an interpreter/translator, or if you require support facilitating.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Birmingham and Solihull Mental Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120844"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Barberry Centre for Mental health, Birmingham", "postalCode": "B15 2FG"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4507", "longitude": "-1.93568"}}, "title": "Band 5 Staff Nurse - Jasmine Ward, The Barberry", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259500", "validThrough": "2020-11-22T23:59:59+0000"}