{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "60587", "minValue": "54389", "unitText": "YEAR", "value": "54389  - 60587  GBP per year"}}, "datePosted": "2020-11-04T12:25:19+0000", "description": "&lt;p&gt;We have an exciting opportunity for a sonographer to join our team in Jersey. The work is interesting and varied but does not include any obstetric scanning.&lt;/p&gt;\n&lt;p&gt;Jersey is situated in the English Channel and it boasts many local Heritage sites and some of the world’s finest beaches. Due to the mild climate walking, cycling, numerous water sports and many other outdoor pursuits are all on your doorstep. It is a very safe island for families.&lt;/p&gt;\n&lt;p&gt;The successful applicant must have experience in a wide range of ultrasound examinations and participation in the ultrasound on call service is required.&lt;/p&gt;\n&lt;p&gt;We are QSI accredited which brings many opportunities and we aim to deliver excellent patient care.&lt;/p&gt;\n&lt;p&gt;A relocation package is available to successful off island applicants.&lt;/p&gt;\n&lt;p&gt;If you would like an informal discussion about the role, please send your telephone number by email to John Bayford at j.bayford@health.gov.jeand tell us when it is best for us to call you back.&lt;/p&gt;\n&lt;p&gt;In making an application for this role, you should note that the Government of Jersey is in the process of restructuring to modernise how we deliver public services. As we work to ensure we have the right structure for the future, we will also be reviewing our (HR) people policies and total reward structures (pay and other terms and conditions) to provide parity across all pay groups&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Health and Community Services Jersey", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=135055"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St Helier", "postalCode": "JE1 3QS"}, "geo": {"@type": "GeoCoordinates", "latitude": "49.1833", "longitude": "-2.1"}}, "title": "Sonographer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255818", "validThrough": "2020-12-04T23:59:59+0000"}