{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62001", "minValue": "53168", "unitText": "YEAR", "value": "£53,168 to £62,001 pa + HCA where applicable"}}, "datePosted": "2020-10-29T16:00:33+0000", "description": "&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Here at NHS Blood and Transplant, we are about to begin our most ambitious programme of change ever. Information Governance (IG) will be a significant consideration throughout our organisation-wide transformation. Leading and managing IG and records management, you will be integral to the success of all manner of changes. Yours will be a pivotal role in our vital mission to save and improve lives.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Taking a leading role on shaping the direction of change to meet the upcoming General Data Protection Regulation (GDPR), you will be recognised at Executive and Board level. Frontline staff, managers and the Board will all rely on expert advice, so you will forge a culture of partnership working with the IG team. Engaging with a broad spectrum of teams, you will be responsible for the strategic development, implementation and maintenance of high-quality IG - from policy, to systems and practice. You will ensure that every area of activity, at every level, takes account of IG requirements, and takes any necessary steps to achieve full compliance.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;To be equal to the challenge, you will need extensive knowledge and experience of IG, ideally within an NHS context. You will be fully conversant with IG related policy and legislation including GDPR, Caldicott, Freedom of Information and records management. A driven and forward-thinking leader, you have a significant track record of delivering information strategy, horizon scanning, policy development and implementation. Equally important will be your talent for engagement and relationship building. You have an excellent ability to communicate both complex and sensitive information to a wide range of people.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;In return, you will enjoy impressive benefits and our commitment to support you with ongoing development opportunities.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Please note that this role can be based at any of our national centres: Bristol, Colindale, Tooting, Manchester, Barnsley or Birmingham&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further information please contact Dan Jeffery at dan.jeffery@nhsbt.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Closing date for applications is 23:59hrs on Sunday 15 November 2020&lt;/p&gt;\n&lt;p&gt;Interviews will take place online on 01 December 2020 (subject to confirmation)&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NHS Blood and Transplant (NHSBT)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120628"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "National", "postalCode": "B15 2SG"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4528", "longitude": "-1.93523"}}, "title": "Head of Information Governance", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248955", "validThrough": "2020-11-15T23:59:59+0000"}