{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "23647", "minValue": "23647", "unitText": "YEAR", "value": "£23,647 p.a."}}, "datePosted": "2020-10-30T15:28:50+0000", "description": "&lt;p&gt;&lt;strong&gt;Senior Support Lead&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary: £23,647 p.a.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;37 hours per week &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for a Senior Support Lead, who is passionate about people and strives to make a difference, to join the In House Provider Services, Learning Disabilities. Experience of working with vulnerable people in care homes, community based or with people with learning disabilities and complex needs is essential.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will be a confident leader and team manager, with the ability to motivate and develop your staff to deliver person centred and focused support. You will have excellent communication and interpersonal skills, a friendly approach and the ability to work in an ever-changing environment.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;As an enthusiastic, motivated and organised person working together with the senior management team, you will help to create and maintain an excellent reputation for the in house services.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;As a Senior Support Lead, you will be responsible for assisting the Deputy Manager in the day-to-day running of the in house provider services. The successful candidate will have a designated service area of responsibility within Swindon Family Breaks or The Complex Behaviour Team and will provide support across all in house provider services where required.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Your key responsibilities will be as follows:&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Carry out routine service audits&lt;/li&gt;\n&lt;li&gt;Assist the delegation of workloads and care resources&lt;/li&gt;\n&lt;li&gt;Ensure effective inductions of all staff, together with supervision of trained staff, as well as providing mentorship and assessment of new care staff&lt;/li&gt;\n&lt;li&gt;Have the ability to make a positive change to the lives of individuals within the services&lt;/li&gt;\n&lt;li&gt;Support and manage a large, diverse staff team working across the in house services&lt;/li&gt;\n&lt;li&gt;Provide guidance and support to your team to ensure the highest levels of care and support are provided to the service users&lt;/li&gt;\n&lt;li&gt;Have an understanding of CQC regulations requirements and safeguarding&lt;/li&gt;\n&lt;li&gt;Promote independence through re-ablement and enablement to the people we support&lt;/li&gt;\n&lt;li&gt;Create and develop support plans and risk assessments&lt;/li&gt;\n&lt;li&gt;Use proactive and reactive strategies to manage the support of people who may challenge services&lt;/li&gt;\n&lt;li&gt;Create effective rotas, ensuring all needs are met&lt;/li&gt;\n&lt;li&gt;Hold regular team and core staff meetings&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This is a varied role and provides opportunities to work across the in house provider services. You will hold a Diploma Level 3 in Health &amp; Social Care or have extensive social care experience.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;An enhanced DBS disclosure will be required.  You must be fluent in the English language (as a requirement of Part 7 of the Immigration Act - for the effective performance of a customer-facing role).&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;em&gt;As part of the COVID19 strategy this role will be subject to regular covid19 testing, as per the guidance set out by the Department of Health and Social Care.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Please Note: flexible working including weekends and evenings as required.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing date: 15 November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Swindon Borough Council", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130035"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Swindon", "postalCode": "SN1 2JG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5602", "longitude": "-1.77996"}}, "title": "Senior Support Lead", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250740", "validThrough": "2020-11-15T23:59:59+0000"}