{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "66823", "minValue": "57990", "unitText": "YEAR", "value": "£57,990- £66,823 Per annum inclusive"}}, "datePosted": "2020-11-05T18:26:20+0000", "description": "&lt;p&gt;BHR are seeking to recruit a highly motivated Registered General Nurse who is currently practicing in the field of Infection Prevention and Control (IPC). This is an exciting new opportunity to work with the IPC Team and the Director of Infection Prevention and Control (DIPC) at Barking, Havering and Redbridge University Hospitals. The successful candidate must hold a recognised qualification in infection prevention; have significant clinical practice in this field with experience of working alongside an Infection Prevention Team.&lt;/p&gt;\n&lt;p&gt;The successful candidate will have a pivitol role in the development of the IPC service and offer specialist expert advice, in the field of IPC. The successful candidate will work both autonomously and as part of the IPC team across sites, striving to minimise risk from healthcare associated infection. The post holder will be responsible for, and lead, a team of Nurses and support staff.&lt;/p&gt;\n&lt;p&gt;You will support, develop and implement systems to improve the quality of IPC management, by the delivery of national directives to develop local quality, patient safety and safe systems of working for staff.&lt;/p&gt;\n&lt;p&gt;You will need to be self-motivated and have a flexible approach to work, have good organisational skills and the ability to influence others, acting as a role model across disciplines, and demonstrate excellent communication skills with good computer literacy.&lt;/p&gt;\n&lt;p&gt;You will provide clear leadership for the IPC team, influencing and improving the quality of care delivered to our patients supported by a team of Microbiologists, Infection Control Doctor (IPCD), team of IPC Nurses and Healthcare Support Staff.&lt;/p&gt;\n&lt;p&gt;All new staff appointed to posts at the Trust are subject to a probationary period. This will give the new staff member an opportunity to become familiar with the culture and working environment of the Trust. The post provides significant opportunities for development as an individual. This is a wonderful opportunity to be part of a developing, forward thinking and user facing department; which is an integral part of the clinical patient pathway and patient experience&lt;/p&gt;\n&lt;p&gt;You will be required to support the delivery of a high quality IPC service across all areas. Therefore you must have a flexible approach to work, demonstrating organisational skills and be able to work to deadlines. You will be required to have good communication skills at all times.&lt;/p&gt;\n&lt;p&gt;The role is an exciting opportunity for those individuals seeking challenges and stimulation. This post will provide the chosen candidate with a unique opportunity to work with an excellent team. Join our team and make a difference.&lt;/p&gt;\n&lt;p&gt;All new staff appointed to posts at the Trust are subject to a probationary period. This will give the new staff member an opportunity to become familiar with the culture and working environment of the Trust.&lt;/p&gt;\n&lt;p&gt;Applications should be made online, however, queries regarding the application process or assistance with the completion of the form (for applicants with a disability) can be made to Ashlyn Mathews, HR Recruitment Department, on 01708 435000 ext 2826. Further details regarding the post may be obtained by contacting the manager as per the contact details below&lt;/p&gt;\n&lt;p&gt;For further information, or to arrange an informal visit, please contact Sian Olivo, Deputy Director of Infection Prevention and Control on 01708 435000, Ext: 6217, e-mail sianolivo@nhs.net&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Barking, Havering and Redbridge University Hospitals Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120782"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Romford", "postalCode": "RM7 0AG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5686", "longitude": ".178941"}}, "title": "Band 8b Lead Nurse Infection Prevention and Control", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258772", "validThrough": "2020-11-19T23:59:59+0000"}