{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "42712", "minValue": "36070", "unitText": "YEAR", "value": "£36,070 - £42,712 Competitive Bank Rates"}}, "datePosted": "2020-11-03T17:15:57+0000", "description": "&lt;p&gt;&lt;strong&gt;BANK - Registered and Mental Health Nurses – Offender Care &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Central North West London NHS Foundation Trust&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Favourable BANK Rates &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Have you ever thought of expanding your clinical skills by working in an Offender Care environment? Are you looking for a challenge that is rewarding and offers flexible working pattern? Or are you interested in working for an organisation that will support you in your career development?&lt;/p&gt;\n&lt;p&gt;If the answer to these questions is yes, then we would love to hear from you.&lt;/p&gt;\n&lt;p&gt;It is an exciting time to start working with offender care with commissioners embracing new ways of working, multidisciplinary teams and investment in technology.&lt;/p&gt;\n&lt;p&gt;CNWL NHS Foundation Trust is looking to recruit Band 5, 6 and 7 General and Mental Health Registered Nurses to join our bank for HMP &amp; YOI Feltham and IRC Heathrow sites.&lt;/p&gt;\n&lt;p&gt;We are looking for enthusiastic, resilient and flexible candidates to help deliver the best care to our patients and make a real impact on promoting their health and wellbeing in a prison setting. The role is a fast-paced but very interesting with no one day being the same.&lt;/p&gt;\n&lt;p&gt;CNWL’s Offender Care Services are made up of highly motivated and passionate teams with vast experience in secure healthcare delivering health care in a range of settings; prisons, Immigration , secure hospital and in the community.&lt;/p&gt;\n&lt;p&gt;Our vision is to: “Work in partnership with the Criminal Justice System and other agencies, by being responsive, dependable and providing quality primary care, mental health and substance misuse services to existing offenders and those at risk of offending to improve their health status and to encourage social inclusion.”&lt;/p&gt;\n&lt;p&gt;We are looking for individuals who can support us make our vision a reality.&lt;/p&gt;\n&lt;p&gt;We also deliver service in the following sites and by joining our bank you may be able to book shift in the following prisons&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;HMP High down- Surrey&lt;/li&gt;\n&lt;li&gt;HMP Down view- Surrey&lt;/li&gt;\n&lt;li&gt;HMP Coldingley-Surrey&lt;/li&gt;\n&lt;li&gt;HMP Send-Surrey&lt;/li&gt;\n&lt;li&gt;HMPYOI Cookham Wood - Medway&lt;/li&gt;\n&lt;li&gt;HMP Bronzefield- Kent&lt;/li&gt;\n&lt;li&gt;HMP Woodhill- Buckinghamshire&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;IRC Heathrow (Colnbrook/ Harmondsworth) West Drayton&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;HMP &amp; YOI Feltham -Hounslow&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;All appointments are subject to successful prison or IRC vetting processes. Please read below for more information regarding the IRC vetting process.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Requirements for All Staff wishing to apply for Healthcare Roles at Heathrow Immigration Removal Centre (HIRC)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Please be aware that anyone wishing to work at &lt;strong&gt;HIRC&lt;/strong&gt; is required to undergo and successfully pass the following checks prior to being offered a substantive or bank role with CNWL at the HIRC.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Immigration Centre Security Checks&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Counter Terrorism Check (CTC) – several forms need to be completed for these checks which are carried out by Cataphract on behalf of CNWL. These forms are then submitted to the Home Office who will send you a link to complete an on-line questionnaire. On completion of this, security checks are undertaken by their various teams&lt;/p&gt;\n&lt;p&gt;You must be able to confirm that you have:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;been resident in the UK for 3 years immediately prior to your application for roles Band 5 and below&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;OR&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;been resident in the UK for 5 years immediately prior to your application for roles Band 5 and above&lt;/li&gt;\n&lt;li&gt;hold a British passport, EU passport or Commonwealth passport with a Biometric Residence Permit that has no restrictions and usually has “indefinite leave to remain”&lt;/li&gt;\n&lt;li&gt;Indefinite leave to remain in the UK&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Enhanced DBS – this is required as part of the CTC checks&lt;/p&gt;\n&lt;p&gt;Please note that CNWL currently pays for the cost of these checks for substantive and bank staff&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;CTC Renewal&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Your CTC clearance will expire after 5 years, so you will be asked to provide information to renew your existent clearance by Cataphract. Again, CNWL currently pays for this for substantive and bank staff.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameAnn-Marie CarterAdditional contact information&lt;/p&gt;\n&lt;p&gt;To get more information about bank roles or information about the sites please contact :-&lt;/p&gt;\n&lt;p&gt;Annemarie Carter – HM YOI Feltham , ann-marie.carter2@nhs.net, 02088445234&lt;/p&gt;\n&lt;p&gt;Rita Lankai-Lamptey – IRC Heathrow, rita.lankai-lamptey@nhs.net,&lt;/p&gt;\n&lt;p&gt;Stella Simpson – Regional Manager – Youth Custody stellasimpson@nhs.net, 07720809443&lt;/p&gt;\n&lt;p&gt;Susan Bell – Regional Manager – IRC’s, susan.bell2@nhs.susan.bell2@nhs.net&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "Central and North West London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120736"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "HMP Feltham/Heathrow IRC, Outer London", "postalCode": "TW13 4NP"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4417", "longitude": "-.434392"}}, "title": "Senior Staff Nurse - Bank Staff (Covid-19 Response)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254906", "validThrough": "2020-11-17T23:59:59+0000"}