{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "68891", "minValue": "60058", "unitText": "YEAR", "value": "£60,058 - £68,891 pa inc"}}, "datePosted": "2020-10-28T15:31:20+0000", "description": "&lt;p&gt;This is a unique opportunity to shape a newly established, senior role in the dynamic psycho-oncology team at Imperial College Healthcare NHS Trust. Our team is fully embedded in specialist cancer at Imperial, very well regarded by our MDT colleagues, with an active range of innovative and collaborative development projects. We benefit from the professional leadership and peer support within the wider Department of Clinical Health Psychology at St Mary&#39;s Hospital, and the full support &amp; development resources of Macmillan, Imperial and CNWL. Joining a team of three clinicians and a dedicated administrator, our new colleague will be energetic, enterprising and patient-centred, with a strong profile in clinical health psychology in a hospital context, and ideally cancer. They will be supporting the clinical lead, taking responsibility for aspects such as developing psychologically-informed cancer pathways, research &amp; third-sector collaborations, our extensive training program (including cancer staff, IAPT teams and speciality trainees in clinical and counselling psychology), policy development, and active clinical involvement with speciality teams at Hammersmith Hospital e.g. stem-cell transplantation and gynae-oncology.&lt;/p&gt;\n&lt;p&gt;Interview date:TBC&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDr Alex KingJob titleConsultant Clinical Psychologist in Psycho-oncologyEmail addressalex.king@nhs.netTelephone number020 3312 1658&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central and North West London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120736"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Imperial College Healthcare NHS Trust, London", "postalCode": "W2 1NY"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5171", "longitude": "-.174187"}}, "title": "Macmillan Clinical Psychologist (8b) – Psycho-oncology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247186", "validThrough": "2020-11-11T23:59:59+0000"}