{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "49325", "minValue": "43712", "unitText": "YEAR", "value": "£43,712 - £49,325 per annum inc HCAS pro rata"}}, "datePosted": "2020-11-03T10:01:00+0000", "description": "&lt;p&gt;Are you passionate about working with school-aged children and young people with complex needs? If you already have experience working in this area but want to further your clinical, leadership &amp; service development skills, then this could be the role for you.&lt;/p&gt;\n&lt;p&gt;We have an exciting opportunity for an experienced, enthusiastic and motivated physiotherapist to lead and develop our physiotherapy service for this group of children and young people.&lt;/p&gt;\n&lt;p&gt;The role will primarily involve working with a secondary special school for children and young people with profound and multiple learning disabilities, but also includes work with primary and secondary aged children attending other specialist and mainstream schools. The role will involve working in school and community clinics, as well as home visits.&lt;/p&gt;\n&lt;p&gt;You will be joining a friendly and supportive Paediatric Physiotherapy team. We work closely with our health colleagues in Ealing Children&#39;s Services, as well as with those in Education and Social Care as part of Ealing Services for Children with Additional Needs.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameRachel BruntonJob titleClinical Service Lead, Paediatric PhysiotherapyEmail addressrbrunton@nhs.netTelephone number02088258702&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central and North West London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120736"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Carmelita House, Ealing", "postalCode": "W5 2PJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5143", "longitude": "-.300322"}}, "title": "Highly Specialist Community Paediatric Physiotherapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253355", "validThrough": "2020-11-24T23:59:59+0000"}