{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum (pro rata)"}}, "datePosted": "2020-10-30T13:01:13+0000", "description": "&lt;p&gt;Would you like an opportunity to join a community based nursing team?&lt;/p&gt;\n&lt;p&gt;We would welcome applications from enthusiastic committed children’s nurses with proven clinical experience.&lt;/p&gt;\n&lt;p&gt;This post will be working across the city-wide special school nursing service implementing and delivering specialist nursing care in a special school environment. The successful candidate will be required to carry out assessments; provide both planned and responsive clinical care and ensure that local safeguarding policies are adhered to.&lt;/p&gt;\n&lt;p&gt;They will be identified as a role model for the Band 5 Special School Nurses and Enteral Feeding Assistants and will also support education staff and offer advice and support to parents and pupils.&lt;/p&gt;\n&lt;p&gt;We would therefore welcome applications from experienced nurses who have excellent communication skills and are able to manage their time effectively. An understanding of the needs of children and young people with disability and/or additional health problems is essential.&lt;/p&gt;\n&lt;p&gt;The children are aged from 2 ½ to 19 years and have a wide range of complex health needs. The successful candidate will be based within the special schools in Birmingham and must be able to travel during the working day.&lt;/p&gt;\n&lt;p&gt;Full training and support will be given.&lt;/p&gt;\n&lt;p&gt;An Enhanced DBS will be required for this post.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;IMPORTANT&lt;/strong&gt;&lt;/p&gt;\n&lt;ol&gt;\n&lt;li&gt;Please ensure you check your Trac account regularly as this is how we will communicate with you during the shortlisting and selection process&lt;/li&gt;\n&lt;li&gt;Please ensure all sections of the application form are completed fully. Please particularly ensure that you provide full details of all referees including business email address, telephone contact details and postal address.&lt;/li&gt;\n&lt;li&gt;Please be aware that BCHC utilises a third party recruitment system (TRAC). When applying via NHS Jobs, your submitted application will be imported into TRAC and any correspondence will be sent via TRAC. We advise that you check your junk/spam emails.&lt;/li&gt;\n&lt;/ol&gt;\n&lt;p&gt;&lt;strong&gt;Be Part of Our Team...&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Birmingham Community Healthcare NHS Foundation Trust (BCHC) has more than 5000 staff working across Birmingham and the West Midlands in a wide range of community nursing and specialist healthcare roles. BCHC delivers over 100 clinical services, in people&#39;s homes, health centres, clinics and inpatient facilities. We deliver a wide range of services for children, young people, parents and families as well as adults and community services, two community hospitals, services for people with learning disabilities, the internationally recognised West Midlands Rehabilitation Centre and one of Europe’s leading Dental Hospitals and School of Dentistry. We deliver all of this with a commitment to integrated, personalised care that is rooted in our local communities. We have an ambition to deliver outstanding, integrated care as one of the key NHS providers in the West Midlands.&lt;/p&gt;\n&lt;p&gt;If you want to ‘Be Part of Our Team’ and work with a Foundation Trust which is continuously striving for better care and healthier communities, we want to hear from you.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Hannah Dyson, Clinical Lead on 07792254977 or Charlotte Baily, Team Leader on&lt;/p&gt;\n&lt;p&gt;07894 327777&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/125654.jpg", "name": "Birmingham Community Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=125654"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "City Wide, Birmingham", "postalCode": "B13 8JL"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4459", "longitude": "-1.89289"}}, "title": "Band 6 Special School Nurses", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250293", "validThrough": "2020-11-13T23:59:59+0000"}