{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 Per annum, pro rata"}}, "datePosted": "2020-10-23T13:16:01+0100", "description": "&lt;p&gt;An exciting opportunity has arisen for Band 5 Nurses to work within the Corby and Kettering Planned Care &amp; Recovery Team within. (Formally known as CMHT)&lt;/p&gt;\n&lt;p&gt;We are seeking individuals who are enthusiastic, compassionate, flexible and creative in their approach and can work alongside nursing staff and the wider multi-disciplinary team to provide quality and effective care.&lt;/p&gt;\n&lt;p&gt;You will demonstrate an enthusiasm for professional development and will be motivated to further your understanding and skills through various training opportunities.&lt;/p&gt;\n&lt;p&gt;You will be part of a dynamic and supportive team, benefiting from a comprehensive supervision and appraisal system, with a commitment to staff development and evidence-based practice.&lt;/p&gt;\n&lt;p&gt;NHFT welcomes applications from people, regardless of age, disability, gender, gender reassignment, race, religion or belief, sexual orientation, marital or civil partnership status or pregnancy or maternity status.&lt;/p&gt;\n&lt;p&gt;We would encourage applications from groups who are currently underrepresented in the organisation. In particular, applications from disabled people (with both visible and non-visible disabilities), people from black and minority ethnic communities and lesbian, gay, bisexual or transgendered (LGBT) people.&lt;/p&gt;\n&lt;p&gt;Car owner/driver and current driving license essential or access to a car (unless you have a disability as defined by the Equality Act 2010)&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;For further information please contact Katy Tidy, Operations Manager on 01933 235444&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Northamptonshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121219"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St Mary&#39;s Hospital, Kettering", "postalCode": "NN15 7PW"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.3941", "longitude": "-.722184"}}, "title": "Mental Health Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240665", "validThrough": "2020-11-06T23:59:59+0000"}