{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "42712", "minValue": "36070", "unitText": "YEAR", "value": "£36,070 - £42,712 £34,961 - £42,010 pro rata pa in"}}, "datePosted": "2020-10-29T13:16:18+0000", "description": "&lt;p&gt;&lt;strong&gt;School Nurses Specialist Community Practitioner - Band 6 &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;0.72 wte term time only and all year round working considered &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Do you have the Specialist Community Public Health Nurse (SCPHN) qualification? Would you like to be part of a team delivering the 5-19 Healthy Child Programme and impacting positively on the health needs of the school age population of Croydon?&lt;/p&gt;\n&lt;p&gt;We are looking to recruit highly motivated, enthusiastic and passionate qualified school nurse to join the School Nursing Service at an exciting time, as we have moved to locality working, in alignment with our colleagues in Health Visiting, FNP and the local authority.&lt;br /&gt;&lt;br /&gt;The successful candidate will be employed by Croydon NHS Health Services and will be part of a growing, skill mix, school nursing team, and will deliver measurable outcomes to the school aged population in Croydon. The vision is to create a sustainable and purposeful service that uses public health data and school health profiles to plan interventions. It is essential that you demonstrate effective leadership, communication, time management and organisational skills. &lt;br /&gt;&lt;br /&gt;You will be responsible for a defined caseload and leading a skill mix locality school health team. This will involve working in collaboration with parents/carers, education colleagues and other locality based multi agency professionals. You will be expected to develop and implement public health initiatives to promote the health and well-being of children and young people, enabling them reach their full potential and access all areas of the curriculum.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;You will be committed to delivering evidence based practice, maintaining current knowledge of local and national issues that impact on the school-age population. As a specialist practitioner you will be required to professionally contribute to the on-going development of the school nursing service. Continuous professional development will be supported within an appraisal framework.&lt;/p&gt;\n&lt;p&gt;A preceptorship programme will ensure you feel supported in your new role.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Applicants must hold a specialist community public health nurse qualification in school nursing . This is an essential requirement for the position and applicants who apply without this qualification will NOT be shortlisted.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Due to the nature of the role it is essential that applicants are car owners and drivers. If necessary adjustments can be considered in accordance with the Equality Act 2010&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interviews will be held on 16th December 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameJulie CritcherJob titleClinical Service LeadEmail addressjulie.critcher@nhs.netTelephone number020 8274 6391Additional contact information&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Veronique Black&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Tel :02082746443&lt;/strong&gt; &lt;strong&gt;&lt;span&gt;Email: veronique.black@nhs.net&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120967.PNG", "name": "Croydon Health Services NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120967"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Lennard Road, Croydon", "postalCode": "CR9 2RS"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.381", "longitude": "-.103243"}}, "title": "School Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248485", "validThrough": "2020-11-29T23:59:59+0000"}