{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 per an"}}, "datePosted": "2020-11-05T09:15:07+0000", "description": "&lt;p&gt;Ward B4 is a 24 bed ward within Medicine for Older People. We work closely with the Acute Stroke Ward and care for patients with complex needs and a variety of medical conditions.&lt;br /&gt;We have a dedicated Multidisciplinary Team that is motivated and enthusiastic to provide safe effective and personal care for all our patients, their families and carers.&lt;br /&gt;As a team we welcome and support new starters and learners and there are lots of opportunities for professional development.&lt;br /&gt;We actively encourage personal development and ongoing education.&lt;br /&gt;&lt;br /&gt;The team strives to achieve continuing improvement and we would like band 5 Registered Nurses who are as equally keen to join us.&lt;br /&gt;&lt;br /&gt;As a registered nurse working on the ward you will be allocated to care for patients with a variety of medical conditions.&lt;br /&gt;You will assess patients individual needs, provide and implement an appropriate individualised care plan for each patient and evaluate effectiveness of care provided.&lt;br /&gt;As a registered nurse you are required to work within NMC guidelines and code of practise and to adhere to all hospital policies.&lt;br /&gt;You will be expected to contribute to the development of the team which will include supervision and training of junior staff and students.&lt;br /&gt;&lt;br /&gt;We require a band 5 Registered Nurse who is keen to join our team. We will provide supervision and support. Candidates will need to be able to demonstrate the principles of the 6cs and willingness to develop and learn new skills.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Jacqueline Green:&lt;/p&gt;\n&lt;p&gt;01254 732111 or email Jacqueline.Green@elht.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "East Lancashire Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120742"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Blackburn Teaching Hospital, Blackburn", "postalCode": "BB2 3HH"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7366", "longitude": "-2.4668"}}, "title": "Staff Nurse - Ward B4", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257012", "validThrough": "2020-11-26T23:59:59+0000"}