{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 per annum"}}, "datePosted": "2020-10-22T13:09:11+0100", "description": "&lt;p&gt;&lt;strong&gt;POST: PCN &lt;/strong&gt;Care Home Coordinator&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;SALARY: &lt;/strong&gt;Band 4 – Referencing Agenda for Change&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;HOURS: &lt;/strong&gt;1 posts for full time (37.5 hours per week)&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;BASE: &lt;/strong&gt;Primary Integrated Community Services Ltd, Unit H4, Ash Tree Court, Nottingham Business Park. NG8 6PY&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Primary Care Network:&lt;/strong&gt; Newark PCN&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;CONTRACT: &lt;/strong&gt;Permanent&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;CLOSING DATE: &lt;/strong&gt;8 November 2020&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;INTERVIEW DATE TO BE ASSIGNED&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Primary Integrated Community Services Ltd (PICS) is the employer for this role. PICS are a local company wholly owned by GPs, specialising in community-based care, and run for the benefit of patients. &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;ABOUT PICS &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;PICS is a GP owned organisation that provides a wide range of services in primary and community care with the aim of improving the health and wellbeing of all our patients and their families. These services are provided in a range of settings including people’s own homes and GP surgeries. Our focus is on delivering all care as close to home as possible.&lt;/p&gt;\n&lt;p&gt;We pride ourselves on being caring, safe and excellent and we work to constantly improve the quality of care we provide and we expect our staff to commit to and demonstrate these values.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;ABOUT THE ROLE&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;PICS are looking for an enthusiastic and highly organised person to work within the PCN Team, providing coordination, administrative and support to the Clinical teams and other members of the PCN.  The post holder will work closely with Care Homes, General Practices and existing services to support the coordination and delivery of multidisciplinary team meetings for care home residents.&lt;/p&gt;\n&lt;p&gt;The following summarises the practices within Newark PCN:&lt;/p&gt;\n\n\n\n\n&lt;p&gt;&lt;strong&gt;PCN (Practices)&lt;/strong&gt;&lt;/p&gt;\n\n\n&lt;p&gt;&lt;strong&gt;WTE&lt;/strong&gt;&lt;/p&gt;\n\n\n\n\n&lt;p&gt;&lt;strong&gt;Newark – &lt;/strong&gt;Balderton Primary Care Centre, Barnby Gate Surgery, Collingham Medical Centre, Fountain Medical Centre, Hounsfield Surgery, Lombard Medical Centre, Southwell Medical Centre&lt;/p&gt;\n\n\n&lt;p&gt;1&lt;/p&gt;\n\n\n\n\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;A more exhaustive list of job responsibilities and necessary skills, experience and qualifications can be found in our Job Description and Person Specification.&lt;/p&gt;\n&lt;p&gt;Please note you will need to meet the essential criteria of the person specification to be considered for the role.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;BENEFITS:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Auto Enrolment to the NHS Pension Scheme or an alternative government based scheme (based on eligibility)&lt;/li&gt;\n&lt;li&gt;Attractive salaries (dependent on experience and qualifications) – referenced to Agenda for Change&lt;/li&gt;\n&lt;li&gt;Access to NHS IT systems&lt;/li&gt;\n&lt;li&gt;Annual leave entitlement references Agenda for Change&lt;/li&gt;\n&lt;ul&gt;\n&lt;li&gt;On Appointment – 27 days plus 8 days bank holiday entitlement&lt;/li&gt;\n&lt;li&gt;After 5 years’ – 29 days plus 8 days bank holiday entitlement&lt;/li&gt;\n&lt;li&gt;After 10 years’ – 33 days plus 8 days bank holiday entitlement&lt;/li&gt;\n&lt;/ul&gt;\n&lt;li&gt;Recognition of previous NHS service for Annual leave and sickness pay&lt;/li&gt;\n&lt;li&gt;High staff satisfaction &lt;br /&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;For an informal discussion or a visit to the organisation to have a look around and meet the team, you can contact Nicky Render on 07736297292 or via email to nicky.render@nhs.net&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;TERMS AND CONDITIONS                            &lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;All applications are to be made via NHS Jobs - CVs will not be accepted.&lt;/li&gt;\n&lt;li&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Previous applicants need not apply. &lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;Please note that applications received after the closing date will not normally be considered.&lt;/li&gt;\n&lt;li&gt;Applicants who have not heard from us with seven days of the closing date can assume that they have not been successful.&lt;/li&gt;\n&lt;li&gt;By submitting an application you consent to your personal data being shared for the purposes of recruitment.&lt;/li&gt;\n&lt;/ul&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Primary Care Services", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=129034"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Unit H4, Ash Tree Court, Nottingham Business Park, Nottinghamshire, NG8 6PY", "postalCode": "NG8 6PY"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9815", "longitude": "-1.23812"}}, "title": "Care Home Co-ordinator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916238587", "validThrough": "2020-11-08T23:59:59+0000"}