{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum, pro rata"}}, "datePosted": "2020-10-27T12:32:05+0000", "description": "&lt;p&gt;Care Home Liaison Team, Based at the Juniper Centre, Moseley Hall Hospital&lt;/p&gt;\n&lt;p&gt;We are looking for an enthusiastic and experienced occupational therapist to join our care home liaison team. The role involves working with service users, families and teams within care homes across Birmingham and Solihull. You will need to have the ability to: assess the care home environment as well as individual service users, work with teams to develop activity and care plans and to support services in developing practice. This team provides essential support to our local community mental health teams who co ordinate the care for our service users. The team members include a clinical psychologist, community psychiatric nurses, an advanced nurse practitioner and support worker.&lt;/p&gt;\n&lt;p&gt;If you share our values of being: compassionate, inclusive and committed and are able to put the service user at the heart of your practice we encourage you to apply.&lt;/p&gt;\n&lt;p&gt;The Mental Health Services for Older People within the Trust values the role of occupational therapy within its teams and promotes regular managerial, professional and clinical supervision.&lt;/p&gt;\n&lt;p&gt;We encourage all occupational therapists to be involved monthly professional support groups, our annual Allied Health Professionals conference and AHP/OT specific training events. We actively support continuing professional development and strive to offer a high quality service to all service users.&lt;/p&gt;\n&lt;p&gt;For further information contact:&lt;/p&gt;\n&lt;p&gt;Charlotte Ward (Acting Team Manager - CERTs Community / Discharge and CHL) 0121 301 0950 / 07985882446 - charlotte.ward10@nhs.net&lt;/p&gt;\n&lt;p&gt;Mary Brown (Lead Occupational Therapist) 021 301 5835.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameCharlotte WardJob titleActing Team Manager (CERTs Community / Discharge &amp; CHL).Email addresscharlotte.ward10@nhs.netTelephone number0121 301 0955 / 07985882446.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Birmingham and Solihull Mental Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120844"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Juniper Centre, Birmingham", "postalCode": "B13 8JL"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4459", "longitude": "-1.89289"}}, "title": "Band 6 Occupational Therapist - Care Home Liaison, Juniper Centre", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244520", "validThrough": "2020-11-15T23:59:59+0000"}