{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24926", "minValue": "23521", "unitText": "YEAR", "value": "£23,521 - £24,926 per annum inc HCAS"}}, "datePosted": "2020-11-03T11:16:50+0000", "description": "&lt;p&gt;We have an exciting opportunity for a full-time (37.5 hours per week), permanent Band 3 Administrator / Receptionist. The service base is at Beaufort House in central Uxbridge, within walking distance of the city centre, public transport and parking facilities.&lt;/p&gt;\n&lt;p&gt;You will join the CNWL Talking Therapies IAPT Services based in central Uxbridge. The services is an NHS therapies service working with local adults suffering with anxiety, depression, health issues and relationship problems. We are a large and busy service, with a high throughput of patients and you will be part of a friendly and supportive administrative team. During Covid our team is part home-working and part site-working but we expect increasingly to return to working from our base as Covid subsides.&lt;/p&gt;\n&lt;p&gt;Your role will focus on patient contact to book appointments by phone and on site to cover reception functions for the service. The clinical service is large and the administrators support staff and patients, so the postholder should enjoy speaking to patients and proactively supporting the clinical team. You will be involved in providing a full range of secretarial and administrative duties to support the delivery of a high quality service by the IAPT team. The post holder will need to develop an understanding of IAPT service objectives and support the team in in carrying out their duties effectively.&lt;/p&gt;\n&lt;p&gt;Experience in working with patient data systems and having good IT and communication skills, are desirable for applicants. You will require good IT skills and a comprehensive working knowledge of the use of Microsoft Office software – Word, Excel, Power point and Access.The post holder will receive regular supervision and support from the Senior Administrator.&lt;/p&gt;\n&lt;p&gt;The IAPT team has close links with other IAPT services within CNWL NHS Foundation Trust.&lt;/p&gt;\n&lt;p&gt;This post is highly suitable for an applicant who is working at a similar grade in the NHS or for those currently working in a non-NHS setting with aspirations to enter into Health service administration.&lt;/p&gt;\n&lt;p&gt;Interview date:23rd November 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameMrs Tracy SchererJob titleSenior AdministratorEmail addresstracyscherer@nhs.netTelephone number01895 206 800&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central and North West London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120736"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Beaufort House, Ground Floor, Uxbridge", "postalCode": "UB8 1QG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.544", "longitude": "-.477739"}}, "title": "Team Administrator / Receptionist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253694", "validThrough": "2020-11-10T23:59:59+0000"}