{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-11-06T15:31:24+0000", "description": "&lt;p&gt;We are seeking a highly motivated cardiac physiologist to join our friendly team, providing high standards of care and support to patients at The Dudley Group of Hospitals NHS Foundation Trust.&lt;/p&gt;\n&lt;p&gt;We offer a comprehensive range of cardiac investigations including pacemaker implant and follow up, exercise tests and ambulatory monitoring fitting and analysis, Thallium exercise. AH rehabilitation exercise programmes. Our echo department delivers both simple transthoracic echocardiography and a range of complex echocardiography techniques such as transoesphageal, contrast, dotutamine and exercise stress echocardiography. In addition, the department delivers a range of diagnostic clinics such as echo surveillance clinics, chest pain assessment clinics. Provides ECG service for GP&#39;s, In and outpatient ECG support on both Adults and Paediatrics.&lt;/p&gt;\n&lt;p&gt;We are committed to supporting learning and development so a successful candidate should be confident that they will be supported to consolidate their learning and begin to develop expertise in Echocardiography, to obtain British Society Echocardiography accreditation.&lt;/p&gt;\n&lt;p&gt;All applicants must have BSc Clinical Physiology (cardiology) or equivalent and demonstrate competency in a range of non-invasive procedures.&lt;/p&gt;\n&lt;p&gt;We are seeking a candidate that shares our values and commitment to ensuring the quality of our services. We encourage open engagement in service design and delivery, and seek an individual eager to share knowledge and ideas in an open and friendly forum.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Joy Beckford - Cardiology Service Manager&lt;/p&gt;\n&lt;p&gt;Email address: joy.beckford@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number: 01384 456111 xt 3401&lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;If you would like to visit our department, please contact on the number above so we can arrange a convenient date &amp; time , due to COVID pandemic it is our duty to keep the staff an public safe.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120847.gif", "name": "Dudley Group NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120847"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Russells Hall Hospital, Dudley", "postalCode": "DY1 2HQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5023", "longitude": "-2.11774"}}, "title": "Cardiac Physiologist B5", "url": "https://www.jobs.nhs.uk/xi/vacancy/916260397", "validThrough": "2020-11-16T23:59:59+0000"}