{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 - £19,337 per annum"}}, "datePosted": "2020-10-26T13:46:53+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for dynamic and enthusiastic individuals to join our Clinical Administration Service as an Administrator within Hub 4 in our secretarial team.&lt;/p&gt;\n&lt;p&gt;Our Administrators play a vital role in the delivery of patient care via the management of the patients end-to-end pathway and supporting the wider team. Our roles are varied and challenging and your day to day duties may include;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Booking and departing patients on one of our busy reception desks&lt;/li&gt;\n&lt;li&gt;Working in our medical records departments, ensuring patient notes are available for all patient appointments&lt;/li&gt;\n&lt;li&gt;Helping track our patients through their journey to ensure a great patient experience&lt;/li&gt;\n&lt;li&gt;Supporting the Senior Administrators including typing of clinical correspondence and adding patients to waiting lists&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Within the Clinical Administration Service we pride ourselves on making a difference and you will be able to enjoy a rewarding career within the NHS with opportunities to develop, grow and progress.&lt;/p&gt;\n&lt;p&gt;The benefits are also great too with a starting salary of £18,005*, eligibility to join the NHS pension scheme and 27 days annual leave plus bank holidays upon entry*&lt;/p&gt;\n&lt;p&gt;Although previous administration experience is desirable, we are first and foremost looking for individuals with a passion to work in a health care setting and those with a &#39;can do&#39; attitude.&lt;/p&gt;\n&lt;p&gt;The successful candidates will join a friendly and supportive team that values the contribution of all staff.&lt;/p&gt;\n&lt;p&gt;This post is part-time Wednesday Thursday and Friday 8.30am to 5.00pm with 30 min for lunch&lt;/p&gt;\n&lt;p&gt;If this vacancy receives a high number of applications it may close early&lt;/p&gt;\n&lt;p&gt;Should you wish to discuss our Administrator positions further, please get in touch.&lt;/p&gt;\n&lt;p&gt;*salary and annual leave will be calculated pro-rota&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Clare Baines Hub 4 Manager&lt;/p&gt;\n&lt;p&gt;claire.baines@hey.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number 01482 608762&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121128.jpg", "name": "Hull University Teaching Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121128"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hull Royal Infirmary, Hull", "postalCode": "HU3 2JZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7444", "longitude": "-.358277"}}, "title": "Administrator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242748", "validThrough": "2020-11-09T23:59:59+0000"}