{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Competitive Salary plus Benefits"}}, "datePosted": "2020-10-27T12:45:06+0000", "description": "&lt;p&gt;&lt;strong&gt;BMI Princess Margaret Hospital&lt;/strong&gt;&lt;strong&gt; in Windsor &lt;/strong&gt;is part of BMI Healthcare, Britain&#39;s leading provider of independent healthcare with a nationwide network of hospitals &amp; clinics, performing more complex surgery than any other private healthcare provider in the country. &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We have a vacancy for a Senior Physiotherapist to join their team of staff in the Physiotherapy Department full time, 37.5 hours a week.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are a busy physiotherapy department currently looking for an experienced Senior Physiotherapist to work in both our inpatient orthopaedic and outpatient MSK settings. &lt;/p&gt;\n&lt;p&gt;We are a dynamic and forward thinking hospital running a MAKO robotic orthopaedic centre for joint replacement surgery. The Physiotherapy Department offers inpatient services to orthopaedic, general surgical, general medical and oncology patients. &lt;/p&gt;\n&lt;p&gt;In our Outpatient Physiotherapy Department we see a variety of musculoskeletal patients including orthopaedic patients both pre and post operatively, self -pay patients, Consultant and GP referrals.  We have specialist areas including offering treatments in hand therapy, manual lymphatic drainage, paediatrics, pelvic health, neurology and vestibular.  We run a variety of patient classes including Pilates, Tai chi and lower limb rehabilitation.&lt;/p&gt;\n&lt;p&gt;Please see attached Job Description for further detailed responsibilities &amp; accountabilities of this role.  The hours include 2 evenings until 8pm and the hours can be spread across 4 or 5 days.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;You will receive a full induction and benefit from access to our extensive local in-service training program as well as our national physiotherapy training plan that offers a variety of training courses.&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Benefits: &lt;/strong&gt;&lt;/span&gt;&lt;br /&gt;Employee benefits for contracted staff also include 25 days holiday + bank holidays, Pension scheme, Private health insurance, discounted gym membership and many more exclusive discounts and incentives via our “Perks at Work” scheme.  We also have free parking. &lt;br /&gt;BMI Physiotherapists also have full access to the BMI Physiotherapy Training plan which offers them numerous discounted Physiotherapy Training Courses.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Interested?&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;If you would like to apply for this opportunity, please complete our brief online application form and ensure to upload the most recent copy of your CV.  We aim to respond to your application within 14 days of the closing date.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Owing to the nature of this position, any offer of employment will be subject to a satisfactory Enhanced Disclosure Check&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Safeguarding&lt;/strong&gt;&lt;/span&gt;&lt;br /&gt;BMI Healthcare is fully committed to safeguarding the welfare of all children and young people, and vulnerable adults by taking all reasonable steps to protect them from harm.  All staff will receive appropriate training and induction so that they understand their roles and responsibilities and are confident about carrying them out.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "BMI Healthcare", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=131874"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Windsor", "postalCode": "SL4 3SJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4747", "longitude": "-.610351"}}, "title": "Senior 1 Physiotherapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244557", "validThrough": "2020-11-29T23:59:59+0000"}