{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "36763", "minValue": "25349", "unitText": "YEAR", "value": "£15.08 to £21.87"}}, "datePosted": "2020-10-21T12:35:48+0100", "description": "&lt;p&gt;&lt;span&gt;Trust Vision and Values are of great importance to us, we believe in demonstrating Collaboration, Honesty, Accountability, Innovation, and Respect in all aspects of our professional roles.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Our Trust Vision is to Build Healthier Lives’ to all of our patients, visitors and service users. In order to ensure this we are constantly investing and developing our staff to discover new methods of care delivery, that are in line with evidence based practice, current research and the best outcome for all patients.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;As part of this recruitment opportunity we are looking for self-motivated, enthusiastic, dynamic, forward thinking Band 5 Theatre Nurses and Operating Department Practitioners to join our Trust bank services.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We have 73 theatres in total, covering a wide range of specialties. Cardiac, Neuro, Livers, Trauma Orthopaedic, ENT, Maxillo Facial, Burns, Plastics, Upper and lower GI, Urology, Renal, Hands, Ophthalmic and Interventional Radiology, Thoracic, paediatric and Gynaecology. We cater for both elective and Emergency surgery, participate in Organ retrieval and transplantation as well as being a Major Trauma Centre. Our theatres are constantly expanding as the demand for our skills increases. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;All applicants must be experienced Theatre Practitioners with either Anaesthetic, scrub or Recovery skills. Applicants can demonstrate this within their application, as well as a strong commitment to teaching &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;For further information on these exciting opportunities then please contact: Melanie Finney.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Melanie.finney@uhb.nhs.uk.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;To apply for the position please complete the application form on NHS Jobs online&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "University Hospitals Birmingham NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123452"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Birmingham", "postalCode": "B15 2TH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4533", "longitude": "-1.93628"}}, "title": "Bank Theatre Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916236397", "validThrough": "2021-03-31T23:59:59+0100"}