{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62001", "minValue": "53168", "unitText": "YEAR", "value": "£53,168 - £62,001 per annum"}}, "datePosted": "2020-10-28T09:15:34+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;span&gt;Severn Major Trauma Operational Delivery Network &amp; Major Trauma Centre (MTC) Manager - Band 8b&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;1.0WTE (Full Time - 37.5 hours per week)&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Based at: Adult Major Trauma Centre, Southmead Hospital, Severn Major Trauma Operational Delivery Network&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Severn Major Trauma Centre was established in 2012 and is one of 20 Major Trauma Operational Delivery Networks in the country. The purpose of the Network is to improve the outcomes from major trauma. The network consists of an adult Major Trauma Centre (MTC) which is at Southmead Hospital and six Trauma Units (TUs) at Gloucester Royal Hospital (Gloucester), Royal United Hospital (Bath), University Hospitals Bristol (Bristol Royal Infirmary), Musgrove Park Hospital (Taunton), Yeovil District Hospital (Yeovil) and Great Western Hospital (Swindon). There is a Paediatric Major Trauma Centre based at Bristol Children’s Hospital that receives injured children from both Severn Major Trauma Network and Peninsular Major Trauma Network to the South. The trauma network is responsible for improving care in the whole patient pathway – from point of injury to rehabilitation.&lt;/p&gt;\n&lt;p&gt;We are looking to recruit an experienced manager to provide leadership to the Network and the Major Trauma Centre. You will need to be experienced with service improvement through engagement with a wide range of stakeholders.&lt;/p&gt;\n&lt;p&gt;The post holder will have demonstrable capability for operational /clinical service management including, change management, people management &amp; financial management. The post holder will lead the planning and development of the work programmes for the Network &amp; Major Trauma Centre to ensure the achievement of the network priorities, and local objectives. This includes the whole patient pathway, overseeing key deliverables and initiatives in relation to pre – hospital, secondary transfer, repatriation, rehabilitation, ongoing care, information, documentation and data.&lt;/p&gt;\n&lt;p&gt;The post holder will provide managerial support to the Network Clinical Director and leads and the MTC Clinical lead and Lead clinicians and managerial leads in all the provider organisations in the Network ensuring that they have clear guidance and support to achieve their individual objectives. The post holder will also manage the centralised multidisciplinary team at the Major Trauma Centre including Major Trauma practitioners and data coordinators.&lt;/p&gt;\n&lt;p&gt;The post holder will be involved in the annual planning for the trauma network and will support the Clinical Director and MTC and Trauma Unit leads in developing network based priorities. They will lead, co-ordinate and manage service improvement and redesign projects across the Network in relation to Major Trauma in order to optimise care delivery systems. The post holder will be responsible for overseeing TARN data across the Network.&lt;/p&gt;\n&lt;p&gt;The post requires regular travel within the network and to national meetings.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Dominique Duma&lt;/p&gt;\n&lt;p&gt;Job title: Severn Major Trauma Network &amp; Centre Manager&lt;/p&gt;\n&lt;p&gt;Email address: dominique.duma@nbt.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number: 0117 4146110&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120777.jpg", "name": "North Bristol NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120777"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southmead Hospital, Bristol", "postalCode": "BS10 5NB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4973", "longitude": "-2.59295"}}, "title": "Severn Major Trauma Operational Delivery Network/Centre Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245787", "validThrough": "2020-11-11T23:59:59+0000"}