{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 per an"}}, "datePosted": "2020-11-05T09:06:14+0000", "description": "&lt;p&gt;The Diabetes and Endocrinology Department has an exciting opportunity for qualified nurses to join our friendly, supportive, innovative acute medical and nursing team, whom are committed to providing and maintaining high standards of patient care.&lt;/p&gt;\n&lt;p&gt;Ward D1 delivers acute medical nursing care with a particular interest in Diabetes and Endocrinology. The Ward has 20 beds compromising of 3 bays, overseen by a dedicated duty coordinator/Sister and with the support of a Practice Educator. You will be looking after patients with diabetic foot ulcers, vascular complications, poor glycemic control, hypoglycemia, diabetic ketoacidosis.&lt;/p&gt;\n&lt;p&gt;If you are keen to develop your acute clinical care skills then this is the ward for you. We also work closely with the specialist diabetes team (including Clinical Nurse Specialist, diabetic foot teams, dieticians). Ward D1 is modern, spacious, calm and clean with a dynamic, professional but fun experienced team who are able to support new team members&lt;/p&gt;\n&lt;p&gt;You will also be committed to delivering a high standard of patient care and have an interest in acute nursing care within the diabetes and Endocrinology field. Excellent communication skills and the ability to work as part of a multidisciplinary team are essential. A flexible approach and the ability to respond to the demands of a rapidly changing acute clinical environment are also essential.&lt;/p&gt;\n&lt;p&gt;In return we can offer you a structured orientation programme with the support of our dedicated Ward Managers, supervisory ward sisters, advanced practitioner, specialist nurses, patient flow facilitation team and a team dedicated specialist consultants. You will receive a supernumerary period to enable you to gain the skills and competencies required to care for acutely ill patients, and the team also provide dedicated clinical teaching sessions every month to support your revalidation and ongoing professional development.&lt;/p&gt;\n&lt;p&gt;Posts are offered on a full time basis. The post requires flexible working patterns to meet the needs of the service to include bank holidays and weekends as required.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Teri Frazer&lt;/p&gt;\n&lt;p&gt;Ward Manager D1&lt;/p&gt;\n&lt;p&gt;01254 733360&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "East Lancashire Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120742"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Blackburn Teaching Hospitals, Blackburn", "postalCode": "BB2 3HH"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7366", "longitude": "-2.4668"}}, "title": "Staff Nurse - Ward D1", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257000", "validThrough": "2020-11-26T23:59:59+0000"}