{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum"}}, "datePosted": "2020-10-26T13:31:35+0000", "description": "&lt;p&gt;Situated in the beautiful county of Kent in the South East of England, East Kent Hospitals University NHS Foundation Trust have three acute hospitals; Kent &amp; Canterbury Hospital based in the historic city of Canterbury, the William Harvey Hospital in Ashford which benefits from high speed rail services to both London and Europe, and the Queen Elizabeth the Queen Mother Hospital in the traditional sea-side town of Margate which has been identified as an area of regeneration.&lt;/p&gt;\n&lt;p&gt;This is an exciting time to be joining EKHUFT with a recent change of focus by the Trust and the local commissioners leading to significant recent and on-going investment in additional medical and nursing staff as well as hospital infrastructure. With commitment from the local health economy (CCGs, Community Trust, primary care, social services, Mental Health and secondary care), we are developing integrated patient pathways to ensure that patients are able to access the most appropriate emergency care.&lt;/p&gt;\n&lt;p&gt;As part of this, funding for additional acute physicians has been agreed taking the total number across the Trust to nine, which will include extended working and a review of the current model to manage the emergency general internal medicine take.&lt;/p&gt;\n&lt;p&gt;It was also recently announced that a new medical school, the first in the county, will be opening in two years. The school, which will offer 100 medical school places per year, is a game-changing opportunity and one which the two universities and Kent and Medway trusts have been working towards and hoping for over several years&lt;/p&gt;\n&lt;p&gt;As an Acute Physician, you will provide leadership for the Emergency Floor and work in collaboration with clinicians in subspecialties to provide 7 day, 12 hour Consultant cover across the Acute Medical Units.&lt;/p&gt;\n&lt;p&gt;If you are looking to lead and shape the future of an evolving and developing emergency care model in a large, acute Foundation Trust that prides itself on delivering high quality care to our patients, then this is the ideal opportunity for you.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Previous applicants need not apply&lt;br /&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;strong&gt;Applications for Less Than Full Time working will be considered.&lt;/strong&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Christopher Parokkaran c.parokkaran@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "East Kent Hospitals University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121462"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "William Harvey Hospital, Ashford", "postalCode": "TN24 0LZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.1415", "longitude": ".91624"}}, "title": "Consultant Acute Physician", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242664", "validThrough": "2020-11-23T23:59:59+0000"}