{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum pro rata"}}, "datePosted": "2020-10-16T15:01:24+0100", "description": "&lt;p&gt;Three Consultant Anaesthetists are required to support the department of Anaesthesia.&lt;/p&gt;\n&lt;p&gt;These are replacement posts and comprise 10 PAs, which typically include direct clinical care of 8.5 PA and supporting professional activity of 1.5 PA. Additional SPA activity may be approved with mutual agreement for roles within the organisation.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;The Department&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The successful candidates will be welcomed into a department with a current substantive consultant establishment of twenty-nine. In addition, there are upto 18 SAS grade Anaesthetists and Clinical Fellows. The trainee establishment consists of 7 CTs, together with 9 ST3+s all rotating from the East Midlands School of Anaesthesia (EMSA). The department also has two Foundation Year 1 doctors and one Foundation Year 2 doctor on 4-month rotations.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We manage our service with open discussion; listening to and respecting everyone’s views. The clinical speciality leads have the responsibility to facilitate change and improvements in the service supported by the leadership team. We encourage everyone to be both leader and follower to help deliver improvements. Active participation in service development, departmental management, clinical governance &amp; education is required.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Anaesthetic Department is actively in the process of achieving National Accreditation with The Royal College of Anaesthetists, we expect this to be complete within the next 2 years.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;In 2019 the department was shortlisted and received a high commendation at the BMT awards for perioperative team of the year. In 2018 &amp; 2019 the department was shortlisted for HJS value &amp; safety awards for various projects.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;The Role&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will work with Consultants in Anaesthesia, Critical Care, Theatre Staff, Divisional Managers, other members of the Anaesthetic Department, Other consultant colleagues, senior nursing staff and management of the hospital.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Key tasks:-&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;span&gt;Maintenance of the highest clinical standards in the management of patients.&lt;br /&gt;&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Teaching and training of junior staff and medical students&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;To actively participate in both departmental and Trust matters concerning Clinical &lt;/span&gt;&lt;span&gt;Governance, service development and general management&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;To have responsibility for ensuring active participation in continuing medical education&lt;br /&gt;&lt;/span&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;All consultants are required to live within a reasonable distance of the Trust, and be able to attend within thirty minutes when on call.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Eligibility&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;In order to be eligible to apply for these positions you must have:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;span&gt;entry on GMC Specialist Register; eligible for entry on Register (or within six months of receipt of Certificate of Completion of Training at time of interview) in Anaesthesia&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;FRCA or equivalent&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;u&lt;span&gt;p to date Advanced Life Support and EPLS or equivalent&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;c&lt;span&gt;ompleted specialist training in the UK&lt;/span&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;These are full-time positions but candidates wishing to work part-time or in a job-share are encouraged to apply. If a part-time or job-share person is appointed modification of the job content will be discussed with the appointee on a personal basis. They will be required to devote substantially the whole of his/her time for the appointed sessions to the duties of the post and to give them priority at these times.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Sherwood Forest Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120977"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "King&#39;s Mill Hospital, Sutton-In-Ashfield", "postalCode": "NG17 4JL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.1345", "longitude": "-1.23627"}}, "title": "Consultant Anaesthetist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916230774", "validThrough": "2020-11-19T23:59:59+0000"}