{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30000", "minValue": "30000", "unitText": "YEAR", "value": "£30,000"}}, "datePosted": "2020-10-19T17:06:59+0100", "description": "&lt;p&gt;Stroud Eating Disorders Service (SEDS) is a specialist residential service providing medium to long-term support and treatment for young people and young adults (aged 13-25) suffering from eating disorders and other associated complex mental health difficulties. We do this across 3 residential homes.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This role allows a relatively rare opportunity to build longer term, meaningful therapeutic relationships and use them to support people to affect change. We are fortunate to be able to do this in warm, homely environments, within the beautiful Stroud Valleys, in Gloucestershire.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Our therapeutic model focuses on supporting our service users to build a life outside of the confines of their eating disorder or indeed, mental illness. We work hard to support those that live in our homes, to build their own resilience, sense of self and ability to connect with the world around them.  &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Ashleigh House is a 6 bedded childrens home (13-18), Althea Park House is a 7 bedded home for young adults (17-25) and The Anchor is a 3 bedded semi-independent step-down home (18+).&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The role is to support the Senior Practitioner (RMN) manage their clinical case load across the 3 homes. It will involve care planning and risk assessment, professional liaison and working directly with service users to support the treatment delivery. You would form a key part of our experienced multi-disciplinary team.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The hours for the role would include a mixture of shift work and 9-5.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Our shift times are:&lt;/p&gt;\n&lt;p&gt;Early shift: 7.30am - 15.30pm&lt;/p&gt;\n&lt;p&gt;Late shift: 14.30pm - 22.30pm&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Priory Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133434"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "GLOUCESTERSHIRE", "postalCode": "GL5 4AJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7475", "longitude": "-2.23113"}}, "title": "MENTAL HEALTH NURSE", "url": "https://www.jobs.nhs.uk/xi/vacancy/916233304", "validThrough": "2020-11-27T23:59:59+0000"}