{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890"}}, "datePosted": "2020-10-26T16:14:38+0000", "description": "&lt;p&gt;Do you have a passion for working with children and young people in mental health? We are looking for a Band …..Speech and Language Therapist to join our Childrens and Young persons service in Shropshire. Post holders are offered clinical supervision and peer support with the Trusts clinical networks. The post holder will contribute to the multi disciplinary assessment of children referred to the Autism diagnostic pathway andoffer a range of communication assessments, offering the expertise of a speech and language therapist within the mutidisciplinary mental health team .&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Allied Health Professions have a robust governance structure across the Trust and support preceptorship, and personal development, and peer support, &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Successful applicants will be able to function confidently in multi-disciplinary teams, work flexibly, possess excellent communication and interpersonal skills, effective clinical reasoning and demonstrate a passion for working with children with a range of mental health disorders. A commitment to continuing professional development is essential all applicants should be willing to undertake further training to meet the needs of the client group. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Midlands Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121040"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Shropshire Telford and Wrekin", "postalCode": "ST16 3SR"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.8106", "longitude": "-2.10908"}}, "title": "Speech and Language Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243336", "validThrough": "2020-11-23T23:59:59+0000"}