{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 to £44,503 pa"}}, "datePosted": "2020-10-27T11:45:23+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;span&gt;Worcestershire Child and Adolescent Mental Health Service&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Base to be confirmed&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Child and Adolescent Psychotherapist&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;BAND 7&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;8.5 hours per week to be worked on Mondays 08:30- 17:30 - Fixed term contract ending 31 December 2021&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are seeking a qualified child and adolescent psychotherapist to work within our multidisciplinary CAMH Service., supporting the bespoke Psychotherapy team to deliver effective care to a discreet CAMHS caseload. This is an exciting time to join us as we have developed a countywide psychotherapy provision with an experienced psychotherapy lead and a psychotherapy colleague. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Alongside of this we have been assessed by the BTPP as being an excellent training provider to trainee psychotherapists. We currently are supporting the training of 2 trainees. We are committed to the further development of psychotherapy within Worcestershire and require someone to join us during 2021 as we recruit to vacancies and continue delivering psychotherapy during the restrictions of the Covid-19 pandemic. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The role will include providing psychotherapeutic assessment and intervention to children and families, mentoring trainees as required and offering consultations to CAMHS colleagues regarding psychotherapy. You will hold your own caseload and work within the wider service building links with colleagues and stakeholders. CAMHS psychotherapy also lead on an under 5s pathway offering assessment and treatment utilising a psychotherapeutic approach to support parents and children in this age range. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The post holder will need to have experience of working in Child and Adolescent Mental Health services and be able to work with us on a Monday. You will need to be confident and have good communication and organisational skills and be a full member of the Association of Child Psychotherapists. You will have access to the wider MDT and also to appropriate clinical supervision. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Please note that due to the restrictions of Covid-19 on our service we are not able to confirm an administration base just yet and this will be discussed with the successful candidate as we move forward. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;If you would like more information about his role please contact Heather Stewart, Interim Psychotherapy lead on 01562 514549/50 &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;span&gt;All staff whatever their role, level or responsibility will be encouraged and supported to do their job well and to improve their job.&lt;/span&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;span&gt;Making Every Day Better for patients, staff, service users and carers is the responsibility of all of us and we want to embed a culture within the organisation that encourages and supports the drive to improve what we do.&lt;/span&gt;&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120795.jpg", "name": "Worcestershire Health and Care NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120795"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Worcestershire", "postalCode": "WR5 1JG"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1924", "longitude": "-2.18312"}}, "title": "Child &amp; Adolescent Psychotherapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244272", "validThrough": "2020-11-15T23:59:59+0000"}