{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-11-06T13:46:28+0000", "description": "&lt;p&gt;An exciting opportunity has arisen to work within our Specialist Services Network. The service is a Community Health and Justice Service for adults based at April House in the City of Manchester. You will work with a clinical team at April House delivering individualised care to Manchester residents who come into or at risk of coming into contact with the criminal justice system.&lt;/p&gt;\n&lt;p&gt;The post holder will carry a caseload within which they will provide assessments, care formulations, clinical risk assessments. Additionally they will liaise with and on behalf of service users to enable timely access to health and social care as well as diversion away from the criminal justice system where appropriate. The post holder will be expected to work closely and in collaboration a range of care and criminal justice partners such as, housing officers, police officers/staff, probation officers, GP’s, community health services. This is a permanent contract post for a qualified mental health nurse or allied health professional at Band 6 level.&lt;/p&gt;\n&lt;p&gt;You would have the support of a Senior Clinical/ Management Team, as well as the skills and experience of a Practitioner Team within the mental health services.&lt;/p&gt;\n&lt;p&gt;Greater Manchester Mental Health is an award winning mental health Trust, providing health and social care services. The Trust serves communities in Bolton, Manchester, Salford and Trafford as well as specialist mental health services across the North West. We also offer local alcohol and drug services throughout several boroughs of Greater Manchester and Lancashire, as well as regional inpatient services.&lt;/p&gt;\n&lt;p&gt;Please ensure you read the job description and person specification attached and that your supporting information reflects this, as your application will be judged against these criteria. All successful applicants will be notified via the email address provided and all further correspondence will be through email, therefore please ensure that you regularly check your emails after the closing date for this post.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Sandy Baylis , 0161 357 1333&lt;/p&gt;\n&lt;p&gt;Sandy.Baylis@gmmh.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121714.jpg", "name": "Greater Manchester Mental Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121714"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "April House, Manchester", "postalCode": "M25 3BL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5368", "longitude": "-2.29146"}}, "title": "Mental Health Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259984", "validThrough": "2020-11-20T23:59:59+0000"}