{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-10-28T13:46:27+0000", "description": "&lt;p&gt;East Kent have transformed their Urgent Care Centres into Urgent Treatment Centres, this will provide a fully integrated system across primary, secondary and out of hours care to deliver the best service to our patients. The Urgent Treatment Centres will be run by the East Kent Urgent Treatment Centre Alliance: Ashford Clinical Providers Ltd, East Kent Hospitals University NHS Foundation Trust, Integrated Care 24, Invicta Health CIC and Thanet Health CIC. These are located at Buckland Hospital, Kent and Canterbury Hospital, Queen Elizabeth the Queen Mother Hospital and William Harvey Hospital.&lt;br /&gt;&lt;br /&gt;We are one of the largest acute Trusts in England and are in the enviable position of being surrounded by beautiful beaches and the Kent countryside but with easy links to the centre of London. So, whether you are interested in cathedrals, castles, exceptional grammar schools or chic and stylish restaurants, East Kent has something for everyone.&lt;br /&gt;We are a multi-site Trust with two acute hospitals in Ashford and Margate and two minor injury units in Canterbury and Dover; we pride ourselves on being a clinically led organisation and are passionate about developing and empowering our staff.&lt;br /&gt;&lt;br /&gt;Due to an organisational re structure, new nursing leadership and expansion of our services we are investing in our front-line services and redesigning our acute and emergency floor to promote collaborative working and enhance the patient pathway and experience. Our emergency and acute floor consists of urgent and emergency care, newly developed observation wards, emergency ambulatory and acute medical assessment units.&lt;br /&gt;&lt;br /&gt;We are seeking a qualified and experienced Emergency Nurse Practitioner (ENP)/ Emergency Care Practitioner (ECP) to join us. Working as a Specialised Nurse in an Urgent Treatment Centre you would be seeing, diagnosing, treating and managing patients independently without having to refer to a Doctor. As an Independent Practitioner, you should be able to carry out a wide variety of tasks from reading and assessing x-rays to plastering. We ask that you are motivated and enthusiastic with proven experience in managing and treating differential diagnoses. In return you will have the opportunity to develop within your role through continuing professional development with modules such as prescribing, minor illness course and x-ray interpretation. We are currently developing a career pathway to support and encourage education and learning to help you to reach your academic potential, to promote this we offer a generous study leave package, if you are new to the Trust we provide a recruitment and retention initiative of up to £3000. We offer flexible working and a rotation between our sites if this is something you would like to consider.&lt;br /&gt;&lt;br /&gt;Staff and patients from across East Kent Hospitals (EKHUFT) are the feature of the biggest NHS recruitment drive in its 70-year history.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;‘We are the NHS’ campaign highlights the extraordinary work that staff across our organisation do every single day. Serving a population of over one million people, EKHUFT is perfectly placed to demonstrate the care, cutting-edge treatments, research, innovations and life-saving operations that the campaign needed. If you are a self motivated band 6 nurse looking for a new career or an experienced nurse looking for promotion then look no further. We would be delighted to talk to you about joining our organisation.&lt;br /&gt;&lt;br /&gt;&lt;br /&gt;For an informal conversation please contact&lt;br /&gt;&lt;br /&gt;Anna Kabenla (Lead ENP)&lt;br /&gt;07964 437622&lt;/p&gt;\n&lt;p&gt;Kate Barrett&lt;/p&gt;\n&lt;p&gt;07798 798943&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameAnna KabenlaAdditional contact information&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Anna Kabenla - anna.kabenla@nhs.net&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Kate Barrett - kbarrett2nhs.net&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "East Kent Hospitals University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121462"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Kent &amp; Canterbury Hospital, Canterbury", "postalCode": "CT1 3NG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2666", "longitude": "1.08711"}}, "title": "Emergency Nurse Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246819", "validThrough": "2020-11-11T23:59:59+0000"}