{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 per annum"}}, "datePosted": "2020-10-29T09:31:05+0000", "description": "&lt;p&gt;&lt;strong&gt;Coventry and Warwickshire Partnership Trust&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Integrated Community Services&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Out of Hospital &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Are you a reliable, dynamic, enthusiastic and well-motivated person with experience of working in a community, hospital and/or rehabilitation setting? Are you looking for a new challenge?&lt;/p&gt;\n&lt;p&gt;An opportunity has arisen as part of our Integrated Care Offer to recruit into Physiotherapy assistant roles.&lt;/p&gt;\n&lt;p&gt;In this post, you will work with experienced Physiotherapists to provide rehabilitation to patients who have recently left hospital after illness, injury or surgery to regain their function and independence. You will visit patients either in a reablement unit or in their own homes. Our aim is to enable our patients to live as independently as possible and achieve goals that are meaningful to them.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will be an important and valued member of this team, enabling patients to achieve what matters most to them. You will be supported to develop in this role, and receive regular supervision and training, both on a one to one basis, as part of the team and when working with our patients. As part of the role you will be expected to achieve competencies that will map your development and ensure that we are providing safe patient care.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The team, based at CWPT will work alongside colleagues from Occupational Therapy and Social Care within Coventry City Council to provide holistic care to meet a variety of patient needs.&lt;/p&gt;\n&lt;p&gt;You must have a relevant NVQ level 3, or an NVQ level 2 with extensive applicable experience and knowledge. Experience of working in a rehabilitation setting is desirable, with awareness and understanding of the role of the Physiotherapy and/or Occupational Therapy. You should be able to display sound communication and practical skills.&lt;/p&gt;\n&lt;p&gt;The Service is committed to upholding the Visions and Values of Coventry and Warwickshire Partnership Trust. There will expectation that you are able to exemplify the Trust Visions and Values, with evidence of such in your application and at interview.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;It is essential that the post holder owns, is able to use and drive a car for the purpose of this post. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;* This post is subject to a DBS check.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further information or to arrange an informal visit please contact&lt;/p&gt;\n&lt;p&gt;Clare Mee; Clinical Lead for Therapy on 03002000396&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Coventry and Warwickshire Partnership Trust (CWPT)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121204"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Paybody Building, 2 Stoney Stanton Road, CV1 4FS, Coventry", "postalCode": "CV1 4FS"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4181", "longitude": "-1.49965"}}, "title": "Physiotherapy Assistant  - Band 3", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247742", "validThrough": "2020-11-08T23:59:59+0000"}