{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 per annum"}}, "datePosted": "2020-11-03T11:00:58+0000", "description": "&lt;p&gt;We are looking for a new member of staff to join our existing Admissions teams at the Lewisham Hospital and Queen Elizabeth Hospital, Woolwich. Candidates will need to be flexible with their hours of work as they will be required to participate in the departmental rota to support the departments working hours 8am to 6pm.&lt;br /&gt;&lt;br /&gt;The Admissions Department is looking for motivated, organised individuals to join their friendly team. You will work as part of this team to ensure that patients are admitted to hospital in a timely and efficient manner, making the process as smooth as possible for patients and clinicians.&lt;br /&gt;&lt;br /&gt;This is an exciting time to join a growing department. The role of the Scheduler requires you to cover all specialties and to provide support to other areas during times of annual leave or other absences. Duties will include contacting patients to arrange admission for surgery, booking patients into the hospital database, checking confidential information, liaising with patients medical staff, nursing and Theatre Staff face to face and over the phone, data entry and hospital notes management. &lt;br /&gt;&lt;br /&gt;The successful candidate must have up-to-date keyboard skills, experience of dealing with members of the public and recent clerical experience. A proven ability to be flexible in responding to changing situations is essential. In return, we can offer on the job training, the option to join the NHS pension scheme and if you choose the starting blocks for a career in the NHS. &lt;br /&gt;&lt;br /&gt;This is a challenging role and if you think that you are the right person we would like to hear from you.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Cassandra Broomes, Admissions Supervisor on 020 8836 4156 or cassandra.broomes@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121183.jpg", "name": "Lewisham and Greenwich NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121183"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Admissions (Waiting List Team), London", "postalCode": "SE13 6LH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4543", "longitude": "-.017025"}}, "title": "Admissions Scheduler", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253592", "validThrough": "2020-11-13T23:59:59+0000"}