{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "36738", "minValue": "29888", "unitText": "YEAR", "value": "£29,888 - £36,738 pa inclusive of HCA"}}, "datePosted": "2020-10-23T14:45:52+0100", "description": "&lt;p&gt;&lt;span&gt;Senior Health Play Specialist AfC Band 5&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Evelina London Children’s Hospital is at the heart of a network of children’s health services across South East England. As one of the largest children’s hospital in England, we are at the forefront of clinical excellence and treat young patients from both the local community and the wider country.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Evelina is growing and we have exciting opportunities for two full time Senior Health Play Specialists to join our expanding Therapeutic and Specialised Play Service. Are you confident in assessing, preparing and distracting children and young people through procedures, then this is the job for you!&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Experience of developing therapeutic play provision, the ability to work autonomously and with the wider team and an ability to collect data on the outcomes of your work on improving the patient experience are essential.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We have two permanent positions available:&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;1) The Neurology &amp; Inherited Metabolic Diseases Ward (16 beds) provides a wide range of medical services to children with conditions affecting the brain, spinal cord and nervous system as well as procedures to diagnose and provide acute and long term management of metabolic disorders. Applicants must be highly motivated and enjoy working in a busy but highly rewarding environment. You must have excellent communication skills and have proven experience of working with children and young people with complex additional needs.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;2) Snow Leopard – comprises of different specialities: We have Long term Ventilation (LTV) 6 bedded bay, where we have long term patients who are getting ready to be discharged home and need support through this transition period as they prepare for a new environment . Another group of LTV patients are those coming for initiation of Non-Invasive Ventilation and often struggle with this process, therefore play specialist is heavily involved in supporting them and their parents/ carers in this. Our 2 bedded neuro-rehabilitation aims to improve a patient’s skills after an acquired brain injury, and play often plays a big part in the recovery process. We are also lucky to have Children’s Allergy Day Care Unit where our patients undergo specialised tests and where preparation, distraction and play therapy are tailored to each child’s individual needs by the play specialists.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The team is looking for a creative, enthusiastic and motivated play specialist who can work well across all specialities, and support teams to improve patients’ journey and/or their hospital stay&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will be part of a large network of play specialists within the Evelina and you will be supported in developing your skills and knowledge in your specialist area. Applicants must hold a Play Specialist qualification and be currently registered with HPSET. If you believe you have the skills, enthusiasm and creativity to join our friendly team we want to hear from you.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;br /&gt;Closing Date: 10&lt;span&gt;th&lt;/span&gt; November 2020 at midnight&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Please state on your application whether you have a preference for a specific unit&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameAndrea Swan/ Ewa BenevidesJob titleWard ManagersEmail addressandrea.swan@gstt.nhs.ukTelephone number07721 244491Additional contact information&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Play Specialist Team leader - Susan.Pruden@gstt.nhs.uk&lt;/p&gt;\n&lt;p&gt;Neurology &amp; Inherited Metabolic Diseases Sister - Andrea.Swan@gstt.nhs.uk&lt;/p&gt;\n&lt;p&gt;Snow Leopard Sister - Ewa.Benevides@gstt.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121066.jpg", "name": "Guy's and St. Thomas' NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121066"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Evelina London, London", "postalCode": "SE1 7EH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4979", "longitude": "-.119645"}}, "title": "Health Play Specialist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240982", "validThrough": "2020-11-10T23:59:59+0000"}