{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "22450", "minValue": "22450", "unitText": "YEAR", "value": "Up to £22,450"}}, "datePosted": "2020-10-29T11:33:40+0000", "description": "&lt;p&gt;&lt;strong&gt;Job Introduction&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Turning Point is a leading Social Enterprise which supports people with a wide range of complex needs across Learning Disabilities, Mental Health, Substance Misuse and Public Health. We are currently recruiting for a Senior Recovery Worker to work in our Wakefield Inspiring Integrated Substance Misuse Service, where you’ll have the chance to make a real difference to the lives of the people we support who are experiencing difficulties from drugs and alcohol usage.&lt;/p&gt;\n&lt;p&gt;Passionate about people, you’ll enjoy the opportunity and support to enhance your own life and career too, as you gain the experience and training you need to progress in your career within a social enterprise. So if you’re ambitious and ready for a fresh challenge with a sector leader then this could be the opportunity for you.&lt;/p&gt;\n&lt;p&gt;Running health and social care services as a social enterprise, we invest every penny back into our care – and our people. So, if you’re ambitious and ready for a fresh challenge, progress your career with a sector leader.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Role Responsibility&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As a Senior Recovery Worker you will lead by example and provide guidance and line management support to team members. You will also support the Hub Manager to ensure service delivery targets are met. Significant substance misuse experience essential for this role as well as experience of providing line management or mentorship support.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Ideal Candidate&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Having handled a significant caseload in a busy environment as a Recovery worker or similar, you’ll have a deep understanding of substance misuse, complex needs and the Recovery Agenda. It’s an extremely varied role, so flexibility, a track record of DANOS compliance and knowledge of relapse and other barriers to recovery will be vital. Naturally, we also look for a Senior Recovery Worker with excellent communication skills, ideally, a vocational qualification, such as an NVQ 3, or equivalent. This role requires a high level of administration, organization and time management. These skills are just as important as your people skills and client work. You will be based in Wakefield though travel within the district will be necessary.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About us&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Why Turning Point?&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As a leading health and social care provider with more than 300 locations across England, we take real pride in the services we offer.&lt;/p&gt;\n&lt;p&gt;Across the varied regions, sectors and settings we operate within, our organisation is held together by a shared vision – and our people are connected by the same values. These include belief in potential, confidence in communication, embracing positive change and always treating each other as individuals.&lt;/p&gt;\n&lt;p&gt;We run all of our services on a not-for-profit basis; instead, we invest every penny back into our services and people. We never stop believing in change for the better, and we work constantly to improve the lives of the people we support.&lt;/p&gt;\n&lt;p&gt;Our people bring our vision to life. So, if you are enthusiastic, motivated and committed to support others to fulfilling their potential, here at Turning Point, we don&#39;t just offer you a job – we offer you a career.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What Benefits Will I Receive?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Of course, we know it&#39;s not about the money. But that doesn&#39;t mean we don&#39;t reward our people for their invaluable work with a benefits package that includes:&lt;/em&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Comprehensive opportunities to learn and develop, with silver accreditation from&lt;em&gt;Investors in People&lt;/em&gt;&lt;/li&gt;\n&lt;li&gt;28 days’ paid holiday a year, increasing with each year of service up to 30 days. Plus the option to purchase additional holidays&lt;/li&gt;\n&lt;li&gt;Flexible benefit options including cycle to work schemes and season ticket loans&lt;/li&gt;\n&lt;li&gt;Competitive pension and life assurance schemes&lt;/li&gt;\n&lt;li&gt;Employee assistance programme and access to online health and wellbeing support&lt;/li&gt;\n&lt;li&gt;Flexible working patterns to support work-life balance&lt;/li&gt;\n&lt;li&gt;Access to a wide range of discounts, including cinema tickets, grocery and high-street shopping and gym memberships&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We reserve the right to close this advert early if we are able to appoint to the vacancy before the advertised closed date.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Turning Point", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=131034"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wakefield", "postalCode": "WF1 3AE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.6844", "longitude": "-1.4971"}}, "title": "Senior Recovery Worker - Wakefield Inspiring Recovery", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248135", "validThrough": "2020-11-12T23:59:59+0000"}