{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 per annum, pro rata"}}, "datePosted": "2020-11-03T14:16:51+0000", "description": "&lt;p&gt;Are you looking for a motivating and rewarding career? Do you thrive on a challenge and want to make a difference to patients at Lancashire Teaching Hospitals NHS Foundation Trust in the Division of Gastroenterology?&lt;br /&gt;&lt;br /&gt;An exciting opportunity have arisen for a band 3 nurse to join our busy Gastroenterology nursing team. The nursing team currently consists of a lead band 7 specialist nurse and one band 6 specialist nurse who care for people with Inflammatory Bowel Disease (IBD) across Chorley and Preston and surrounding areas. Recent service re development identified the need for support to the nursing service and in particular, a band 3 nurse who can work well as part of a team but also independently following instruction. This is a fast paced job in an evolving service. The band 3 will be expected to grow with and adapt to the changes in the service as they occur and so resilience, commitment and a sense of humour is required for this post.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;We require an enthusiastic individual with a cheerful disposition and excellent communication skills who has an interest in long term conditions such as IBD. The successful applicant will report to the clinical nurse specialist in IBD, and assist with drug therapy monitoring, the IBD database, the virtual biologics clinic, the IBD Helpline and patient emails where appropriate. Previous gastroenterology experience / exposure would be beneficial but not essential as full training will be given.&lt;/p&gt;\n&lt;p&gt;The successful applicant will be expected to work across both hospital sites and will work closely with the IBD nurses and Lead Gastroenterology Consultant on occasions. The post is full time Monday to Friday for one year with the possibility of a permanent post thereafter. If you feel that this is the role for you, we’d love to hear from you!&lt;/p&gt;\n&lt;p&gt;Interview date: To be confirmed&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameElizabeth CahoonJob titleIBD Highly Specialist NurseEmail addresselizabeth.cahoon@lthtr.nhs.ukTelephone number01772524103Additional contact information&lt;/p&gt;\n&lt;p&gt;alternative contact: Gill Riley -- gill.riley@lthtr.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Lancashire Teaching Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121125"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "royal preston hospital, Fulwood Preston", "postalCode": "PR29RJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7951", "longitude": "-2.70663"}}, "title": "Senior Healthcare Assistant - Inflammatory bowel disease  (IBD)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254308", "validThrough": "2020-11-09T23:59:59+0000"}