{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51393", "minValue": "45780", "unitText": "YEAR", "value": "£45,780 - £51,393 per annum inclusive pro rata"}}, "datePosted": "2020-10-27T13:01:17+0000", "description": "&lt;p&gt;&lt;strong&gt;Team Lead Physiotherapist – Acute Therapy Team&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;1 year Fixed Term Contract covering Maternity Leave&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Band 7 - Full Time - 37.5 hours per week&lt;br /&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Are you looking for a new challenge? Are you interested in service development? Would you like to work for an organisation committed to furthering your learning at Master’s level? Then you could be the person for us.&lt;/p&gt;\n&lt;p&gt;The post holder will be responsible for jointly leading the Acute Therapies Team to provide a high level, 7-day service to all patients within A&amp;E, Same Day Emergency Care (SDEC) and Acute Medical Unit (AMU). They will work closely alongside another Band 7 Physiotherapist with the Band 8 and Band 7 Occupational Therapist. The successful candidate will be expected to carry a varied caseload whilst also supporting the therapists within this high-paced specialty. This will involve working effectively within the Multi-disciplinary Team, leading on complex assessments, discharge planning and ensuring safe onward referral.&lt;/p&gt;\n&lt;p&gt;The post-holder will be integrated into the Acute Therapy Service within UCLH NHS Trust and supported professionally to develop services. Clinically, support will be provided from the Acute Therapies Manager at UCH and from the MDT.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be a dynamic and motivated Physiotherapist who can provide decisive and effective therapy input and can demonstrate leadership qualities, high level communication skills and a flexible approach when working under pressure. Applicants will need experience of working at Band 6 level within an acute NHS setting, including experience within all core physio specialties (neuro, respiratory and MSK/Outpatients). Good knowledge of discharge planning and community services will be essential for this role. Previous experience within community therapy teams would be beneficial.&lt;/p&gt;\n&lt;p&gt;At UCLH we are committed to delivering top-quality patient care, excellent education and world class research. You will be supported and actively encouraged in developing your leadership and clinical skills. This is a great opportunity to work and develop as an individual and as part of a team, gaining clinical and operational experience in a supportive environment.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;“Please note this role’s fixed term contract is for the purpose of covering maternity leave and therefore the end date is subject to change in line with this.”&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;For further information please contact Charlotte Ames, Team Lead Physiotherapist (Tel: 07944669296, Email: charlotteames@nhs.net) Caragh Flannery, Team Lead Occupational Therapist (Tel: 07944669296, Email: caragh.flannery@nhs.net), Hayley McGuiness, Clinical Lead Occupational Therapist (Email: h.mcguiness@nhs.net).&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University College London Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120731"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "UCLH, London", "postalCode": "NW1 2PG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5257", "longitude": "-.13737"}}, "title": "Team Lead Physiotherapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244646", "validThrough": "2020-11-10T23:59:59+0000"}