{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "49325", "minValue": "43712", "unitText": "YEAR", "value": "£43,712 - £49,325 Per Annum Inclusive"}}, "datePosted": "2020-10-28T15:31:15+0000", "description": "&lt;p&gt;The Configuration Lead is an important role, providing essential technical and configuration management expertise to the development and deployment of the Trust&#39;s system.&lt;br /&gt;&lt;br /&gt;The post holder will be lead for the configuration of solution that will contribute to the successful delivery of the programme and the EPR programme. She/he will be taking the lead ensuring that the Trust’s system is designed and configured to meet the complex clinical requirement of the Trust. In particular, the post holder will ensure activities are delivered on time, within budget, to the agreed specification and scope, and to the set quality standards. This will involve the production of plans, documentation and guidance throughout the project lifecycle, ensuring all procedures are adhered to, objectives are identified and met, and benefits realised from new ways of working, that contribute to the Trust’s strategic objectives.&lt;br /&gt;&lt;br /&gt;As an EPR Consultant reporting to the Clinical Systems Support Manager , you will:&lt;br /&gt;&lt;br /&gt;• Reviewing existing application services and supporting systems, working with clinical, operational and technical teams, re-design them to improve service models to align and deliver on strategies linked to the IM&amp;T strategy, service transformation, and the EPR programmes.&lt;br /&gt;&lt;br /&gt;• Ensuring clinical system changes are aligned to the Trust’s objectives, are delivered efficiently, and are fully optimised to underpin patient flow.&lt;br /&gt;&lt;br /&gt;• Lead configuration changes and/or the development of new functionality, ensuring all parts of the systems are fully integrated and tested according to clinical need.&lt;br /&gt;&lt;br /&gt;&lt;br /&gt;• Identifying opportunities and innovative solutions to complex problems and managing their deployment.&lt;br /&gt;&lt;br /&gt;• Creating, maintaining and controlling change throughout the projects life cycle, ensuring all changes made are identified, documented, benefits are realised, evaluated and approved.&lt;br /&gt;&lt;br /&gt;• Ensure documenting and maintaining all system configurations for the systems including configuration amendment decisions made via the change control process.&lt;br /&gt;&lt;br /&gt;• Establish and deliver effective reviews during and post-completion to assess project outcomes.&lt;br /&gt;&lt;br /&gt;• Setting up user groups/support groups in line with operational requirements supporting the EPR System Manager.&lt;br /&gt;&lt;br /&gt;Key requirements:&lt;br /&gt;1. Degree level, preferably in an IT subject&lt;br /&gt;2. GCSE Mathematics and English grade C or higher&lt;br /&gt;3. NHS EPR system configuration and development – (e.g. System C, Cerner,Lorenzo etc.)&lt;br /&gt;&lt;br /&gt;Alternatively:&lt;br /&gt;3. An exceptional candidate, who can provide evidence of employment in a Public Sector or Corporate IT environment as a Systems Administrator and with the relevant knowledge and experience listed below, may be considered.&lt;br /&gt;4. ITIL Framework Awareness &lt;br /&gt;5. ITIL V2 Foundation&lt;br /&gt;&lt;br /&gt;For further information, or to arrange an informal visit, please contact debbie.nkwo Digital Transformation Manager, IM&amp;T e-mail debbie.nkwo1@nhs.net&lt;/p&gt;\n&lt;p&gt;All new staff appointed to posts at the Trust will be subject to a 6 months probationary period. This will give new staff members an opportunity to become familiar with the culture and working environment of the Trust.&lt;/p&gt;\n&lt;p&gt;Applications should be made online, however, queries regarding the application process or assistance with completion of the form (for applicants with a disability) can be made to Amanda Vickers, Recruitment Department on 01708 435000 ext. 3861. Further details regarding the post may be obtained by contacting the manager as per the contact details above.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Barking, Havering and Redbridge University Hospitals Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120782"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Across Site, Romford/Ilford", "postalCode": "RM7 0AG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5686", "longitude": ".178941"}}, "title": "Band 7 Configuration Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247183", "validThrough": "2020-11-11T23:59:59+0000"}