{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82.096 - £110,683 per annum"}}, "datePosted": "2020-10-28T11:17:42+0000", "description": "&lt;p&gt;The Clinical Haematology team at NUH are looking for a new colleague to join their integrated and forward thinking service. This is an opportunity to join a nationally renowned service at the forefront of research and clinical innovation. This is a replacement substantive post within the myeloma team, reflecting the increased workload and complexity in this area. The successful candidate should have a demonstrable clinical and research interest in myeloma.&lt;/p&gt;\n&lt;p&gt;Nottingham University Hospitals NHS Trust is one of the largest in the UK with an annual turnover of approximately £1 billion. It was formed on 1 April 2006, when two top-rated trusts Queen’s Medical Centre and Nottingham City Hospital merged in order to develop a range of high-quality, sustainable patient services across the two campuses. The Centre for Clinical Haematology at the City Campus is a purpose-built, four storey modern building housing two inpatient wards, daycase and clinic facilities, including an apheresis suite.&lt;/p&gt;\n&lt;p&gt;The Department is one of the largest centres for the treatment of haematological malignancies in the UK with a strong reputation for clinical trials and clinical research. This is an ideal opportunity for an ambitious and confident doctor keen to further develop clinical, research and leadership skills in a dynamic inclusive team.&lt;/p&gt;\n&lt;p&gt;The successful candidate will join the myeloma team alongside the 3 current myeloma consultants, supported by a myeloma research fellow, 3 myeloma clinical nurse specialists, and a large clinical research team.&lt;/p&gt;\n&lt;p&gt;This role offers opportunities to participate in undergraduate and postgraduate teaching, educational supervision, research and leadership roles within the specialty.&lt;/p&gt;\n&lt;p&gt;It is a requirement for successful candidates to have completed Specialist Training in the UK or equivalent and to be entered on the GMC Specialist Register for Clinical Haematology or be eligible to be listed within 6 months of interview.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Dr Fran Wadelin (Consultant Haematologist, and Head of Service frances.wadelin@nuh.nhs.uk) on 01159691169 ext 55597.&lt;/p&gt;\n&lt;p&gt;Dr Dean Smith (Consultant Haematologist dean.smith@nuh.nhs.uk), both on 0115 840 4725969&lt;/p&gt;\n&lt;p&gt;Dr Kandee Saravanamuttu kandeepan.saravanamuttu@nuh.nhs.uk 0115 9691169 EXT 54725&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122234.jpg", "name": "Nottingham University Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122234"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "City Hospital, Nottingham", "postalCode": "NG5 1PB"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9893", "longitude": "-1.16006"}}, "title": "Consultant Haematologist with expertise in Myeloma", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246280", "validThrough": "2020-11-29T23:59:59+0000"}