{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615"}}, "datePosted": "2020-11-05T10:16:38+0000", "description": "&lt;p&gt;Are you ready to begin your first qualified position, or are you an existing therapist looking to develop your skills?&lt;/p&gt;\n&lt;p&gt;This Band 5 Occupational Therapy Rotational post sits within the Therapies and Orthotics Directorate of the East Lancashire Hospitals NHS Trust. We are part of a large AHP service for people who live in East Lancashire and Blackburn with Darwen.&lt;/p&gt;\n&lt;p&gt;Our rotational placements cover both acute and community and our band 5s rotate through a wide range of services. Specialities include medicine, trauma and elective orthopaedics, surgery, acute stroke and stroke rehabilitation, neuro-rehabilitation in a specialist unit, community integrated therapy teams and community rehabilitation wards.&lt;/p&gt;\n&lt;p&gt;Please note that some of the rotations are within teams that cover extended hours (8.00am until 6.00pm) and that we offer a 7 day service.&lt;/p&gt;\n&lt;p&gt;The placements are currently for a six or twelve month period depending on the rotational area. These are designed so that there is enough time to develop and gain clinical experience within each clinical service.&lt;/p&gt;\n&lt;p&gt;This post will involve carrying a defined caseload of patients that require core Occupational Therapy skills. The post holder will implement the Occupational Therapy process with patients presenting with a variety of needs arising from occupational dysfunction.&lt;/p&gt;\n&lt;p&gt;The post holder will be responsible for providing general Occupational Therapy advice to other multi agency professionals, junior staff and Occupational Therapy students. You will have responsibility for monitoring, organising and supervising Occupational Therapy Technicians with support from an experienced Occupational Therapist.&lt;/p&gt;\n&lt;p&gt;It is essential you hold a Diploma/Degree in Occupational Therapy and are registered with the HCPC at the time of appointment. You should have up-to-date knowledge of current best practice in Occupational Therapy and have good communication and interpersonal skills to enable you to work effectively as part of the team. We are also looking for enthusiasm to develop skills and experience in a range of settings.&lt;/p&gt;\n&lt;p&gt;It is essential that you are a car driver with access to a vehicle for work purposes. &lt;strong&gt;Please ensure that you clearly indicate this within your application.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This job advert will close as soon as sufficient applications have been received. Please apply for this job as soon as you can, if interested. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameAmanda KirkJob titleTherapies Professional Development LeadEmail addressamanda.kirk@elht.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "East Lancashire Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120742"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Across East Lancashire", "postalCode": "BB2 3HH"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7366", "longitude": "-2.4668"}}, "title": "Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257198", "validThrough": "2020-11-19T23:59:59+0000"}