{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62001", "minValue": "53168", "unitText": "YEAR", "value": "£53,168 - £62,001 Indicative Banding"}}, "datePosted": "2020-10-23T11:01:23+0100", "description": "&lt;p&gt;&lt;span&gt;The Discharge to Assess approach introduced during the initial Covid response, has fundamentally changed the delivery of discharge care from hospitals, enabling the System to make radical improvements for which it had long aspired. There is now a clear requirement to maintain and develop this approach in order to capitalise on the gains that have been made, keeping the very best of new practices, ways of working and structures and maintaining the momentum to make fundamental and long lasting improvements into the future.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;South East Hampshire ICP Health and Care partners are seeking an exceptional individual who can lead on the Discharge to Assess approach within our local Single Point of Access. They will work with health and social care partners, including acute hospital leads, community health providers, primary care, the local authority, the care sector and the voluntary sector, to ensure effective and sustained patient flow. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;This way of working is a radical departure from the past and therefore the postholder will need to inspire confidence and trust with senior colleagues and staff. The postholder will have a range of exceptional personal and leadership attributes and qualities including an ability to build trust and collaborative relationships, innovation and creativity, an ability to learn from the past married with an ability to challenge the norm and a high level of personal resilience.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Southern Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120646"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Gosport", "postalCode": "PO13 0GY"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8231", "longitude": "-1.16234"}}, "title": "Operational Service Lead - Discharge to Assess", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240177", "validThrough": "2020-11-06T23:59:59+0000"}