{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-11-06T12:01:00+0000", "description": "&lt;p&gt;Perinatal Mental Health Practitioners – Band 6 x 2 Posts &lt;br /&gt;Full time 37.5hrs per week, substantive Posts - Job shares considered&lt;br /&gt;Base TBC – 2 posts to cover Powys&lt;/p&gt;\n&lt;p&gt;We are delighted to be offering the opportunity for two highly motivated, passionate and caring professionals to join in the development and delivery of Perinatal Mental Health Services to the residents of Powys!&lt;/p&gt;\n&lt;p&gt;We are looking for two innovative and creative Mental Health professionals, who have the drive and commitment to be part of a developing specialist team meeting the mental health needs of individuals and families across Powys. &lt;br /&gt;As a Perinatal Mental Health (PNMH) Practitioner you will be using your excellent clinical knowledge and experience working with the Psychiatrist and Band 7 Team Lead to establish and deliver interventions from the Perinatal pathway in conjunction with Midwifery, Health visiting, Families and Women’s’ services colleagues across the locality.&lt;/p&gt;\n&lt;p&gt;The Perinatal Mental Health (PNMH) practitioner will work clinically and collaboratively alongside key professionals to oversee and ensure specialist clinical assessment, planning, implementation and evaluation of clinical care in the community for women with PNMH services and their families.&lt;/p&gt;\n&lt;p&gt;The post holders will be influential in promoting mental health wellbeing, demonstrating enhanced competence in complex, clinical assessment, decision making, and the management of clinical needs. There will be times when decision making will require timely and responsive intervention to manage risk.&lt;/p&gt;\n&lt;p&gt;As a PNMH Practitioner you will be an active participant of PTHB Mental Health services directorate, along with the expectation of full engagement with peers and colleagues across Wales to provide services in line with the All Wales Perinatal Mental Health Service. Linking in with the existing Mental Health services both primary and secondary in Powys will require the ability to communicate effectively with a diverse group of professionals to ensure the needs of people requiring perinatal services are met in line within the All Wales Perinatal Fully Integrated Care Pathway.&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; English and/or Welsh speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt;If you believe you have the right skills, energy and experience for the posts as outlined in the Job description and person specification we would love to hear from you! For Informal conversations/questions about the post prior to application please contact - Helen McIntyre, Service Manager Adult Mental Health North Powys on: 07929781781/helen.mcintyre1@wales.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameHelen McIntyreJob titleService Manager Adult Mental Health North PowysEmail addresshelen.mcintyre1@wales.nhs.ukTelephone number07929781781&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123203.jpg", "name": "Powys Teaching Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123203"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "tbc, Powys", "postalCode": "LD3 0LS"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.0102", "longitude": "-3.26181"}}, "title": "Perinatal Mental Health Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259551", "validThrough": "2020-11-19T23:59:59+0000"}