{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £37,890 per annum"}}, "datePosted": "2020-10-06T13:01:34+0100", "description": "&lt;p&gt;&lt;span&gt;&lt;span&gt;An opportunity has arisen for a HCPC Registered Specialist Biomedical Scientist, Band 6 or Band 5 (dependant on relevant qualifications), to join the Swansea Bay University Health Board Laboratory Medicine Service (formed in 2012 from the merger of Laboratory Haematology and Clinical Biochemistry, including Specimen reception and Phlebotomy services). The service currently covers the areas and populations served by four hospital sites i.e. Morriston Hospital, Singleton Hospital, Neath Port Talbot Hospital and the Princess of Wales Hospital. Service provision for the latter is subject to current discussions relating to Health Board boundary change.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;The successful applicant will be expected to work on all sites.&lt;br /&gt;&lt;br /&gt;We are a dynamic department that provides analytical services comprising of Haematology, Transfusion and Clinical Biochemistry. We have managed service contracts with Sysmex, Roche and Ortho, which allows us to standardise service delivery across the network.&lt;br /&gt;&lt;br /&gt;Laboratory Medicine is developing a multidisciplinary workforce and cross training between Haematology and Biochemistry specialisms. We are looking for enthusiastic Biomedical Medical Scientists who will further embrace the challenges of cross training to progress to multidisciplinary working. Additional opportunities to rotate to specialist areas within Laboratory Medicine will be provided dependant on service needs.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Salary and banding will depend upon relevant experience. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Final year students following the PTP process or trainees may be considered for this role.&lt;br /&gt;&lt;br /&gt;There is a requirement for participation in the multi-site rota covering all shifts so a flexible approach to work is a requirement of the post. Shift enhancements under Agenda for Change terms and conditions apply.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;The ability to speak Welsh is desirable for this post; English and/or Welsh speakers are equally welcome to apply.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Nick.Dorward@wales.nhs.uk&lt;br /&gt;01792 702222 ext. 39153&lt;/p&gt;\n&lt;p&gt;OR&lt;/p&gt;\n&lt;p&gt;Lee.Peters@wales.nhs.uk&lt;br /&gt;01792 7033037&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123207.jpg", "name": "Swansea Bay University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123207"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Morriston, Singleton &amp; Princess of Wales Hospitals, Swansea &amp; Bridgend", "postalCode": "SA6 6NL"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6847", "longitude": "-3.93527"}}, "title": "Specialist Biomedical Scientist/Biomedical Scientist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916214755", "validThrough": "2020-11-22T23:59:59+0000"}