{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "18933", "minValue": "18562", "unitText": "YEAR", "value": "£18,562 - £18,933 per annum pro rata"}}, "datePosted": "2020-11-05T16:21:02+0000", "description": "&lt;p&gt;This is Redcar and Cleveland. We are an ambitious council keen to build on our strong track record of innovation and partnership working, ensuring that we create a flourishing future for the borough and all of its residents. Key to this is a committed workforce who always gives their best. Offering a fast paced, progressive working environment, Redcar and Cleveland Borough Council is a great career move.&lt;br /&gt;&lt;br /&gt;The Adults &amp; Communities Directorate consists of three strands, Adult Social Care, Community Development, and Public Health. Our aims are to continue to provide essential and highly valued services and to build capacity to enable local communities to make lasting change, improve quality of life and prosperity. As a directorate we lead on developing a culture of co-operation and co-production, respecting and nurturing the skills and talents of local people and enabling them to fulfil their potential.&lt;br /&gt;&lt;br /&gt;We are seeking to recruit an experienced carer to work within Jervaulx residential care home. The position involves supporting adults with learning disabilities to work towards achieving their individual aims and goals, providing a high standard of person centred care and support. Experience in providing personal care is essential. It would be desirable for applicants to have a minimum level 2 qualification in Care or its equivalent.&lt;br /&gt;&lt;br /&gt;Should you wish to have an informal chat about the role with one of the management team, please contact Michelle Skjelhaug Manager or Tracey Clark Deputy Manager on the following number - 01287 653814.&lt;br /&gt;&lt;br /&gt;The authority is committed to safeguarding and promoting the welfare of children/young people and vulnerable adults. We expect all staff and volunteers to share this commitment and an enhanced disclosure &amp; barring service check (DBS) will be sought.&lt;br /&gt;&lt;br /&gt;The council holds ambassador status for the North East Better Health at Work Award.&lt;br /&gt;&lt;br /&gt;We offer very attractive terms and conditions of employment, including generous annual leave entitlement, flexible working hours (where appropriate), membership of the Local Government Pension Scheme and access to numerous other salary sacrifice schemes and staff benefits/discounts, including a lease car scheme.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Redcar and Cleveland Borough Council", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130615"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Skelton, Saltburn", "postalCode": "TS12 2NL"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.5611", "longitude": "-.967567"}}, "title": "Support Assistant (22 hours)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258543", "validThrough": "2020-11-12T23:59:59+0000"}