{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "107668", "minValue": "79860", "unitText": "YEAR", "value": "£79,860 - £107,668 per annum"}}, "datePosted": "2020-10-14T14:46:02+0100", "description": "&lt;p&gt;The Job description for the vacancy is awaiting for royal college approval, the job description will be provided once the approval is received&lt;/p&gt;\n&lt;p&gt;We are looking for a Consultant Psychiatrist to join the inpatient team at Laurate House in South Manchester within the Greater Manchester Mental Health Trust. The post has become available since the current post holder wants to move to another post in the Trust for career development.&lt;/p&gt;\n&lt;p&gt;We are a dynamic and innovative Trust providing an excellent environment in which employees can develop and progress in their career. We value work- life balance and support our staff in achieving this.&lt;/p&gt;\n&lt;p&gt;This is an exciting time to join our dedicated teams to support further development of our inpatient mental health services following the development of a new Greater Manchester Mental Health NHS Foundation Trust.&lt;/p&gt;\n&lt;p&gt;The post holder will be a dedicated full time Consultant Psychiatrist (10 Programmed Activities) to work and will be responsible for 21 beds in a mixed sex inpatient unit. This post will be supported by junior trainees. You will work as part of multi-disciplinary teams and will be expected to provide clinical leadership in managing the care of the patients.&lt;/p&gt;\n&lt;p&gt;It is also expected your role would include liaison with other agencies including the Local authority, Child Protection teams and Voluntary Sector Agencies. You will need you have an excellent knowledge of safeguarding of vulnerable adults and children.&lt;/p&gt;\n&lt;p&gt;The Trust is committed to safeguarding children, young people and vulnerable adults and requires all staff and volunteers to share this commitment.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDr Boben BenjaminAdditional contact information&lt;/p&gt;\n&lt;p&gt;Dr Boben Benjamin - Lead Consultant&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Email: boben.benjamin@gmmh.nhs.uk&lt;/p&gt;\n&lt;p&gt;Tel: 0161 3571366&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121714.jpg", "name": "Greater Manchester Mental Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121714"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Manchester, Manchester", "postalCode": "M25 3BL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5368", "longitude": "-2.29146"}}, "title": "Consultant Psychiatrist Inpatient General Psychiatry", "url": "https://www.jobs.nhs.uk/xi/vacancy/916226729", "validThrough": "2020-11-25T23:59:59+0000"}