{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "68891", "minValue": "60058", "unitText": "YEAR", "value": "£60,058 - £68,891 pa. inc."}}, "datePosted": "2020-10-30T15:31:45+0000", "description": "&lt;p&gt;**Please note that applicants with at risk status will be given priority consideration**&lt;/p&gt;\n&lt;p&gt;As the Senior CHC Manager in the Continuing Care Team the post holder will report to the Deputy Director of Continuing Healthcare (North London) PUPoC Governance and NEL Safeguarding Lead&lt;/p&gt;\n&lt;p&gt;to ensure the local health and social care system delivers safe and effective services to patients within the areas CHC provision as commissioned by our customers the CCGs to provide CHC support.&lt;/p&gt;\n&lt;p&gt;The post holder will:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Be responsible for leading on the key operational day to day areas of work relating to CHC and to the care of CHC and FNC eligible patients, specifically ensuring that the CHC service is fully compliant with all requirements in the national framework for Personal Health Budgets (PHB, )NHS Funded CHC and NHS-funded nursing care (FNC)&lt;/li&gt;\n&lt;li&gt;Playing a key role working with the Deputy Director of Continuing Healthcare (North London) PUPoC Governance and NEL Safeguarding Lead in bringing together the relevant stakeholders to ensure quality and value for money in the provision of NHS Funded CHC and FNC&lt;/li&gt;\n&lt;li&gt;Support and manage joint working with the Children’s Continuing Care Team(s) to ensure that the transition process from Children’s to Adults services is of a high standard and is compliant with the national framework.&lt;/li&gt;\n&lt;li&gt;Provide the appropriate contracting leads with support in relation to the development of services for CHC eligible patients, providing and informed perspective to the development of strategies and service planning for these vulnerable groups.&lt;/li&gt;\n&lt;li&gt;Be part of the senior Business Multidisciplinary Team (MDT), and contribute to ensuring that appropriate business expertise is available to the Director of Integration and CHC, for monitoring, analysing and reporting on quality and performance.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;This post will work closely with the Head of Business Multi-disciplinary Team (MDT) comprising quality, contracting, finance and business intelligence which supplies services to Clinical Commissioning Groups across different regions. The local Business MDT works in close partnership with the local senior CHC Operations Team to provide an integrated CHC service.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please refer to Role specific duties and responsibilities within attached Job Description.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Mary Jamal&lt;br /&gt;Mary.Jamal@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NEL Commissioning Support Unit", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127694"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Clifton House, London", "postalCode": "EC2A 2DU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5222", "longitude": "-.084148"}}, "title": "Senior CHC Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250767", "validThrough": "2020-11-12T23:59:59+0000"}