{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 to £21,142 pa (based on full time hours)"}}, "datePosted": "2020-11-03T09:45:15+0000", "description": "&lt;p&gt;Full time post 37.5 hours per week&lt;/p&gt;\n&lt;p&gt;We are seeking an experienced male band 3 Health Care Support Worker to join our friendly Home Treatment Team based in Elmleigh, Havant. Home Treatment Team is a service provided within our Crisis Resolution Home Treatment Team. The role is working across 7 days a week 9-5pm with the expectation of covering within our 24 hour Crisis Team when required.&lt;/p&gt;\n&lt;p&gt;Within your role you will be providing responsive, evidence based and recovery focused care to the patients experiencing a self defined Mental Health Crisis Team.&lt;/p&gt;\n&lt;p&gt;You will work as part of a multi-disciplinary team, alongside, Nurses, Social Worker’s, OT’s, HCA, Medical team and Admin. We will provide an intensive treatment plan to support patients in the community, averting hospital admission where possible. Whilst also supporting individuals along their journey through the Acute Care Pathway from the hospital environment to home.&lt;/p&gt;\n&lt;p&gt;As part of the role, the candidate will take part in meeting the competencies by taking part in training and a comprehensive induction programme.&lt;/p&gt;\n&lt;p&gt;In return for your dedication we can offer you full training and the opportunity to develop your career in healthcare with support for further training and qualifications.&lt;/p&gt;\n&lt;p&gt;Due to the nature of the role a valid driving licence and access to a vehicle for work purposes is essential for this post.&lt;/p&gt;\n&lt;p&gt;SHFT are an equal opportunities employer and welcome applications from all who believe they fit the essential requirements for this role regardless of their race, sex, disability, religion/belief, sexual orientation or age.**However exemption is claimed under the Equality Act 2010 Part 1 Schedule 9 and applications can only be accepted from males due to the care needs of the MALE residents/patients**&lt;/p&gt;\n&lt;p&gt;If you would like to know more about this role or you would like to come and visit please contact Harold Kombe on 02392 682820 or via email harold.kombe2@southernhealth.nhs.uk&lt;/p&gt;\n&lt;p&gt;We look forward to hearing from you.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Happy to talk flexible working&lt;/strong&gt;- all requests for flexible and part time working will be considered.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Follow us on Facebook and on Twitter: &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;facebook.com/SouthernHealthNHS&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;@&lt;/strong&gt;Southern_NHSFT&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Southern Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120646"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Havant", "postalCode": "PO9 2JJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8565", "longitude": "-.975569"}}, "title": "Male Health Care Support Worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253299", "validThrough": "2020-11-17T23:59:59+0000"}