{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "15482", "minValue": "15482", "unitText": "YEAR", "value": "£9.21 per hour excluding holiday pay"}}, "datePosted": "2020-11-04T10:03:21+0000", "description": "&lt;p&gt;&lt;strong&gt;Job Title and Grade:&lt;/strong&gt;Band 2 Pharmacy Support Worker&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location/Trust:&lt;/strong&gt;4th Floor In-patient Pharmacy, (Royal Manchester Children’s Hospital) Oxford Road Manchester M13 9WL&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Department Covered:&lt;/strong&gt;Pharmacy&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Pay Rates:&lt;/strong&gt;£9.21&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Placement Ref/ID&lt;/strong&gt;: 35990&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Role:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;A passion for putting patients first&lt;/strong&gt;…… join the bank for flexibility in how you work.&lt;/p&gt;\n&lt;p&gt;Would you like to be part of a Trust where the values are places emphasis on working together, honesty and everyone matters to produce the best care?&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;If you answered ‘yes’ to the above, we’d love to hear from you!&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We have long term placement opportunities available for Pharmacy Support Workers available at Manchester University NHS Foundation Trust, specifically providing the following:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To ensure the timely collection and delivery of ward generated prescriptions / orders to the appropriate areas within the Pharmacy Department&lt;/li&gt;\n&lt;li&gt;To distribute medical gases and pharmaceutical products to wars and departments within the Hospitals on the Oxford Road Campus.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Key Responsibilities:&lt;/p&gt;\n&lt;ol&gt;\n&lt;li&gt;Be responsible for the safe and effective delivery of ‘controlled drugs’ to wards and departments through the Trust, following strict procedures and liaising appropriately with ward staff on delivery.&lt;/li&gt;\n&lt;li&gt;Distribute medical gases and pharmaceutical products to designated areas at allocated times throughout the day.&lt;/li&gt;\n&lt;li&gt;Collect and deliver ward generated prescriptions and orders at allocated times throughout the day.&lt;/li&gt;\n&lt;li&gt;Participate in general housekeeping duties within the pharmacy stores, medical gases and distribution areas as identified by the Pharmacy Stores Manager, Distribution Team Leader or the Medical Gases Manager.&lt;/li&gt;\n&lt;li&gt;Liaise with relevant colleagues responsible for the supply of medical gases and pharmaceutical products in order to facilitate service development and good practice.&lt;/li&gt;\n&lt;li&gt;Ensure all pharmaceutical products are transported safely and securely using allocated locked trucks and trolleys.&lt;/li&gt;\n&lt;li&gt;Actively contribute to the safe storage and handling of pharmaceutical products.&lt;/li&gt;\n&lt;li&gt;Assist in the stock rotation within the stores, keeping the bulk fluid work area tidy.&lt;/li&gt;\n&lt;li&gt;Take part in the moving and handling of large quantities of bulk fluids on a daily basis, using lifting aids where necessary and ensuring all tasks are undertaken in compliance with statutory safety regulations and handling policy in order to minimise personal injury.&lt;/li&gt;\n&lt;/ol&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Requirements:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;NVQ2 in Pharmacy or similar would be desirable but not essential&lt;/p&gt;\n&lt;p&gt;Some pharmacy experience would be desirable but not essential&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;In return for your hard work commitment NHS Professionals (NHSP) can offer you some fantastic benefits: –&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Competitive Pay Rates&lt;/strong&gt;- work this week, get paid next week!&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;First choice of placements at over 50 NHS Trusts in England&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Dedicated consultants&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Flexible working options&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Free DBS and free training&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Build holiday allowance&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Support when you need it – 24/7 365 days –&lt;/strong&gt;Call us anytime on 03330 144 370&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Stakeholder pension scheme&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Who are NHS Professionals?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;NHS Professionals (NHSP), owned by the Department of Health and Social Care (DHSC), works in partnership with hospital trusts to provide a bank of highly skilled temporary workers who want to work flexibly within the NHS.&lt;/p&gt;\n&lt;p&gt;Working through the NHSP bank means Trusts don’t have to rely on expensive agencies. Right now, we have over 130,000 members registered on our bank from various roles, grades and specialities, saving the NHS over&lt;strong&gt;£70 million&lt;/strong&gt;each year. This money is then reinvested back into the NHS.&lt;/p&gt;\n&lt;p&gt;Register today for various flexible working options and long-term placement opportunities.&lt;/p&gt;\n&lt;p&gt;For more information on the roles or details on how to join NHS Professionals, simply get in touch with Phil Chafer, Recruitment &amp; Placement Consultant on 01442915242 or&lt;span style=&quot;text-decoration: underline;&quot;&gt;Philip.chafer@nhsprofessionals.nhs.uk&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;We look forward to hearing from you soon.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Disclaimer&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Please note, you will be contacted by email throughout the recruitment process, so please check your emails, including your junk/spam regularly. We regret we cannot contact everyone who is not selected for an interview, therefore if you do not hear from us within 21 days after submitting your application, please assume you have not been successful on this occasion&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "NHS Professionals - Flexible Workers", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121069"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Manchester", "postalCode": "M13 9WL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4625", "longitude": "-2.22771"}}, "title": "Band 2 Pharmacy Support Worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255306", "validThrough": "2020-11-18T23:59:59+0000"}