{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890"}}, "datePosted": "2020-10-29T09:45:02+0000", "description": "&lt;p&gt;We are pleased to offer an opportunity to join our busy, customer focussed, high performance team as an IT Support Manager. There are two positions, one based at QE and the other based at Heartlands.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;Responsible for a team who will be providing high quality, responsive, customer focussed, 1st and 2&lt;/span&gt;&lt;span&gt;nd&lt;/span&gt;&lt;span&gt;line IT Service and Support on a 24/7 shift basis to Trust users and stakeholders.&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;You will need to be a keen team player with a conscientious, outgoing personality and ability to communicate well at all levels. Equally important will be your commitment, drive and enthusiasm to delivering high levels of customer satisfaction within a “Service Excellence” driven culture.&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Due to the nature of the role, the ideal candidate should be self-motivated, able to remain calm and efficient under pressure, and have the ability to work on their own initiative as well as part of the wider Service Centre Team.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;The post holder will provide remote desktop and telephone support to all internal and external supported IT users. Infrastructure Management and Inventory software is mainly used to manage and resolve these incidents, but site visits (some remote) are also required as necessary to all supported locations at any time.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;The post holder will provide first and second line support for all desktops, printers and printer servers, handheld tablet and PDA devices and all software installed. This is predominantly, but not exclusively, in a Microsoft networked environment and will involve managing the allocation of first and second line support resources.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University Hospitals Birmingham NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123452"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Birmingham", "postalCode": "B15 2TH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4533", "longitude": "-1.93628"}}, "title": "IT Support Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247753", "validThrough": "2020-11-16T23:59:59+0000"}