{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51393", "minValue": "45780", "unitText": "YEAR", "value": "£45,780 - £51,393 per annum inclusive"}}, "datePosted": "2020-10-08T12:31:20+0100", "description": "&lt;p&gt;An exciting opportunity has arisen for a Senior Healthcare Scientist to join our Chemical Pathology Department. You will join the team of Healthcare Scientist at one of the largest paediatric clinical biochemistry departments in the UK. &lt;br /&gt;&lt;br /&gt;The Chemical Pathology Dept at GOSH is part of the Paediatric Laboratory Medicine, and has strongly clinical ties with the Metabolic, Endocrine, Neurology, Gastro-enterology, Transplant and other Clinical Teams. The department hosts the UKs largest Newborn screening service screening approximately over 120,000 newborns per year. We also provide a comprehensive diagnostic, treatment and management service to children with a wide range of different conditions including rare inherited metabolic diseases. The Metabolic sections provides a wide range of biochemical tests such as organic acids, amino acids and acylcarnitines for screening and diagnosis of rare inherited metabolic diseases. The Laboratory also has strong links with the Neurometabolic Unit at the National Hospital for Neurology and Neurosurgery and several staff members have joint contracts. The Laboratory also has strong academic links with the GOSH Institute of Child Health and is involved in a variety of research projects in the UK and overseas. &lt;br /&gt;&lt;br /&gt;Your role will predominantly be within the Metabolic section but will involve clinical support for the Routine Biochemistry section. You will also participate in the duty biochemist rota where you will handle day to day clinical queries for the whole department and results reporting and interpretation rota.&lt;/p&gt;\n&lt;p&gt;Applicants should have completed their registration portfolio and and be HCPC state registered. An accredited MSc degree in Clinical Biochemistry or a related subjected is essential. You should have good communication skills, be able to work well in a team and be able to take initiative and prioritise workload. The work requires consistent attention to detail and excellent organisational skills.&lt;/p&gt;\n&lt;p&gt;Further professional development for FRCPath membership is strongly encouraged with regular internal seminars and financial assistance to attend external courses.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Interviews will be held between 19th and 27th November &lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Name Helen Aitkenhead Job title Consultant Clinical Scientist &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Email address helen.aitkenhead@gosh.nhs.uk &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Telephone number 02078138318&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Additional contact information&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Helen Prunty, Principal Clinical Scientist for the Metabolic Laboratory on 02078138318 or email helen.prunty@gosh.nhs.uk&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121180.png", "name": "Great Ormond Street Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121180"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Great Ormond Street Hospital for Children NHS Foundation Trust, London", "postalCode": "WC1N 3JH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5222", "longitude": "-.119898"}}, "title": "Clinical Scientist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916218300", "validThrough": "2020-11-08T23:59:59+0000"}