{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum pro rata"}}, "datePosted": "2020-11-05T12:46:18+0000", "description": "&lt;p&gt;&lt;em&gt;Come and work for NELFT, an organisation that values the best care by the best people. &lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;Are you enthusiastic, motivated and an experienced CAMHS Practitioner, who has an interest and knowledge of working with Children and Adolescents who present with mental health and significant behavioural difficulties.&lt;/p&gt;\n&lt;p&gt;If so this is the job for you.&lt;/p&gt;\n&lt;p&gt;As a key part of our Children and Young Peoples Mental Health Service, the post holder will undertake CAMHS assessments of children and young people up to age 18 with formulation and diagnosis, and recommendations for treatment within a spectrum of mental health presentations. You will have a caseload, offering evidence based interventions to children and adolescents with complex mental heath needs and their families .&lt;/p&gt;\n&lt;p&gt;You will have the ability to deliver a range of evidence based clinical interventions for children and young people and will be supported to train in other treatment modalities . Close working relationships with members of the team and partnership agencies e.g. Social Services, Education and others is essential.&lt;/p&gt;\n&lt;p&gt;You must demonstrate an interest in multi-agency and multi-disciplinary work and be familiar with evidence-based practice in childrens mental health. There are excellent opportunities for CPD, in service teaching and supervision within the team and the Trust.&lt;/p&gt;\n&lt;p&gt;You must be able to work independently and have good clinical / therapeutic and case management skills to engage this group of young people.&lt;/p&gt;\n&lt;p&gt;NELFT have 7 locality teams based across Kent incorporating a range of town and rural communities, each with their own demographic needs.&lt;/p&gt;\n&lt;p&gt;We have a variety of posts available across the 7 teams, and the availability to travel is essential as we promote working with children in a range of settings, which may include their homes, schools and wider community settings&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Probationary Period&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This post will be subject to a probationary period. Internal applicants are exempt from the probationary period (unless you are an internal applicant currently part way through a probationary period or currently a bank member of staff).&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Assessment/Interview info&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;At NELFT we set very high standards to ensure we provide quality services. We require prospective employees to carry out an online literacy and numeracy test, equivalent to NVQ Level 2. For more information regarding our assessments, please visit our website. If you are shortlisted, invited for interview and successfully offered the post, you will be required to undertake an assessment for these skills during the pre-employment checks.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Starting with NELFT&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;NELFT place a great deal of importance on new starters being properly welcomed and inducted into the Trust. All new starters will join the Trust on the first Monday of each month and will undertake a comprehensive induction of up to two weeks which will include mandatory training, systems training and the allocation of equipment. As part of the process new starters will have the opportunity to also meet the executive team, senior managers and attend a number of drop in sessions focussing in engagement, health and wellbeing and key processes. The induction will be held at our head office in Rainham, Essex.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Bonny Andrews&lt;/p&gt;\n&lt;p&gt;Integrated Team Manager&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Bonita.andrews@nelft.nhs.uk&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NELFT NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120606"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Orchard House Clinic, Thanet", "postalCode": "CT10 2TT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3663", "longitude": "1.42083"}}, "title": "CYPMHS (CAMHS) Nurse/OT/Social Worker/BACP CBT Multi-Disciplinary Pat", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257712", "validThrough": "2020-11-19T23:59:59+0000"}