{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 Per annum"}}, "datePosted": "2020-11-05T13:46:09+0000", "description": "&lt;p&gt;&lt;strong&gt;The Role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for a forward thinking mental health professional to join our team, the Tamar Complex care and dementia team, .&lt;/p&gt;\n&lt;p&gt;You will be involved in the delivery of evidence based interventions and the coordination of care to a caseload of individuals experiencing severe mental health difficulties, including dementia and functional mental health issues age 75 and over.&lt;/p&gt;\n&lt;p&gt;The role also involves close liaison and partnership working with GPs and other agencies to enable a recovery focussed approach. This is an exciting opportunity to be involved in the further development of this role as the service evolves.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About You&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for a confident and motivated practitioner with excellent communication skills and a professional back ground in either Mental Health nursing, Occupational Therapy or as a Social Worker, who can demonstrate the Trust’s vision and values in their clinical practice. You will need to demonstrate confidence in the delivery of assessment and treatment interventions/therapy to a caseload of service users,. You need to be enthusiastic, passionate and driven to work with a team focused on the recovery of their clients. You will need to show an interest in delivering current evidence based treatments. You will be committed to keeping service users and carers at the heart of everything that you do, and be enthusiastic about cultivating the growth of community mental health services. We are looking for a professional who has the ability to adapt, learn and make a meaningful contribution to future service provision.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Team&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are part of a countywide Complex Care and Dementia Service. Based in Liskeard and covering South East Cornwall, our team is situated within easy reach of the university city of Plymouth.&lt;/p&gt;\n&lt;p&gt;We work with individuals who have a diagnosis of dementia or a functional mental health issues , age 75 and over. The team comprises of a Consultant Psychiatrist , Occupational therapist, Community Psychiatric Nurses, Memory Assessment Nurses , Health Care Assistants, Clinical lead in Memory and Memory care coordinator.&lt;/p&gt;\n&lt;p&gt;We can offer you:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A supportive team environment where new ideas and innovation are welcomed, considered and acted on.&lt;/li&gt;\n&lt;li&gt;Regular supervision and caseload management to help you balance your caseload&lt;/li&gt;\n&lt;li&gt;Mandatory training program to maintain your core skills.&lt;/li&gt;\n&lt;li&gt;Access to personalised training in line with a yearly appraisal &amp; PDP. We want to develop your skills and expertise.&lt;/li&gt;\n&lt;li&gt;We can offer opportunities to help you access cpd activities to develop your career further..&lt;/li&gt;\n&lt;li&gt;A team base with free parking, access to pool cars and close to a mainline railway station.&lt;/li&gt;\n&lt;li&gt;Health &amp; wellbeing programme&lt;/li&gt;\n&lt;li&gt;Team away days to enable us to grow as a team and focus on our shared priorities.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;South East Cornwall is a great place to live and work with access to beautiful coastline, beaches and countryside as well as easy access to Plymouth’s shops, theatres and restaurants.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Jayney Henwood&lt;/p&gt;\n&lt;p&gt;Locality Team Manager, North and East Complex Care and Dementia Service.&lt;/p&gt;\n&lt;p&gt;07900607395&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120947.png", "name": "Cornwall Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120947"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Trevillis House, Liskeard, Liskeard", "postalCode": "PL25 4QN"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.3377", "longitude": "-4.78279"}}, "title": "Community Mental Health Practitioner - North&amp;East Cornwall - Band 5", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257948", "validThrough": "2020-11-19T23:59:59+0000"}