{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-11-02T15:01:20+0000", "description": "&lt;p&gt;Cardiff and Vale UHB - University Hospital of Wales/University Hospital Llandough&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Clinical Pharmacist - Rotational (Band 7)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you have, or expect to gain your post-graduate pharmacy diploma this year, join us to embark on a new challenge, with the opportunity to influence the future direction of pharmacy services!&lt;/p&gt;\n&lt;p&gt;That opportunity begins when you join our team as a rotational pharmacist. Our posts will enable you to deepen your knowledge and expertise, and broaden clinical and non-clinical skills under the direction of experienced lead practitioners in a variety of clinical areas including acute medical admissions, paediatric oncology, nephrology and transplant, haematology, clinical trials and critical care. You can join our continuing drive to improve quality as we embark on a major redesign of our provision of integrated medicines management services; we aim to achieve the best outcomes for our patients through delivery of excellence in pharmaceutical care.&lt;/p&gt;\n&lt;p&gt;Our strategy for supportive personal development, which includes expanding the pool of pharmacist prescribers, has resulted in over 80% of previous rotational pharmacists successfully stepping up to more senior pharmacy positions both locally and further afield. We recognise that our profession’s future leadership will come from pharmacists like you, with drive and ability. Join our highly motivated team and share in our values, caring for people, keeping them well.&lt;/p&gt;\n&lt;p&gt;At Cardiff and Vale UHB our values demonstrate our commitment to our patients:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;We care about the people we serve and the people we work with&lt;/li&gt;\n&lt;li&gt;We trust and respect one another&lt;/li&gt;\n&lt;li&gt;We take personal responsibility&lt;/li&gt;\n&lt;li&gt;We treat people with kindness&lt;/li&gt;\n&lt;li&gt;We act with integrity&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We plan to hold an open event to give you the chance to meet us and discover more about how you could progress your career as part of Wales’ capital flagship healthcare providers. For more details please call Tim Banner (Head of Patient Services) on 029 2074 2996.&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; Welsh and/or English speakers are equally welcome to apply. &lt;/p&gt;\n&lt;p&gt;Closing Date: 16/11/2020 &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact: &lt;/p&gt;\n&lt;p&gt;Anthony Lewis/Adrian Turk/Suzanne Davies&lt;/p&gt;\n&lt;p&gt;Tel: 02920 746795&lt;/p&gt;\n&lt;p&gt;Steve Gage&lt;/p&gt;\n&lt;p&gt;Tel: 02920 748024&lt;/p&gt;\n&lt;p&gt;Tim Banner&lt;/p&gt;\n&lt;p&gt;Tel: 02920 742996 &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123193.jpg", "name": "Cardiff and Vale University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123193"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "University Hospital of Wales or University Hospital Llandough, Cardiff", "postalCode": "CF14 3UB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.499", "longitude": "-3.19007"}}, "title": "Clinical Pharmacist - Rotational", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252527", "validThrough": "2020-11-16T23:59:59+0000"}