{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "53459", "minValue": "47544", "unitText": "YEAR", "value": "£47,544 - £53,459 inc. Fringe HCAS"}}, "datePosted": "2020-10-10T16:43:12+0100", "description": "&lt;p&gt;An exciting opportunity has arisen for 2 full time Advanced Nurse Practitioner/ Independent Non- Medical Prescriber to join our Home Treatment Teams in Frimley and Cherstey. You will join a hard-working multidisciplinary team of practitioners, who support people in crisis in their own homes. You will have extensive experience in working with people who are at the threshold of inpatient admissions. These are exciting times for the service as we aim to build on the positive inspections of our crisis services. You will ensure service users in crisis have timely access to medication reviews and treatment in line with recommended best practice. You will be strong at advising junior members of staff as well as devising positive risk taking plans for people being referred for admissions or home treatment interventions.&lt;/p&gt;\n&lt;p&gt;The candidate must have a full and valid driving licence due to the community element of the role and the large geographical area this Team covers.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121260.jpg", "name": "Surrey and Borders Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121260"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Chertsey, Frimley", "postalCode": "KT22 7AD"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2976", "longitude": "-.335577"}}, "title": "Advanced Nurse Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916221393", "validThrough": "2020-11-12T23:59:59+0000"}