{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "B5 £24,907 - £30,615 B6 £31,365 - £37,890 per annu"}}, "datePosted": "2020-11-04T11:16:21+0000", "description": "&lt;p&gt;We have an exciting opportunity for you to join our growing team of dedicated friendly CT Radiographers, as we are in the process of expanding our CT services at both Scunthorpe and Grimsby hospitals.&lt;/p&gt;\n&lt;p&gt;The CT Department at Scunthorpe now has two GE CT scanners this is in order to provide an efficient patient centred service across all specialities. We have recently moved to working a nightshift, to allow for a better service for patients as well as a better work life balance for staff.&lt;/p&gt;\n&lt;p&gt;We are district general hospitals who presently perform a wide range of examinations including Trauma, Oncology, CT angiography work, CT biopsies and Radiographer led CT colon sessions with a future plan to provide cardiac services for the Trust with the opening of the additional scanner.&lt;/p&gt;\n&lt;p&gt;Our Radiologists support the Radiographer led CT Colon service and training is actively supported on a regular basis to allow Radiographers to achieve this skill.&lt;/p&gt;\n&lt;p&gt;We are looking for highly motivated Radiographers, ideally with experience in CT, although training can be given, who are passionate about providing exceptional patient care to join our close knit team.&lt;/p&gt;\n&lt;p&gt;Suitable candidates must be HCPC registered and would ideally hold a Post Graduate Certificate in CT imaging although this is not essential. Applications from Radiographers who are currently working as a Band 5 Radiographer who may wish to specialise in CT are also welcomed as training would be given.&lt;/p&gt;\n&lt;p&gt;The ability to perform intravenous cannulations would be desirable however training will be provided for suitable candidates. The department actively encourages CPD and supports post graduate certificate training.&lt;/p&gt;\n&lt;p&gt;We are a busy department that is open 7 days a week and this post requires working a variety of shifts in response to the service needs and participation in the nightshifts would be a requirement of the role. Part time working would also be considered.&lt;/p&gt;\n&lt;p&gt;Northern Lincolnshire &amp; Goole NHS Foundation Trust consists of Scunthorpe General Hospital, Diana Princess of Wales Hospital, and the smaller Goole District Hospital. Imaging services are provided across all 3 sites. We have busy, friendly departments with dedicated teams of Radiographers and Consultant Radiologists, with a good working relationship with Clinicians and other Service Users.&lt;/p&gt;\n&lt;p&gt;We have well-developed equipment; 64 slice CT scanners, and 1.5T MRI scanners at each site, and the Trust investment programme continues to demonstrate commitment to service improvement. Scunthorpe The Blue Sky Imaging Suite opened in Aug 2012, and is a purpose built cross-sectional imaging suite, housing a GE Optima 660 64 slice CT scanner, a GE Revolution 64 slice CT scanner, and a GE 450W wide bore 1.5T MRI scanner. Diana, Princess of Wales Hospital, Grimsby The CT/MRI department has a GE revolution CT scanner and a Philips Intera Acheiva 1.5T MRI scanner. Building works are in progress at Grimsby on a purpose built MRI unit for two new philips 1.5T scanners which will replace the current MRI scanner.&lt;/p&gt;\n&lt;p&gt;The main requirement for this recruitment venture will be for the successful candidate to have base site of Scunthorpe. Flexibility is required, and there may be opportunities to work across the sites in certain circumstances.&lt;/p&gt;\n&lt;p&gt;As a Trust, we are actively committed to CPD, and encourage people to widen their scope of practice, currently having radiographers performing IV cannulation, radiographer reporting, &amp; Radiographer led CT Colonography. We have a comprehensive Induction Programme, which is directly linked to a competency-based structure. We have direct links with Sheffield Hallam University from where we provide clinical placements across sites for student radiographers, and with Hull &amp; York Medical School – offering clinical placements to medical students.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Carol Bond, Head of CT and MRI&lt;/p&gt;\n&lt;p&gt;carol.bond1@nhs.net&lt;/p&gt;\n&lt;p&gt;03033 304843 / 03033302550&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121065.png", "name": "Northern Lincolnshire and Goole NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121065"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Scunthorpe", "postalCode": "DN15 7BH"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5875", "longitude": "-.666943"}}, "title": "CT Radiographer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255575", "validThrough": "2020-11-18T23:59:59+0000"}