{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "73664", "minValue": "63751", "unitText": "YEAR", "value": "£63,751 - £73,664 per annum"}}, "datePosted": "2020-11-02T15:31:28+0000", "description": "&lt;p&gt;&lt;strong&gt;WE ARE LOOKING FOR CLINICAL SERVICE MANAGERS TO COVER THE SURGICAL SERVICE GROUP AND WOMEN &amp; CHILDREN’S SERVICES.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Cwm Taf Morgannwg Health Board is looking for senior operational leaders to join our Merthyr Cynon Integrated Locality Group based team, where you will be part of a truly integrated system for the wellbeing of our communities and population.&lt;/p&gt;\n&lt;p&gt;Working with the very best leaders, theClinical Service Group Managers will be key to managing one of our service groups within the Merthyr Cynon Integrated Locality Group. The newly established Integrated Locality Groups bring a population health focus, collaborating with partners, together with all aspects of mental health, primary care, secondary care, in a truly integrated way to deliver the very best outcomes for the people we serve.&lt;/p&gt;\n&lt;p&gt;The individuals will be responsible for the day to day running of services and will work in partnership with key stakeholders to develop the strategy and plans for delivering services for the population.&lt;/p&gt;\n&lt;p&gt;The Surgical Service Group Manager portfolio includes General Surgery, Trauma &amp; Orthopaedics, Anaesthetics, Critical Care and Oral Maxillofacial Services. You will be accountable for the service group operations and delivery, including collaborating across locality to develop services, plan for improvement, for the delivery of quality, and financial performance through strong, compassionate leadership and engagement. Working with the Acute Services General Manager you will be the lead individual for scheduled care tier one government targets relating to Cancer, Outpatient and Theatre performance. A strong background in Demand and Capacity planning is essential for this role.&lt;/p&gt;\n&lt;p&gt;The Women’s and Children’s Service Group Manager portfolio includes Paediatrics Services and full Obstetrics, Maternity &amp; Gynaecology service at Prince Charles Hospital with additional responsibility for Obstetrics Service at the Royal Glamorgan Hospital which excludes an Obstetric led unit, You will be accountable for the service group operations and delivery, including collaborating across locality to develop services, plan for improvement, for the delivery of quality, and financial performance through strong, compassionate leadership and engagement. Working with the Acute Services General Manager you will be the lead individual for the continuing progress of the recent RCOG review and develop the Paediatrics service proposals on behalf of the Merthyr Cynon ILG as part of the plan to deliver Paediatrics services across the Health Board. A strong background in risk governance, planning and partnership working is essential for this role.&lt;/p&gt;\n&lt;p&gt;Cwm Taf Morgannwg Health Board is ideally situated within a beautiful part of Wales, between Wales’ capital city, Cardiff, to the south, the South Wales coast including Porthcawl and Swansea Bay to the West and the stunning scenery of the Brecon Beacons National Park to the North – all within a short commute. We operate within a vibrant community, rich with history and heritage, and our Health Board is at the heart of this community.&lt;/p&gt;\n&lt;p&gt;We are steadfast in maintaining a focus on quality, improved patient experience, and ensuring equitable access to services. Our &lt;em&gt;Three-year Integrated Plan &lt;/em&gt;and &lt;em&gt;Quality Governance Framework&lt;/em&gt; reinforce the strong commitment we have made to quality and safety which underpins all our work.&lt;/p&gt;\n&lt;p&gt;You will possess the necessary energy and credibility to lead, support and develop services and our people, delivering high-quality services for our patients. You will be accountable for the service group operations and delivery, including collaborating across locality to develop services, plan for improvement, for the delivery of quality, and financial performance through strong, compassionate leadership and engagement.&lt;/p&gt;\n&lt;p&gt;You will have a proven track-record in managing highly complex services which involve staff from all levels within an organisation and across a range of professional and organisational boundaries. You will have significant knowledge and experience of operational leadership and change management, along with quality and service improvement methodologies.&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; Welsh and/or English speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt;Closing date: 16th November 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Neil Cooper Acute Services Manager&lt;/p&gt;\n&lt;p&gt;neil.cooper@wales.nhs.uk&lt;/p&gt;\n&lt;p&gt;01685 721721 ext 26317&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123872.png", "name": "Cwm Taf Morgannwg University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123872"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Prince Charles Hospital, Merthyr Tydfil", "postalCode": "CF47 9DT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.764", "longitude": "-3.38552"}}, "title": "Clinical Service Group Managers", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252606", "validThrough": "2020-11-16T23:59:59+0000"}