{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "87754", "minValue": "75914", "unitText": "YEAR", "value": "£75,914 - £87,754 Per annum"}}, "datePosted": "2020-10-28T13:46:28+0000", "description": "&lt;p&gt;&lt;strong&gt;National lead for Medicines Information and Director, Welsh Medicines Information Centre&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Band 8d&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for an exceptional, experienced pharmacist to provide the strategic and operational leadership to Medicines Information Services across NHS Wales. Based in the Welsh Medicines Information Centre at the University Hospital of Wales (Cardiff), the national lead will maintain and further develop this centre of excellence. They will also provide expert advice on all aspects of the quality and delivery of specialist information services and promote and support education, research and development activity in medicines information.&lt;/p&gt;\n&lt;p&gt;The organisation’s culture of continuous improvement is supported by audit, evaluation and evidence based health and social care. Working closely with other national lead specialists in Wales and the Chief Pharmacists Peer Group, the post holder will contribute to the strategic agenda for safe and high quality patient-focused Pharmacy services.&lt;/p&gt;\n&lt;p&gt;They will also represent Wales on the UK Medicines Information Executive and participate in its subcommittees and working groups as required.&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; Welsh and/or English speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt;Closing date: 18th November 2020.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;If you have any questions or would like to discuss further please contact Darrell Baker, Director of Pharmacy and Medicines management on 02920 744331 or the current postholder, Fiona Woods on 02920 742796&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123193.jpg", "name": "Cardiff and Vale University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123193"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "UHW, Cardiff", "postalCode": "CF14 4XW"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5068", "longitude": "-3.18937"}}, "title": "National Lead for Medicines Information/Director, Welsh Medicines Inf", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246820", "validThrough": "2020-11-18T23:59:59+0000"}