{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "107668", "minValue": "79860", "unitText": "YEAR", "value": "£79,860 - £107,668 per annum"}}, "datePosted": "2020-11-05T13:46:01+0000", "description": "&lt;p&gt;Applications are invited for the post of Senior Clinical Fellow in Microbiology to commence as soon as possible for an initial 12-month period with view to possible further extension subject to mutual agreement. The department provides a comprehensive range of services for our resident population of approximately 500,000 residing mainly in east and north Hertfordshire and extends to the borders of Bedfordshire, Cambridgeshire, west Hertfordshire and Essex.&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity to work in a large district general hospital covering the full range of acute services including an active renal unit, orthopaedics, gastroenterology, respiratory medicine, cardiology, oncology, rheumatology, urology, plastic surgery, obstetrics &amp; gynaecology, paediatrics and elderly care medicine. There is a well-established infection control team covering all hospital sites. The on-call commitment is paid at A rate under the new Consultant Contract.&lt;/p&gt;\n&lt;p&gt;Following the investment of £150 million in major new facilities at the Lister, along with a £30 million New QEII hospital built by the local clinical commissioning group, the East and North Hertfordshire NHS Trust has brought together all its specialist emergency and inpatient services at the Stevenage hospital. Our state-of–the-art clinical facilities include a major new Emergency Department, the Hertfordshire Cardiology Centre (which includes a 24/7 PPCI service), new scanning centre, McMillan chemotherapy unit, ward, endoscopy and theatre blocks.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;East &amp; North Hertfordshire NHS Trust is an employer committed to equal opportunities.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Closing date: 22nd November 2020&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Applicants wishing to arrange either an informal discussion or visit should contact:&lt;/p&gt;\n&lt;p&gt;Dr Eleni Mavrogiorgou, Consultant Microbiologist on 01438 2884043 (Ext 4043) or elenimavrogiorgou@nhs.net&lt;/p&gt;\n&lt;p&gt;Dr Ashish Narula, Consultant Histopathologist and Clinical Director of Pathology on 01438 286326 (Ext 6326) or ashish.narula@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120840.jpg", "name": "East and North Hertfordshire NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120840"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Stevenage", "postalCode": "SG1 4AB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.9242", "longitude": "-.211889"}}, "title": "Senior Clinical Fellow in Microbiology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257944", "validThrough": "2020-11-22T23:59:59+0000"}