{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "17230", "minValue": "14641", "unitText": "YEAR", "value": "£8.71 to £10.25 per hour DOE"}}, "datePosted": "2020-11-05T15:27:04+0000", "description": "&lt;p&gt;&lt;strong&gt;HCA | Covid Swab Team | £8.71 to £10.25 per hour DOE | Roundhay | Full-Time&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We have an exciting opportunity for an experienced Health Care Assistant with proven experience, to join our dynamic Team located in our Leeds Hospital. You will be supporting our Clinical teams by initially performing Covid-19 swabbing before moving to other departments&lt;/p&gt;\n&lt;p&gt;This is a Full-Time role of 37.5 hours per week; with shifts patterns between the hours of 08:00 and 19:00 Monday to Sunday, with flexibility for occasional additional cover as required.&lt;/p&gt;\n&lt;p&gt;Our Clinical team are a key element to our Patient’s journey as they visit our hospital. The successful candidate will be someone who is looking to thrive in a role that requires genuine autonomy and the chance to work as part of a continually changing environment.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Duties and Responsibilities&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;In this fast-paced role, you will be required to assist our Clinical team in providing exemplary Care within the department, whilst providing Healthcare Assistance to our Nursing team.&lt;/li&gt;\n&lt;li&gt;As an HCA, duties will include routine tasks related to the delivery of care to ensure our patient’s health and well-being.&lt;/li&gt;\n&lt;li&gt;You will move and set up diagnostic equipment (after training) and other resources, as well as applying technology for measurement, monitoring and treatment.&lt;/li&gt;\n&lt;li&gt;You must have experience or a willingness to learn both Venepuncture and ECG Recording.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Who we&#39;re looking for&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As an experienced HCA, you will be fundamental in providing Healthcare Support to our Nursing Team to ensure patients receive the best possible personal care.&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;System literacy is essential; MS Office and SAP is desirable, however, not essential for the right candidate&lt;/li&gt;\n&lt;li&gt;Previous experience within a similar role&lt;/li&gt;\n&lt;li&gt;Must be accurate and have a strong desire for attention to detail.&lt;/li&gt;\n&lt;li&gt;NVQ Level 3 in Health and Social Care or equivalent&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Benefits&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We offer employees a competitive salary as well as a comprehensive benefits package which includes but is not limited to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;35 days annual leave inclusive of bank holidays&lt;/li&gt;\n&lt;li&gt;Employer and employee contributory pension with flexible retirement options&lt;/li&gt;\n&lt;li&gt;‘Spire for you’ reward platform - discount and cashback for over 1000 retailers&lt;/li&gt;\n&lt;li&gt;Free Bupa wellness screening&lt;/li&gt;\n&lt;li&gt;Private medical insurance&lt;/li&gt;\n&lt;li&gt;Life assurance&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Please see the attached benefits leaflet for more information.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We commit to our employee’s well-being through work life balance, on-going development, support and reward.&lt;/p&gt;\n&lt;p&gt;Spire Healthcare is a leading independent hospital group in the United Kingdom and the largest in terms of revenue. From 39 hospitals and 8 clinics across England, Wales and Scotland, Spire Healthcare provides diagnostics, inpatient, day case and outpatient care.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;For us,&lt;/em&gt;&lt;em&gt;it&#39;s more than just treating patients; it&#39;s about looking after people.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Spire Healthcare Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132894"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Roundhay", "postalCode": "LS8 1NT"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8321", "longitude": "-1.51416"}}, "title": "Healthcare Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258321", "validThrough": "2020-11-19T23:59:59+0000"}