{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 pa pro rata"}}, "datePosted": "2020-11-03T12:01:07+0000", "description": "&lt;p&gt;An exciting opportunity has arisen at Northamptonshire Healthcare NHS Foundation Trust. We are looking for inspiring Nurses with excellent leadership skills to join our team of dedicated community staff nurses.&lt;br /&gt;&lt;br /&gt;The successful candidate will need to demonstrate a keen interest in the field of Community Nursing, together with a genuine desire to develop both the service and yourself.&lt;/p&gt;\n&lt;p&gt;If you think you have what it takes to thrive in an environment that is challenging, safe, effective, kind and caring and drives you to develop personally and professionally there has never been a better time to join our valued and innovative Community Nursing Team &lt;br /&gt;&lt;br /&gt;We encourage pre-application visits to enable you to gain an understanding of the role and service.&lt;br /&gt;&lt;br /&gt;The service aims to provide an excellent standard of person centered planned and unplanned nursing intervention to patients in their homes and is part of an integrated service that supports patients to remain in their home environment. As a County wide Senior Community Nurse you will work closely with the multi-disciplinary team in order to support the service and have a high focus on delivering quality outcomes and improving the patient experience. &lt;br /&gt;&lt;br /&gt;As both an organisation and a service we are actively involved both local and national innovative projects around improving quality of care, integrated working with stakeholders, designing new pathways and we are currently mid-way through a two year project that will transform community nursing in the county. We’ve recently invested in new mobile working technology to aid staff. We have an extensive program of training and skills development available for staff and actively nominate and encourage our staff to apply for national awards and recognition, such as Queen’s Nursing Institute, RCN and Nursing Times awards.&lt;br /&gt;&lt;br /&gt;Car owner/driver and current driving license essential or access to a car (unless you have a disability as defined by the Equality Act 2010)&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameWENDY PALFREYAdditional contact information&lt;/p&gt;\n&lt;p&gt;Wendy.Palfrey@nhft.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Northamptonshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121219"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Countywide, Corby", "postalCode": "NN17 2UR"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4902", "longitude": "-.712582"}}, "title": "Community Healthcare Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253861", "validThrough": "2020-11-17T23:59:59+0000"}