{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 to £110,683 per annum FTE"}}, "datePosted": "2020-10-30T15:16:03+0000", "description": "&lt;p&gt;&lt;strong&gt;Paediatric Intensive Care Consultant 10PA Locum&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Ref- 290-LCOND515&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Imperial College Healthcare NHS Trust welcomes applicants to apply for a 10PA Paediatric Intensive Care Locum Consultant post.&lt;/p&gt;\n&lt;p&gt;This is an excellent opportunity to join our first class paediatric intensive care team based at St Mary’s Hospital in Paddington London. We are a busy, friendly department fully accredited for training in Intensive Care Medicine.&lt;/p&gt;\n&lt;p&gt;The St Mary’s Paediatric Intensive Care Unit (PICU) is one of the leading units in the sector and the only unit offering level 3 general intensive care in the North-West London region. Around 30 per cent of patients come from the local north west London catchment area, the remainder are transferred by the Children’s Acute Transport Service (CATS) from hospitals across London and the home counties.&lt;/p&gt;\n&lt;p&gt;This is an exciting time to be part of the service as the unit has recently expanded to become a 15 bedded unit comprised of 11 ITU beds and 4 HDU beds. Services on site include paediatric surgery, a highly regarded national and international paediatric haematology and bone marrow transplant programme, infectious diseases and one of the leading paediatric allergy and immunology units in the United Kingdom. The hospital has a busy emergency department and is one of 4 Major Trauma Centres for children and adults in London.&lt;/p&gt;\n&lt;p&gt;The unit cares for children with life threatening conditions including major trauma, severe infections, airway and respiratory problems, neurological conditions and those who have undergone surgery. Medical services supported include acute emergency paediatrics, respiratory medicine, allergy and immunology, rheumatology, haematology, oncology, neurology, and surgery.&lt;/p&gt;\n&lt;p&gt;Applicants must be trained in Paediatric Intensive Care Medicine or equivalent and have the required experience and training in managing critically ill children. Applicants must be included on the GMC’s Specialist Register or be within 6 months of CCT (CCT) or have equivalent training, by the date of interview.&lt;/p&gt;\n&lt;p&gt;Closing date: 15th November&lt;/p&gt;\n&lt;p&gt;Interview date: 2nd December&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;For further details / an informal discussion and visit, contact either:&lt;/p&gt;\n&lt;p&gt;Sabeena Qureshi&lt;/p&gt;\n&lt;p&gt;Head of service&lt;/p&gt;\n&lt;p&gt;Sabeena.qureshi@nhs.net&lt;/p&gt;\n&lt;p&gt;T: 07984157675&lt;/p&gt;\n&lt;p&gt;or&lt;/p&gt;\n&lt;p&gt;Simon Nadel&lt;/p&gt;\n&lt;p&gt;Simon.Nadel@nhs.net or s.nadel@imperial.ac.uk&lt;/p&gt;\n&lt;p&gt;T: 07778045884&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123032.jpg", "name": "Imperial College Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123032"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St Marys Hospital, London", "postalCode": "W2 1NY"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5171", "longitude": "-.174187"}}, "title": "Locum Paediatric Intensive Care Consultant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250706", "validThrough": "2020-11-15T23:59:59+0000"}