{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum/pro rata"}}, "datePosted": "2020-10-22T16:01:16+0100", "description": "&lt;p&gt;&lt;span&gt;The South Oxfordshire Adult Mental Health Team (AMHT) is a combined Crisis, Assertive Outreach and CMHT providing intensive and seamless assessment, care and treatment for people with a wide range of mental health difficulties across South Oxfordshire. The service is integrated with psychological services and is working within a Partnership with 5 Charitable services to provide an excellent standard of care to our patients. This mean an exciting and diverse working environment with resources from 3rd Sector services such as Mind and Connections (floating support) embedded in the team. In addition we are currently embedding Peer Support Workers within the teams to promote the power of lived experience and ensure that the gap between patient and clinician is bridged.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We would welcome applications from newly qualified Mental Health Nurses and Occupational Therapists interested in working in Community Mental Health starting at Band 5. Please apply via this advert and express interest in a Band 5 development post.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Our AMHTs provide an assessment and treatment function. The successful candidate will be with the Treatment function which operates mainly Monday to Friday 9-5 with weekends every 6-8 weeks. Both Part time and Full Time positions will be considered. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will join a dynamic and skilled multi-disciplinary team with professionals from across Social Work, Nursing and Occupational therapy as well as Psychological therapists and Psychiatry within an organisation rated “Good” by the CQC. Your professional supervision and leadership needs will be prioritised and you will experience excellent support and professional development opportunities. The team is highly supportive and committed to delivering a high quality patient and carer journey; where the caseload can be demanding, diverse, frequently complex yet rewarding.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameMelissa PorterJob titleTeam ManagerEmail addressmelissa.porter@oxfordhealth.nhs.ukTelephone number01865 904191&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Oxford Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122233"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wallingford Community Hospital, Oxfordshire", "postalCode": "OX10 9DU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5947", "longitude": "-1.12827"}}, "title": "Care Coordinator- Treatment Function", "url": "https://www.jobs.nhs.uk/xi/vacancy/916239252", "validThrough": "2020-11-12T23:59:59+0000"}