{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Competitive"}}, "datePosted": "2020-11-03T09:32:19+0000", "description": "&lt;p&gt;&lt;strong&gt;We have an exciting opportunity for a Band 5 Staff Nurse to join our Radiology Department based at The London Clinic in Central London, W1G (Close to Regents Park &amp; Baker Street tube stations).&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Established in 1932, The London Clinic is one of the UK’s largest independently owned non-profit hospital, with state-of-the-art facilities located on Harley Street. We have circa 1200 employees, a total of 8 premises, and we are dedicated to providing the best, personalised healthcare with a breadth of surgical and medical expertise.&lt;/p&gt;\n&lt;p&gt;Our main hospital spans 8 floors comprising of 234 beds and 10 theatres, including a Hybrid theatre and two minimally invasive and day surgery theatres. The Duchess of Devonshire Wing is our award-winning cancer centre, which includes state-of-the-art radiotherapy, chemotherapy suites and dedicated patient bedrooms&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job Description&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;To provide high quality patient focused care, whilst assisting the consultant radiologists undertaking interventional procedures, such as drainages and biopsies under CT, fluoroscopy or ultrasound guidance for both outpatients and inpatient.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job Type&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is a full time permanent position working 37.5 hours per week, working Monday – Friday between 8am – 8pm (across shift patterns), with oncall rotation and flexible overtime..&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The salary for this role is competitive and will be dependent upon skills and experience.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Benefits package&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We offer our permanent staff a comprehensive package which includes a contribution pension scheme (total annual contribution up to 20%), Private Medical Healthcare, 25 day’s annual leave plus bank holidays, season ticket travel loan, and a wide range of discounts with a variety of retailers and services. We also offer excellent career development; with clear career pathways and access to further education.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Duties &amp; Responsibilities&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To act as the identified nurse for patients attending diagnostic and therapeutic procedures assessing, planning implementing and evaluating their care&lt;/li&gt;\n&lt;li&gt;Demonstrate knowledge and technical skills in assisting and scrubbing for specialist imaging procedures and in the assembly and handling of interventional materials, such as catheters, guidewires, stents and coils.&lt;/li&gt;\n&lt;li&gt;Practice a correct aseptic technique in accordance with the clinic and departmental nursing policies.&lt;/li&gt;\n&lt;li&gt;Administering IV sedation and the monitoring of patients during procedures.&lt;/li&gt;\n&lt;li&gt;Responsible for any patients/ visitors to the department who become unwell and for initiating emergency care for them as appropriate.&lt;/li&gt;\n&lt;li&gt;To provide support to the radiographers, radiology department assistants, nuclear medicine technologists&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;em&gt;This job description is intended as a general guide to the post, but it may change in line with the needs of the department or at the request of the line manager.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Skills &amp; Experience&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Full NMC registration&lt;/li&gt;\n&lt;li&gt;Minimum of two years’ experience working within an acute setting&lt;/li&gt;\n&lt;li&gt;GCSE or equivalent in English Language and Maths&lt;/li&gt;\n&lt;li&gt;Perform pre procedure nursing assessments.&lt;/li&gt;\n&lt;li&gt;Demonstrate a high level of clinical practice&lt;/li&gt;\n&lt;li&gt;Ability to monitor patients and work autonomously in challenging environments&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;em&gt;The successful applicant’s offer is subject to relevant DBS, Occupational Health and Reference Checks respectively, alongside standard Right To Work Checks.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;We are an organisation that has charitable status and this helps us to drive forward our mission of reinvesting our income to deliver better patient outcomes.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;The London Clinic is proud of its diverse workforce and is committed to building a team that represents a variety of backgrounds, perspectives, and skills. We absolutely welcome applicants from underrepresented groups; if you think you have the skills and experience for the job, please apply - we would love to hear from you regardless of your background.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "The London Clinic", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132294"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "London", "postalCode": "W1G 6BW"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.523", "longitude": "-.15005"}}, "title": "Nurse Radiology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253292", "validThrough": "2020-11-17T23:59:59+0000"}