{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "36720", "minValue": "36720", "unitText": "YEAR", "value": "Up to £36,720  FTE - dependent on experience"}}, "datePosted": "2020-10-23T15:21:41+0100", "description": "&lt;p&gt;&lt;strong&gt;Be a part of the HMP Isle of Wight Healthcare Team and make a difference...&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Are you collaborative, caring and compassionate?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Prisons are one of the most challenging, yet rewarding places for healthcare professionals to work - if you’re looking for a role where you can develop your existing skills and learn something new every day, then this is the place to be.&lt;/p&gt;\n&lt;p&gt;This role is based at HMP Isle of Wight. Working in an HMP environment is a great place to utilize your skills where no two days are ever the same. It’s a closed community where you’ll be in direct and sometimes constant contact with services users with varying physical health, mental health and substance misuse issues.&lt;/p&gt;\n&lt;p&gt;Practice Plus Group are Health in Justice Market leader, providing healthcare services to offenders across the country. Our model of care is our Wellbeing Approach – an integrated, comprehensive approach in recognition of the fact prisoners are a socially-excluded group with healthcare needs which are complex and often associated with poor outcomes. It adopts the premise no single health/wellbeing factor can be taken in isolation of other motivational issues which might impact a person’s care.&lt;/p&gt;\n&lt;p&gt;We can offer training and development in our friendly and supportive teams, as well a range of other employee benefits.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Looking for something a little different?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We&#39;re looking for an Early Days Mental Health Practitioner to work as part of a dynamic team in delivering an effective service supporting managers and staff across the south east, south and south west within Her Majesty’s Prisons. The post holder will help support a wide range of benefits to improve the welfare and service provided to prisoners who are moving through the custodial system.&lt;/p&gt;\n&lt;p&gt;The post holder will ensure when a patient is transferred from a reception prison or another prison, the mental health team receives a comprehensive handover before the transfer takes place. Or, where a transfer is not known, the handover is provided within one working day of the individual’s reception to the establishment. They will also be able to identify any immediate mental health needs including, any external services or prescribing requirements that prisoners may have received prior to arrival in the criminal justice system and, may need assistance with within the first few days of admission.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What do we need from you so you can do the job?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; You will be an approved Mental Health Professional with a degree in Healthcare or Social Work, CQSW/DipSW or equivalent. This could be a dual-qualified (MH and LD) Nurse as identified in the national specification. You will have significant diverse experience of working in integrated adult mental health services, and experience of complex mental health issues as well as experience of providing a consultative service to members of a multi-disciplinary on-site HMP, health or social care team. A good working knowledge of all relevant Mental Health and Social Care legislation and Codes of Practice.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;More Information..&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The work is interesting and varied and is an opportunity to make a difference to peoples’ lives, enabling them to improve and maintain their health and well-being.&lt;/p&gt;\n&lt;p&gt;We would love to hear from clinicians that want to make a real difference to the lives of patients and support them during their early days in HMP Isle of Wight.&lt;/p&gt;\n&lt;p&gt;This is a full time role working 37.5 hours per week.&lt;/p&gt;\n&lt;p&gt;The salary for this role is up to £36,720 per annum - dependent on experience.&lt;/p&gt;\n&lt;p&gt;Please note that offers of employment are subject to Practice Plus Group Terms &amp; Conditions and receipt of satisfactory references, an enhanced DBS check and prison vetting.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;At Practice Plus Group we actively promote diversity and equal opportunities.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Practice Plus Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130136"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Newport", "postalCode": "PO30 5RS"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7121", "longitude": "-1.30498"}}, "title": "Early Days Mental Health Practitioner - HMP YOI Portland", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241098", "validThrough": "2020-11-08T23:59:59+0000"}