{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-11-05T14:30:41+0000", "description": "&lt;p&gt;CWP are excited to be recruiting MHST mental health practitioners for the new Mental Health in Schools Support Teams.&lt;/p&gt;\n&lt;p&gt;We are recruiting to wave 3 which will commence in November 2020 and wave 4 which will commence in January 2021.&lt;/p&gt;\n&lt;p&gt;The Mental Health Support Teams are part of an exciting project funded by NHS England, Health Education England and partners, with the aim of improving the mental health and wellbeing of children and young people in the community. There is a specific focus on developing more access to helping and improving emotional support within all primary and secondary schools. Working alongside community partners the Mental Health Support Teams will be part of CYP Access function.&lt;/p&gt;\n&lt;p&gt;The mental health practitioner role for MHST will be to support the delivery of all interventions provided by Emotional &amp; Mental Health Practitioners, ensuring that a wide range of evidence based interventions are used to support young people’s mental health. You will support leadership and will be involved in the development of the MHST alongside the Clinical Lead and Clinical Coordinator, supervising practitioners and other senior colleagues in the service and within the borough.&lt;/p&gt;\n&lt;p&gt;We seek to appoint enthusiastic and dynamic individuals who are passionate about CYP mental health, with a demonstrable track record of CAMHS clinical and supervisory experience. You will be a CAMHS professional, registered with a professional body (nurse, social worker or OT) or have equivalent qualifications and accreditation&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Sophie Holt Clinical Lead Email address sophie.holt1@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Cheshire and Wirral Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121132"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Cheshire - to be confirmed, Chester - TBC", "postalCode": "CH2 1BQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.2118", "longitude": "-2.89903"}}, "title": "Mental Health Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258123", "validThrough": "2020-11-19T23:59:59+0000"}