{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "46845", "minValue": "40876", "unitText": "YEAR", "value": "£40,876 -£46,845"}}, "datePosted": "2020-10-26T10:24:49+0000", "description": "&lt;p&gt;&lt;strong&gt;Job Title:&lt;/strong&gt; Senior Public Health Analyst &lt;br /&gt; &lt;strong&gt;Location:&lt;/strong&gt;Hertford and/or Stevenage, with opportunities for flexible working&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary Range:&lt;/strong&gt; £40,876 pa progressing to £ 46,845 pa &lt;br /&gt; &lt;strong&gt;Hours:&lt;/strong&gt; 37 per week&lt;br /&gt; &lt;strong&gt;Contract:&lt;/strong&gt; Permanent&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About us&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Public Health Evidence and Intelligence team is part of Hertfordshire County Council. In order to improve the health of our residents we need to understand their needs, so ensuring that we have relevant, accurate and up-to-date data is important in determining the services we provide. This is especially the case during the COVID-19 pandemic.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The successful candidate will have the opportunity to be a key member of a team committed to encouraging and enabling an evidence-based approach to improving the health of Hertfordshire residents. Working with other analysts in the team, the role involves using advanced statistical, epidemiological and technical skills to develop robust analysis and modelling on the impact of COVID -19 on the population and services and interpreting the results for a range of professional audiences. Additionally, you will lead on the development of intelligence products and the completion of some processes.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About you&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;A Master’s degree or equivalent work experience is required for this role. Experience will ideally be in one or a number of the following disciplines: public health/ epidemiology, statistics/ information analysis, data science. You will be a highly motivated individual, committed to service excellence and you will be confident working both on your own and within a team environment.&lt;/p&gt;\n&lt;p&gt;You will have experience of working with NHS and public health datasets, the analysis of complex information and research, of conveying key messages to policy decision makers and other key stakeholders including senior management, and of undertaking literature reviews and critical appraisals. You will be able to engage at a senior level to shape policy.&lt;/p&gt;\n&lt;p&gt;You will have excellent knowledge of R and Excel as well as experience of, or the ability to quickly pick up, software such as PowerBI, in order to process, analyse and visualise complex data sets. You will have the ability to lead on the design of intelligence products.&lt;/p&gt;\n&lt;p&gt;You will be a highly motivated individual, committed to service excellence and you will be confident working both on your own and within a team environment. With good interpersonal skills, you will be able to communicate confidently and effectively with professional staff across the organisation, translating complex analysis into actionable insights and managing complex processes.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing Date&lt;/strong&gt;: 15th November 2020&lt;br /&gt; &lt;strong&gt;Interview Date&lt;/strong&gt;: 18th to the 20th November 2020 &lt;br /&gt;&lt;br /&gt; For an informal discussion and more information please contact: &lt;strong&gt;Will Yuill, Principal Public Health Analyst, at will.yuill@hertfordshire.gov.uk or on 01992 555127&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Hertfordshire County Council", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=131394"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Countywide", "postalCode": "SG13 8DQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7914", "longitude": "-.081069"}}, "title": "Senior Public Health Analyst", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242008", "validThrough": "2020-11-15T23:59:59+0000"}