{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "34679", "minValue": "31821", "unitText": "YEAR", "value": "£18.93 -  £20.63  per hour"}}, "datePosted": "2020-10-19T09:39:21+0100", "description": "&lt;p&gt;We invest in the best – We pay &lt;strong&gt;£2,500 Welcome Bonus &lt;/strong&gt;for all Nurses - * Terms &amp; conditions apply.&lt;/p&gt;\n&lt;p&gt;We would be delighted to speak to you If you’ve previously worked for the &lt;strong&gt;NHS.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We at Huntercombe Group are looking for a &lt;strong&gt;Practice Nurse&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To work according to the NMC Code of Professional Conduct and relevant professional guidelines as a named nurse or key worker for a defined group of patients.&lt;/li&gt;\n&lt;li&gt;Provide professional nursing input and care for patients across the hospital / unit.&lt;/li&gt;\n&lt;li&gt;Take the lead role in the provision and facilitation of a physical well-being clinic for all patients, e.g. Well Men and Women’s clinic, health screening, smoking reduction / cessation, fitness, health and weight management.&lt;/li&gt;\n&lt;li&gt;Liaise with the General Practice and take the lead for infection control and providing a response to minor injuries and medication ordering.&lt;/li&gt;\n&lt;li&gt;To adopt a flexible approach to hours of duty, in order to meet the needs of the service.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Key Accountabilities&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Scope and Authority&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Responsible for providing high quality nursing care for patients across the unit as appropriate and required.&lt;/li&gt;\n&lt;li&gt;Responsible for providing practice nursing support, leadership, advice and guidance to members of the multi-disciplinary team to ensure high standards of care are provided to all patients at all times with specific responsibilities for the physical well-being of patients across the unit.&lt;/li&gt;\n&lt;li&gt;Responsible for supporting the Pharmacist and overseeing medication ordering and stock control across the unit, including audits.&lt;/li&gt;\n&lt;li&gt;Take a lead role in developing and facilitating service-wide well-being initiatives and health promotion.&lt;/li&gt;\n&lt;li&gt;Take a lead role in the physical care standards, ensuring the achievement of consistently high quality services and investigate / implement corrective actions as appropriate.&lt;/li&gt;\n&lt;li&gt;Support nursing colleagues with advice and guidance regarding care planning and management of patients’ physical conditions.&lt;/li&gt;\n&lt;li&gt;Take responsibility for the resourcing, upkeep and organisation of the clinical treatment room, maintaining and auditing emergency equipment and maintenance of the first aid boxes on site.&lt;/li&gt;\n&lt;li&gt;Take a lead role in the unit for Infection Control issues.&lt;/li&gt;\n&lt;li&gt;Take personal responsibility for ensuring that appropriate security procedures are adhered to at all times and that risks are continuously assessed and managed, highlighting areas of concern to the clinical team. This includes the safe management of keys, locked areas, resources and for following procedures that are set out in Company Policy and Procedure manuals.&lt;/li&gt;\n&lt;li&gt;To undertake any other appropriate roles and responsibilities as requested and required.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Clinical Practice&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To ensure a comprehensive assessment is completed for the patients’ journey.&lt;/li&gt;\n&lt;li&gt;Ensure that each patient has an individual care plan and risk assessment, which takes into account the patient (if appropriate) and their carers views, with regular reviews.&lt;/li&gt;\n&lt;li&gt;To administer medicine within the guidelines and framework of the Nursing and Midwifery Council.&lt;/li&gt;\n&lt;li&gt;Practice within the defined parameters under the Mental Health Act 1983/2007.&lt;/li&gt;\n&lt;li&gt;Ensure all clinical documentation is of a high standard and patient notes are maintained and filed in the appropriate way.&lt;/li&gt;\n&lt;li&gt;Working autonomously with confidence and competence to provide a highly specialised and safe service to the patient.&lt;/li&gt;\n&lt;li&gt;To take appropriate action when working with vulnerable adults and children following guidelines and Trust procedures, liaising with appropriate agencies as required.&lt;/li&gt;\n&lt;li&gt;Maintain and contribute to the standards of professional care, ethics, policies and procedures&lt;/li&gt;\n&lt;li&gt;Maintain professional standards of practice at all times.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Communication and Relationship Skills&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Provide a high level of Communication with internal and external stakeholders.&lt;/li&gt;\n&lt;li&gt;Participates in discussions and debates and staff meetings offering views, ideas and opinions.&lt;/li&gt;\n&lt;li&gt;Participate in the process of positively supporting and inspiring colleagues within the service to improve standards and quality and to develop professional practice.&lt;/li&gt;\n&lt;li&gt;Communicate all relevant issues pertaining to care.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Other&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Responsibility to maintain continuous professional development in order to meet requirements of professional registration.&lt;/li&gt;\n&lt;li&gt;To work within the boundaries of the NMC Professional Code of Conduct.&lt;/li&gt;\n&lt;li&gt;Adherence to national guidance and best practice evidence on Infection prevention and Control.&lt;/li&gt;\n&lt;li&gt;Compliance with the Huntercombe Group clinical polices and those adopted.&lt;/li&gt;\n&lt;li&gt;Participation in the Huntercombe Group clinical governance work programmes.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;About You&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please take a look at our progressive and rewarding benefits package &lt;br /&gt;&lt;/strong&gt;• Employee Assistance Programme (EAP) &lt;br /&gt;• Maternity leave at 3 month’s full pay and 3 month’s half pay&lt;br /&gt;• 2 week’s paid paternity leave &lt;br /&gt;• Shared parental leave, matching the maternity leave benefit &lt;br /&gt;• A thorough Induction Programme tailored to the hospital where you will be working &lt;br /&gt;• Clear pay structure, with competitive rates &lt;br /&gt;• General annual leave allowance of 25 days plus bank holidays that grows with service&lt;br /&gt;• Sick pay of 4 weeks full pay and 4 weeks half pay &lt;br /&gt;• The opportunity to participate in a company contributory pension scheme with up to 3% matching contributions &lt;br /&gt;• Death in service benefit equivalent to 2 x salary &lt;br /&gt;• A range of staff discounts &lt;br /&gt;• Continuing Professional Development (CPD)&lt;br /&gt;&lt;br /&gt; For a more detailed job spec please take a look at our Website where you can also read some inspiring stories and find out why working at Huntercombe really sets us apart from the rest.&lt;/p&gt;\n&lt;p&gt;We welcome applications from everyone irrespective of ethnic origin, gender, age, gender identity, sexual orientation, religion, marital status, disability or social background. This is a great opportunity for someone to make a difference.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/130001.jpg", "name": "The Huntercombe Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130001"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Market Drayton, Stoke on Trent", "postalCode": "TF9 4LX"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9291", "longitude": "-2.35599"}}, "title": "Practice Nurse RGN", "url": "https://www.jobs.nhs.uk/xi/vacancy/916231647", "validThrough": "2020-11-18T23:59:59+0000"}