{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 to £19,337 Per Annum"}}, "datePosted": "2020-11-03T16:15:22+0000", "description": "&lt;p&gt;Applications are invited from suitable applicants to join the team of Assistant Technical Officers (ATO) in the busy department of Microbiology laboratory at University Hospitals Plymouth.  ATO staff assist the Biomedical Scientists in the examination of a wide range of clinical samples from patients, in order to determine the laboratory diagnosis, and appropriate treatment, of infection.   ATOs additionally carry out other duties essential for the smooth running of the Department. &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The successful applicant will have GCSE in English and two other subjects, preferably including a science, and to grade C or above. You will have basic keyboard skills, be able to demonstrate attention to detail, and be able to work as part of a team.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Full training will be given and suitable staff will be encouraged to take an NVQ level 3 qualification in laboratory related subjects.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The department has over 50 staff and handles around 480,000 sample requests per year. It is well equipped, has UKAS accreditation and is a recognised training laboratory&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This is a full time post 0900-1730 Monday to Friday; there is also a commitment to participate in a weekend and bank holiday rota. All weekend and bank holiday work is paid at an enhanced rate. There is a requirement for the post holder to work extended working days or to participate in a 24/7 rota.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further information please contact &lt;strong&gt;Allan Speirs (01752 433270)&lt;/strong&gt; or &lt;strong&gt;Mark Wallis (01752 437750)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;***Preference will be given to internal Trust staff, as well as ‘Priority’ and &#39;At Risk&#39; status including NHS At Risk staff throughout Devon who are able to display recent relevant experience as dictated by the Person Specification.***&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120815.jpg", "name": "University Hospitals Plymouth NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120815"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "PLYMOUTH", "postalCode": "PL6 8DH"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.4167", "longitude": "-4.11371"}}, "title": "Assistant Technical Officer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254736", "validThrough": "2020-11-06T17:26:15+0000"}