{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "52886", "minValue": "47841", "unitText": "YEAR", "value": "£47,841 - £52,886"}}, "datePosted": "2020-11-03T16:36:50+0000", "description": "&lt;p&gt;An exciting career opportunity has arisen for part time (2 days) enthusiastic and energetic clinical psychologist or equivalent who has an interest working with looked after children, to join Barnet’s Integrated Clinical Services (BICS), a CYP MH Service for CYP and families presenting with mild to moderate mental health difficulties in the community and within social care. We are a strong, supportive, friendly multidisciplinary department and welcome for either a clinical psychologist to join us. (This post is equivalent to agenda for change Band 7 to 8a salary depending on experience)&lt;/p&gt;\n&lt;p&gt;Barnet is one of the most diverse boroughs in London which provides opportunities and challenges that are rewarding, both professionally and personally. We are focussed on making Barnet an even better place to live for all families, we call this ambition “Family Friendly Barnet”. At the heart of this vision is our aim of helping families, children and young people to become resilient so they can thrive and achieve.&lt;/p&gt;\n&lt;p&gt;BICS has four teams within their service and you will join the clinical social care (CSC) team. Here, you will be embedded within the looked after children in care service offering community based mental health assessments and a range of therapeutic interventions to children, young people and foster carers. You will work with children, young people, carers and families that are allocated to the children in care service who present with moderate mental health difficulties.  The role will also involve training, consultation and advice to social workers and wider professionals.&lt;/p&gt;\n&lt;p&gt;We value and encourage your continuing professional development and will support you with leadership from the Clinical Lead, line management and supervision from the Clinical Manager and/or Principal CSC clinician and peer support from the other clinical practitioners in your team.&lt;/p&gt;\n&lt;p&gt;We offer excellent specialist CPD and training opportunities such as specialist clinical therapeutic approaches. The department has established strong working relationships with colleagues in Children’s Social Care. In addition, you will have ample opportunities to work with partner agencies such as Barnet’s Tier 3 NHS Specialist CAMHS, other community and voluntary services. We also have links with the London Clinical Psychology and Systemic Training Schemes.&lt;/p&gt;\n&lt;p&gt;We would like to invite applications who like working in the community and integrating with agencies creatively to improve the experiences and outcomes of the children, young people and their families in the borough.&lt;/p&gt;\n&lt;p&gt;If shortlisted you will be required to bring photographic ID to your interview to prove your identity.&lt;/p&gt;\n&lt;p&gt;Barnet is committed to safeguarding and promoting the welfare of children, young people, and vulnerable adults and expects all staff and volunteers to share this commitment. Barnet operates stringent safer recruitment procedures.&lt;/p&gt;\n&lt;p&gt;Please note that the interviews for this post will take place on Friday November 27th  2020.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact: Dr Anindita Sarkar (Clinical Lead) either by email (anindita.sarkar@barnet.gov.uk), or on 02083592942 or on 07849623243.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "London Borough of Barnet", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=134816"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Colindale", "postalCode": "NW9 4EW"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5975", "longitude": "-.245036"}}, "title": "LAC Clinical Practitioner (Clinical Psychologist)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254810", "validThrough": "2020-11-16T23:59:59+0000"}