{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-11-03T09:30:54+0000", "description": "&lt;p&gt;&lt;strong&gt;Would you like to come and join our innovative Children and Young People Services?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for a number of Band 6 Community Practitioners in both Mental Health and Neurodevelopmental Disorder Pathways to join the Children and Young Peoples Services in South Tyneside and Sunderland.&lt;/p&gt;\n&lt;p&gt;Our children and young people services are fully integrated and provide specialist mental health assessment and intervention for children and young people with complex and enduring mental health problems, including those with a learning disability. The multi-disciplinary team comprises a highly skilled and experienced workforce of Consultant Psychiatrists, Nurses, Psychologists, Occupational Therapists, Psychotherapists, Social Workers, Art Therapists and Support Workers.&lt;/p&gt;\n&lt;p&gt;We deliver a wide range of evidence based interventions through clearly defined care pathways. We have developed a comprehensive supervision structure for staff including individual supervision and peer support through our clinical networks linked to our care pathways. Some of the many interventions we offer young people and families are Family Therapy, Cognitive Behavioural Therapy, Dialetical Behavioural Therapy and Attachment focused work. We believe in the development of all our staff and have invested in external training opportunities as well developing a comprehensive internal training programme.&lt;/p&gt;\n&lt;p&gt;Our Neurodevelopmental Team undertakes assessment, diagnosis and intervention with children and young people with Attention Deficit Hyperactive Disorder and/or Autism Spectrum Disorder. Band 6 staff contribute to the multi- disciplinary assessment and diagnosis of children and young people. Interventions include parenting programmes, post diagnostic psychosocial education for families and young people. The team also operate medication monitoring and review clinics for those children and young people with ADHD.&lt;/p&gt;\n&lt;p&gt;We are keen to recruit Band 6 Community Practitioners with experience in working with children and young people with experience of collaborative working with both partner agencies and the multi disciplinary team, and the ability to undertake specialist assessment and deliver evidence based therapeutic interventions.&lt;/p&gt;\n&lt;p&gt;The team operates across the hours of 8.00am to 8.00 pm Monday to Friday, with some clinics running on Saturdays. The service base for South Tyneside/Sunderland is Monkwearmouth Hospital, Newcastle Road, Sunderland&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Angela O&#39;Dell/ Tracey Jefferson&lt;/p&gt;\n&lt;p&gt;0191 5665500&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121049.jpg", "name": "Cumbria, Northumberland, Tyne and Wear NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121049"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Monkwearmouth Hospital, Sunderland", "postalCode": "SR5 1NB"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.9244", "longitude": "-1.38666"}}, "title": "Community Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253282", "validThrough": "2020-11-17T23:59:59+0000"}