{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 £45,753 - £51,668 per annum pro"}}, "datePosted": "2020-10-30T12:16:15+0000", "description": "&lt;p&gt;Advanced Pharmacist- Antibiotics Pharmacist&lt;br /&gt;&lt;br /&gt;12 month maternity leave cover, 22 hours per week&lt;/p&gt;\n&lt;p&gt;Due to maternity leave we are seeking an exceptional dynamic patient focussed Pharmacist to work closely with the microbiologists, clinicians and pharmacists to continue to deliver good Antimicrobial Stewardship across the Trust. In conjunction with our substantive antibiotic pharmacist, you will provide strategic leadership to ensure appropriate prescribing and monitoring of antimicrobials for patients in the Trust. You would be expected to assist with developing guidelines for antibiotics in line with current best practice to help with achieving targets for prescribing, including consumption of antibiotics and the AWaRe classification. Ideally you will be a pharmacist prescriber and have a willingness to work innovatively to maximise the visibility of pharmacy within this role.&lt;/p&gt;\n&lt;p&gt;In addition to this you will have a role in delivering medicines optimisation to in-patients in conjunction with an experienced team of pharmacists and technicians within the Trust. &lt;br /&gt;&lt;br /&gt;You will be joining a progressive and forward thinking pharmacy team which is well respected for patient focussed care and innovation. We have a proven track record of embracing new ways of working and the Trust has just implemented The Cerner Millennium electronic patient record and e-prescribing system which is truly transforming the way we are working. The post holder will be expected to take part in weekend, bank holiday and extended hours provision of pharmacy services and will have an emergency duty commitment.&lt;/p&gt;\n&lt;p&gt;A six month probationary period will apply to this post.&lt;br /&gt;&lt;br /&gt;We are committed to your personal development and we will give you every opportunity to develop your skills, knowledge and opportunities for career progression.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameFiona smithAdditional contact information&lt;/p&gt;\n&lt;p&gt;Fiona Smith Deputy Clinical Director of Pharmacy on 01422 224920 / 07909936612 or email fiona.smith1@cht.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Calderdale and Huddersfield NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121129"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Huddersfield Royal Infirmary / Calderdale Royal Hospital, Huddersfield", "postalCode": "HD3 3EA"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.6555", "longitude": "-1.81634"}}, "title": "Advanced Pharmacist - Antibiotics Pharmacist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250108", "validThrough": "2020-11-16T23:59:59+0000"}