{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pro rata"}}, "datePosted": "2020-11-02T10:00:55+0000", "description": "&lt;p&gt;&lt;strong&gt;Contract: Fixed term (secondment for NHS Staff) 6 months in the first instance.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours: 37.5 hours per week &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If you wish to apply for this role on a secondment basis please seek permission from your current line manager before applying for the position.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;York Teaching Hospital NHS Foundation Trust has an exciting opportunity within the Workforce &amp; OD Directorate as a &lt;strong&gt;Human Resources Advisor&lt;/strong&gt;, due to an existing member of staff gaining a secondment.&lt;/p&gt;\n&lt;p&gt;We are looking for a pro-active, forward thinking individual to join our team of HR Advisors. You must show resilience and the ability to manage your own workload effectively. Although you will be working as part of the wider HR Team; you need to be able to work autonomously. The successful candidate must have previous experience of providing complex HR advice and guidance &lt;strong&gt;OR&lt;/strong&gt; be an experienced manager of staff in a customer-focused environment .&lt;/p&gt;\n&lt;p&gt;You will be supporting Care Groups with a full range of Employee Relations Issues; for further information about the specifics of the role, please consult the attached Job Description. You will promote the implementation of Human Resources Policies in a fair way on a case-by-case basis, whilst coaching and supporting managers in ensuring consistency across the organisation and developing a Just and Learning culture.&lt;/p&gt;\n&lt;p&gt;You must be able to communicate effectively and confidently to a wide range of audiences. If you are a self-motivated individual who is looking to further their career within Human Resources, &lt;strong&gt;or&lt;/strong&gt; to make the transfer from managing teams of people to being a HR specialist, this could be the role you have been waiting for!&lt;/p&gt;\n&lt;p&gt;Whilst the role is primarily based at our York site, there will be a requirement to work across our Trust sites upon occasion. Please note we are currently working remotely on a regular basis due to Covid19, but attendance at face-to-face meetings may be necessary (covid precautions in place).&lt;/p&gt;\n&lt;p&gt;In return, the starting point of the salary is negotiable within Band 5 and the successful candidate will be eligible for a generous NHS Pension Scheme, 27 days of annual leave plus Bank Holidays and have access to a wide variety of staff benefits, which include a buying and selling annual leave scheme, staff lottery, subsidised staff shop, and discounts on a range of products and services.&lt;/p&gt;\n&lt;p&gt;NHS experience is not essential - if you are an existing NHS employee, this opportunity is offered on a secondment basis.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interviews will be held virtually on Tuesday 17th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Grace Waddington&lt;/p&gt;\n&lt;p&gt;HR Business Partner&lt;/p&gt;\n&lt;p&gt;grace.waddington@york.nhs.uk&lt;/p&gt;\n&lt;p&gt;07766990470&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;It&#39;s not just the area that&#39;s a great draw. In addition, as a member of our team you’ll have access to one of the most generous and comprehensive pension schemes in the UK, a minimum of 27 days annual leave (on top of Bank Holidays) and an award-winning package of staff benefits (see link on the right).&lt;/em&gt;&lt;/p&gt;", "employmentType": "OTHER", "hiringOrganization": {"@type": "Organization", "name": "York Teaching Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120856"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Park House, York Hospital", "postalCode": "YO31 8ZZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.9684", "longitude": "-1.08402"}}, "title": "HR Advisor", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251507", "validThrough": "2020-11-09T23:59:59+0000"}