{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "90521", "minValue": "77578", "unitText": "YEAR", "value": "46.15 to 53.85"}}, "datePosted": "2020-11-03T16:41:27+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;span&gt;Bank Salaried GPs&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;Locations across Essex:&lt;/strong&gt;&lt;/span&gt;&lt;strong&gt;Braintree, Witham, Southend on Sea, Chelmsford &lt;/strong&gt;&lt;span&gt;and &lt;/span&gt;&lt;strong&gt;Purfleet&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Are you looking for a flexible opportunity to fit in and around your lifestyle?&lt;/span&gt;&lt;span&gt;&lt;span&gt;Are you looking for the opportunity to manage your work/life balance and share in our team experience? If so, Virgin Care could be the place for you! Whether you are studying, retired and looking for additional hours or just looking for flexible working options, we have bank hours available to suit you: from ad hoc hours to longer term placements.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Feel Valued&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;As aSalaried GPdelivering NHS services with us, we’ll provide you with a flexible working pattern including an NHS pension (subject to scheme rules)and out of hours enhancements (where applicable).&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;As well as the attractive hourly rates of pay, you will receive the opportunity to develop your expertise with training modules as part of our comprehensive induction and statutory and mandatory training and continued professional development, NHS badge entitling you to NHS discounts, access to information on permanent positions, and free tea and coffee!&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Feel Proud&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will be a GMC registered General Practitioner as well as having experience working within Primary Care.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;As a bankGeneral Practitioneryou will be a proactive member of the team whose skills will ensure safe, quality and value for money services are being provided in an efficient and systematic manner.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We have built organisation-wide committees in many specialist fields. You’ll have the option to join your clinical specialism, networking with professionals from across the country. We get together regularly, auditing and sharing standard methodology for innovation and service re-design. You’ll be a part of the pool of subject matter experts bringing together clinical and operational leads. You will be a part of quality improvements, research and development activity. Here we recognise and celebrate clinical excellence and dedication.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Bank hours are often available in the following locations: Reading, Essex and Bedford.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Feel Inspired&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;“Here at Virgin Care, colleague recognition is important to us and we know that across our services there are colleagues who deserve acknowledgment for their commitment for going above and beyond to ensure that their colleagues and service users feel the difference.”&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Feel the Difference&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;If you’d like to discuss the role further, or request the full job description, please contact Samantha Hamilton via email: samantha.hamilton&lt;span&gt;@virgincare.co.uk&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You’re welcome to come in for an informal visit, meet our friendly team and ask any queries you may have before you apply.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We partner with the NHS to make a real difference to people inReading, Essexand Bedfordand we’re building a working environment where colleagues too can really feel the difference. It’s the kind of place where nothing’s too much trouble. Where you’ll feel empowered, listened to, valued and where we’ll support you to bring your best self to work every single day and to deliver high quality care. And that’s just the beginning. Since 2006, we’ve delivered services to millions of people by developing our own unique approach where our patients are at the centre of everything we do.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We’re committed to equal opportunities and welcome a broad diversity of talent to apply. We reserve the right to cease any advertising prior to the published closing date for a role that receives a high number of applications. Virgin Care Limited, its subsidiary companies and the Virgin Care LLPs are part of the Virgin Group and provide NHS and social care services. If you would like to know a little more about how we use your information, please see our website’s privacy policy.&lt;/span&gt;&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "Virgin Care", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127354"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Chelmsford", "postalCode": "CM2 7PY"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7257", "longitude": ".482625"}}, "title": "Bank Salaried GP", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254812", "validThrough": "2020-11-17T23:59:59+0000"}