{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "36739", "minValue": "29888", "unitText": "YEAR", "value": "£29,888 - £36,739 per annum inclusive of HCAS"}}, "datePosted": "2020-10-13T14:46:04+0100", "description": "&lt;p&gt;The Royal Free London NHS trust is a leading academic and tertiary referral centre for Breast, Plastic and Reconstructive Surgery. We are one of the largest Plastic Surgery Departments, with over 20 consultants. We are a dynamic multidisciplinary team - our world class care values are at the forefront of all that we do.&lt;/p&gt;\n&lt;p&gt;Plastic surgery is restorative (form &amp; function) and/or corrective surgery of various area(s) of the body. This can be as a result of; congenital abnormalities, cancer reconstruction and trauma. It can range from simple skin grafts to complex flaps using techniques, as well as surgery, such as Negative Pressure Wound Therapy (NPWT), Larvae and Leech Therapies.&lt;br /&gt;&lt;br /&gt;An exciting opportunity exists to join our team working within our 18 bedded breast, plastic &amp; reconstructive surgery ward.&lt;br /&gt;&lt;br /&gt;We are seeking a dynamic, motivated Registered Nurse to join our team as a Band 5 staff nurse. You must possess the ability to work flexibly, prioritising the needs of our patients effectively and communicating clearly. You will be required to demonstrate commitment to excellent patient experience, in line with the Trust World Class Care Values, and in support of our patients. &lt;br /&gt;&lt;br /&gt;5 North A has 18 beds and accepts all kinds of Plastic Surgery. We are a regional unit which covers, North London, Hertfordshire &amp; Luton and includes the North West London &amp; Hertfordshire Hand Trauma Service.&lt;/p&gt;\n&lt;p&gt;The plastic surgery team at the Royal Free can offer valuable support and development, coordinated through our Clinical Practice Educator, available on the ward area. There is also a wealth of support provided from the senior nursing team, plastic nurse specialists (breast reconstruction &amp; outreach) and hand therapists. This will start with your comprehensive induction and orientation, and continue with access to formal and informal study sessions and development days, including simulation training. Further university accredited courses are available (subject to availability). A Trust preceptorship programme is available to all newly qualified staff for a full year. There are many interesting opportunities for further career development within the Royal Free.&lt;br /&gt;&lt;br /&gt;The Royal Free is located within an attractive part of London, with easy access to transport; train, bus or tube. We can offer on-site accommodation, on site leisure facilities and nursery places. Many of our staff commute from outer London and beyond.&lt;br /&gt;&lt;br /&gt;We support flexible working.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Azar Karkhaneh (5NA Ward Manager) – 0207 317 7783, or ext 37423, azar.karkhaneh@nhs.net or Jennie Cole (Plastics CPE), jennifercole@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120624.jpg", "name": "Royal Free London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120624"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Free Hospital, Hampstead", "postalCode": "NW3 2QG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5532", "longitude": "-.165298"}}, "title": "Band 5 Staff Nurse - Plastic Surgery", "url": "https://www.jobs.nhs.uk/xi/vacancy/916224744", "validThrough": "2020-11-08T23:59:59+0000"}