{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 gross per annum"}}, "datePosted": "2020-10-16T09:46:15+0100", "description": "&lt;p&gt;&lt;strong&gt;Am opportunity has arisen to appoint an ambitious and innovative individuals to the position of Consultant Psychiatrist, working in our women’s secure inpatient service based in Norwich&lt;/strong&gt;.&lt;/p&gt;\n&lt;p&gt;Norfolk and Suffolk NHS Foundation Trust is the main provider of specialist mental health, psychological therapies, drugs and alcohol and learning disability services for the counties of Norfolk and Suffolk, serving a population of 1.6 million, across seven CCGs, with an annual turnover of £220m.&lt;/p&gt;\n&lt;p&gt;Our Forensic Mental Health Services comprises of low and medium secure inpatient services, community forensic services, and criminal justice liaison services for both counties, as well as inpatient medium secure services for the residents of Cambridgeshire. You will join our team of 7 Consultants. Our service achieved a “good” rating by CQC when inspected in August 2018, but we have higher aspirations.&lt;/p&gt;\n&lt;p&gt;The roles will provide clinical care and leadership for our Forensic Women’s Secure Services based at Hellesdon Hospital covering the counties of Norfolk and Suffolk. These roles will provide you with the opportunity to play a key strategic role in service design and redevelopment. We are currently undertaking a service redesign aimed at ensuring that service users in all parts of the pathway are full partners in their individual care and the ongoing development of the services and that all aspects of the care pathway are efficiently delivered by expert multidisciplinary teams. The service is currently part of a collaboration developing New Care Models within the Eastern Region, as well as bidding for wave 2 of specialist forensic community team development with NHS England.&lt;/p&gt;\n&lt;p&gt;The post holder must be registered with the GMC, possess a license to practice and have S12 (2) approval. The post holder must also have an entry on the GMC Specialist Register (CCST) in Forensic or Adult Psychiatry (or within three months of completion of CCST). Applications from those wishing to work flexibly or those wishing to develop academic or special interest sessions are welcomed.&lt;/p&gt;\n&lt;p&gt;Top reasons to live and work in Norfolk and Suffolk:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Protected 2.5 SPA time (pro rata)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;There are numerous teaching opportunities available, both at postgraduate and undergraduate level, at the medical school at University of East Anglia.&lt;/li&gt;\n&lt;li&gt;There are many areas of outstanding natural beauty, award-winning coastlines and picturesque villages, which add to the charm of the county.&lt;/li&gt;\n&lt;li&gt;Quality of living for staff working in Norfolk and Suffolk is high with some of the lowest crime rates in the country, affordable housing and excellent schools.&lt;/li&gt;\n&lt;li&gt;Norwich is the County town, only 90 minutes away from London, as well as being situated close to Norwich and Stansted Airport.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Up to £12,000 relocation package available *terms and conditions apply*&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Here at NSFT we pride ourselves on being a welcoming, talented, friendly and supportive team who like nothing better than sharing their experiences and learning from each other.&lt;/p&gt;\n&lt;p&gt;Please find attached our Job Description and Person Specification for more detail on your Key Accountabilities, then if you feel you have what it takes to make a difference, click APPLY!&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Proposed interview date is 10th December 2020 (this is provisional and subject to change). Candidates may only be given a minimum of 3 days’ notice for interview. You will be contacted via email and invited to book a time. These emails may go to your SPAM, so please keep checking all your emails if applying.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;Please visit our Facebook and Twitter page @NSFTjobs&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameMark EarthrowlAdditional contact information&lt;/p&gt;\n&lt;p&gt;Dr Mark Earthrowl, Clinical Director, 01603421558; mark.earthrowl@nsft.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Covid-19 update&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are working hard to maintain usual recruitment process however please be aware that we may ask you to be interviewed via skype rather than in person. Please also bear with us as we endeavour to recruit as many people as we can in unprecedented times.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121326.png", "name": "Norfolk and Suffolk NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121326"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Whitlingham Ward, Hellesdon Hospital, Norwich", "postalCode": "NR6 5BE"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6596", "longitude": "1.25089"}}, "title": "Consultant Forensic Psychiatrist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916229487", "validThrough": "2020-11-15T23:59:59+0000"}