{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 Pro rata"}}, "datePosted": "2020-10-26T12:46:33+0000", "description": "&lt;p&gt;&lt;strong&gt;There are full time and part time Staff Nurse positions available on Ward 14 at Fairfield General Hospital. &lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;Ward 9 is fast paced medical/ surgical ent ward&lt;/p&gt;\n&lt;p&gt;It offer&#39;s many opportunities to develop your knowledge and skills, as we also have an additional 13 beds which care for patients with medical conditions awaiting discharge.&lt;/p&gt;\n&lt;p&gt;Are you looking for a nursing role that gives you exposure to a variety of patient cases and broadens your experiences as a nurse? Then this role could be the one for you!&lt;/p&gt;\n&lt;p&gt;Ward 9 at Fairfield General is looking to recruit band 5 Staff Nurses both newly qualified and experienced to join an enthusiastic team committed to delivering the highest standard of care to our patients.&lt;/p&gt;\n&lt;p&gt;Traditionally this is an ENT Ward however we have a mix of medical and surgical beds making this a great environment for nurses wanting variety and cases that will enhance your nursing skills.&lt;/p&gt;\n&lt;p&gt;Initiatives such as end PJ paralysis, using e-obs for the deteriorating patient, c.diff awareness using tests of change to decrease infection across the hospital and pressure ulcer prevention all feature in monthly ward meetings where staff are encouraged to have a voice.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Our commitment to you&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A well-staffed, supportive environment (most shifts have a rostered co-ordinator)&lt;/li&gt;\n&lt;li&gt;Senior nurses who will value and appreciate you&lt;/li&gt;\n&lt;li&gt;Strong preceptorship and support for your development&lt;/li&gt;\n&lt;li&gt;Opportunities for secondments and link nurse positions to enhance your skills and knowledge&lt;/li&gt;\n&lt;li&gt;A fully staffed team of support workers who are enthusiastic, keen to learn and willing to support you in providing top notch care.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;The right nurse for us….&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for dedicated, committed and reliable individuals who are keen to learn, willing to work together as a team but are self-motivated and can work independently when needed. This is a forward thinking team so you will need to be someone who can embrace change and get stuck in.&lt;/p&gt;\n&lt;p&gt;You will be a professional who truly understands the need for care, consideration and respect for our patients but can also apply these qualities to your team members. Our patients and their families require someone with compassion and the ability to empathise with difficult situations and be willing to go the extra mile to do what’s right by them.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We welcome the chance for you to see how the ward team works and encourage you to visit us as part of your application. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;All positions offered and appointed are in full recognition and acceptance of these requirements.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Melanie Brindle&lt;/p&gt;\n&lt;p&gt;Job title Ward manager&lt;/p&gt;\n&lt;p&gt;Email address melanie.brindle@pat.nhs.uk&lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;Melanie Brindle&lt;br /&gt;Ward Manager&lt;br /&gt;0161 778 3725&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121091.jpg", "name": "The Pennine Acute  Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121091"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Buy &amp; Rochdale Care Organisation, Bury", "postalCode": "BL9 7TD"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.6005", "longitude": "-2.25533"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242497", "validThrough": "2020-11-09T23:59:59+0000"}