{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum pro rata"}}, "datePosted": "2020-10-30T10:30:52+0000", "description": "&lt;p&gt;&lt;span&gt;Are you looking for a greatdevelopment opportunity within community services?&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;WEB (Woodbury, Exmouth and Budleigh) Community Therapy Team havea fantastic developmental opportunity for eitheran experienced Band 5 to progress to a Band 6or a Band 6 Physiotherapist looking for rotational experience within the community team. You will be well supported and encouraged to continuously develop to meet the needs of yourself and the service. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This rotational post is based across the Community Rehabilitation Team, the Community Inpatient ward and the Urgent Community Response Team. You will be working as part of a multi-disciplinary, integrated team with patients in their own homes who present with a variety of long term conditions including complex neurology and falls. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Our service objective is to maximise people’s independence and quality of life through assessment, rehabilitation, preventing hospital admissions, and supporting the hospital discharge process.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;For further details or to arrange an informal visit, pleasecontact:Fiona Snape, Physiotherapy Team Leadon 01395 282036 or emailfionasnape@nhs.net&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Our vision is to provide safe, high quality seamless services delivered with courtesy and respect. To achieve our vision we expect all our staff to uphold our Trust values. Our Trust values are: &lt;br /&gt; Honesty, Openness &amp; Integrity&lt;br /&gt; Fairness&lt;br /&gt; Inclusion &amp; Collaboration&lt;br /&gt; Respect &amp; Dignity&lt;/p&gt;\n&lt;p&gt;***Preference will be given to staff with ‘Priority’ and &#39;At Risk&#39; status including NHS At Risk staff throughout Devon.***&lt;/p&gt;\n&lt;p&gt;DUE TO THE ANTICIPATED HIGH NUMBER OF APPLICATIONS FOR THIS POST WE RESERVE THE RIGHT TO CLOSE THE VACANCY BEFORE THE CLOSING DATE.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121044.jpg", "name": "Royal Devon and Exeter NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121044"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Exmouth", "postalCode": "EX8 2JN"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.6205", "longitude": "-3.40162"}}, "title": "Rotational Physiotherapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249736", "validThrough": "2020-11-17T23:59:59+0000"}