{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "45,753.00 - 51,668.00"}}, "datePosted": "2020-11-04T17:07:07+0000", "description": "&lt;p&gt;&lt;strong&gt;Community Clinical Lead (Out of Hospital Emergency Response Lead)&lt;br /&gt;Band 8a&lt;br /&gt;Ormskirk, Lancashire&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Are you a driven, caring and motivated Clinical Lead with experience of Admissions Avoidance based in the West Lancashire area? Are you looking to join an NHS Health and Social Care partner which enables innovation and has the interest of the community at its heart?&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Feel Valued&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As an Out of Hospital Emergency Response Lead, you’ll be working as part of the NHS system in West Lancashire where we deliver services across the region..&lt;/p&gt;\n&lt;p&gt;We‘ll offer you:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;AfC 20/21 salary and terms and condition– including an NHS pension&lt;/li&gt;\n&lt;li&gt;Access to our Strive for Better networks, a national support and professional network made up of NHS professionals like you, giving you the chance to constantly develop industry-leading care and quality&lt;/li&gt;\n&lt;li&gt;Access to our free Employee Assistance Programme, a service providing expert advice, 24/7/365 online and by telephone covering a wide range of support options such as; counsellors, post trauma incident support, legal, debt and practical life management helplines&lt;/li&gt;\n&lt;li&gt;Virgin Tribe - this grants you access to premier offers and discounts on Virgin Products such as holidays&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;&lt;strong&gt;Feel Proud&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;Within our West Lancashire service you will join our Senior Management Team and provide leadership to our evolving Care Control Hub, Community Emergency Response Team and our newest service, the Short Intensive Support Service.&lt;/p&gt;\n&lt;p&gt;Reporting directly to our Head of Operations you will:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Line manage nursing, therapy and support staff within their services supporting the current operational leads.&lt;/li&gt;\n&lt;li&gt;Ensure the Care Control Hub and delegated services deliver the stated outcomes and key performance indicators set by line managers.  The post holder will specifically support a contribution to the reduction of inappropriate admissions to secondary care for older people and will ensure the services evolve to contribute to a reduction in outpatient follow up and outpatient appointments in general.&lt;/li&gt;\n&lt;li&gt;Produce business continuity plans&lt;/li&gt;\n&lt;li&gt;Drive improvements in care pathways and promote appropriate care in the community&lt;/li&gt;\n&lt;li&gt;Lead by example, providing expert advice and guidance to clinical teams.&lt;/li&gt;\n&lt;li&gt;Set and oversee the clinical quality standards of reporting services.&lt;/li&gt;\n&lt;li&gt;Work with third parties, CCG and other agencies to provide suitable care to the community.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;As an Out of Hospital Emergency Response Lead you will be a Registered Nurse or Health Care Professional NMC/HCPC registered, with knowledge of ambulatory/intermediate/emergency care. You will have knowledge of CQC outcomes framework, with the ability to apply it in different healthcare settings.&lt;/p&gt;\n&lt;p&gt;You will have commercial awareness or experience with sound working knowledge of the NHS and government policy. You will be inquisitive, with a flair for innovating care delivery and able to undertake root cause analysis and investigations. &lt;em&gt; &lt;/em&gt;&lt;/p&gt;\n&lt;h2&gt;&lt;strong&gt;Feel the Difference&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;If you’d like to discuss the role further, or request the full job description, please contact Sarah Lunt via email: Sarah.Lunt@virgincare.co.uk. We can offer an informal discussion about the role to interested candidates for insight into life at Virgin Care!&lt;/p&gt;\n&lt;h2&gt;&lt;strong&gt;Virgin Care&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;We’re committed to equal opportunities and welcome a broad diversity of talent to apply. We reserve the right to cease any advertising prior to the published closing date for a role that receives a high number of applications.&lt;/p&gt;\n&lt;p&gt;As a Disability Confident Committed company, we work in partnership with the Department of Work and Pensions (DWP) to provide facilities, work environment adjustments and technical solutions to make our business an inclusive place for all.&lt;/p&gt;\n&lt;p&gt;Virgin Care Limited, its subsidiary companies and the Virgin Care LLPs are part of the Virgin Group and provide publicly funded health and social care services. If you would like to know a little more about how we use your information, please see our website’s privacy policy.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Virgin Care", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127354"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bickerstaff House", "postalCode": "L39 2AZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5645", "longitude": "-2.87161"}}, "title": "Community Clinical Lead", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256765", "validThrough": "2020-11-18T23:59:59+0000"}