{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 + 5% HCAS +Welcome benefit"}}, "datePosted": "2020-11-04T12:30:24+0000", "description": "&lt;p&gt;Why have we been rated as Outstanding?&lt;/p&gt;\n&lt;p&gt;Because your well-being is important to us.&lt;/p&gt;\n&lt;p&gt;We are offering a Welcome benefit of £2000, Revalidation support, Comprehensive induction programme, Clinical Supervision and Continuing professional development, rewards for recommending a friend, dedicated and passionate teams.&lt;/p&gt;\n&lt;p&gt;Join First Community Health and Care to make a real difference to patients whilst developing your career. We are looking for Band 5 qualified nurses to join our Community Nursing Service for the evening shift. The evening shift is from 6pm to 11pm seven days a week, including weekends and bank holidays.&lt;/p&gt;\n&lt;p&gt;First Community provides community nursing and therapy services for the NHS across East Surrey and parts of West Surrey. As an employee-owned community interest organisation, patient care is at the forefront of all we do. We’re recruiting dedicated nurses looking to use your first rate clinical skills. In return we’ll invest in your career through excellent training and development opportunities.&lt;br /&gt; You should have plenty of enthusiasm and be able to work both alone and as part of a team. You should also be flexible and willing to work within the changing health care environment, adapting quickly to change.&lt;/p&gt;\n&lt;p&gt;Due to the nature of the role it is essential that applicants are able to drive, have a car suitable for business purposes, and a clean driving licence.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/126974.jpg", "name": "First Community Health and Care", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126974"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Caterham and Redhill", "postalCode": "CR3 5RA"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2841", "longitude": "-.085553"}}, "title": "Community Staff Nurse (evenings)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255831", "validThrough": "2020-11-18T23:59:59+0000"}