{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-11-03T10:46:34+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for an enthusiastic RMN to contribute to the continued development of the Primary Care Mental Health Services in delivering care and support to patients with long term mental health needs in primary care.&lt;/p&gt;\n&lt;p&gt;You will operate within the principles of recovery and be responsible for the case management of agreed individuals with a stable but long term mental health condition in conjunction with the Primary Care Team.&lt;/p&gt;\n&lt;p&gt;You will work alongside GP surgeries where you will liaise with GPs on managing patients with a wide range of presenting mental health conditions. You will carry out mental health assessments, brief interventions and help to improve the mental health awareness and assessment skills in primary care services. You will also lead on specific projects identified as a priority by your local Clinical Commissioning Group (CCG).&lt;/p&gt;\n&lt;p&gt;You will be required to work with primary care colleagues, GP’s, social care and a range of statutory and voluntary sector mental health providers. You will be expected to have a good knowledge of local community organisations which provide help and support to those with mental health concerns, social isolation and emotional distress.&lt;/p&gt;\n&lt;p&gt;We are seeking to appoint Mental Health Nurses who enjoy being part of new initiatives, are highly clinically skilled and have excellent communication skills. This project requires individuals who are highly motivated, results-orientated and able to work to challenging timescales. You will be directly employed by Kent &amp; Medway NHS Partnership Trust and subject to Trust terms and conditions.&lt;/p&gt;\n&lt;p&gt;You will be benefiting from encouragement to continue to develop your own specialist skills, knowledge and competence through participation, reflection, supervision and training and your development will be guided using the Trust’s appraisal process.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;What we offer:&lt;br /&gt;&lt;br /&gt;- Engagement and running the STEPPS (System Training for Emotional Predictability and Problem Solving) Group&lt;br /&gt;- Working within the Structured Clinical Model for patients with Emotionally Unstable Personality Disorder &lt;br /&gt;- Participation in groups with Psychology and Occupational Therapy &lt;br /&gt;- Opportunities to run groups&lt;br /&gt;- Preceptorship for new qualified staff&lt;br /&gt;- Leadership Modules to develop in senior roles&lt;br /&gt;- Mentorship and Supervision &lt;br /&gt;- Opportunities to work in Secondary Care Mental Health Service&lt;br /&gt;&lt;br /&gt;What you can expect once you join the team: &lt;br /&gt;&lt;br /&gt;- Monthly supervision (clinical and managerial)&lt;br /&gt;- Reflective Group to discuss complex cases and share learning &lt;br /&gt;- MDT Risk Forum to discuss complex cases with high risks &lt;br /&gt;- Mandatory Training &lt;br /&gt;- Support with your caseload via the POD Model&lt;br /&gt;- Clinical Review of caseload with Consultant Psychiatrist and Team Leader&lt;br /&gt;- Structured Clinical Management Group support&lt;br /&gt;- Admin support &lt;br /&gt;- Peer Support&lt;/p&gt;\n&lt;p&gt;We are looking for a motivated and enthusiastic Mental Health Professional. You will have a strong sense of initiative and an excellent team working ability. &lt;br /&gt;&lt;br /&gt;Effective communication skills and self-governance are required. You will be able to demonstrate knowledge of high level interventions &amp; community assessment skills. Existing qualifications or a willingness to undertake training relevant to the post is expected.&lt;br /&gt;&lt;br /&gt;This post offers an excellent opportunity to work in an interesting and developing service environment. You will be offered considerable opportunities for training and professional development.&lt;br /&gt;&lt;br /&gt;As part of the Band 6 Nursing team you will be required to attain a mentoring qualification.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;In the winter of 2017, we launched our new and exciting Nursing Strategy, which is attached here for your reference. Our strategy will support our registered and unregistered nursing staff to provide the best care possible to our patients and their families, whilst enjoying a long and supportive career with us here at KMPT.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Bessie Mhlophe, Operational Team Leader&lt;/p&gt;\n&lt;p&gt;Email: bessie.mhlophe@nhs.net, Telephone: 0750097745&lt;/p&gt;\n&lt;p&gt;Laura Evans, Operational Team Leader, Telephone: 01622766939&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121464.jpg", "name": "Kent and Medway NHS and Social Care Partnership Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121464"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Highlands house, Tunbridge Wells", "postalCode": "TN1 2JN"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.1323", "longitude": ".272045"}}, "title": "Primary Care Mental Health Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253531", "validThrough": "2020-11-17T23:59:59+0000"}