{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 to £21,142 per annum"}}, "datePosted": "2020-11-05T15:53:29+0000", "description": "&lt;p&gt;Do you want to be part of a newly created team committed to providing high quality recovery-focused care and treatment?&lt;/p&gt;\n&lt;p&gt;Do you want to make a difference to the lives of females experiencing a period of mental health illness?&lt;/p&gt;\n&lt;p&gt;This is an exciting time to join Lincolnshire Partnership Foundation Trust (LPFT), as we continue to expand and are welcoming applications for Senior Health Care Support Workers to join our new Female Acute Treatment ward.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Role:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Ash Villa is our new 15 bedded acute treatment inpatient ward, newly created as part of ambitious plans to expand and develop our services and patient offering.&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity to join a new multi-disciplinary team and deliver high quality patient centered and recovery focused care.&lt;/p&gt;\n&lt;p&gt;Ash Villa will provide high quality, specialised treatment and therapy to women with mental health treatment needs, who cannot be safely supported by a community based service.&lt;/p&gt;\n&lt;p&gt;You will provide high quality, evidence-based, holistic care to patients in line with the Health Care Support Worker Code of Conduct and Trust policies. You will support senior colleagues to assess, plan, implement and evaluate care plans based upon individual patient needs.&lt;/p&gt;\n&lt;p&gt;The post holder will participate and facilitate creative and meaningful recovery focused activities with individual patients and in groups.&lt;/p&gt;\n&lt;p&gt;The role may require the use of physical interventions to manage an individual whose behaviors may cause harm to themselves or others and where other non-physical intervention, for example, communication, de-escalation and problem solving skills have been unsuccessful.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About You:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for motivated and enthusiastic individuals, with a passion to care for those with mental health treatment needs to become part of our friendly and supportive team. We are seeking only the best Senior Health Care Support Workers, those who really want to make a difference, and put the Trust Values (Compassion, Pride, Integrity, Valuing Everyone, Innovation and Collaboration) at the core of patient care.&lt;/p&gt;\n&lt;p&gt;Working on an Acute Treatment Ward is a challenging yet rewarding environment. We are looking for someone who is positive, patient and resilient.&lt;/p&gt;\n&lt;p&gt;You will have excellent communication skills with the ability to establish professional therapeutic relationships with patients to enable then to achieve their treatment and recovery goals.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What We Offer:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are committed to supporting you to become the best version of yourself; through offering a comprehensive induction programme with extensive training and further development opportunities, regular clinical and managerial supervision with a focus on reflective practice and a friending working environment.&lt;/p&gt;\n&lt;p&gt;LPFT are continually striving to expand and improve their staff benefits package, so in addition to all the great rewards you might expect from working for the NHS (generous pay, pension, leave, and NHS discounts), we offer:&lt;/p&gt;\n&lt;p&gt;•Staff Wellbeing Service – supporting staff to improve and maintain their psychological and physical wellbeing.&lt;br /&gt;•A wide variety of exercise classes&lt;br /&gt;•Fast access to physiotherapy &lt;br /&gt;•Generous Relocation Package of up to £8K (where eligible)&lt;br /&gt;•Home Electronics salary sacrifice scheme&lt;br /&gt;•Transave – Saving and Loans Scheme&lt;br /&gt;•Car lease scheme open to all employees&lt;br /&gt;•Free staff parking across all 52 LPFT sites&lt;/p&gt;\n&lt;p&gt;For our full list of benefits please see the link to our Benefits booklet.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Lincolnshire Life:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;With excellent schools, picturesque surroundings and obtainable housing, Lincolnshire offers a fantastic lifestyle that you may not have considered possible.&lt;br /&gt;Lincolnshire is a large county with a rich history and beauty; with so much to see and do there is something for everyone.&lt;/p&gt;\n&lt;p&gt;For more information about what makes Lincolnshire a great place to live and work please see our Lincolnshire Area and Lincolshire Life links.&lt;/p&gt;\n&lt;p&gt;If you are looking for a forward thinking, rewarding and friendly place to work and a beautiful place to live LPFT is the right place for you.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Want to talk about the role?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For an informal visit or to discuss the role further, please do not hesitate to contact Katherine Brothwell – HR Business Partner – katherine.brothwell@nhs.net - 07773100887.&lt;/p&gt;\n&lt;p&gt;PREVIOUS APPLICANTS NEED NOT APPLY&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120663.jpg", "name": "Lincolnshire Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120663"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Willoughby Road, Greylees, Sleaford", "postalCode": "NG34 8QA"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9826", "longitude": "-.455546"}}, "title": "Senior Healthcare Support Worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258440", "validThrough": "2020-11-19T23:59:59+0000"}