{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum, pro rata"}}, "datePosted": "2020-10-30T10:02:50+0000", "description": "&lt;p&gt;An opportunity has arisen for Registered Nurses to join our team on the Enhanced Care Ward - full and part time hours are available.&lt;/p&gt;\n&lt;p&gt;The Enhanced Care Ward is a 10 bedded unit for patients with additional complex care needs. We are looking for a motivated, committed individual to join our innovative team. The Enhanced Care Ward is a fast- paced environment in which every day is different.&lt;/p&gt;\n&lt;p&gt;Are you:-&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;seeking development opportunities for career progression?&lt;/li&gt;\n&lt;li&gt;returning to the profession after a break?&lt;/li&gt;\n&lt;li&gt;joining civilian life after a successful nursing career in the military?&lt;/li&gt;\n&lt;li&gt;retired and looking to continue to contribute to our wonderful NHS?&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;When you join, your DBS check will be free of charge, your NMC Registration Fee will be reimbursed to you for the first year of employment and you will have the opportunity to join the Band 5 to 6 development programme as outlined below. Why not take advantage of these benefits by submitting your application.&lt;/p&gt;\n&lt;p&gt;We really value our nurses; whether you are a final year nursing student or already practicing, you will be an asset to our Trust and a key part of our nursing community. You will strengthen our innovative and experienced teams and contribute to the high standards of Care that we provide to the people of Derbyshire. You will be required to work shifts including weekends and bank holidays.&lt;/p&gt;\n&lt;p&gt;Details of our staff support packages are on our website. Some of which include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Fully embedded Preceptorship package and supporting study days&lt;/li&gt;\n&lt;li&gt;Support of Practice Facilitators throughout the preceptorship process&lt;/li&gt;\n&lt;li&gt;Schwartz Rounds&lt;/li&gt;\n&lt;li&gt;PEER Support&lt;/li&gt;\n&lt;li&gt;Employee assistance service&lt;/li&gt;\n&lt;li&gt;Training and development opportunities such as psychodynamic therapy training, coaching and mentoring&lt;/li&gt;\n&lt;li&gt;Support to meet your registration needs&lt;/li&gt;\n&lt;li&gt;Research Centre and library facilities&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;You must hold a current NMC registration (or be a final year nursing student eligible for NMC registration). We look forward to hearing from you and working alongside you in one of our teams. If you share our Trust Values, come and join our Teams.&lt;/p&gt;\n&lt;p&gt;READ ABOUT OUR NEW DEVELOPMENT PROGRAMME AVAILABLE TO YOU:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What is the new programme?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Our new band 5 to 6 development programme is aimed at improving the quality of care offered to patients within acute inpatient settings. By working within a competency framework over a 2 year period Derbyshire Healthcare aims to offer a training and development programme for all band 5 nursing staff.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;How does it work?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;When a nursing staff member completes the competency package they will be automatically transferred into a band 6 Clinical role without interview. This will be determined by the completion of the competency framework and an ability to show a senior level of clinical practice.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Why are we doing this?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;By doing so, we aim to make acute inpatient care a specialist area to work in with the highest level of experienced and trained staff, improving the working environment and the patient experience and clinical care they receive.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What’s the offer and support?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Alongside the development programme, each staff member will receive regular clinical supervision, managerial supervision, practice development group engagement and opportunities for coaching and mentoring improving the access to ongoing career development and planning. All development programmes will be managed by the local line manager with oversight from the Area Service Manager, Head of Nursing and Clinical Matron.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What’s the goal?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;By engaging in the programme you will have opportunities to work, learn and shadow a variety of healthcare professionals across Derbyshire Healthcare and to lead and take part in quality improvement projects, and we will provide better care.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Senior Nurse, Kerby Walker, kerby.walker@nhs.net&lt;/p&gt;\n&lt;p&gt;or&lt;/p&gt;\n&lt;p&gt;Lead Nurse, Hollie Grief, h.grief@nhs.net&lt;/p&gt;\n&lt;p&gt;01332 623867&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121834.jpg", "name": "Derbyshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121834"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Radbourne Unit - University Hospitals of Derby Site, Derby", "postalCode": "DE22 3WQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9126", "longitude": "-1.51002"}}, "title": "Registered Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249634", "validThrough": "2020-11-22T23:59:59+0000"}