{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 - £19,337 per annum pro rata"}}, "datePosted": "2020-10-26T12:31:06+0000", "description": "&lt;p&gt;The Trust delivers emergency and unscheduled care to people in Norfolk, Suffolk, Cambridgeshire, Essex, Bedfordshire and Hertfordshire. The Clinical Audit department analyses and reports on information for ensuring clinical standards are monitored to ensure best clinical practice is adopted at all times, working within the Compliance and Standards team to develop and maintain effective working relationships with senior managers, managers, clinicians and staff across the Trust.&lt;/p&gt;\n&lt;p&gt;We are currently looking to fill a position responsible for supporting and facilitating the Trust’s Clinical Audit Programme in Bedford&lt;/p&gt;\n&lt;p&gt;To receive and organise Patient Care Records. To interpret patient care records, collecting appropriate clinical and patient data, and accurately input to spreadsheets. Attention to detail, excellent keyboard skills required.&lt;/p&gt;\n&lt;p&gt;The ideal candidate &lt;strong&gt;will&lt;/strong&gt; be educated to GCSE level and have a ideally a &lt;strong&gt;minimum of 1 year&lt;/strong&gt; experience in an NHS environment.&lt;/p&gt;\n&lt;p&gt;It is essential that they should have working experience / knowledge of computers, data input and word processing including use of spread sheets and medical data bases. Competent using Microsoft Office products and have experience of medical terminology.&lt;/p&gt;\n&lt;p&gt;They should be an excellent communicator and able to present complex information to individuals and groups. They should have experience in working in a team with an ability to work and manage their own work loads and read distressing Clinical Records and Handling Confidential Information with Understanding of Information Governance and Confidentiality.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NamePammi WarwickJob titleClinical Audit ManagerEmail addressPammi.Warwick@eastamb.nhs.ukTelephone number07710 340643&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120792.jpg", "name": "East of England  Ambulance Service Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120792"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bedford, Bedford", "postalCode": "MK41 0RG"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1524", "longitude": "-.416922"}}, "title": "Clinical Audit Data Clerk", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242438", "validThrough": "2020-11-08T23:59:59+0000"}