{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "32000", "minValue": "28706", "unitText": "YEAR", "value": "£28,706 - £32,000 + Benefits"}}, "datePosted": "2020-10-30T11:14:21+0000", "description": "&lt;p&gt;You’ve just qualified as a nurse. Congrats. Now you need to choose your first job; one that will give your career the best start; that won’t drop you in the deep end.&lt;/p&gt;\n&lt;p&gt;When you join Elysium as a newly qualified Mental Health Nurse, you are automatically enrolled onto the RCN-accredited Preceptorship Academy. That’s 12 months of expert support, training and supervision to help you apply your academic knowledge in real life situations.&lt;/p&gt;\n&lt;p&gt;You will be developed to grow into a confident, autonomous professional with refined skills, values and behaviours. That’s on top of your new role helping to change the lives of others and making a difference.&lt;/p&gt;\n&lt;p&gt;As a qualified nurse you will ensure patients diagnosed with a mental health conditions receive high-quality care, while supporting your colleagues and promote good teamwork.&lt;/p&gt;\n&lt;p&gt;No two days are the same, with plenty to keep you engaged and motivated, but also a good amount of routine.&lt;/p&gt;\n&lt;p&gt;Your personal development matters, after all, a better you means better care. So expect plenty of opportunities to continually develop yourself throughout your career with Elysium.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;You will have:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Relevant nursing qualification and registration&lt;/li&gt;\n&lt;li&gt;Strong team-working skills&lt;/li&gt;\n&lt;li&gt;High level of self-motivation and a flexible approach&lt;/li&gt;\n&lt;li&gt;Positive attitude and be naturally caring and compassionate&lt;/li&gt;\n&lt;li&gt;Commitment to high-quality care and to values and evidence-based practice&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Where you will be working&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location:&lt;/strong&gt;Farmfield Drive,Charlwood,Surrey,RH6 0BN&lt;/p&gt;\n&lt;p&gt;You will be working at Farmfield Hospital, which is a large purpose-built medium-secure service with good facilities. Working alongside a multidisciplinary team, you will provide care and support for adult men 18+ with a forensic background and enduring mental health illnesses such as personality disorder, substance misuse issues and behaviours that challenge.&lt;/p&gt;\n&lt;p&gt;Farmfield is located North West of Gatwick airport near the village of Hookwood, with good transport links by road, bus and train. It is easiest to reach the site by car.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What you will get&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Annual salary of £28,706 rising to£32,000 upon completion of Preceptorship&lt;/li&gt;\n&lt;li&gt;Equivalent of up to 33 days annual leave plus your Birthday off!&lt;/li&gt;\n&lt;li&gt;Free meals and parking&lt;/li&gt;\n&lt;li&gt;Wellbeing support and activities&lt;/li&gt;\n&lt;li&gt;Career development and training&lt;/li&gt;\n&lt;li&gt;Pension contribution&lt;/li&gt;\n&lt;li&gt;Life Assurance&lt;/li&gt;\n&lt;li&gt;Enhanced Maternity Package&lt;/li&gt;\n&lt;li&gt;Flexible working opportunities&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;There is also a range of other benefits including retail discounts and special offers, car leasing without a credit check, holiday financing and much more.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About your next employer&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will be working for an established, stable and agile company with a unique approach to the delivery of care.&lt;/p&gt;\n&lt;p&gt;Each and every employee is valued and supported, as everyone has an important role to play in the success of Elysium. It is only with the dedication, passion and hard work from staff that excellent care programs that truly benefit the service users can be delivered.&lt;/p&gt;\n&lt;p&gt;With a network of over 70 services across England and Wales, providing four services including: Mental Health, Neurological, Learning Disabilities &amp; Autism, Children &amp; Education, there is opportunity for you to grow and move with Elysium.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Elysium Healthcare follows safer recruitment of staff for all appointments. It is a requirement that all staff understand it is each person’s individual responsibility and are committed to promoting and safeguarding the welfare of service users. Candidates will be subject to an Enhanced DBS disclosure.&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Elysium Healthcare", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133794"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Charlwood", "postalCode": "RH6 0BN"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.1664", "longitude": "-.201944"}}, "title": "Preceptorship Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249890", "validThrough": "2020-12-31T23:59:59+0000"}