{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Competitive"}}, "datePosted": "2020-11-05T14:44:17+0000", "description": "&lt;h1&gt;Opportunity for an experienced Director of Clinical Services&lt;/h1&gt;\n&lt;h1&gt;Are you looking for an exciting new challenge in the beautiful Worcestershire ?&lt;/h1&gt;\n&lt;h1&gt;This could be the opportunity for you!&lt;/h1&gt;\n&lt;p&gt;  Are you looking for a role that mixes rural tranquillity with city life? A patient focused service with the bonus of being close to the vibrant city of Worcester and towns such as Gloucester and Cheltenham?   Malvern Wells could be the place to you.  An exciting opportunity has arisen for an established Director of Clinical Services to relocate to the beautiful, rural Worcestershire to open and lead the new Priory Hospital Malvern.&lt;/p&gt;\n&lt;p&gt;Located at the foot of the Malvern Hills, Priory Hospital Malvern provides a specialist psychiatric rehabilitation and recovery service for 25 men aged 18 years or older in a beautiful and relaxing setting. Our patients suffer from enduring mental illness and/ or personality disorder.   We support the needs of both detained and voluntary patients and can manage patients with complex needs, including those with a history of offending.&lt;/p&gt;\n&lt;p&gt;We aim to support patients in developing the life skills needed to enter back into the community where appropriate.&lt;/p&gt;\n&lt;p&gt;This is a fantastic opportunity to play a leading role in starting up this new service, leading a new staff team with the experience of an experienced Leadership team, developing Priory’s reputation for delivering the highest standards of care to a new site and broadening Priory’s provision of services in the Worcestershire area.&lt;/p&gt;\n&lt;p&gt;We are looking for a Nurse or Health professional to take on the highly exciting role of Director of Clinical Services within our new 25 bedded hospital based in the beautiful Malvern Wells in Worcestershire&lt;/p&gt;\n&lt;p&gt;The role will provide significant line management responsibility for our outstanding teams, who in turn deliver exceptional clinical work within our Rehab and Recovery services.&lt;/p&gt;\n&lt;p&gt;Established clinical and management experience is required, including coaching outstanding performance, effective supervision of line managers, succession planning, and managing any areas of underperformance. This role would suit a ward manager or clinical manager wanting to progress or an experienced Director of Clinical Services wanting a fresh opportunity.&lt;/p&gt;\n&lt;p&gt;The successful candidate will have finely tuned decision-making skills, delivering excellent results in a highly time sensitive environment as well as:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Effective organisational capability, with skill at managing tight deadlines are a must.&lt;/li&gt;\n&lt;li&gt;Excellent interpersonal and communication skills with large teams of Managers.&lt;/li&gt;\n&lt;li&gt;Enthusiastic and motivated with a strong “can do” attitude that replicates your own desire to succeed.&lt;/li&gt;\n&lt;li&gt;A role model to other staff and patients- providing advice and support to promote good practice.&lt;/li&gt;\n&lt;li&gt;Ensuring good, strong and effective governance, and acting as a clinical lead and strong deputy for the Hospital Director in their absence. You must be competent in supporting the Hospital Director in planning for internal and external inspections, whilst keeping the Hospital safe at all times.&lt;/li&gt;\n&lt;li&gt;Competent in relationship building, and able to develop strong interpersonal relationships with key referrers and stakeholders.&lt;/li&gt;\n&lt;li&gt;Ability to encourage team members to expand, develop their own competencies and effective succession planning.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What we’d like to give you:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A competitive salary&lt;/li&gt;\n&lt;li&gt;£3000.00 towards relocating if the move is more than 100 miles or £1500.00 if the move is less than 100 miles&lt;/li&gt;\n&lt;li&gt;Disclosure check cost coverage&lt;/li&gt;\n&lt;li&gt;Comprehensive induction and commitment to ongoing training&lt;/li&gt;\n&lt;li&gt;25 days annual leave plus bank holidays plus a day off for your birthday!&lt;/li&gt;\n&lt;li&gt;Online benefits and cashback rewards&lt;/li&gt;\n&lt;li&gt;Cycle to work scheme&lt;/li&gt;\n&lt;li&gt;SMART Pension option&lt;/li&gt;\n&lt;li&gt;Free on-site parking&lt;/li&gt;\n&lt;li&gt;Free meals on site&lt;/li&gt;\n&lt;li&gt;Free parking on site&lt;/li&gt;\n&lt;li&gt;Enhanced maternity pay&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;For an informal chat and further details please contact Cerys Morris on 07720948773 or email cerysmorris@priorygroup.com&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Priory Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133434"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Worcestershire", "postalCode": "WR14 4HZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.0797", "longitude": "-2.32346"}}, "title": "Director of Clinical Services", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258152", "validThrough": "2020-11-19T23:59:59+0000"}