{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Dependant on experience"}}, "datePosted": "2020-11-02T12:01:48+0000", "description": "&lt;p&gt;&lt;strong&gt;IT Telecoms Solutions Architect&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;DHU Health Care CIC&lt;br /&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Due to the expansion of our organisation our IT &amp; Telecoms Department are recruiting an IT Telecoms Solutions Architect.&lt;/p&gt;\n&lt;p&gt;The role will be primarily focused on leading the development of fit for purpose system architecture and system architecture strategy to meet business needs. This includes gathering business requirements, technical requirements and functional specifications as well as regularly assessing the current software systems in place to identify areas for improvement.&lt;/p&gt;\n&lt;p&gt;The ideal candidate will hold a technical degree and/or industry recognised qualification and be able to demonstrate experience in architecture and engineering principles (TOGAF, ZACHMAN, etc) . You will possess excellent verbal communication skills, specifically able to communicate technical information in simple language to end users.&lt;/p&gt;\n&lt;p&gt;You will be able to work proactively under own initiative, take responsibility and demonstrate leadership and work effectively as part of a team. Ability to gather and analyse system requirements and work with a wide range of specialists, at all levels, across internal and external organisational barriers&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Essential requirements:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Extensive experience of server hardware, operating systems and applications software including configuration, delivery and installation&lt;/li&gt;\n&lt;li&gt;Experience of designing and implementing server and storage technology.&lt;/li&gt;\n&lt;li&gt;Experience of VOIP telephony services.&lt;/li&gt;\n&lt;li&gt;Experience of applying the principles of ITIL Incident Management, Problem Management and Change and Release Management&lt;/li&gt;\n&lt;li&gt;Experience of British and International Security Standards (e.g. CIS security benchmarks, ISO27001, ISO9001, NIST, PCI-DSS, OWASP)&lt;/li&gt;\n&lt;li&gt;UK and EU privacy legislation (especially Data Protection Act 1988 and EU GDPR) and the UK regulatory environment (e.g. ICO and CQC).&lt;/li&gt;\n&lt;li&gt;Experience in assessing and/or building security tools and experience in system hardening&lt;/li&gt;\n&lt;li&gt;Experience of producing high quality systems documentation&lt;/li&gt;\n&lt;li&gt;Network Architecture and Protocols sufficient for solution design and implementation.&lt;/li&gt;\n&lt;li&gt;A sound knowledge of network and application security principles&lt;/li&gt;\n&lt;li&gt;Significant server hardware and software knowledge&lt;/li&gt;\n&lt;li&gt;Knowledge of Microsoft Server operating systems including Active Directory.&lt;/li&gt;\n&lt;li&gt;Must hold a Full UK Driving Licence&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;In return we can offer you a competitive salary with generous benefits&lt;/p&gt;\n&lt;p&gt;Inclusion of NHS pension&lt;/p&gt;\n&lt;p&gt;Generous Holiday allowance&lt;/p&gt;\n&lt;p&gt;Westfield Health ( Employee assistance programme)&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Nathanael Pearson, Head of IT &amp; Telecoms, Nathanael.Pearson@dhuhealthcare.nhs.uk, 07827573656&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/130356.PNG", "name": "DHU Health Care CIC", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130356"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Johnson Building, Derby", "postalCode": "DE24 8PU"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9149", "longitude": "-1.45586"}}, "title": "IT Systems Architect", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251943", "validThrough": "2020-11-16T23:59:59+0000"}