{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 pro rata per annum"}}, "datePosted": "2020-11-04T10:31:56+0000", "description": "&lt;p&gt;&lt;strong&gt;Static&lt;/strong&gt;&lt;strong&gt; (Medicine and Surgery Team) Specialist Band 6 Physiotherapist &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;30 Hours per week&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for a highly motivated, forward thinking and experienced Physiotherapist to join our dynamic Integrated Medicine and Surgery Inpatient Therapy Team at Stockport NHS Foundation Trust. We offer a rotational programme within our team working across a variety of different areas including Urgent Care, Critical Care, Surgical Wards and Speciality Medical Wards.&lt;/p&gt;\n&lt;p&gt;We seek a physiotherapist to work as part of an integrated multidisciplinary team to improve flow and quality of the patient journey. The successful candidate will demonstrate flexibility and have previous experience working in an acute setting.&lt;/p&gt;\n&lt;p&gt;This post will provide the successful candidate with the ideal opportunity to further develop and expand on their existing clinical skills in a variety of areas. You will be supported by Therapy Team Leads, Clinical Leads, and Physiotherapy Professional Leads.&lt;/p&gt;\n&lt;p&gt;We have a strong commitment to support all staff members with CPD opportunities. We offer regular supervision and annual appraisal with a regular in-service training programme.&lt;/p&gt;\n&lt;p&gt;There is a responsibility for Respiratory On Call evening and weekend duties, which is underpinned by teaching and a competency programme.&lt;/p&gt;\n&lt;p&gt;The Trust is committed to safeguarding and promoting the welfare of children, young people and vulnerable adults and expects all staff and volunteers to share this commitment and promote safeguarding by implementing the Trust’s policies and procedures, acting promptly on concerns, communicating effectively and sharing information appropriately.&lt;/p&gt;\n&lt;p&gt;If successful this vacancy will require an enhanced DBS check at a cost of £43.50. This cost will be deducted from your first Trust salary &lt;br /&gt;&lt;br /&gt;In addition to this it will be a condition of your employment that you will join the DBS update service and pay the annual subscription fee of £13.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Hannah Spurr - Band 7 Clinical Lead Physiotherapist&lt;/p&gt;\n&lt;p&gt;0161 419 5270&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Stockport NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122553"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Stockport NHS Foundation Trust, Stockport", "postalCode": "SK2 7JE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3838", "longitude": "-2.13202"}}, "title": "Band 6 Static Physiotherapist Medicine &amp; Surgery", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255399", "validThrough": "2020-11-22T23:59:59+0000"}