{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "74661", "minValue": "40037", "unitText": "YEAR", "value": "£40,037 - £74,661 pro rata per a"}}, "datePosted": "2020-10-19T09:00:44+0100", "description": "&lt;p&gt;&lt;strong&gt;Salaried General Practitioner (GP) Opportunities - Bridgwater&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Somerset NHS Foundation Trust is seeking to appoint innovative General Practitioners across four sites within the primary care service. This is an excellent opportunity for a GP seeking a salaried role to contribute to shaping new ways of working/models of care, influence the running of their practice, and fully participate in all activities including clinical governance.&lt;/p&gt;\n&lt;p&gt;As part of our wider alliance you will be given the opportunity to develop specialist skills, develop new care pathways, and influence how primary care interacts with acute and community care. This is a rare opportunity to work at scale within an NHS organisation that is responsible for Primary, Acute and Community Care, across the county.&lt;/p&gt;\n&lt;p&gt;We can offer you flexible working options up to 8 full time GP sessions working across local practices, competitive remuneration package, opportunities for paid professional development and study leave, opportunities for cross working and joint training, the opportunity to develop specialist skills, along with the opportunity to have the support of a larger organization to develop your career.&lt;/p&gt;\n&lt;p&gt;We offer a firm commitment towards training, education and development and you would be joining a supportive, committed and friendly GP team who value team support and good communication. We are the only Trust to offer Primary Care, Mental Health and Acute services offering you a chance to build a portfolio career.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Practice Details&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Warwick House Medical Practice - Taunton&lt;/p&gt;\n&lt;p&gt;We are a practice of 5 Doctors plus Nurses, Health Care Assistant, Midwife, Advance Nurse Practitioner, Pharmacist, Paramedic, a Mental Health Support Worker and MSK Practitioners. We aim to provide a high standard of care in a relaxed and friendly atmosphere. We believe we have an efficient, dedicated and hard-working team who are easily approachable and enjoy their work.&lt;/p&gt;\n&lt;p&gt;For enquires and to arrange informal visits, please contact:&lt;/p&gt;\n&lt;p&gt;Sian Mara, Operational Manager sian.mara@nhs.net&lt;/p&gt;\n&lt;p&gt;Lister House – Wiveliscombe, Taunton&lt;/p&gt;\n&lt;p&gt;We are a 6600 patient, rural dispensing practice located in the historic market town of Wiveliscombe, set in wonderful surrounds on the edge of Exmoor in the Brendon Hills. We have a supportive team of GPs providing surgeries in our modern, purpose built premises, supported clinically by two Nurse Practitioners working as part of our acute team, Practice Nurses and Health Care Assistant. We are also supported by a Clinical Practice Pharmacist and we offer sessions with First Contact Physios and Mental Health Workers. This is an excellent time for you to join a developing and innovative practice.&lt;/p&gt;\n&lt;p&gt;For enquiries and to arrange informal visits, please contact;&lt;/p&gt;\n&lt;p&gt;Emma Spiller, Practice Manager e.spiller@nhs.net&lt;/p&gt;\n&lt;p&gt;North Petherton Surgery – North Petherton, Bridgwater&lt;/p&gt;\n&lt;p&gt;We are a dispensing practice located between Bridgwater and North Petherton, situated on the edge of the eastern foothills of the Quantocks, and close to the edge of the Somerset Levels. We serve 6500 patients providing all the benefits of modern healthcare whilst maintaining traditional GP values. We are rated Good by the CQC and achieved above CCG average ratings on the recent patient survey.&lt;/p&gt;\n&lt;p&gt;For enquiries and to arrange informal visits, please contact;&lt;/p&gt;\n&lt;p&gt;Lesley Mildren – Practice Manager lesley.mildren@nhs.net or Jo Ayre – Deputy Practice Manager Joanne.ayre4@nhs.net&lt;/p&gt;\n&lt;p&gt;Creech Medical Centre – Creech St Michael, Taunton&lt;/p&gt;\n&lt;p&gt;We are located in the Village of Creech St Michael, 3 miles east of Taunton. Our mission is to provide the local community with an excellent level of primary care services, that are sustainable and appropriate, delivered in a safe environment by a well led and responsive healthcare team. Our team is made up of 4 GPs, practice nurses, community psychiatric nurse, MSK practitioner, wellbeing advisor, midwife, district nurse, paramedic practitioners, and practice staff.&lt;/p&gt;\n&lt;p&gt;For enquiries and to arrange informal visits, please contact;&lt;/p&gt;\n&lt;p&gt;Dominique Pearson-Smith, Practice Manager dominique.pearson-smith@nhs.net&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Area&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We also offer you the chance to experience life in the West Country, offering you the chance to live near some of the UK’s most desirable location; from the beaches in North Devon and Cornwall, to the cosmopolitan centres of Bristol, Bath and Exeter, whilst also being less than 2 hours from London. The County town of Taunton has diverse shopping, restaurants, and regularly hosts international music and sporting fixtures. Somerset also offers some of the best school in the country from Public Institutions such as Millfield, Queens College, Taunton School, Kings College, Wellington School and Blundell’s, to award winning state school such as the Richard Huish College.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Working base&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We expect most people would prefer a home base; however we are also offering the opportunity for flexibility in sessions across our practices.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Pro rata, dependant on volume of sessions&lt;/p&gt;\n&lt;p&gt;There are a number of sessions available across the practices which we can discuss with you in more detail&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Contact details&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you would like to discuss the application process for this role please contact Jordan Pollard, Medical Recruitment Consultant on 07765898212 or Jordan.Pollard@somersetft.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For enquires and to arrange informal visits, please contact:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Warwick House - Sian Mara, Operational Manager sian.mara@nhs.net&lt;/li&gt;\n&lt;li&gt;Lister House - Emma Spiller, Practice Manager e.spiller@nhs.net&lt;/li&gt;\n&lt;li&gt;North Petherton - Lesley Mildren – Practice Manager lesley.mildren@nhs.net or&lt;/li&gt;\n&lt;li&gt;Jo Ayre – Deputy Practice Manager Joanne.ayre4@nhs.net&lt;/li&gt;\n&lt;li&gt;Creech - Dominique Pearson-Smith, Practice Manager pearson-smith@nhs.net or Nandini Mcculloch – Admin Manager nandini.mcculloch1@nhs.net&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Somerset NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121360"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Taunton, Taunton", "postalCode": "TA6 4RN"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.1479", "longitude": "-2.99453"}}, "title": "Salaried General Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916231574", "validThrough": "2020-11-23T23:59:59+0000"}