{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24000", "minValue": "24000", "unitText": "YEAR", "value": "up to £24,000 per annum pro-rata"}}, "datePosted": "2020-11-03T12:10:18+0000", "description": "&lt;p&gt;&lt;strong&gt;Governance Administrator&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Part-time permanent role&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;22.5 hours/3 days per week&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Based in Derby, DE1 3QT&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Up to £24,000 per annum pro-rata&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Totally plc addresses the challenges of increased demand on healthcare services by delivering high-quality planned, urgent, and insourcing healthcare across the UK and Ireland.&lt;/p&gt;\n&lt;p&gt;Totally plc is currently recruiting for a Governance Administrator to work within their Planned and Insourcing Services based at Cardinal Square, Derby on a Part-time Permanent basis.&lt;/p&gt;\n&lt;p&gt;The successful candidate is responsible for providing the administrative function which enables the Divisions to meet quality standards in relation to all aspects of clinical governance, risk management, incident management and complaint management. This in turn supports the delivery of high quality, safe care for all who use the organisation’s services.&lt;/p&gt;\n&lt;p&gt;The successful candidate will have experience in Clinical Governance administration and have experience of working in a busy office environment. The candidate should also have telephone customer service skills and have the ability to communicate clearly and concisely.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For a full job description, further information about this role and to apply please contact Corey Spencer on 07553 753270 or via email corey.spencer@totallyplc.com&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;This post is subject to the Rehabilitation of Offenders Act (Exceptions Order) 1975 and as such it will be necessary for a submission for Disclosure to be made to the Disclosure and Barring Service (formerly known as CRB) to check for any previous criminal convictions.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing date for ALL applications is Sunday 15th November 2020 &lt;/strong&gt;(please note that this vacancy may be closed early if sufficient applications are received).&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interviews held via Zoom: W/C 23rd November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Please note the following shortlisting approach will be applied:&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Round 1 - Any staff at risk of redundancy within the Totally plc group, who meet the essential criteria, will be considered in the first instance for this vacancy.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Round 2 - If the vacancy has not been filled after round 1, any employee Affected by Change within the Totally plc group, who meet the essential criteria, will be then be considered for this vacancy.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Round 3 - If the vacancy has not been filled after round 2, we will consider and shortlist all remaining applications in accordance with our recruitment policy.&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Vocare Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133274"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Derby", "postalCode": "DE1 3QT"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9256", "longitude": "-1.46833"}}, "title": "Governance Administrator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253884", "validThrough": "2020-11-15T23:59:59+0000"}