{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62001", "minValue": "53168", "unitText": "YEAR", "value": "£53,168 - £62,001 per annum pro rata"}}, "datePosted": "2020-10-26T13:01:35+0000", "description": "&lt;p&gt;&lt;strong&gt;Band 8B (Part Time - 30 hours) Principal Clinical Psychologist&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Would you like to join and lead a newly re-forming team and help shape the way we work in the current climate? We have an exciting opportunity for a full-time Band 8B Principal Clinical Psychologist to lead locally on the development of a new Stepped Care Therapies Service for older people. The post allows for varied clinical work complimented by managerial endeavour allowing the post holder to lead locally but also feed into Directorate wide initiatives and contribute to the ongoing development of Psychology provision for Older People’s mental health.&lt;/p&gt;\n&lt;p&gt;Clinically there is the opportunity to work with: anxiety of all different aetiologies, depression, psychosis, eating disorders, trauma survivors, emotional dysregulation, amongst other functional conditions as well as numerous and varied organic issues such as young onset dementia. The variety of clinical aetiology is then complimented by the manner in which we work; individually, with family and other caring ‘systems’, couples work, consultation with our MDT colleagues and we are looking to develop therapeutic groups to meet patient needs. The service has also recently expanded our repertoire of delivery to include remote appointments. The service has a good history of providing further CPD opportunities for dedicated clinicians looking to develop their skill sets through formal training and supporting individual clinician projects (for example, the delivery of Trust wide Equality and Diversity sessions to raise awareness of Transgender issues).&lt;/p&gt;\n&lt;p&gt;Cambridgeshire and Peterborough NHS Foundation Trust have developed and embedded an integrated model of community physical and mental health care at primary and secondary care levels. This is an excellent opportunity to further support the development of this service including memory assessment service and advising the wider team and in-reach to inpatient services when appropriate.&lt;/p&gt;\n&lt;p&gt;This post will be part of a stepped care therapy service comprising of Clinical Psychologists, Psychological therapists, Occupational therapists and Mental health practitioners. This team is one of three integrated care teams (ICTs) with social workers and psychiatrists and a memory assessment service, providing clinical input and support to 4 neighbourhood teams (comprising of physical health and mental health staff) in the Peterborough area. There are opportunities for undertaking clinical interventions, delivering training, providing supervision to the wider team and developing combined interventions/approaches for people with long term conditions.&lt;/p&gt;\n&lt;p&gt;The qualified Clinical Psychologist (registered with the Health and Care Professions Council) will have experience of working in a variety of mental health settings. In particular, they will have experience of working with older people with mental health problems, within community multi-disciplinary team. They will provide clinical supervision and have delegated management responsibilities in the service. Interventions provided by the post holder will be on an individual or a group basis, utilising enhanced clinical skills.&lt;/p&gt;\n&lt;p&gt;Cambridgeshire and Peterborough NHS Foundation Trust are committed to providing high quality, effective services, working in partnership with service users towards recovery. The Trust actively supports continuing professional development and has a robust annual appraisal process. The post holder will be supported through regular clinical and managerial supervision, peer support and supervision structures. There are Trust wide psychology CPD events, and active participation with the regional PSIGE/FPOP group. We have strong links with the University of East Anglia for both CPD opportunities and for supporting the training and development of Clinical Psychologists.&lt;/p&gt;\n&lt;p&gt;Services at Cambridgeshire and Peterborough NHS Foundation Trust have been rated as ‘good’ following an inspection by the Care Quality Commission.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Dr Anna Forrest&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Professional Lead for Psychology in the Integrated Care Directorate&lt;/p&gt;\n&lt;p&gt;01223 726022 or anna.forrest@cpft.nhs.uk&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Christine Robertson&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Older People’s Mental Heath Clinical Manager (North)&lt;/p&gt;\n&lt;p&gt;01354 644233 or christine.robertson@cpft.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121760.JPG", "name": "Cambridgeshire and Peterborough NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121760"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Pines, Peterborough", "postalCode": "PE2 7JU"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5546", "longitude": "-.270029"}}, "title": "Principal Clinical Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242572", "validThrough": "2020-11-08T23:59:59+0000"}