{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615"}}, "datePosted": "2020-11-02T08:16:16+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;span&gt;STAFF NURSE – PATIENCE 2 WARD&lt;/span&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Hours: Full-time 37.5 per week rotation of shifts including nights and days.&lt;/p&gt;\n&lt;p&gt;Salary: Band 5: £24, 907-£30,615 per annum.&lt;/p&gt;\n&lt;p&gt;Patience 2 Ward is a newly created 27 bed mix sex Cancer and Associated Specialties emergency admissions surgical ward.&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen on Patience 2 Ward at Nottingham University Hospitals Trust for a Registered Nurse who is enthusiastic, motivated and caring to develop their professional knowledge and ability. Patience 2 Ward is a busy and dynamic Urology Ward admitting both emergency and elective admissions. As a Registered Nurse on the ward you will be exposed to a vast range of Urological surgery, from very minor procedures to major operations. The ward team will work with you to develop competency relevant to the area within an agreed time frame. Patience 2 also operates a 24 hour patient advice line, to help provide reassurance to patients and prevent unnecessary re-admissions to the ward. The unit is committed to providing the highest quality of care and maintaining consistently high standards in a professional and friendly atmosphere. NB: please note: successful applicants will need to complete a successful DBS check.&lt;/p&gt;\n&lt;p&gt;We have a caring and supportive team of nurses dedicated to the delivery of effective patient care. Excellent communication skills and the ability to work flexibly as part of a team are essential. Personal and professional development is actively supported. There are numerous opportunities for nurses with a keen interest in the development of link roles. We offer opportunities for professional development and will support staff to undertake further study.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Applicants should be:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;1st level Registered Nurse, have an interest in Urology nursing be willing to develop clinical skills within required timescales, have excellent verbal and written communication skills be able to prioritise workload and work well within a team.&lt;/p&gt;\n&lt;p&gt;If you are committed to providing patient focused care we would like to hear from you. As a caring and positive person you will be committed to delivering high quality care whilst adhering to the trust values and behaviours.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Emily Sale&lt;/p&gt;\n&lt;p&gt;Job title-Ward Manager&lt;/p&gt;\n&lt;p&gt;Email address-emily.sale@nuh.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number-71952&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122234.jpg", "name": "Nottingham University Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122234"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "City Campus, Nottingham", "postalCode": "NG5 1PB"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9893", "longitude": "-1.16006"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251293", "validThrough": "2020-11-15T23:59:59+0000"}