{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Competitive"}}, "datePosted": "2020-11-03T17:15:51+0000", "description": "&lt;p&gt;&lt;strong&gt;Are you passionate about ensuring all staff have a positive experience? &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; Do you want to constantly improve the support we give to line managers to help them lead their teams with compassion and kindness? &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Do you have lots of ideas on how to transform how we deliver HR support? &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Are you ready for a new challenge? &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Then join us as Deputy Chief of People and create a future you can be truly proud of, as part of the Northern Care Alliance.&lt;/p&gt;\n&lt;p&gt;The Northern Care Alliance (NCA) brings together the ‘outstanding’ rated Salford Royal NHS Foundation Trust with Pennine Acute Hospitals NHS Trust to form a progressive Alliance of Care Organisations under a group arrangement. (Salford, Oldham, Bury &amp; Rochdale). The NCA is an organisation focused on the importance of place. A place where we are passionate about driving forward significant improvements in the provision of safe, high-quality integrated health and social care. A place where hearts and minds combine to save and improve lives. A place where every day is a whirlwind of passion, challenges and immense pride.&lt;/p&gt;\n&lt;p&gt;Giving our patients and staff an excellent experience is at the heart of our vision for the Northern Care Alliance. We have hugely dedicated and committed staff across our organisation and we want to ensure that each and every one of them feels valued in the work they do and supported in every aspect of their daily lives.&lt;/p&gt;\n&lt;p&gt;As Deputy Chief of People you will be front and centre of leading the team who provide the front line HR support to our Care Organisations as well as many of the key functions that support that delivery. You will have the opportunity to shape our people strategy and plans as well as the HR support we provide. You will need to work closely across the senior team and the wider people function to ensure that everything we do is designed to deliver on our ambitions for excellence in experience, as well as transforming how we support our service delivery into the future.&lt;/p&gt;\n&lt;p&gt;You will be an experienced HR leader with a passion for supporting staff and real drive to make a difference. You will be able to influence at all levels and be willing to push the boundaries on what we can achieve. You will be able to demonstrate a track record of delivering changes to the way we do things and of providing strong leadership to an HR function. A sense of humour and fun will help too!&lt;/p&gt;\n&lt;p&gt;If you want to talk about the role further please contact Nicky Clarke, nicky.clarke@srft.nhs.uk to arrange a chat. If you share our vision, take your place with us.&lt;/p&gt;\n&lt;p&gt;Closing date for applications 30th November 2020&lt;/p&gt;\n&lt;p&gt;Interviews 8th December 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameNicky ClarkeJob titleChief of PeopleEmail addressnicky.clarke@srft.nhs.ukTelephone number07720 306814&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121715.jpg", "name": "Salford Royal NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121715"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Nothern Care Alliance Group, Salford", "postalCode": "M6 8HD"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4876", "longitude": "-2.32342"}}, "title": "Deputy Chief of People", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254902", "validThrough": "2020-11-30T23:59:59+0000"}