{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24000", "minValue": "24000", "unitText": "YEAR", "value": "Up to £24,000 per annum - DOE"}}, "datePosted": "2020-10-26T12:31:39+0000", "description": "&lt;h1&gt;&lt;strong&gt;I help to make a difference!&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;&lt;strong&gt;Are you collaborative, caring and compassionate?&lt;/strong&gt;&lt;br /&gt; &lt;br /&gt; Prisons are one of the most challenging, yet rewarding places for healthcare professionals to work - if you’re looking for a role where you can develop your existing skills and learn something new every day, then this is the place to be.&lt;br /&gt; &lt;br /&gt; HM Prison The Mount is a Category C men&#39;s prison, located on the outskirts of Bovingdon village in Hertfordshire, England&lt;br /&gt; &lt;br /&gt; Practice Plus Group were recently awarded the healthcare contract at HMP The Mount and started delivering the services on 1st October 2020; we are the Health in Justice Market leader, providing healthcare services to offenders across the country. Our model of care is our Wellbeing Approach – an integrated, comprehensive approach in recognition of the fact prisoners are a socially-excluded group with healthcare needs which are complex and often associated with poor outcomes. It adopts the premise no single health/wellbeing factor can be taken in isolation of other motivational issues which might impact a person’s care.&lt;br /&gt; &lt;br /&gt; &lt;br /&gt; &lt;strong&gt;Interested in clinical development?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We could give you the opportunity to develop in to a specialist role of your interest and benefit to the healthcare team&#39;s pharmacy service.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;In return for your hard work you will..&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Receive an annual salary of up to £24,000 - dependent on experience. You&#39;ll also get a number of benefits including a company contributory pension scheme, 25 days annual leave plus 8 public bank holidays plus CPD and re-validation support.&lt;/p&gt;\n&lt;p&gt;Other benefits include cycle to work scheme, childcare vouchers plus training and clinical development opportunities.&lt;br /&gt; &lt;br /&gt; Onsite benefits at HMP The Mount include access to an onsite gym, free parking and subsidised café/restaurant.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What will you be doing?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will be required to support the delivery of Pharmacy Services which will be part be of a comprehensive healthcare package, based on the prison service’s needs. Working on the prison wings, you can expect to be involved in everything from medicine management, dispense medications, screening drug charts, patient counselling etc.&lt;/p&gt;\n&lt;p&gt;You may be required to accept certain activities in relation to the day to day operational management of their unit and as such must ensure that they are trained and competent to take on these additional responsibilities. As a Pharmacy Technician, you may also be required to take on a role of working across multiple Pharmacy Services if and when required.&lt;br /&gt; &lt;br /&gt; You will hold NVQ Level 3, BTEC or equivalent qualifications and have current registration with the General Pharmaceutical Council (GPHC) to be considered for this role. You will also have relevant post-qualification experience working within a pharmacy environment and multi-disciplinary team.&lt;br /&gt; &lt;br /&gt; You’ll be able to demonstrate assessment skills, including undertaking of risk assessments and have sound patient counselling skills, treating patients with respect and dignity at all times, adopting a culturally sensitive approach.&lt;br /&gt; &lt;br /&gt; As a Pharmacy Technician, you may be required to take on a role of working across multiple Pharmacy Services if and when required.&lt;br /&gt; &lt;br /&gt; If you are self-motivated and able to work autonomously as well as showing plenty of initiative when it comes to handling a wide range of situations, then this could be the right role for you!&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Next steps&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you are shortlisted, you will be contacted by the Internal Recruiter for this role.&lt;br /&gt; &lt;br /&gt; The recruiter will submit your CV to the hiring manager and in turn we will arrange an interview for you to attend at if the hiring manager feels that you are suitable for the job.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;More information&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is a full-time role working 37.5 hours per week. The salary for this role is up to £24,000 - dependent one experience.&lt;br /&gt; &lt;br /&gt; Please note that offers of employment are subject to Practice Plus Group Terms &amp; Conditions and receipt of satisfactory references, an enhanced DBS check and prison vetting.&lt;br /&gt; &lt;br /&gt; &lt;em&gt;&lt;strong&gt;At Practice Plus Group we actively promote diversity and equal opportunities.&lt;/strong&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Practice Plus Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130136"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hemel Hempstead", "postalCode": "HP3 0NZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7248", "longitude": "-.541331"}}, "title": "Pharmacy Technician - HMP The Mount", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242459", "validThrough": "2020-11-09T23:59:59+0000"}