{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "39681", "minValue": "32933", "unitText": "YEAR", "value": "£32,933 - £39,681 Per Annum incl HCAS"}}, "datePosted": "2020-10-26T11:46:12+0000", "description": "&lt;p&gt;Berkshire Surrey Pathology Services (BSPS) is a successful and progressive merged pathology network which is a contractual joint venture between Ashford &amp; St Peter’s, Frimley Health, Royal Berkshire and Royal Surrey County Hospitals NHS Foundation Trusts. It provides services to NHS Acute Trusts, CCGs, academic centres and the private healthcare sector undertaking approximately 20 million tests per year serving a population of 2 million. &lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for a dynamic, forward thinking individual with excellent leadership skills to become part of our Pathology Support Services Team . The scope of the role requires an individual to manage and support pathology Specimen Reception, Phlebotomy and Supply Chain departments at Frimley Park Hospital and community satellite sites.&lt;br /&gt;&lt;br /&gt;As a key member of the BSPS team, you’ll have strong leadership skills with a proven ability to support and sustain transformational change. You will be experienced in working effectively and supporting the specimen reception and phlebotomy departments, demonstrating innovation with a clear focus on delivery. Strategic thinking and implementation, performance management, quality management skills, coaching skills and highly developed communications skills will be fundamental to your role.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameSatinder BoparaiJob titleDeputy General Manager Pathology Support ServicesEmail addresssatinder.boparai@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121099.png", "name": "Frimley Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121099"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Frimley Park, Frimley", "postalCode": "GU16 7UJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3197", "longitude": "-.741538"}}, "title": "Site Lead Support Services", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242255", "validThrough": "2020-11-08T23:59:59+0000"}