{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "10086", "minValue": "10086", "unitText": "YEAR", "value": "Band 5/6 equivalent"}}, "datePosted": "2020-10-29T10:36:11+0000", "description": "&lt;p&gt;&lt;strong&gt;Staff Nurse | Pre-Operative Assessment | Band 5/6 equivalent |Monday to Saturday – Full time hours|  Hove| Learning and advancement opportunities&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Due to expansion the Montefiore Hospital  is recruiting for  an enthusiastic and committed  Staff nurse. You will be  based  in our Pre-Assessment unit , working alongside an experienced and dynamic team covering a wide variety of specialisms. This unmissable opportunity will enable  you  to further develop your clinical skills in a modern and supportive environment.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Montefiore Hospital is rated  “O&lt;strong&gt;utstanding” by the Care Quality Commission (CQC). We practice some of the most advanced treatments on the latest generation imaging, and diagnostic technology. This means we can offer everything from screening and rehabilitation through to leading-edge surgical procedures and excellence in specialist fields like orthopaedics, cardiology and general surgery all delivered through our expert and caring clinical team. &lt;/strong&gt;&lt;/strong&gt;&lt;strong&gt;The hospital is well positioned to maximise the excellent local public transport. There are buses that stop in the vicinity and is also walking distance of both Hove and Brighton train station&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Duties and responsibilities:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;You will support in assessing patient’s health and well-being across a complex and changing caseload&lt;/li&gt;\n&lt;li&gt;Undertake electronic pre-operative assessment of patients&lt;/li&gt;\n&lt;li&gt;Identify and escalate patients of concern against the hospital&#39;s admission criteria to senior nursing staff&lt;/li&gt;\n&lt;li&gt;Ability to undertake a full patient health assessment and triage their pre-operative assessment requirements&lt;/li&gt;\n&lt;li&gt;Assist in the delivery of care to meet the individuals’ health and wellbeing needs.&lt;/li&gt;\n&lt;li&gt;Provide and receive complex, sensitive or contentious information&lt;/li&gt;\n&lt;li&gt;Develop own knowledge and skills and that of others&lt;/li&gt;\n&lt;li&gt;Promote best practice in health and safety and security&lt;/li&gt;\n&lt;li&gt;Assist in maintaining and developing services&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Who we&#39;re looking for:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;You will be a Registered Nurse with no restrictions on practise&lt;/li&gt;\n&lt;li&gt;Be used to working in teams with minimum supervision&lt;/li&gt;\n&lt;li&gt;Experience of working in an acute environment&lt;/li&gt;\n&lt;li&gt;Competence across a range of skills, supported by professional and clinical knowledge acquired through state registration&lt;/li&gt;\n&lt;li&gt;A surgical background is desirable but we are happy to consider Nurses with an interest in developing their experience in this field&lt;/li&gt;\n&lt;li&gt;Advanced IT skills for electronic pre-operative assessment system&lt;/li&gt;\n&lt;li&gt;Phlebotomy, venepuncture and ECG skills desirable (or willing to be trained).&lt;/li&gt;\n&lt;li&gt;Outstanding communication skills&lt;/li&gt;\n&lt;li&gt;Pre-Operative Assessment Association course desirable (or willing to undertake this course within 12 months of employment)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Benefits:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We offer employees a competitive salary as well as a comprehensive benefits package which includes but is not limited to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;35 days annual leave inclusive of bank holidays&lt;/li&gt;\n&lt;li&gt;Employer and employee contributory pension with flexible retirement options&lt;/li&gt;\n&lt;li&gt;‘Spire for you’ reward platform - discount and cashback for over 1000 retailers&lt;/li&gt;\n&lt;li&gt;Free Bupa wellness screening&lt;/li&gt;\n&lt;li&gt;Private medical insurance&lt;/li&gt;\n&lt;li&gt;Life assurance&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Please see the attached benefits leaflet for more information.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We commit to our employees well-being through work life balance, on-going development, support and reward.&lt;/p&gt;\n&lt;p&gt;Spire Healthcare is a leading independent hospital group in the United Kingdom and the largest in terms of revenue. From 39 hospitals and 8 clinics across England, Wales and Scotland, Spire Healthcare provides diagnostics, inpatient, day case and outpatient care.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further information about this role or for an informal conversation about the range of career options available with Spire please contact Sherine Lowers  on sherine.lowers@spirehealthcare.com&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;For us, it&#39;s more than just treating patients; it&#39;s about looking after people.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Closing date: In order to streamline our recruitment process, we reserve the right to expire vacancies prior to the advertised closing date once we have received a sufficient number of applications &lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Spire Healthcare Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132894"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hove", "postalCode": "BN3 1RD"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8318", "longitude": "-.154902"}}, "title": "Staff Nurse – Pre-Assessment", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247941", "validThrough": "2020-11-29T23:59:59+0000"}