{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 Per Annum pro rata for Part time"}}, "datePosted": "2020-10-27T13:01:05+0000", "description": "&lt;p&gt;Are you a Band 5 theatre practitioner looking to develop your skills into the cardiothoracic specialty?&lt;br /&gt;&lt;br /&gt;Do you have a positive attitude, strong work ethic and wish to work in a demanding, yet dynamic department?&lt;br /&gt;&lt;br /&gt;The Essex Cardiothoracic Centre has facilities for 100 patient beds, performing an average 950 adult cardiac, 350 adult thoracic surgical and 2,500 cardiology procedures each year. We also perform vascular surgical cases on site in a new purpose-built hybrid theatre. Facilities include a highly equipped 18 bed critical care unit, separate cardiology day ward. Essex CTC is one of the few centres in the UK undertaking minimally invasive mitral programme. &lt;br /&gt;&lt;br /&gt;We have an exciting opportunity for a nurse/ODP to join our multi-disciplinary theatre team at The Essex Cardiothoracic Centre. This role requires an enthusiastic, committed and diligent person who is keen to move into a specialist department, able to work within a dynamic team and will strive to maintain the high standard of care offered to our patients. There will be an on call commitment required as part of the post to cover out of hours working. There will also be an opportunity to develop further skills in scrub and recovery.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;NMC or HCPC registration is essential. Please demonstrate your suitability for this role in the Further Comment Section of the application form, as this will be a highly sought after position.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NamePhil ParkerEmail addressPhil.Parker@btuh.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121033.jpg", "name": "Mid and South Essex NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121033"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Basildon Hospital Essex Cardiothoracic centre, Basildon", "postalCode": "SS16 5NL"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5577", "longitude": ".450587"}}, "title": "Band 5 Scrub Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244640", "validThrough": "2020-11-10T23:59:59+0000"}