{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 p.a. / pro rata for part time"}}, "datePosted": "2020-11-05T13:46:10+0000", "description": "&lt;p&gt;&lt;strong&gt;Are you an experienced CAMHS practitioner looking for a new challenge? &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are pleased to offer a number of posts within the 24/7 &lt;strong&gt;Connection Service based at St Ann’s Hospital.&lt;/strong&gt; This service offers 24 hour telephone support to the residents of Dorset experiencing a mental health crisis.&lt;/p&gt;\n&lt;p&gt;As one of the CAMHS practitioners you will work overnight and at weekends offering consultation and advice to families, and young people experiencing Mental Health Crisis, and professionals who are supporting them.&lt;/p&gt;\n&lt;p&gt;You will work in close consultation with other teams within the network, particularly CAMHS Liaison Psychiatry and the Health Based Place of Safety and offer consultation and if required mental health assessments.&lt;/p&gt;\n&lt;p&gt;You will be part of access mental health and the friendly and supportive connections team. This is an all age team and as part of the role you will be offered training and expected to work fluidly across the age span.&lt;/p&gt;\n&lt;p&gt;We are looking for a number of highly organised, autonomous enthusiastic and pro-active health professionals, with CAMHS experience and a desire to share and support systems and colleagues.&lt;/p&gt;\n&lt;p&gt;Full and Part time available - Nights 8pm - 8am and weekend days 8am - 8pm.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Employment in this post requires a Enhanced Disclosure and Barring Service (DBS) check. The DBS levies a charge of £40 and the Trust will recover this cost in instalments from your first 3 salary payments.&lt;/p&gt;\n&lt;p&gt;Applicants who subscribe to the DBS update service and are able to present a valid DBS certificate will not incur a charge.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Katie Butler, CAMHS Tier 4 Service Manager - Email: katie.butler1@nhs.net Telephone: 07500 994280&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121022.png", "name": "Dorset HealthCare University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121022"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Poole", "postalCode": "BH13 7LN"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.6986", "longitude": "-1.92791"}}, "title": "CAMHS Out of Hours Night Practitioner, Band 6", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257949", "validThrough": "2020-11-19T23:59:59+0000"}