{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum / pro rata"}}, "datePosted": "2020-10-30T09:00:56+0000", "description": "&lt;p&gt;The Crisis Response and Home Treatment Team in Buckinghamshire Mental Health Services are seeking to recruit a highly motivated and skilled Band 7 Occupational Therapist to join their team. This is an exciting opportunity for an Occupational Therapist who wants to further develop and gain their managerial skills within the urgent and crisis care pathway.&lt;/p&gt;\n&lt;p&gt;The job is varied and challenging and offers the opportunity to be a part of the exciting journey that Buckinghamshire Mental Health services are taking towards setting up a responsive crisis service. Key elements of the post include taking the lead on the development of recovery and occupation focused interventions by providing expertise and training for the team. In addition to this you will be responsible for the professional supervision of Occupational Therapists within in the Crisis team.&lt;/p&gt;\n&lt;p&gt;The trust has a strong AHP leadership and professional supervision will be provided by the Professional Lead Occupational Therapist (Adult Mental Health Pathway). There are additional opportunities for on-going training and networking with other Occupational Therapists in the trust.&lt;/p&gt;\n&lt;p&gt;The Urgent Care Pathway is an initiative by Buckinghamshire Mental Health Services, as part of Oxford Health NHS Foundation Trust, to meet the demands of the Ten-Year Plan to provide Crisis Response and Home Treatment Services by 2021. Initially based in the Assessment Teams, Clinicians employed into the pathway will be a part of a developing service aimed at supporting our most vulnerable patients and their families in the least restrictive setting possible, by providing a variety of highly intensive interventions at home.&lt;/p&gt;\n&lt;p&gt;As we move toward this Crisis Response and Home Treatment service we require clinicians who are used to working in a fast-paced team, confident in managing risk in the least restrictive way. Clinicians will be skilled mental health assessors with a proven ability to signpost service users towards the most effective treatment pathways.&lt;/p&gt;\n&lt;p&gt;Service Users access a crisis response in a variety of ways, ranging from referrals from their GP and attendance at an emergency department, to a crisis response when they need care in the community and are seen by the police and our street triage teams. The aim of the Urgent Care Pathway is to bring together all those access points under one team, including:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Psychiatric Liaison&lt;/li&gt;\n&lt;li&gt;Overnight Response Team&lt;/li&gt;\n&lt;li&gt;Assessment Teams&lt;/li&gt;\n&lt;li&gt;Acute Day Hospitals&lt;/li&gt;\n&lt;li&gt;Street Triage and Health Based Places of Safety&lt;/li&gt;\n&lt;li&gt;Safe Haven (in partnership with MIND)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;As we work towards this there will be opportunities for clinicians to develop skills in a variety of areas and to help shape the service as we work towards a full fidelity crisis model.&lt;/p&gt;\n&lt;p&gt;In 2021 our base will be moving to Easton Street, High Wycombe.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameLisa SchurerJob titleCRHT Team ManagerEmail addresslisa.schurer@oxfordhealth.nhs.ukTelephone number07717 428080&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Oxford Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122233"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Valley centre, High Wycombe", "postalCode": "HP13 6EQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6284", "longitude": "-.739342"}}, "title": "Crisis Team Deputy Manager - Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249397", "validThrough": "2020-11-15T23:59:59+0000"}