{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £37,890 pa"}}, "datePosted": "2020-09-29T15:00:20+0100", "description": "&lt;p&gt;&lt;strong&gt;BAND 5 TO 6 DEPENDING ON EXPERIENCE&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Lincolnshire Partnership NHS Foundation Trust (LPFT) provides specialist Mental health and Learning disability services for more than 730,000 people in Lincolnshire. Lincolnshire Partnership NHS Trust is well on the road to fully embracing the Transforming Care Agenda of preventing people with a Learning disability from experiencing unwarranted or extended stays in hospital.&lt;/p&gt;\n&lt;p&gt;To ensure that Lincolnshire people with learning disabilities are in receipt of services in the right place at the right time we are excited to have the opportunity to extend and develop learning disability community health services across Lincolnshire. The new and extended services have been implemented to deliver community focused and person centred services for adults with intellectual learning disabilities.&lt;/p&gt;\n&lt;p&gt;The community hub team offers a range of specialist health interventions to people with a learning disability within their place of normal residence, respite and day care placements. The interventions offered are conducted within the agreed pathways offered by the Learning Disability Service:&lt;br /&gt;•Physical Health Liaison&lt;br /&gt;•Mental Health&lt;br /&gt;•Behaviours of Concern&lt;br /&gt;•Mental Health Liaison&lt;/p&gt;\n&lt;p&gt;We are looking for a motivated RNLD/RMN Nurse with experience or an interest of working with adults whom have a diagnosis of Learning Disabilities and are presenting with challenging behaviours or Mental health illness and have complex needs.&lt;/p&gt;\n&lt;p&gt;You will work as part of a well established multi-disciplinary team and you must be a compassionate, organised, team player with excellent communication skills and effective time management skills. You will ideally have experience in clinical assessment, care planning and appropriate clinical decision making skills around risk and behaviour management. You will also be required to be accountable for your own caseload management and will identify Positive Behavioural Support interventions which you will joint work with staff within the team to deliver, or you will provide supervision for other team members to implement this. Your enthusiasm and motivation are just as important as your experience as full training can be provided for a successful applicant with the relevant qualifications.&lt;/p&gt;\n&lt;p&gt;Lincolnshire Partnership NHS Foundation Trust is well established, forward thinking organisation with a real vision for making a positive difference to people in our care and support for our staff. In our recent CQC inspection we were rated overall as ‘Good’ and given ‘outstanding’ for well led. The successful post holder will receive regular supervision both management and clinical and there are future training opportunities available such as access to Non-Medical Prescriber training for the right candidate.&lt;/p&gt;\n&lt;p&gt;Hours of work are Monday to Friday 9am to 5pm and the Position is with the East team which covers Boston, Louth and Skegness areas so the applicant will be required to be able to travel independently to these areas.&lt;/p&gt;\n&lt;p&gt;LPFT offers an excellent benefits package, continued professional development and support, career opportunities and relocation assistance where required.&lt;/p&gt;\n&lt;p&gt;Job advert may close sooner if sufficient applications received.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120663.jpg", "name": "Lincolnshire Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120663"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Beech House, Toot Lane, Boston", "postalCode": "PE21 0AX"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9698", "longitude": ".001882"}}, "title": "Behaviour Support Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916204906", "validThrough": "2020-12-01T23:59:59+0000"}