{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365-£37,890 per annum (pro-rata if part time)"}}, "datePosted": "2020-11-02T12:33:49+0000", "description": "&lt;p&gt;We have an exciting opportunity for a Band 6 Physiotherapist based at Wellington Barracks and Green Hill, Woolwich as part of Defence Primary Healthcare.&lt;/p&gt;\n&lt;p&gt;As the successful candidate you will ensure the provision of a comprehensive and professional physiotherapy/rehabilitation service for entitled personnel. This includes undertaking highly skilled and specialist work in the musculo-skeletal (MSK)/sports and training injury area.&lt;/p&gt;\n&lt;p&gt;You will be part of a friendly healthcare team, providing a high-quality professional service. You will be expected to work between two sites at Wellington Barracks and Green Hill, Woolwich. The working environment at Primary Care Rehabilitation Facility (PCRF) London and (PCRF) Woolwich is welcoming, inclusive and supportive, and you will be valued for the skills you bring. There is potential for on-site gymnasium membership and a subsidised cafeteria.&lt;/p&gt;\n&lt;p&gt;We prioritise the health and wellbeing of our staff, as well as our patients. We also provide regular CPD, as well as experiences and insights into Defence that are fascinating, unique and informative.Returning personnel to full fitness, and maximising their well-being is our ultimate aim, and you will be a key part of this effort, working with the rest of the healthcare team.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please pay particular attention to the attached Job Description and Person Specification, which outlines the role requirements in further detail.&lt;/strong&gt;&lt;/p&gt;\n&lt;h2&gt; &lt;/h2&gt;\n&lt;h2&gt;&lt;strong&gt;Essential Criteria &lt;/strong&gt;&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li&gt;Degree in Physiotherapy plus additional specialist training or experience to post graduate diploma level or equivalent&lt;/li&gt;\n&lt;li&gt;State Registered Physiotherapist (HCPC)&lt;/li&gt;\n&lt;li&gt;Membership of the Chartered Society of Physiotherapists (MCSP)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt; &lt;/h2&gt;\n&lt;h2&gt;Selection Process&lt;/h2&gt;\n&lt;p&gt;The selection at sift stage will be based on your CV.&lt;/p&gt;\n&lt;p&gt;Please ensure you demonstrate that you have the required skills, qualifications and memberships in your CV and that you have saved it using your surname then first name prior to submitting your application.&lt;/p&gt;\n&lt;p&gt;At interview, you will be tested against the following NHS Technical Skill Framework:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;NHS Health &amp; Wellbeing – HWB6 – Assessment &amp; Treatment Planning&lt;/li&gt;\n&lt;li&gt;NHS Health &amp; Wellbeing– HWB7 – Interventions &amp; Treatment&lt;/li&gt;\n&lt;li&gt;NHS Information &amp; Knowledge – NHS IK3 – Knowledge &amp; Info Resources&lt;/li&gt;\n&lt;li&gt;NHS General – NHS G6 – People Management&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;You will also be tested on the following behaviour:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Leadership&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Travel to interview costs will not be reimbursed.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h1&gt;&lt;span&gt;Further Information&lt;/span&gt;&lt;/h1&gt;\n&lt;p&gt;In addition, your appointment entitles you to the NHS London Inner London “High Cost Area” supplement which will be paid as a proportion of basic pay (including the value of any long term recruitment and retention premium) subject to a minimum and maximum level of extra pay.&lt;/p&gt;\n&lt;p&gt;There is no requirement to deploy as this is met by our uniformed personnel, but you will form the continuity of care required by our patients when based at home.&lt;/p&gt;\n&lt;p&gt;Please be aware that if you are found successful you will be asked to provide evidence of your immunity to Hepatitis B.&lt;/p&gt;\n&lt;p&gt;Successful candidates must meet the security requirements before they can be appointed. The level of security needed is security check.&lt;/p&gt;\n&lt;p&gt;All employees joining Ministry of Defence who are new to the Civil Service will be subject to a 6-month probation period (unless otherwise advised) effective from the employment start date.&lt;/p&gt;\n&lt;p&gt;Please note the salary will be pro-rata where part time hours are undertaken.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please ensure you have read all the details in the important information link prior to applying.&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/132174.png", "name": "Ministry of Defence (Defence Medical Services)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132174"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wellington Barracks, Birdcage Walk, London SW1E 6HQ &amp; Green Hill, Woolwich, London SW18 4BW", "postalCode": "SW1E 6HQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5", "longitude": "-.137672"}}, "title": "Band 6 Physiotherapist (Civilian)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252079", "validThrough": "2020-11-10T23:59:59+0000"}