{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £30,615 pa"}}, "datePosted": "2020-10-30T08:47:27+0000", "description": "&lt;p&gt;&lt;strong&gt;Clinical Speciality:&lt;/strong&gt; Patient Recovery &amp; Discharge&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Ward:&lt;/strong&gt; Ward 22&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Locality:&lt;/strong&gt; Burnley General Teaching Hospital&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Ward 22 at Burnley general Hospital is a newly renovated unit, open to patients who are in need of further hospital care following their acute stay at Royal Blackburn. We care for patients from medical, surgical and trauma wards who may be in need of further rehabilitation, discharge planning or any other need which does not require an acute setting.&lt;/p&gt;\n&lt;p&gt;General Duties will include;&lt;/p&gt;\n&lt;ol&gt;\n&lt;li&gt;To provide, promote and maintain the highest possible standard of evidence based patient care.&lt;/li&gt;\n&lt;li&gt;Communicate effectively with individuals and groups.&lt;/li&gt;\n&lt;li&gt;Develop knowledge and practice in this area of work.&lt;/li&gt;\n&lt;li&gt;Contribute to quality improvement.&lt;/li&gt;\n&lt;li&gt;Contribute to the development of services.&lt;/li&gt;\n&lt;li&gt;Support peoples equality, diversity and rights.&lt;/li&gt;\n&lt;li&gt;Work alongside health professionals when planning and implementing patients care.&lt;/li&gt;\n&lt;li&gt;Assist in the discharge planning process in order to maintain appropriate and safe discharge.&lt;/li&gt;\n&lt;li&gt;Lead others in the development of knowledge, ideas and work practice.&lt;/li&gt;\n&lt;li&gt;Plan, allocate, assess and provide feedback to team members.&lt;/li&gt;\n&lt;li&gt;Maintain and support the efficient use of physical and /or financial resources.&lt;/li&gt;\n&lt;/ol&gt;\n&lt;p&gt;Type of Candidate:&lt;/p&gt;\n&lt;p&gt;Ability to work any hour / day of the week – day/night duty.&lt;/p&gt;\n&lt;p&gt;Embrace cohesive working with the wider members of the MDT.&lt;/p&gt;\n&lt;p&gt;Show initiative and enthusiasm, with a positive outlook within the work place.&lt;/p&gt;\n&lt;p&gt;Is honest and trustworthy and maintains professional accountability.&lt;/p&gt;\n&lt;p&gt;Please ensure you check the email account from which you apply regularly as we may use this to contact you regarding your application. &lt;br /&gt;&lt;br /&gt;Only those applicants who demonstrate clearly how they meet our person specification will be shortlisted for interview. &lt;br /&gt;&lt;br /&gt;We reserve the right to close any vacancies from further applications when we have received a minimum number of applications from which to make a shortlist. Please ensure you apply without delay if you wish to be considered for this role. &lt;br /&gt;&lt;br /&gt;The Trust is committed to creating a well managed, flexible working environment that supports staff and promotes their welfare and development. We are committed to promoting equality and diversity; we value the contribution of individual talent, skills, knowledge and experience and aim for a workforce demography representative of the local community. We operate Zero Tolerance to aggression, violence, bullying and harassment. We will make reasonable adjustments to ensure our recruitment and selection process is accessible to all. Flexible Working applications will be considered. The Trust operates a No Smoking Policy. &lt;br /&gt;&lt;br /&gt;Should you require a reasonable adjustment to our recruitment process please contact a member of Recruitment Services on 01254 732075 at the earliest opportunity to ensure that measures can be put in place to enable your application for this post.&lt;/p&gt;\n&lt;p&gt;Please Note: new entrants to the NHS will normally commence on the first pay point of the relevant band.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This job advert will close as soon as sufficient applications have been received. Please apply for this job as soon as you can, if interested. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Dear Potential Applicant,&lt;/p&gt;\n&lt;p&gt;It is important you are made aware of the changes which East Lancashire Hospitals NHS Trust has implemented with regard to charging for the cost of undertaking Disclosure and Barring Scheme (DBS) Checks (previously known as Criminal Records Bureau or CRB) and how this may impact upon you.&lt;/p&gt;\n&lt;p&gt;As this position is exempted from the Rehabilitation of Offenders Act 1974 and involves work that is identified as a regulated activity as defined in the Safeguarding Vulnerable Groups Act (2006), any offer of employment is provisional upon a satisfactory DBS check being obtained.&lt;/p&gt;\n&lt;p&gt;The cost of an Enhanced Disclosure will be £48.00, which includes a small handling fee.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;In line with other NHS organisations in the North West Region, the Trust is now passing the charge for undertaking a DBS check on to candidates in the event they are successfully appointed into the post for which they have applied. Candidates can choose whether to pay this over 1-3 months as a deduction from the monthly salary. By applying for this vacancy you are agreeing to this undertaking in the event you are successfully appointed.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameGill CurrieJob titleMatron - Intermediate CareEmail addressgillian.currie@elht.nhs.ukTelephone number01282 805375&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "East Lancashire Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120742"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Burnley General Teaching Hospital, Burnley", "postalCode": "BB10 2PQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8098", "longitude": "-2.22817"}}, "title": "Staff Nurse/Qualified Nurse Associate - Ward 22", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249374", "validThrough": "2020-11-30T23:59:59+0000"}