{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "74661", "minValue": "40037", "unitText": "YEAR", "value": "£40,037 - £74,661 Per Annum"}}, "datePosted": "2020-11-02T15:31:50+0000", "description": "&lt;p&gt;We are excited to be advertising a number of Emergency Medicine Trust Grade Registrar CESR (Certificate of Eligibility for Specialist Registration) posts, based in the Emergency Department, Kettering General Hospital.&lt;/p&gt;\n&lt;p&gt;The post is part of an expansion of our Middle Grade tier of doctors, and is designed for candidates who are working at the level of senior decision maker in Emergency Medicine, or who are ready to take this responsibility and wish to advance their career in this exciting specialty.&lt;/p&gt;\n&lt;p&gt;The post will provide the appointed clinician with the training opportunities and support required to successfully complete all aspects of the CESR process, from skill and knowledge acquisition through to presentation of your portfolio to the GMC’s CESR committee for recognition on the EM specialist register.&lt;/p&gt;\n&lt;p&gt;From this time on the Doctor will be put onto CESR rotation to enable completion of the four component parts of the programme. It will be possible to provide specific three month secondments to address relevant educational and competency needs. Participating specialties will lead secondments including Anaesthesia and Intensive Care Medicine which are mandatory for CESR rotation. We will provide Acute Medicine and Paediatrics secondment if required. The remaining time will be spent within the Emergency Department, and provide you with experience of working in a large 24 hour emergency department.&lt;/p&gt;\n&lt;p&gt;The successful applicant will begin work at a level commensurate with previous experience, likely to be at ST4 level, or equivalent. You should be ready to start onto the Senior Rota and should have some experience working in the UK. You must be registered with GMC and hold a license to practice. There will be a specifically-designed training and teaching package for all successful applicants and there will be a designated Consultant supervisor for the duration of the rotation.&lt;/p&gt;\n&lt;p&gt;Our department consistently receives excellent feedback from trainees regarding the friendly working environment, the approachability and supportiveness of senior staff, and the training opportunities available.&lt;/p&gt;\n&lt;p&gt;The Consultant body has a breadth of experience including an MRCEM examiners, and sub-specialty interests in Paediatric Emergency Medicine and Level 1 Ultra-sound trainers. This is not a LET-B recognized training post, and you will not receive a National Training Number or a CCT.&lt;/p&gt;\n&lt;p&gt;We will welcome applications from agencies who are part of the NHS Framework.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameSareesh BandapaatiAdditional contact information&lt;/p&gt;\n&lt;p&gt;Sareesh Bandapaati - Consultant ED via Caroline Cross on telephone number 01536 493382.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120843.png", "name": "Kettering General Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120843"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Kettering General Hospital, Kettering", "postalCode": "NN16 8UZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4028", "longitude": "-.741278"}}, "title": "Specialty Doctor in Emergency Department", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252620", "validThrough": "2020-11-12T23:59:59+0000"}