{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 pa/pr"}}, "datePosted": "2020-10-30T12:30:17+0000", "description": "&lt;p&gt;City Health Care Partnership CIC is an innovative, award winning organisation, at the forefront of change and keen to recruit the best people to develop its services within the context of social business. We are seeking a dedicated and enthusiastic Practice Manager to work at Wolds View Primary Care Centre, Bridlington. &lt;/p&gt;\n&lt;p&gt;Wolds View Primary Care Centre is based at Bridlington Hospital and incorporates a GP Practice, Urgent Treatment Centre and GP Out Of Hours.  The service area is also a “Hub” for Improving/Extended Access services. &lt;/p&gt;\n&lt;p&gt;The role is to work within the GP Practice at Wolds View Primary Care Centre.   The hours of work for this post are 37.5 per week.&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity to work within a GP practice offering a full range of services and also in a busy health care environment alongside colleagues providing routine and urgent care to the community.  This job will at times be challenging but enjoyable and rewarding.&lt;/p&gt;\n&lt;p&gt;Applications are welcomed from suitably qualified candidates with experience in management and leadership within healthcare.&lt;/p&gt;\n&lt;p&gt;The post holder will be required to attend and contribute to training events to fulfil their role and keep abreast of national health policy as well as local and organisational procedures and protocols.&lt;/p&gt;\n&lt;p&gt;An ability to commute within the organisation’s geographical area with access to an appropriate means of transport is also essential.&lt;strong&gt;&lt;span&gt;                        &lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Please note that upon appointment, new starters will commence at the bottom of the relevant pay band until any relevant previous NHS service has been verified. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;For informal enquiries please contact Anita Burnhill, Service Manager, Tel: 01262 425620 (email: anita.burnhill@nhs.net) or Gemma Bradley, Senior Operations Manager, Tel: 01482 478964 (email: gemma.bradley3@nhs.net).&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;In cases when a vacancy receives a high number of applications, we may bring the closing date forward. You are therefore advised to submit your completed application as early as possible.                    &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;All applications must be made through NHS Jobs Website. No agencies please&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/124994.jpg", "name": "City Health Care Partnership CIC", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=124994"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bridlington", "postalCode": "YO16 4QP"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.0865", "longitude": "-.216002"}}, "title": "Practice Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250157", "validThrough": "2020-11-15T23:59:59+0000"}