{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "38890", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 pa pr"}}, "datePosted": "2020-10-30T10:46:29+0000", "description": "&lt;p&gt;NHS Midlands and Lancashire CSU are seeking a qualified and experienced individual to work on Court of Protection (CoP) cases across the responsible CCG areas and to ensure CSU compliance with The Mental Capacity Act (MCA) and Deprivation of Liberty Safeguards (DOLS).&lt;/p&gt;\n&lt;p&gt;To support and advise colleagues in matters relating to the MCA and DOLS, to ensure current case law and legislation is being imbedded into clinical practice to promote best practice and compliance with the law.&lt;/p&gt;\n&lt;p&gt;This role sits within the commissioning functions of IPA where health funding is in place, supporting patients in receipt of NHS funding including Continuing Healthcare (CHC), joint funding and complex care funding.&lt;/p&gt;\n&lt;p&gt;The role will be responsive to CCG priorities and expectations whilst working on their behalf and representing them at Court, this will need to be balanced with understanding of best interest principles and provide an objective and considered representation to all parties including patients and their representatives.&lt;/p&gt;\n&lt;p&gt;The post will provide strong clinical leadership and clinical expertise to colleagues within the CSU but also external stakeholders such as the local authority, CCG’s and provider Trusts.&lt;/p&gt;\n&lt;p&gt;The post holder will be responsible for developing and setting best practice standards relating to the MCA and associated legislation. The post holder will set strategic plans relating to compliance with the MCA and be responsible for the implementing and monitoring of those plans to ensure constant service improvement and development.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please note: This role does not guarantee regular work and has no guaranteed hours. You are not applying for either a permanent or fixed term role. If you still wish to apply please continue, otherwise please cancel your application.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Lorna Warriner - Email address - lorna.warriner@nhs.net&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/128334.png", "name": "Midlands and Lancashire Commissioning Support Unit", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128334"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Jubilee House, Leyland", "postalCode": "PR26 6TR"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7076", "longitude": "-2.69456"}}, "title": "Safeguarding Practitioner (Bank)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249784", "validThrough": "2020-11-16T23:59:59+0000"}