{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "42712", "minValue": "36070", "unitText": "YEAR", "value": "£36,070 - £42,712 pa. Inclusive of HCAS [15%]"}}, "datePosted": "2020-10-21T16:16:07+0100", "description": "&lt;p&gt;&lt;strong&gt;Band 6 - Senior Anaesthetic Nurse or ODP – Main Theatres&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for an enthusiastic and motivated Anaesthetic nurse or Operating Department Practitioner to join our dynamic theatre team at Kingston Hospital. Kingston Hospital Foundation Trust is a district general hospital that provides excellent opportunity for personal and professional development of our staff and has close links with the both St George’s University of London, and Kingston Faculty of Health and Social Care Sciences. We also provide excellent local care to the residents of Kingston, Richmond, Twickenham, Wandsworth, Surrey and Sutton. We provide a full range of diagnostic and treatment services and have a national reputation for innovative developments in healthcare, particularly in ‘patient-focused’ care across our services including emergency, day surgery and maternity services. Staff are committed to providing quality healthcare, working hard to ensure that we build up a wide range of clinical services.&lt;/p&gt;\n&lt;p&gt;We carried out a big piece of work with our staff and patients and developed a set of shared values and behaviours – to be &lt;strong&gt;caring&lt;/strong&gt;, &lt;strong&gt;safe&lt;/strong&gt;, &lt;strong&gt;responsible&lt;/strong&gt;, &lt;strong&gt;value each other and to be inspiring&lt;/strong&gt;.&lt;/p&gt;\n&lt;p&gt;We aim to make these values ‘what we do’ - to inspire, develop and support every one of us to live our values; every patient, every colleague, every day.&lt;/p&gt;\n&lt;p&gt;The Main Theatre department comprises 8 operating theatres &amp; The Day Surgery Unit comprises of 4 theatres performing surgery in a variety of specialities.&lt;/p&gt;\n&lt;p&gt;We will provide you with support and training to develop new skills and continuous professional development. Ideally you will have previous operating theatre experience.&lt;/p&gt;\n&lt;p&gt;Interview date: 25th November 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Jed Ablanque (Theatre Practice Educator)&lt;/p&gt;\n&lt;p&gt;j.ablanque@nhs.net or call 020 8934 3073.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Kingston Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120946"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Main Theatres, Kingston Hospital NHS Foundation Trust., Kingston Upon Thames", "postalCode": "KT2 7QB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4143", "longitude": "-.283067"}}, "title": "Senior Anaesthetic Nurse/ODP", "url": "https://www.jobs.nhs.uk/xi/vacancy/916237236", "validThrough": "2020-11-15T23:59:59+0000"}