{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 per annum pro rata"}}, "datePosted": "2020-11-06T11:31:26+0000", "description": "&lt;p&gt;We are currently looking to recruit two fulltime, enthusiastic and motivated Band 3 Support Workers to join the Adult (18+) Norfolk Community Eating Disorder Service, based in Norwich.&lt;/p&gt;\n&lt;p&gt;You will be working as a part of a supportive multidisciplinary team that provides services to people who experience moderate to severe eating disorders. You will be one of two Clinical Support Workers within our community team.&lt;/p&gt;\n&lt;p&gt;As a Clinical Support Worker in the team you will provide a range of practical support to people using the service within a community setting. You will work closely with the rest of the multidisciplinary team to deliver services and interventions, leading towards recovery and / or the improvement in quality of an eating disorder patient’s life .&lt;/p&gt;\n&lt;p&gt;You will need to adopt an enabling approach to help people achieve their recovery goals, promote independence and help people to develop or maintain their skills in daily living. The interventions offered will be time limited and focused on the patient&#39;s need.&lt;/p&gt;\n&lt;p&gt;The ideal candidate will have a strong team work ethic, ability to work independently in different community settings, have a sense of accountability, accompanied by an ability to work under pressure at times.&lt;/p&gt;\n&lt;p&gt;In return we will provide a team environment that provides the necessary support to ensure your development within your role. We are keen to develop our staff and encourage learning opportunities within the Trust. Additionally, you will receive regular supervision and be trained in the use of the Specialist Supportive Clinical Management (SSCM) model.&lt;br /&gt;&lt;br /&gt;Cambridgeshire and Peterborough NHS Foundation Trust (CPFT) provides integrated community and mental health, learning disability and social care services of the highest standard due to our continued commitment to quality and service improvement. We aim to support people of all ages to achieve the very best they can for their health and well-being. To ensure that we achieve this goal we look to recruit candidates of a high calibre that share our passion for delivering excellent service user care, research and education&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Patrick Santry - Team Manager&lt;/p&gt;\n&lt;p&gt;0300 300 0142&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121760.JPG", "name": "Cambridgeshire and Peterborough NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121760"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Springs, Norwich", "postalCode": "NR7 8ET"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6612", "longitude": "1.32766"}}, "title": "Clinical Support Worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259444", "validThrough": "2020-11-22T23:59:59+0000"}