{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 per annum"}}, "datePosted": "2020-10-26T16:16:43+0000", "description": "&lt;p&gt;&lt;strong&gt;If you are a passionate and experienced nursing assistant or admissions administrators and are looking for a new opportunity we would like to hear from you.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Due to an expansion in our services we are actively seeking a Band 4 Senior Perioperative Nursing Assistant with vacancies for the following position:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Senior Perioperative Nursing Assistant for Theatre Direct Admissions.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Oxford University Hospitals NHS Foundation Trust is one of the largest NHS teaching trusts in the country and enjoys a national reputation for the quality of its services in healthcare. The Trust is comprised of four hospitals - John Radcliffe Hospital, Churchill Hospital, Nuffield Orthopaedic Centre (all situated in Headington, Oxford) and the Horton Hospital in Banbury.&lt;/p&gt;\n&lt;p&gt;The John Radcliffe Main theatres and West Wing Theatres provide expertise and excellence in specialist elective and emergency surgery, including adult and children.&lt;/p&gt;\n&lt;p&gt;John Radcliffe Main theatres, including theatre direct admissions, specialize in Major Trauma Surgery, Spinal Surgery, Vascular and acute General Surgical emergencies.&lt;/p&gt;\n&lt;p&gt;The West Wing Theatre Specialties include ENT, Ophthalmology, Plastics, Neuro, Paediatric Ortho /General and Max Fax’s surgery.&lt;/p&gt;\n&lt;p&gt;The operating theatres offer a wide range of general and specialist clinical services with links to the Oxford Universities for education, training and research. The John Radcliffe represents a dynamic centre on which to build upon clinical experience and professional development.&lt;/p&gt;\n&lt;p&gt;Any prospective applicants will require a minimum of 2 years perioperative nursing experience with Care Certificate or equivalent qualification, or a minimum of 2 years’ experience with admissions processes within the NHS.&lt;/p&gt;\n&lt;p&gt;You will be required to work collaboratively and flexibly across the theatre suites to accommodate the service demands of each department. Good communication skills are essential to enable you to work alongside theatre teams to provide a quality patient experience whist optimizing theatre capacity and utilization.&lt;/p&gt;\n&lt;p&gt;We have embedded educational opportunities to support your development and career progression with a comprehensive education strategy in place to underpin the development of all grades. We endeavor to provide a supportive learning environment which includes preceptorship and a comprehensive leadership development program.&lt;/p&gt;\n&lt;p&gt;Full time posts are available.&lt;/p&gt;\n&lt;p&gt;For further information and to arrange an informal visit please contact Nicky Haigh Tel: 01865 (2)23057 nicky.haigh@ouh.nhs.uk (Deputy Matron) or Sam Last Tel: 01865 (2)21055 sam.last@ouh.nhs.uk (Team leader for Senior Perioperative Nursing Assistants)&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameSam LastJob titleTeam Leader for Theatre Direct AdmissionsEmail addresssam.last@ouh.nhs.ukTelephone number01865 (2) 21055Additional contact information&lt;/p&gt;\n&lt;p&gt;Nicky Haigh - Deputy Theatre Matron&lt;/p&gt;\n&lt;p&gt;Email: nicky.haigh@ouh.nhs.uk&lt;/p&gt;\n&lt;p&gt;Tel: 01865 (2)23057&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Oxford University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120889"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "John Radcliffe Hospital, Oxford", "postalCode": "OX3 9DU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7639", "longitude": "-1.21979"}}, "title": "Senior Perioperative Nursing Assistant for Theatre Direct Admissions", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243369", "validThrough": "2020-11-09T23:59:59+0000"}