{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "107688", "minValue": "78860", "unitText": "YEAR", "value": "£78,860-£107,688 per annum"}}, "datePosted": "2020-10-13T17:22:22+0100", "description": "&lt;h1&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Consultant Radiologist&lt;/strong&gt;&lt;/span&gt;&lt;/h1&gt;\n&lt;p&gt;Torbay and South Devon NHS Foundation Trust is looking to appoint two Consultant Radiologists. This is an exciting time to join Torbay and South Devon NHS Foundation Trust, now one of the first vertically-integrated health and care organisations in the country (ICO).&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are a highly successful organisation. In 2011 we won the Health Service Journal Acute Hospital of the Year Award and in both 2013 and 2014 we were named in the HSJ’s Top 100 Places to work. In 2015 the Trust was named as one of the 40 best-performing Trusts in England in the CHKS Top Hospital Award for 2015.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;There is a commitment to an ambitious and inclusive vision to improve health and well-being for the population from all local stakeholders across health and social care, and that vision has been awarded Pioneer status by NHS England. The development of an Integrated Care Organisation, (ICO) through the acquisition of Torbay and Southern Devon Health and Care NHS Trust by South Devon Healthcare NHS Foundation Trust has now taken place and is one of the major enablers in the transformation of services, and developing a new approach to health and social care.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The ICO allows us to radically re-think and re-shape the way we deliver care, free from traditional organisational constraints. We will develop and redesign services that meet the needs of our local population and that are coordinated and integrated in ways that benefit service users. We will develop services that are responsive and flexible and which link, without break, with services of our partner organisations such as primary care and mental health services.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;THE DEPARTMENT&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Torbay and South Devon NHS Trust offers imaging services at Torbay Hospital and 3 community hospitals situated around South Dartmoor. The department of Radiology is based at two separate sites within Torbay Hospital; Radiology East, incorporating MRI and Nuclear Medicine, and all other modalities in Radiology West. There is a separate Breast Care Unit including breast imaging and a Women&#39;s Health Unit.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Main Radiology Services&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The main Radiology Department has a ‘back to back’ CT comprising a GE VCT XT 64 slice scanner (installed March 2009) and a GE 750 HD Discovery (installed December 2011). We are in the process of acquiring a 3rd CT scanner to improve our cardiac CT imaging capabilities and increase in hospital capacity. There are also 2 general screening rooms including a Siemens Artis Zee-MP flat plate C arm (installed April 2009), 3 general x-ray rooms and a twin ultrasound suite.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Nuclear medicine and MRI are situated side by side in the older part of the hospital. NM has a dual head Gamma/CT camera, installed in May 2007 and facilities for cardiac stress testing. A GE Signa 1.5T HDxt MRI was installed in December 2011 and Siemens 1.5T Aero machine in July 2014, we are in the process of replacing the older GE scanner in 2020.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Five additional ultrasound rooms are situated in the Women&#39;s Health Unit.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;There are additional Chest and Dental x-ray rooms in the OP department.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Torbay Hospital and the outlying community hospitals went live with PACS in September 2006&lt;em&gt;. &lt;/em&gt;The organisation of workload from the outset has resulted in the timely reporting of all examinations minimal backlogs developing. This system of PACS reporting allocation has been presented at national conferences.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Regular clinical meetings are held within the department and include Urology, Vascular Surgery, General Surgery, Breast, Care of the Elderly, Paediatrics, General Medicine, Medical and Surgical Gastroenterology, Thoracic Medicine, Endocrinology, Rheumatology, Orthopaedics, ENT and Oncology with multidisciplinary team meetings in all major cancer sites.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Radiology Directorate has a close involvement with the Cancer Services Collaborative and was a pilot site for Whole Systems Improvement in Radiology. The Department was also a pilot site for Team Bonuses; CWP Accelerated Development Programme; National Booked Admissions; Electronic Patient a Staff Records and Team Based Working.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;In addition, there is a strong tradition of supporting education and training for all staff with role extension playing an important part. There are radiographers undertaking US and plain film skeletal x-ray reporting. Another advanced practitioner supports MSK interventional work with targeted pain injections under fluoroscopy.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;A formal Interventional Radiology on-call service commenced in April 2009, this was the first in the Southwest. Initially an entirely in-house service, in September 2010 it combined with the Royal Devon &amp; Exeter (a combined vascular surgical on-call rota had already been in place for several years). The service has been extremely successful and our experience has been presented in national meetings and publications.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Breast Care Unit&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is separate from the main department and has 2 digital mammography units and two US rooms where the Radiologists and an Advanced Practitioner Radiographer undertake symptomatic breast radiology and screening assessments. Stereotactic interventional breast biopsies are also undertaken including use for diagnostic and excision work of an Encor vacuum biopsy system. The reading room is equipped with 2 digital monitors for breast screen reading and general PACS reporting.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further information please contact:&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Dr Rebecca Green, Clinical Director and Consultant Radiologist – 01803 655647&lt;/p&gt;\n&lt;p&gt;Mr Tim Simpson, Radiology Business Manager – 01803 655618&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120957.jpg", "name": "Torbay and South Devon NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120957"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Torquay", "postalCode": "TQ2 7AA"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.4823", "longitude": "-3.55381"}}, "title": "Consultant Radiologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916225169", "validThrough": "2020-11-19T23:59:59+0000"}