{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668  per annum"}}, "datePosted": "2020-11-05T16:31:07+0000", "description": "&lt;p&gt;&lt;span&gt;8a Applied Psychologist/Highly Specialist Psychologist&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;An exciting opportunity has arisen for a permanent full time Band 8a Applied Psychologist to join the Selby, Child and Adolescent Mental Health Services (CAMHS) team. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The successful candidate will work as part of a small but busy CAMHS multi-disciplinary team in Selby, providing a range of specialist assessments, formulations and interventions to children, young people and their families. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Clinical work will include working into the Emotional Wellbeing Pathway, the Neurodevelopmental Pathway and the Positive Behaviour Support Pathway, therefore experience of working into Mental Health services, and working with individuals with a diagnosis of Autism Spectrum Conditions (ASC) and/or Attention Deficit Hyperactivity Disorder (ADHD) would be beneficial. We welcome candidates who are trained in Positive Behaviour Support and ADOS; however, we are also happy to train a successful candidate in these approaches/assessments once they join the team. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This role will also include a variety of leadership and organisational roles, including supporting the development and improvement processes that are currently taking place within the service. This will include leading on various service development and strategic opportunities in the service, locality or trust. This role will include supporting the team in developing their psychological skills, knowledge and attitudes through providing leadership, consultation, formulations, and delivering supervision. The post holder will need to develop key working relationships with colleagues within the team, with CAMHS services across the trust, and with other local external agencies.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Candidates should be experienced clinicians who have worked within Mental Health Services and can demonstrate excellent interdisciplinary working skills. Team work is an important element of the job and you will need to demonstrate working effectively in a team and be trained in offering supervision to other professionals. Applicants need to be motivated, enthusiastic, flexible and resilient. Experience of leadership and working with children, young people and their families would be beneficial.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Psychologists provide key leadership roles within the Trust. To support this we have developed leadership profiles for each psychology band and the profile card associated with this post is attached. You can find more information about the NHS Leadership Academy’s Healthcare Leadership Model and the profiles at their website. We encourage you to look at these resources as they will play a part in the interview process.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Dr Clare Whitton, Consultant Clinical Psychologist &amp; Locality Lead for Psychologists across York and Selby CAMHS &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;01757 241071&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;clare.whitton@nhs.net&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122252.jpg", "name": "Tees, Esk and Wear Valleys NHS Foundation Trust ", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122252"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Cabin, Selby", "postalCode": "YO8 4DL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7855", "longitude": "-1.08014"}}, "title": "Highly Specialist Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258572", "validThrough": "2020-11-19T23:59:59+0000"}