{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 pa"}}, "datePosted": "2020-10-14T13:00:32+0100", "description": "&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Area of work:&lt;/span&gt;&lt;/strong&gt;&lt;strong&gt; Healthy Futures Calderdale&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Public Health Staff Nurse&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Job Location&lt;/span&gt;&lt;/strong&gt;&lt;strong&gt;: Calderdale&lt;/strong&gt;&lt;strong&gt;- &lt;/strong&gt;(&lt;em&gt;Locala Community Partnerships CIC&lt;/em&gt;)&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary: &lt;/strong&gt;£24,907-£30,615 per annum (Pro rata for part time if applicable)&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours per week: &lt;/strong&gt;37.5&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job Type:&lt;/strong&gt; External/Internal. Permanent&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;At Locala our vision is making a positive difference to the wellbeing of the people and the communities we serve. Our values are at the heart of everything we do and are built on respect, working together and leadership. If you feel you have what it takes to be part of a team who are committed to the delivery of high quality care then we would love to hear from you.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The post holder will work with the local authority and Locala public health nurses in Calderdale to provide support to schools and settings around Covid-19. In addition as part of the Healthy Futures school nursing team the post holder will promote and support the health and wellbeing of all school age children, their families and the wider community. Working under the supervision of the Specialist Community Public Health Nurse (SCPHN) within a locality, with partner agencies where appropriate, to support delivery of the Healthy Child Programme (HCP) 0-19 (DH 2010) thereby improving outcomes for children and families working alongside Health Visiting colleagues within each locality.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;You will have excellent interpersonal and communication skills and able to synthesise and communicate highly complex information. You will be able to manage stressful situations and be a team player&lt;/strong&gt;. &lt;strong&gt;You will possess the skills to work without supervision to assess, plan, implement and evaluate care including be able to write and present reports. You will have computer literacy skills and be able to plan and manage a range of practice developments based on need. You will work collaboratively with our partners and have a flexible and adaptable attitude.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Education/ job requirements and qualifications needed: &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will be an NMC Registrant.&lt;/p&gt;\n&lt;p&gt;As part of the school nursing team the post holder will carry out assessments of need and the implementation of planned programmes of care to the school age population and their families which is supervised by the&lt;span&gt; SCPHN.&lt;/span&gt; The post holder will maintain an up to date awareness of national and local government guidance on Covid-19 particularly in relation to education and early years’ childcare settings to provide support to these settings and children and families around Covid-19. Registered Nurse qualification.&lt;/p&gt;\n&lt;p&gt;The role is 37.5 hours per week, but part time working will be considered. Please state within the body of the application whether you require part time hours.&lt;/p&gt;\n&lt;p&gt;In return for becoming part of our team we offer a full induction and training package to support your needs, we will develop and motivate you to enable you to have the right skills to do your job, we offer great working conditions along with supporting you to achieve a good work life balance.&lt;/p&gt;\n&lt;p&gt;For more information about the role please contact Team Leader Meinir Smith on 0300 304 5076 or by email meinir.smith@locala.org.uk&lt;/p&gt;\n&lt;p&gt;Closing Date: Sunday8th November 2020 at midnight&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/126414.png", "name": "Locala Community Partnerships CIC", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126414"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Halifax", "postalCode": "HX1 5NB"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7246", "longitude": "-1.87721"}}, "title": "Public Health Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916226351", "validThrough": "2020-11-08T23:59:59+0000"}