{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "24157", "unitText": "YEAR", "value": "£24,157.00 per annum"}}, "datePosted": "2020-10-29T16:28:12+0000", "description": "\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Children’s Wellbeing Practitioner&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Location: Chelmsford and University College of London (UCL)&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Hours: 25 days study at UCL and the remaining days working in an allocated location within our Essex Services&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;h2&gt;&lt;span&gt;Do you have experience working with children and young people with mental health difficulties? Are you looking for an opportunity to improve your knowledge by studying a diploma whilst developing the services offered to families in Essex? &lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;span&gt;Essex Child and Family Wellbeing Services are offering you the chance to join a 12 month trainee programme ran in conjunction with UCL. Once completing this course you will be awarded a Postgraduate Certificate in Child and Young Persons Psychological Wellbeing Practice (PgCert CWP for short).&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Our Essex Chiild and Family Wellbeing Services are split into 4 quadrants, including North, Mid, South and West and this position will be allocated within those areas. There will be an expectation for the successful applicant to have the abiity to travel throughout Essex as and when required. &lt;/span&gt;&lt;/p&gt;\n&lt;h2&gt;&lt;span&gt;Feel Proud&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;span&gt;This is a training role within the Children and Young People’ Improving Access to Psychological Therapies programme (CYP IAPT). You will work within a CYP mental health service in Chelmsford delivering, under supervision, high-quality; brief outcome focused evidence-based interventions and guided self-help for children and young people experiencing mild to moderate mental health difficulties including anxiety, low mood and common behavioural difficulties. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The training and service experience will equip you with the necessary knowledge, attitude and capabilities to operate effectively in an inclusive, value driven service. You will attend all university based taught and self-study days which will be approximately 25 days throughout the year and work in the service for the remaining days of the week using your newly developed skills.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Whilst Virgin Care will do our upmost to offer a permanent position to each individual that completes the course, we are unfortunately unable to guarantee this.&lt;/span&gt;&lt;/p&gt;\n&lt;h2&gt;&lt;span&gt;Feel valued&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;span&gt;As a Virgin Care employee you will also receive:&lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;span&gt;Flexible working to provide you with that true work / life balance&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Access to Virgin Tribe - our staff benefits scheme which grants you access to premier offers and discount off all Virgin products including flights, holidays, gyms and media, along with regular competitions and giveaways.&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Feel the difference fund - a £100,000 fund to bring ‘Feel the difference’ to life, giving every employee a chance to have their thoughts and ideas heard. &lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Access to MyWellness – a health and lifestyle platform covering mental health awareness and support, healthy recipes &amp; activity challenges&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Access to bespoke career pathways and opportunities to continue your professional development&lt;/span&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;span&gt;You will have proven experience working with children and young people with mental health difficulties, along with a minimum of a second-class Bachelor’s degree in a relevant subject (e.g. psychology, social care) and the ability to travel to UCL for University study days as required and implement training with appropriate support.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;As the Children’s Wellbeing Practitioner you will have the ability to manage sensitive, traumatic and emotionally distressing caseloads in a caring and appropriate manner. Your responsibilities will also include but not limited to: operating at all times from an inclusive values base, which recognises and respects diversity, accepting referrals within agreed national and local protocols, undertaking accurate assessment of risk to self and others, prepare and present case load information to supervisors within the service, escalate cases where the level of need becomes beyond scope and ensure that confidentiality is protected at all times.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The successful applicants will be asked to complete an additional application to UCL directly and a written offer will only be given by Virgin Care once UCL has accepted this application. &lt;/span&gt;&lt;/p&gt;\n&lt;h2&gt;&lt;span&gt;Feel the Difference &lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;span&gt;Virgin Care partner with the NHS and local authorities, providing high quality care for more than 1 million people each year up and down the country. We are an ambitious, forward thinking and passionate company who strive to make a real difference to people and our colleagues. We re-invest all of the money we earn to improve the experience, deliver ambitious transformations and empower all of our colleagues to make the changes, no matter how big or small, that make a real difference. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;If you’d like to discuss the role further, please contact Rebecca Scott-Williams via email: Rebecca.Scott-Williams@virgincare.co.uk&lt;/span&gt;&lt;/p&gt;\n&lt;h2&gt;&lt;span&gt;Virgin Care&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;span&gt;We’re committed to equal opportunities and welcome a broad diversity of talent to apply. We reserve the right to cease any advertising prior to the published closing date for a role that receives a high number of applications. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;As a Disability Confident Committed company, we work in partnership with the Department of Work and Pensions (DWP) to provide facilities, work environment adjustments and technical solutions to make our business an inclusive place for all.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Virgin Care is committed to safeguarding and protecting the children and young people that we work with. As such, all posts are subject to a safer recruitment process, including the disclosure of criminal records and vetting checks. We ensure that we have a range of policies and procedures in place which promote safeguarding and safer working practice across our services. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Virgin Care Limited, its subsidiary companies and the Virgin Care LLPs are part of the Virgin Group and provide publicly funded health and social care services. If you would like to know a little more about how we use your information, please see our website’s privacy policy.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;\n", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Virgin Care", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127354"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Chelmsford", "postalCode": "CM1 1LH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7372", "longitude": ".476016"}}, "title": "Children&#39;s Wellbeing Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249075", "validThrough": "2020-11-12T23:59:59+0000"}