{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-11-05T13:31:52+0000", "description": "&lt;p&gt;We have an exciting opportunities for a qualified HCPC registered Band 5 Biomedical Scientist&#39;s (BMS) to work as part of our team in the FastTrack Haematology Laboratory within Blood Sciences at University Hospitals of Leicester (UHL).&lt;/p&gt;\n&lt;p&gt;The ideal candidates will be HCPC registered, possess a degree or equivalent qualification approved by the IBMS/ HCPC, with sufficient post registration experience in Haematology to practice at Band 5 level. Applications for Trainee Band 5 positions may be considered.&lt;/p&gt;\n&lt;p&gt;The successful candidates will be working within UHL, with a requirement to work at any of the 3 UHL sites as appropriate for the delivery of the service, any time over a 24/7 period. &lt;br /&gt;&lt;br /&gt;The post holder will be expected to assist the section manager in the daily operations and service provision of the department, to include essential Quality tasks.&lt;br /&gt;&lt;br /&gt;We are looking for good team players who can effectively contribute to the on-going development of the services within the Trust. Candidates should also show an ongoing commitment to continued professional development and training / education. &lt;br /&gt;&lt;br /&gt;You will be a well-motivated, responsible team member who is able to manage high workloads, perform to a high quality standard and work as part of a team or on your own initiative with minimal supervision. You must be able to demonstrate good written and verbal communication skills, a flexible approach in line with the Trust agenda of service reconfiguration and be capable of working accurately and efficiently under pressure.&lt;/p&gt;\n&lt;p&gt;Previous applicants need not apply&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Joanne Melbourne Job title Deputy Service Manager Email address joanne.melbourne@uhl-tr.nhs.uk Telephone number 0116 2586574 Additional contact information&lt;/p&gt;\n&lt;p&gt;Jo Melbourne (Deputy Service Manager) on telephone (0116) 258 6574 or email: joanne.melbourne@uhl-tr.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120651.jpg", "name": "University Hospitals of Leicester", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120651"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "UHL, Leicester", "postalCode": "LE1 5WW"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6278", "longitude": "-1.13479"}}, "title": "Biomedical Scientist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257903", "validThrough": "2020-11-19T23:59:59+0000"}