{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "60000", "minValue": "45000", "unitText": "YEAR", "value": "£45,000 - £60,000 (depending upon experience)"}}, "datePosted": "2020-10-30T17:58:27+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;strong&gt;Advanced Nurse Practitioner&lt;/strong&gt;-&lt;strong&gt;Permanent&lt;/strong&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary: £45,000 - £60,000 (depending upon prescribing qualification &amp; experience)&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Are you a Nurse Practitioner looking to further your career and professional development in Nursing, whilst improving the healthcare outcomes of local people?&lt;/li&gt;\n&lt;li&gt;Are you a prescribing nurse looking for a new opportunity?&lt;/li&gt;\n&lt;li&gt;Are you looking for a flexible role or perhaps a portfolio role?&lt;/li&gt;\n&lt;li&gt;Are you looking to work in innovative ways to enable you to focus on providing exceptional patient care?&lt;/li&gt;\n&lt;li&gt;Are you seeking the support of a great team at your practice to help deliver a professional service?&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We are a successful and trusted provider of NHS services across England and Scotland. We have grown rapidly in the past decade from a single Dulwich practice to a team of over 400 employees dedicated to giving patients the very best in care.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;DMC Healthcare&lt;/strong&gt;continue to see steady growth in the services we provide and we have opportunities for salaried&lt;strong&gt;Advanced Nurse Practitioner&lt;/strong&gt;to join our Primary Care teams Full Time providing care at&lt;strong&gt;Sheppey Healthcare&lt;/strong&gt;in&lt;strong&gt;Sheerness, Kent&lt;/strong&gt;&lt;strong&gt;.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for ANPs to join our growing team to help in the delivery of a high-quality service. In addition, we have established central support structures in matters such as administrative support, central reporting, submissions, finance etc. thus ensuring that you and the clinical team in our surgeries, walk-in centres and mobile medical units can focus on patient care.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will be responsible for ensuring the delivery of safe and effective nursing care to the whole practice population, including the assessment of patients with undifferentiated diagnosis.&lt;/p&gt;\n&lt;p&gt;As a senior member of the practice nursing team, the post holder is accountable for the nursing service delivery. You will manage all the nursing resources, working closely with the Nurse lead, practice manager and GPs to deliver the practice priorities. Clinically, the focus of the role is the delivery of evidence-based practice for patients with long-term conditions and management and preventative nursing interventions to all patients, including those who require visiting at home.&lt;/p&gt;\n&lt;p&gt;As autonomous practitioners the ANPs are responsible for the care delivered, demonstrating critical thinking and skills in clinical decision-making. You will work collaboratively with the whole general practice team to meet the needs of patients, supporting the delivery of policy and procedures and providing leadership and direction for the nursing team.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Your experience:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Candidates will be registered with NMC&lt;/li&gt;\n&lt;li&gt;Provide satisfactory references for the preceding three-year period&lt;/li&gt;\n&lt;li&gt;Appointment is subject to satisfactory health and DBS clearance&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Your skills:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Good I.T. skills to perform the I.T. administration relating to the post necessary to support the tasks, including: Blood Results and Clinical Letters.&lt;/li&gt;\n&lt;li&gt;Good communication skills and the ability to demonstrate sensitive communication styles to ensure patients are fully informed and consent to treatment&lt;/li&gt;\n&lt;li&gt;The ability to prioritise own and other&#39;s workload and ensure effective time-management strategies are embedded within the culture of the team&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;If you are passionate about contributing to how the DMC services develop at our practices, and more widely across the business, our open culture will enable you to get involved in the decisions that affect our delivery.&lt;/p&gt;\n&lt;p&gt;Our approach to service delivery is advanced and we strive to look at the way we work to ensure that time with patients is maximised.&lt;/p&gt;\n&lt;p&gt;We will support you in your ongoing personal development and if you are interested in developing a special interest, we are open to that too.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;As part of our employment process, you will be required to complete the appropriate level DBS check.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Equality and Diversity Statement&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The company supports the principle of Equality and Diversity in employment wholeheartedly and opposes all forms of unlawful or unfair discrimination on the grounds of age, disability, sex, gender reassignment, sexual orientation, pregnancy and maternity, race, religion or belief and marriage and civil partnerships.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Disclosure and Barring Service Check&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This post is subject to the Rehabilitation of Offenders Act (Exceptions Order) 1975 and as such it will be necessary for a submission for Disclosure to be made to the Disclosure and Barring Service (formerly known as CRB) to check for any previous criminal convictions.&lt;/p&gt;\n&lt;p&gt;This job advert may close as soon as sufficient suitable applications have been received. If interested please apply for this post as soon as possible.&lt;/p&gt;\n&lt;p&gt;Your submitted application maybe imported into our preferred Third-party recruitment system. By applying for this post, you are agreeing to DMC Healthcare transferring the information within this application to its preferred applicant management system. If you are offered a job, information will also be transferred into the DMC Electronic Staff Records system.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central Advertising - Other", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130656"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Sheerness, Kent", "postalCode": "ME12 3LT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4156", "longitude": ".792928"}}, "title": "Advanced Nurse Practitioner - Sheppey Healthcare", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251087", "validThrough": "2020-11-13T23:59:59+0000"}