{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 p.a., pro rata for part-time"}}, "datePosted": "2020-11-02T14:31:34+0000", "description": "&lt;p&gt;Are you a qualified or newly qualified Nurse looking to work in a District Nursing team? Look no further…….&lt;/p&gt;\n&lt;p&gt;Dorset HealthCare is all about progress and innovation and ensuring we achieve the best possible patient care and health and wellbeing outcomes for all our communities.&lt;/p&gt;\n&lt;p&gt;We are looking for individuals with excellent communication skills, who pride themselves in the quality of care they provide to our patients to work within our District Nursing teams. Currently we have vacancies in&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Blandford&lt;/li&gt;\n&lt;li&gt;Sturminster Newton&lt;/li&gt;\n&lt;li&gt;Shaftesbury&lt;/li&gt;\n&lt;li&gt;Sixpenny Handley&lt;/li&gt;\n&lt;li&gt;Longfleet District Nursing Team based at Alderney Hospital&lt;/li&gt;\n&lt;li&gt;Rosemary Road&lt;/li&gt;\n&lt;li&gt;Poole Road District Nursing Team based at Parkstone Towers&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Where full or part time depending on what you are looking for.&lt;/p&gt;\n&lt;p&gt;The successful applicants will participate in the delivery of skilled autonomous nursing care to patients within their own home, will have an understanding of primary care including the management of long term conditions, broaden your range of skills and knowledge in caring for people in their own environment as part of a multi-disciplinary team including end of life care, wound management, medicines management and as appropriate, assisting the patient to develop self-management skills, this will also include integration with other teams.&lt;/p&gt;\n&lt;p&gt;If you are interested in working in Blandford, Sturminster Newton, Shaftesbury and Sixpenny Handley opportunities please contact Vicky Whittingham for an informal conversation on Victoria.Whittingham@nhs.net&lt;/p&gt;\n&lt;p&gt;If you are interested in working in Longfleet District Nursing Team based at Alderney Hospital, Rosemary Road and Poole Road District Nursing Team, based at Parkstone Towers opportunities please contact Karen Walker for an informal conversation on karen.walker2@nhs.net&lt;/p&gt;\n&lt;p&gt;Please state your preference for location within your application.&lt;/p&gt;\n&lt;p&gt;Employment in this post requires an Enhanced Disclosure and Barring Service (DBS) check. The DBS levies a charge of £40 and the Trust will recover this cost in instalments from your first 3 salary payments.&lt;/p&gt;\n&lt;p&gt;Applicants who subscribe to the DBS update service and are able to present a valid DBS certificate will not incur a charge.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Vicky Whittingham, Email address: Victoria.Whittingham@nhs.net, Telephone number: 07825755189&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121022.png", "name": "Dorset HealthCare University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121022"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Various", "postalCode": "BH17 0RB"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7402", "longitude": "-1.97751"}}, "title": "Community Staff Nurse, Band 5", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252447", "validThrough": "2020-11-16T23:59:59+0000"}