{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum"}}, "datePosted": "2020-10-09T10:46:24+0100", "description": "&lt;p&gt;&lt;strong&gt;Locum Consultant in Emergency Medicine&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;York Teaching Hospital NHS Foundation Trust&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Are you looking to be part of an experienced and supportive MDT?&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Are you passionate in providing high quality emergency patient care?&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Do you want a working environment that supports your clinical and academic development?&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We are looking to welcome two enthusiastic and dynamic Locum Consultans to join our ever expanding service based at York Hospital.&lt;/p&gt;\n&lt;p&gt;This is a fixed term position until August 2021. The successful candidates will join a diverse, forward thinking and enthusiastic ED team who are committed to providing patients with high quality emergency care.&lt;/p&gt;\n&lt;p&gt;This is an exciting time to become a part of the Emergency Department at York due to the ongoing Care Group wide transformation, which has included the introduction of same day emergency care service to enhance our patient experience, and the introduction of the role of Emergency Physician in Charge.&lt;/p&gt;\n&lt;p&gt;You will have the opportunity to enjoy the variety of clinical practice that comes from working in a large, busy teaching hospital whilst developing their own special interest both clinically and non-clinically. You will be enrolled onto our Consultant Development Programme; the over-arching aim is to allow you to develop the skills and knowledge for the different aspects of the Consultant role.&lt;/p&gt;\n&lt;p&gt;The department has strong links with the Hull and York Medical School, providing opportunities in teaching and training. You will benefit from a flexible annualised job plan with a 7.5 DCC / 2.5 SPA, though we are open to discuss any specific or specialised job plans that candidates may desire, including flexible/less than full time working. The department strives to achieve a collective work ethos to help to maintain long term sustainability to work-life balance. Whether you are interested in a subspecialty commitment, teaching, research or quality improvement projects, we are excited to explore these opportunities with you.&lt;/p&gt;\n&lt;p&gt;There is currently a 1:5 weekend-duty rota (1:15 8-4, 1:15 12-19 and 1:15 15.30 – 23.30 and on call) in operation.&lt;/p&gt;\n&lt;p&gt;York Hospital is located just minutes away from the historic city centre of York which is home to various restaurants, bars, shops and theatres perfect for all ages. There are many bus routes accessible throughout York and the train station is only a ten-minute drive from the hospital with regular services to surrounding areas such as Leeds and the ability to travel to London in under 2 hours.&lt;/p&gt;\n&lt;p&gt;In joining the Trust, you will have access to a wide range of staff benefits including health and wellbeing support, finance schemes and discounts. There is also a competitive relocation package of up to £6,000. To support your learning and development you will be entitled to a study leave budget of £3,000 across three years, along with support from our learning and development team. The Trust also offers an extra 2 days annual leave for consultants on top of the existing allowance as detailed in the 2008 - Consultant Terms and Conditions. More information can be found on the Trust’s website in the ‘Working for Us’ section.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Mr Gary Kitching, Clinical Director for the Emergency Department at York Hospital –&lt;/p&gt;\n&lt;p&gt;Email: gary.kitching@york.nhs.uk or telephone 01904 725616&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "York Teaching Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120856"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Emergency Department York Hospital, YORK", "postalCode": "YO31 8HE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.9706", "longitude": "-1.08365"}}, "title": "Locum Consultant in Emergency Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916219814", "validThrough": "2020-11-20T23:59:59+0000"}