{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683"}}, "datePosted": "2020-10-16T16:01:28+0100", "description": "&lt;p&gt;Applications are invited to apply for the above substantive consultant post in Paediatric Intensive Care with a special interest in clinical governance based at the Oxford Children’s Hospital, John Radcliffe Hospital, Headington, Oxford This is a new post created from amendments to the existing job plans of the current consultants.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Oxford University Hospitals NHS Foundation Trust is one of the largest NHS teaching trusts in the country and enjoys a national reputation for the quality of its services in healthcare. The Trust is comprised of four hospitals: The John Radcliffe Hospital including the Oxford Children’s Hospital, Churchill Hospital, and the Nuffield Orthopaedic Centre are all situated in Headington, Oxford. The Horton General Hospital is in Banbury.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The paediatric intensive care unit is a busy and thriving 18 bedded unit serving both the local population and 5 district-general hospitals in the Thames Valley Area. We support a variety of specialist services including paediatric neurosurgery, craniofacial surgery, ENT, cardiology, respiratory and haematolgoy/oncology in conjunction with the specialist teams. We are a major trauma centre and the hub for the Thames Valley major trauma network, responsible for the care of over 1000 adult and child major trauma cases per year. We have an active clinical research portfolio contributing to a variety of national and international clinical trials. We jointly run and staff a paediatric critical care transport and retrieval service in conjunction with University Hospitals Southampton (Southampton Oxford Retrieval Service).&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The successful applicant will join a team of 7 substantive Consultants. The post-holder’s commitments will include the day to day management of children on the paediatric critical care unit, staffing the retrieval service and mentoring and teaching junior and nursing staff. The successful applicant should also be able to demonstrate experience with and a commitment to clinical governance and patient safety issues and will be expected to develop this role within the department and within the critical care network. Appropriate administrative support will be provided to support this post.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Applicants should be on the Specialist Register for Paediatrics and paediatric intensive care or be a Specialist Registrar within three months of their expected date of receipt of a CCT at the time of interview.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;In the interest of equal opportunities, we want to make sure that information about candidates is provided in the same format so all applicants should fill in the standard application form on the NHS Jobs Website.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;James Weitz, Oxford PICU Clinical Lead, &lt;/strong&gt;&lt;strong&gt;james.weitz@ouh.nhs.uk&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Oxford University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120889"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "JR, Oxford", "postalCode": "OX3 9DU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7639", "longitude": "-1.21979"}}, "title": "Consultant in Paediatrc Intensive Care Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916231000", "validThrough": "2020-11-29T23:59:59+0000"}