{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "34950", "minValue": "34950", "unitText": "YEAR", "value": "£34,950"}}, "datePosted": "2020-10-08T20:54:06+0100", "description": "&lt;p&gt;&lt;strong&gt;The company:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;2gether Support Solutions is a new, wholly owned subsidiary of one of the largest NHS Foundation Trusts in the UK, East Kent Hospitals University NHS Foundation Trust (EKHUFT). The Trust established the company so that core facilities and support services can continue to be operated successfully with the added benefits that a private sector culture and approach can bring to enhancing and developing these services. The company remains 100% publicly owned, with the Trust as the only shareholder.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The role:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Your role will involve working as part of the team that maintains Radiology medical equipment across the Trust. You will liaise and work closely with other healthcare professionals, manufacturers’ representatives, engineers, and technical staff to provide; applications advice, device evaluation, acceptance testing, commissioning, troubleshooting, calibration, and maintenance of a diverse range of Radiology devices &amp; diagnostic ultrasound equipment.&lt;/p&gt;\n&lt;p&gt;Key responsibilities will include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Working to tight timelines to safely repair complex X-Ray, diagnostic ultrasound and medical equipment.&lt;/li&gt;\n&lt;li&gt;Carry out repairs to intricate medical equipment, utilising best engineering practice.&lt;/li&gt;\n&lt;li&gt;Provide extensive support for the most complex medical devices; primarily first line maintenance on mobile &amp; fixed X-Ray systems, and Diagnostic ultrasound and Mammography vans.&lt;/li&gt;\n&lt;li&gt;Use technical and clinical experience to identify potentially hazardous symptoms and faults when in clinical areas or in talking to clinical staff.&lt;/li&gt;\n&lt;li&gt;Organise, prioritise, and control work using own initiative (without managerial input during on-call hours- nights, weekends, bank holidays)&lt;/li&gt;\n&lt;li&gt;Support the Radiology maintenance lead and EME site leads on sites other than main base as required and often with short notice&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The candidate:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;BEng / BSc in Engineering or Physical Science, or an equivalent combination of qualifications and experience&lt;/li&gt;\n&lt;li&gt;Extensive knowledge of the clinical application, operation, and maintenance of a wide range of complex X-Ray, Diagnostic ultrasound, and specialist medical devices&lt;/li&gt;\n&lt;li&gt;Highly developed knowledge of engineering theory necessary to efficiently diagnose and rectify faults on complex X-Ray, Diagnostic Ultrasound and specialist medical devices.&lt;/li&gt;\n&lt;li&gt;Advanced electronic engineering skills&lt;/li&gt;\n&lt;li&gt;Good organisational, prioritisation and time management skills&lt;/li&gt;\n&lt;li&gt;Good customer relations and interpersonal skills&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Why work for us?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We offer a range of excellent benefits including:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;The opportunity to buy or sell up to 10 days annual leave each year&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Training and Development opportunities&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Career progression&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Discount in selected high street retailers&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Onsite childcare facilities (QEQM, WHH, KCH)&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Cycle to work Scheme&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;em&gt;2gether Support Solutions is an equal opportunities employer and welcome applications from all suitably qualified persons regardless of their race, sex, disability, religion / belief, sexual orientation or age.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;We reserve the right to close this advert early if we are able to appoint to the vacancy before the advertised closed date.&lt;/em&gt;&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "2gether Support Solutions", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=136294"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Canterbury", "postalCode": "CT1 3NG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2666", "longitude": "1.08711"}}, "title": "Radiology Maintenance Technician", "url": "https://www.jobs.nhs.uk/xi/vacancy/916219375", "validThrough": "2020-11-27T23:59:59+0000"}