{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44780", "minValue": "37638", "unitText": "YEAR", "value": "£37,638 - £44,780 per annum inclusive pro rata"}}, "datePosted": "2020-11-03T10:16:27+0000", "description": "&lt;p&gt;We are looking to recruit a self-motivated and enthusiastic Haemoglobinopathy Coordinating Centre (HCC) Service Manager to work as part of The Red Cell Network (TRCN). The HCC Service Manager will have an important, wide and varied remit and will primarily support the function of the network in accordance with Quality Standards. Additionally, the post holder will provide comprehensive data management, support the aims and ethos of TRCN and be an integral part of the multidisciplinary team across the Network.&lt;/p&gt;\n&lt;p&gt;The post holder will be expected to provide high-level administrative support in organising up to 10 educational and Peer Support network meetings per year. S/he will be a focal point for network-wide data collection and input, producing reports as and when is needed. S/he will also be responsible for coordinating the established Regional Haemoglobinopathy Multi-disciplinary clinical meetings and will be responsible for maintaining The Red Cell Network website, designing and editing the tri-annual patient newsletter and organising patient-focused events.&lt;/p&gt;\n&lt;p&gt;The role demands excellent communication and administration skills, a strong capacity for managing a workload independently and with minimal supervision, a pro-active and creative approach, and an ability to be flexible and learn new skills quickly. A high level of computer literacy is essential.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;For further information, or for an informal discussion about the role, please contact Joanne Arenas, Business and Quality Manager by email – joanne.arenas@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University College London Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120731"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "UCLH, London", "postalCode": "NW1 2PG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5257", "longitude": "-.13737"}}, "title": "Service Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253392", "validThrough": "2020-11-13T23:59:59+0000"}