{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "28274", "minValue": "22811", "unitText": "YEAR", "value": "£13.57 - £16.82 Per Hour"}}, "datePosted": "2020-10-23T13:35:02+0100", "description": "&lt;p&gt;Meadow Park Treatment and Recovery Centre in Ellesmere Port is a mixed gender 20 bedded Mental Health community Treatment and Recovery Centre specialising in the rehabilitation of people with severe and enduring mental health issues. Through co production utilising person centred working Meadow Park offers a Multi-disciplinary approach based on a psycho social model to enable people to work through their recovery and leave the inpatient environment with the ability to be as independent as possible.&lt;/p&gt;\n&lt;p&gt;Meadow Park is the community provision of the local rehabilitation pathway with admissions from local acute, high dependency rehabilitation and low secure environments. The pathway then offers step down to community support and outreach with effective transition planning as part of a person’s journey.&lt;/p&gt;\n&lt;p&gt;Nurses at Meadow Park must be prepared to demonstrate their ability to continually develop both personally &amp; professionally and be motivated to work towards further improving the standards of clinical care within the service. Candidates should be passionate about delivering person centred care, want to work collaboratively with the people they support and use every opportunity to inspire hope within their relationships. AFG also offer career progression within the organisation which is strongly encourage to all nurses at Meadow Park.&lt;/p&gt;\n&lt;p&gt;If you are looking at a Preceptorship, please let us know first so that we can advise you further.&lt;/p&gt;\n&lt;p&gt;(Although you will work most of your shifts at the above named service, you may be required to work at alternative services across Cheshire therefore all contracts state Cheshire as location).&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Alternative Futures Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130416"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Ellesmere Port", "postalCode": "CH66 1LL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.2889", "longitude": "-2.9235"}}, "title": "RMN - 25 Hours - Ellesmere Port", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240738", "validThrough": "2020-11-06T23:59:59+0000"}