{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum pro rata"}}, "datePosted": "2020-11-02T16:00:47+0000", "description": "&lt;p&gt;&lt;strong&gt;LOOKING FOR YOUR FIRST BAND 6 PHYSIOTHERAPY POST OR CONSIDERING COMBINING YOUR SKILLS OBTAINED ELSEWHERE?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;An exciting opportunity has arisen for an enthusiastic and driven Band 6 Physiotherapist to join the Therapy Team at East Cheshire NHS Trust on the therapy bank or a fixed term contract to support with winter pressures if that would suit you better.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the service:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The East Cheshire Physiotherapy Service delivers care in a variety of settings, including acute hospitals, rehabilitation centres, community clinics and GP practices.&lt;/p&gt;\n&lt;p&gt;An opportunity has arisen to join our innovative and friendly team of Physiotherapists on a bank or fixed term contract within the MDT on the acute medicine team. This post is an excellent opportunity to progress your career and is suitable for Band 6 physiotherapists looking to further their specialist skills and knowledge.&lt;/p&gt;\n&lt;p&gt;We are a forward thinking and evolving Physiotherapy service, offering a range of staff experiences from Physiotherapy Assistants through to Advanced Clinical Specialists. Each discipline is supported by a professional lead, with strong links with GP’s, Consultants and local Universities.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What we are looking for:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;We are looking for an enthusiastic and well-rounded HCPC registered Physiotherapist with experience of working in the NHS.&lt;/li&gt;\n&lt;li&gt;The candidate should be self-motivated with excellent communication skills and the ability to work both autonomously and within the physiotherapy team and wider MDT. Organisation and time management is key to efficiently managing personal caseloads.&lt;/li&gt;\n&lt;li&gt;The candidate should provide a patient centred approach to care an under pinning sound clinical knowledge in evidence based assessment and management of a variety of conditions.&lt;/li&gt;\n&lt;li&gt;It will be essential for the post holder to work autonomously within trust policies and professional practice, in addition to maintaining accurate and comprehensive patient records.&lt;/li&gt;\n&lt;li&gt;You should be driven and innovative, willing to support the advanced clinical specialist in service and staff development.&lt;/li&gt;\n&lt;li&gt;Weekend working is available once competencies have been completed.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;A full UK driving licence and access to a vehicle, or be able to demonstrate means of meeting the travel requirements of the post.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What we offer in return:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;On commencing the role you will have a full induction. You will receive regular supervision from the advanced clinical specialists.&lt;/li&gt;\n&lt;li&gt;All Physiotherapists benefit from regular CPD with access to advice and support from our advanced clinical specialist physiotherapists, receiving monthly Peer review sessions, and participating in monthly In-service training.&lt;/li&gt;\n&lt;li&gt;Service development and innovation is strongly encouraged alongside participation in audit and research. The service has strong links with the Arthritis Research UK Primary Care Centre at Keele University and regularly participates in research trials&lt;/li&gt;\n&lt;li&gt;Internal promotion and succession planning is integral to staffing within East Cheshire Trust and staff will be encouraged to apply for higher banded permanent opportunities as they arise, if deemed competent.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;If you are a motivated Physiotherapist who likes to work within a supportive Physiotherapy framework, developing independent working and wishes to gain experience in the wider health community we would like to hear from you.&lt;/p&gt;\n&lt;p&gt;This post is Permanent BANK&lt;/p&gt;\n&lt;p&gt;Hours per week: BANK&lt;/p&gt;\n&lt;p&gt;Closing Date: 16th November 2020&lt;/p&gt;\n&lt;p&gt;Please be aware that this post requires an Enhanced with Barred list Disclosure and Barring Service (DBS) check, the cost of which is payable by the successful candidate.&lt;/p&gt;\n&lt;p&gt;If you have lived or worked abroad for 6 months or more in the last 5 years you will need to obtain an overseas police clearance. Further information can be found on the additional information links at the bottom of the advert.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;To keep up to date with all of our latest Recruitment activity here at East Cheshire NHS Trust, take a look at our Careers website with lots of information on how to join our team and Facebook and Twitter pages, links to which can be found on the right hand side:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Visit our Facebook page: Careers at East Cheshire NHS Trust&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Follow us on Twitter: @CareersECT&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Ros Hope Job title Therapy Team Manager Email address roshope@nhs.net Telephone number 01625 661488&lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;Rachel Pepler&lt;/p&gt;\n&lt;p&gt;Acute Therapy Team Manager&lt;/p&gt;\n&lt;p&gt;01625 661488&lt;/p&gt;\n&lt;p&gt;r.pepler@nhs.net&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121085.jpg", "name": "East Cheshire NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121085"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Macclesfield District General Hospital, Macclesfield", "postalCode": "SK10 3BL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.2623", "longitude": "-2.14158"}}, "title": "Bank Clinical Specialist Physiotherapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252728", "validThrough": "2020-11-16T23:59:59+0000"}