{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 pa"}}, "datePosted": "2020-11-03T17:30:43+0000", "description": "&lt;p&gt;We are looking to recruit a number of Consultant Anaesthetists able to work in a busy acute trauma teaching unit. You will join an enthusiastic and supportive team of anaesthetists and intensivists in the provision of an anaesthetic service to the Trust.&lt;/p&gt;\n&lt;p&gt;Salford Care Organisation (Northern Care Alliance) is one of 2 acute Trusts (known as a Major Trauma Centre Collaborative), who collectively provide the functions of a Major Trauma Centre (MTC) for Greater Manchester.&lt;/p&gt;\n&lt;p&gt;The MTC at Salford leads on brain injuries, but will also lead on Poly-Trauma management from across Greater Manchester. Salford Care Organisation is a major teaching hospital affiliated to Manchester University - lying approximately 5 miles from central Manchester - and is supported by excellent motorway, rail, tram and airport connections. There is a dedicated 24-hour emergency theatre service. We have recently received funding to start work on the Acute Receiving centre, which will focus on improving trauma outcomes in the GM region and on continued surgical excellence.&lt;/p&gt;\n&lt;p&gt;We provide a variety of surgical specialities in Salford, including the upper GI service to Greater Manchester and a nationally referred Intestinal Failure Unit. We have a well-established CPET service and ERAS pathways for our Major elective surgery. Our data is collected as part of PQUIP and the results discussed at regular Divisional meetings. We have an expanding group within the department, with an interest in Perioperative Medicine and improving patient outcomes.&lt;/p&gt;\n&lt;p&gt;We also house the Manchester centre for Clinical Neurosciences. We provide cover for a variety of neurosurgical specialities and we are continuing to expand. Our spinal unit has a nationally referred cohort of patients and performs complex spinal corrective surgery. The department is driven by a collaborative decision-making process between anaesthesia and surgery to optimise outcomes for patients. We are also the first Trust in the North West to provide a 7-day Thrombectomy service. This is expected to expand to a 24-hour service shortly.&lt;/p&gt;\n&lt;p&gt;Outside of Salford, we also support the NCA Orthopaedic centre (based in Fairfield General hospital) and a specialist upper limb unit which is located in Oaklands hospital. It is expected that any appointment will have some work in these areas.&lt;/p&gt;\n&lt;p&gt;In line with the Trust’s Single Equality Scheme we welcome applications from everyone irrespective of ethnic origin, disability, age, gender, sexual preference, disability, nationality, religion, marital status, social back ground or trade union membership. However, as members of ethnicity minority groups, individuals with disabilities and women are currently under-represented at this level of post, we would encourage applications from members of these groups. Appointment will be based on merit.&lt;/p&gt;\n&lt;p&gt;For further information, please contact:&lt;/p&gt;\n&lt;p&gt;Dr Kris Sivarajan&lt;/p&gt;\n&lt;p&gt;Anaesthetic Clinical Director &lt;br /&gt;on 0161 206 5870 &lt;br /&gt;or kris.sivarajan@srft.nhs.uk&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameKris SiverajanJob titleAnaesthetic Clinical DirectorEmail addresskris.sivarajan@srft.nhs.ukTelephone number0161 206 5870&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121715.jpg", "name": "Salford Royal NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121715"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Salford Care Organisation, Salford", "postalCode": "M6 8HD"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4876", "longitude": "-2.32342"}}, "title": "Consultant Anaesthetist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254933", "validThrough": "2020-11-17T23:59:59+0000"}