{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "106718", "minValue": "92795", "unitText": "YEAR", "value": "£92,795 to £106,718 pa inc. HCAS"}}, "datePosted": "2020-10-29T10:00:11+0000", "description": "&lt;h1&gt;&lt;strong&gt;Deputy Chief Nurse - Band 9&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;Our Deputy Chief Nurse has taken up her new post as the Trust’s Chief Nurse. This provides an excellent opportunity to appoint a dynamic and high-achieving successor to the Deputy Chief Nurse post who will drive forward the implementation of our Nursing and Midwifery Strategy, to lead the delivery of excellent standards of patient care and safety and be a role model to our nurses and midwives.&lt;/p&gt;\n&lt;p&gt;Working closely with the Chief Nurse you will provide strategic and value based professional leadership for our circa 1500-strong talented nursing and midwifery workforce and will ensure that our nursing and midwifery practice is of the highest possible standard.&lt;/p&gt;\n&lt;p&gt;This is an exciting and challenging time to join the Nursing and Midwifery Team at Ashford and St Peter’s with Covid-19 and the demand for our services which is progressively increasing while the funding position is ever more stretched. However, Covid-19 has also provided a platform for change and innovation and we believe Ashford &amp; St Peter’s is in a good position to meet these challenges both in terms of financial and clinical stability. Our new Deputy Chief Nurse will help shape these challenges whilst driving to maintain and develop the care we give to our patients&lt;/p&gt;\n&lt;p&gt;You should have extensive relevant experience in an acute NHS setting with substantial experience as a senior manager or deputy director in a large and complex organisation with both the professional and personal credibility to support the Trust in an increasingly challenging healthcare environment. You will have a commercial awareness and understanding of the healthcare setting and entrepreneurial opportunities for Nursing &amp; Midwifery. You will possess a track record of leading and managing high performing teams, transforming services and creating environments in which staff can deliver high quality, safe care.&lt;/p&gt;\n&lt;p&gt;In return you will be working with great staff, be part of an enthusiastic Senior Nursing and Midwifery team and you will be supported to develop personally to deliver your role and further your personal and career ambitions.&lt;/p&gt;\n&lt;p&gt;If you are enthusiastic and passionate about the challenges this opportunity offers, and believe that you have the skills, experience and ambition to play a key role in delivering our vision, values and strategic objectives, then we would welcome an application from you.&lt;/p&gt;\n&lt;p&gt;Due to Covid-19 and maintaining social distancing guidelines, we anticipate conducting the recruitment and selection process virtually.&lt;/p&gt;\n&lt;p&gt;If you have any further queries, please contact Elaine Beaumont, Workforce Resourcing Manager on 01784 884068/ 01932 726528.&lt;/p&gt;\n&lt;p&gt;Finally, please note that all shortlisted candidates will have an opportunity to meet with the Chief Nurse, Andrea Lewis personally in advance of the interviews through a virtual meeting.&lt;/p&gt;\n&lt;p&gt;Closing Date 15th November 2020&lt;/p&gt;\n&lt;p&gt;Interview Date: 9th December 2020&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120626.png", "name": "Ashford and St. Peter's Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120626"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Chertsey, Surrey", "postalCode": "KT16 0PZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3771", "longitude": "-.526821"}}, "title": "Deputy Chief Nurse - Band 9", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247792", "validThrough": "2020-11-15T23:59:59+0000"}