{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 £31,365 - £37,890 per annum"}}, "datePosted": "2020-10-26T17:00:55+0000", "description": "&lt;p&gt;Band 6, Deputy Sister / Charge Nurse in Adult Critical Care, Adult Intensive Care, Oxford&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;“&lt;/strong&gt;&lt;strong&gt;If your actions inspire others to dream more, learn more, do more and become more, you are a leader.”&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;So, I guess the question is, is this you? Or, is this who you would wish to be? If so, then we would really love to meet you. The team in Adult Intensive Care are committed to growing nursing leadership because we know that great leadership changes lives.&lt;/p&gt;\n&lt;p&gt;If you think you might like to help us lead in delivering compassionate excellence to our patients then read on.&lt;/p&gt;\n&lt;p&gt;● An exceptional opportunity to work in a nationally renowned centre for specialties such as Trauma, Vascular surgery; Cancer &amp; Haematology; Maxillofacial surgery and to top it off, one of the largest transplant centres in Europe!&lt;/p&gt;\n&lt;p&gt;● A fully supported and protected induction period giving you a great opportunity to find your feet in the team.&lt;/p&gt;\n&lt;p&gt;● We will tailor a development package to suit your specific learning needs. This will include study days and clinical support from our dynamic education team. We also offer you an extensive orientation package and fully supported supernumerary period in which you work with a mentor.&lt;/p&gt;\n&lt;p&gt;● A comprehensive supported leadership programme comprising of study days and clinical support to help you develop in your role.&lt;/p&gt;\n&lt;p&gt;● Opportunities to be prepared for a band 7 role.&lt;/p&gt;\n&lt;p&gt;● A range of development and learning opportunities, such as, simulation and specialist courses to equip you with the knowledge and skills required to care for the complex patient population within the Oxford ICUs.&lt;/p&gt;\n&lt;p&gt;● Generous NHS holiday entitlement which increases with your length of service.&lt;/p&gt;\n&lt;p&gt;● Generous and comprehensive NHS pension scheme.&lt;/p&gt;\n&lt;p&gt;● Given certain development conditions are met then an additional pay enhancement of 10% is applied to your basic salary. Just one of the ways we can reward your contribution to the team!&lt;/p&gt;\n&lt;p&gt;If you have been convinced that the team here in Oxford can help you develop your nursing practice and leadership potential, then we would love to hear from you.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing date: 15th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please note : All Candidates must have a UK recognised Intensive Care course , at level 6 or 7 to be considered for this post,&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Melissa Lovell, Senior Sister - Melissa.lovell@ouh.nhs.uk, 01865 740432&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Oxford University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120889"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "John Radcliffe and Churchill Hospitals, Oxford", "postalCode": "OX3 9DU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7639", "longitude": "-1.21979"}}, "title": "Deputy sister/ Charge Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243514", "validThrough": "2020-11-15T23:59:59+0000"}