{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "36738", "minValue": "29888", "unitText": "YEAR", "value": "£29,888 - £36,738 £29,056 - 36,134 per annum inc"}}, "datePosted": "2020-10-28T13:01:23+0000", "description": "&lt;p&gt;&lt;strong&gt;Band 5 Staff Nurse posts on 5A Ward&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Newly qualified or about to qualify? , then read on as 5A ward will give you the perfect opportunity to consolidate your training in a supportive friendly environment where our students who become staff nurses with us thrive and develop their competencies to be the best in the business ( but we are biased and that’s our opinion!!)&lt;/p&gt;\n&lt;p&gt;Positions are currently available on 5A, the solid tumour cancer ward within the Bart’s cancer Centre based at St Bartholomew’s Hospital, which has an excellent reputation for providing excellent care and for staff development and support.&lt;/p&gt;\n&lt;p&gt;5A is a busy 22 bedded ward caring for cancer patients at all stages of their cancer journey. The ward has 10 single side rooms and 3 x 4 bedded bays. We provide chemotherapy, radiotherapy and immunotherapy care to our patients delivering treatments and managing / caring for the side effects. We are also providing more end of life care to our patients with many choosing the ward to be their preferred place of death having built a rapport with staff over the years that many have received treatment with us.&lt;/p&gt;\n&lt;p&gt;We care for a diverse population of patients with no two days being the same. We are a strong supportive team which is essential and integral in the provision of care and support to our patients and staff.&lt;/p&gt;\n&lt;p&gt;As a band 5 we expect you to be enthusiastic motivated and wanting to develop learn and grow. Leading care from the bedside, providing excellent care and role modelling to students at all times. You would be enrolled on the Bart’s health preceptorship programme for 9 to 18 months, encouraged to attend all acute care skills training and also attend cancer services development days and other site based training relevant to patient care and your personal and professional development.&lt;/p&gt;\n&lt;p&gt;Opportunities grow with experience with opportunities to undertake chemotherapy training and assessor training for student nurses as the ward is a learning environment for students on placement from City and London Southbank Universities.&lt;/p&gt;\n&lt;p&gt;The ward can be a challenging environment to work in but is very rewarding and you will get immense job satisfaction in the care that you are able to provide and also in the development of staff whether student, health care assistant or staff nurses as they grow and flourish with the experiences you share.&lt;/p&gt;\n&lt;p&gt;We offer opportunities to develop professionally and academically through the many links we have with our universities that we are affiliated with and cancer specific modules which we have strong links with the Royal Marsden School, based in Fulham, one of the UK’s leading specialist cancer schools.&lt;/p&gt;\n&lt;p&gt;We are also proud that many staff here start their career with us after doing placements with us with again adds to the reward of the role.&lt;/p&gt;\n&lt;p&gt;If this sounds like a role for you please feel free to apply. Informal visits / discussions welcome for anyone interested in the post.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDaniel LawrenceJob titleWard ManagerEmail addressdaniel.lawrence10@nhs.netTelephone number020 346 56567 55553&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120603.jpg", "name": "Barts Health NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120603"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St Bartholomew&#39;s Hospital, London", "postalCode": "EC1A 7BE"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.517", "longitude": "-.100858"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246699", "validThrough": "2020-11-11T23:59:59+0000"}