{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "38000", "minValue": "38000", "unitText": "YEAR", "value": "Up to £38,000 + £3,633 ILW"}}, "datePosted": "2020-11-03T09:06:08+0000", "description": "&lt;p&gt;&lt;strong&gt;Job Introduction&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;At Turning Point, we are recognised leaders in helping people recover from addiction and gain control of their lives. By providing the right support at the right time, and making sure that people can find all the help they need, we have grown into one of the largest providers of substance misuse services in England and Wales. Right now, we are now looking for a talented Deputy Operations Manager to work within our community-based substance misuse services in the City of London and Hackney.&lt;/p&gt;\n&lt;p&gt;The service is delivered in partnership with Mind CHWF and London Friend and there is a focus on partnership working throughout the service to support those in the local community who need assistance to achieve their goals. We deliver treatment and support across the neighbourhoods ensuring a holistic and inclusive approach to recovery in this service.&lt;/p&gt;\n&lt;p&gt;Passionate about people, you’ll enjoy the opportunity and support to enhance your own life and career too, as you gain the experience and training you need to progress in your career within a social enterprise. So if you’re ambitious and ready for a fresh challenge with a sector leader then this could be the opportunity for you.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Role Responsibility&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Your focus will be on ensuring the delivery of a consistently high quality service through ensuring the safe and effective running of the services throughout the county to service users, staff and visitors.  You will ensure CQC standards are met and manage improvements by identifying, planning and managing effective change. &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Support the Senior Operations Manager to provide leadership to the multi-disciplinary team in line with Turning Point’s vision and core values.&lt;/li&gt;\n&lt;li&gt;Work closely with the commissioners, key stakeholders and local healthcare professionals to oversee the provision of the service.  &lt;/li&gt;\n&lt;li&gt;Manage Team Managers and undertake HR related duties including supervisions, appraisals, recruitment and selection and support and empower Team Managers to manage HR related queries. &lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;By working closely with healthcare professionals such as GPs and social services, your dedication will make a better future.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Ideal Candidate&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Proven track record of managing clinical and psychosocial services for people with substance misuse issues&lt;/li&gt;\n&lt;li&gt;Previous experience of managing managers&lt;/li&gt;\n&lt;li&gt;Previous experience of managing all aspects of a service contract&lt;/li&gt;\n&lt;li&gt;Experience of managing multiple priorities&lt;/li&gt;\n&lt;li&gt;Excellent communication skills and partnership working&lt;/li&gt;\n&lt;li&gt;Experience of managing services across multiple locations&lt;/li&gt;\n&lt;li&gt;Knowledge and experience of CQC would be advantageous&lt;/li&gt;\n&lt;li&gt;The legal right to work in the UK&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;About us&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Why Turning Point?&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As a leading health and social care provider with more than 300 locations across England, we take real pride in the services we offer.&lt;/p&gt;\n&lt;p&gt;Across the varied regions, sectors and settings we operate within, our organisation is held together by a shared vision – and our people are connected by the same values. These include belief in potential, confidence in communication, embracing positive change and always treating each other as individuals.&lt;/p&gt;\n&lt;p&gt;We run all of our services on a not-for-profit basis; instead, we invest every penny back into our services and people. We never stop believing in change for the better, and we work constantly to improve the lives of the people we support.&lt;/p&gt;\n&lt;p&gt;Our people bring our vision to life. So, if you are enthusiastic, motivated and committed to support others to fulfilling their potential, here at Turning Point, we don&#39;t just offer you a job – we offer you a career.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What Benefits Will I Receive?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Of course, we know it&#39;s not about the money. But that doesn&#39;t mean we don&#39;t reward our people for their invaluable work with a benefits package that includes:&lt;/em&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Comprehensive opportunities to learn and develop, with silver accreditation from &lt;em&gt;Investors in People&lt;/em&gt;&lt;/li&gt;\n&lt;li&gt;33 days’ paid holiday a year, increasing with each year of service up to 35 days. Plus the option to purchase additional holidays&lt;/li&gt;\n&lt;li&gt;Flexible benefit options including cycle to work schemes and season ticket loans&lt;/li&gt;\n&lt;li&gt;Competitive pension and life assurance schemes&lt;/li&gt;\n&lt;li&gt;Employee assistance programme and access to online health and wellbeing support&lt;/li&gt;\n&lt;li&gt;Flexible working patterns to support work-life balance&lt;/li&gt;\n&lt;li&gt;Access to a wide range of discounts, including cinema tickets, grocery and high-street shopping and gym memberships&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We reserve the right to close this advert early if we are able to appoint to the vacancy before the advertised closed date.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Turning Point", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=131034"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hackney", "postalCode": "E8 3SG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.539", "longitude": "-.056289"}}, "title": "Deputy Operations Manager - City &amp; Hackney", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253214", "validThrough": "2020-11-17T23:59:59+0000"}