{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "91881", "minValue": "91881", "unitText": "YEAR", "value": "£91,881 per annum"}}, "datePosted": "2020-10-20T13:01:40+0100", "description": "&lt;p&gt;This NHS Locum Consultant post is a replacement post and you will join colleagues in a very dynamic and forward looking Multi Disciplinary Child and Adolescent Mental Health Service. The post will be a 10 session post with the possibility of developing special interest sessions. There are range of opportunities on offer including early intervention psychosis, CAMHS learning disability team, ASD/neurodevelopmental team, perinatal psychiatry / infant mental health, specialist eating disorder service and crisis/liaison.&lt;/p&gt;\n&lt;p&gt;This post comes during a period of Health Board-wide service reviews, including a comprehensive reconfiguration of Mental Health, Learning Disabilities and S-CAMHS services within the Health Board. The aim is to provide a spectrum of flexible and responsive services for the population across the Health Board.&lt;/p&gt;\n&lt;p&gt;The S-CAMHS is part of the Mental Health &amp; Learning Disabilities Directorate and there has been a significant investment in enhancing existing provision and developing new services across the HDUHB over the last 18 months.&lt;/p&gt;\n&lt;p&gt;West Wales is an area of outstanding beauty that offers a variety of outdoor pursuits and beautiful coastline. It is an excellent place to raise a family. Reasonable property prices and excellent state schools contribute to low living costs and a high quality of life. There are also good road and rail connections to Cardiff and London.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Dr Warren Lloyd: Clinical Director and Associate Medical Director MH&amp;LD&lt;/p&gt;\n&lt;p&gt;Email: Warren.Lloyd@wales.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone: 01267 244341&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123194.gif", "name": "Hywel Dda University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123194"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Preseli Centre, Withybush General Hospital, Haverfordwest", "postalCode": "SA61 2PS"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.8156", "longitude": "-4.9592"}}, "title": "Locum Consultant in S-CAMHS", "url": "https://www.jobs.nhs.uk/xi/vacancy/916234505", "validThrough": "2020-11-23T23:59:59+0000"}