{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51393", "minValue": "45780", "unitText": "YEAR", "value": "£45,780 - £51,393"}}, "datePosted": "2020-11-04T16:46:00+0000", "description": "&lt;p&gt;Come and join our radiology department for a great working experience and the opportunity to develop your career in the unique environment of St George’s University Hospital NHS Foundation Trust, home of ’24 hours in A&amp;E’.&lt;/p&gt;\n&lt;p&gt;We are seeking to recruit a highly motivated and enthusiastic Band 7 sonographer to join our friendly and well-supported ultrasound team. The post holder must be flexible, adaptable to change, prepared to embrace workforce developments and contribute to efficient service delivery through the highest standards of safe, kind and compassionate care.&lt;/p&gt;\n&lt;p&gt;The service requires all sonographers to perform a wide range of ultrasound examinations including general, small parts, gynaecology and basic vascular examinations. Specialist ultrasound services are also provided by the Trust include musculoskeletal, interventional and paediatric examinations. Experience in these specialist scans would be advantageous, but not required, as we actively support extended training in the department and are in the process of setting up the South-West London training academy.&lt;/p&gt;\n&lt;p&gt;This is a cross-site position, working across 4 sites with a total of 16 ultrasound rooms which enables staff to benefit from the valuable experience and scope of practice that each department has to offer in addition to helping us meet the demand on our service. All of our ultrasound rooms are equipped with the latest ultrasound machines and software.&lt;/p&gt;\n&lt;p&gt;A requirement of the position is a qualification in medical ultrasound along with recent NHS experience. At least one year of post graduate ultrasound experience is desirable, however, new graduates are encouraged to apply. We offer flexible working patterns including weekend working and part time hours will also be considered subject to the needs of the service. Our staff also benefit from the inner London high cost area supplement of 20%.&lt;/p&gt;\n&lt;p&gt;If you would like more information or to arrange an informal visit then please contact Steve Jarvis ultrasound Superintendent Radiographer on 0208 725 1782 or stephen.jarvis@stgeorges.nhs.uk&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;*Previous applicants need not apply*&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "St George's University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121185"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St George&#39;s University Hospital NHS Foundation Trust, London", "postalCode": "SW17 0QT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4267", "longitude": "-.175721"}}, "title": "Band 7 Sonographer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256706", "validThrough": "2020-11-18T23:59:59+0000"}