{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "107668", "minValue": "79860", "unitText": "YEAR", "value": "£79,860 to £107,668 per annum"}}, "datePosted": "2020-11-02T14:01:49+0000", "description": "&lt;p&gt;&lt;strong&gt;Southend University Hospital are seeking dynamic and forward thinking Consultants in Elderly Care to be part of shaping our future.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are offering an excellent opportunity to be part of expanding our services, in particular, our Acute Frailty services, both into the acute hospital and out into the community setting.&lt;/p&gt;\n&lt;p&gt;Currently the department has specialist services for older people including Memory specialist clinics, Falls clinics and Tilt Tables. We have an established ambulatory frailty assessment unit within the hospital grounds, giving patients same day access to comprehensive geriatric assessment including diagnostics, well supported by 3 frailty nurses, Rehabilitation and Social teams. We work closely with our falls specialist nurses and our Dementia specialist nursing teams.&lt;/p&gt;\n&lt;p&gt;Our experienced nursing teams are providing some surgical liaison and movement disorder services but ultimately we are seeking to deliver a Consultant led and delivered service. Southend is a tertiary cancer site with the opportunity to provide oncogeriatric services in the future. We are seeking to expand upon our frailty service delivery with valued support from our senior managerial teams.&lt;/p&gt;\n&lt;p&gt;We have two acute elderly care wards, well supported by junior medical staff including 3 specialist registrar trainees, 2 core medical trainees , 3 GP trainees, 11 foundation doctors and 4 clinical fellows dedicated to improving our services.&lt;/p&gt;\n&lt;p&gt;We are committed to education and research opportunities for our Consultant staff and Junior medical staff alike, boasting recent successful submissions to British Geriatric conference and Oncogeriatric conference. Additionally the Medicine Directorate are able to offer a personalised supportive induction programme for all newly appointed Consultants which is flexible to candidate’s needs. This includes a welcome tour, time to complete statutory/mandatory training, time to integrate into the team at a pace to suit the candidate and a tailored programme in line with any additional requests from the candidate. We include regular reviews and opportunities to flex the induction programme as required.&lt;/p&gt;\n&lt;p&gt;The Medicine Directorate are proud to accommodate candidates who are actively working towards CESR or Article 14 and we would welcome applications for review.&lt;/p&gt;\n&lt;p&gt;We offer a relocation package in line with Trust policy and would consider a recruitment and retention bonus for successful candidates.&lt;/p&gt;\n&lt;p&gt;Southend is a vibrant seaside town offering a relaxed lifestyle with excellent links to London, local airport and access to beautiful countryside and excellent schools.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Dr Leila Bafadhel / Dr Anthony O’Brien &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Consultant Geriatricians &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;01702 508 662 (Ext 8662)&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121033.jpg", "name": "Mid and South Essex NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121033"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southend University Hospital NHS Foundation Trust, Westcliff-On-Sea", "postalCode": "SS0 0RY"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5538", "longitude": ".689123"}}, "title": "Consultant Geriatrician", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252328", "validThrough": "2020-11-30T23:59:59+0000"}