{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 pa"}}, "datePosted": "2020-11-03T11:17:59+0000", "description": "&lt;p&gt;Staff Nurse &lt;strong&gt;Band 5 - £24,907- £30,615 pa plus RRP to be paid every 6 months &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Swallownest Court is located on the outskirts of Rotherham Town Centre and comprises of four wards on site. Osprey 18 beds acute, Sandpiper 18 beds acute, Kingfisher 5 beds PICU and Goldcrest 19 beds rehabilitation and recovery. Our modern purpose built building is part of the All Age Mental Health Inpatient Pathway for the Rotherham Care Group.&lt;/p&gt;\n&lt;p&gt;Patient care is governed by our multi-disciplinary collaborative approach where extensive assessment and individualised treatment plans form part of our pathways whilst stabilising acute symptoms. We are committed to the ethos of the recovery model promoting hope, optimism and innovative ways of working in partnership with patients.&lt;/p&gt;\n&lt;p&gt;If you are committed to enabling the recovery of people experiences acute mental health issues we would like to hear from you to ensure we provide continued high quality care whilst supporting the existing team in a dynamic clinical environment.&lt;/p&gt;\n&lt;p&gt;We value highly motivated, enthusiastic and resilient staff to work alongside out team whilst taking responsibility for coordinating and managing shifts on a daily basis. If you are forward thinking with a clear understanding of risk assessments and a good working knowledge of the principals of acute psychiatry we would welcome your application. Support will be offered through regular clinical and managerial supervision, in-house and external training; facilitated reflective practice sessions with our on-site Psychologists and an individual approach to your future developmental needs.&lt;/p&gt;\n&lt;p&gt;For further information please contact Andrea Frost Modern Matron, Adult Services Inpatient Division on 01709 447542.&lt;/p&gt;\n&lt;p&gt;We reserve the right to close down this advert early should there be a high number of applicants.&lt;/p&gt;\n&lt;p&gt;PLEASE NOTE WE WILL CONTACT YOU VIA EMAIL ABOUT YOUR APPLICATION THEREFORE PLEASE CHECK YOUR EMAIL ACCOUNT&lt;/p&gt;\n&lt;p&gt;It is important that you check your NHS jobs account regularly. To access emails from us, log into your account and view &#39;My Applications&#39; however some emails have been known to end up in &#39;JUNK MAIL/SPAM BOX&#39; so please ensure you check this folder as well as your INBOX so you don&#39;t miss any important communication regarding your application.&lt;/p&gt;\n&lt;p&gt;If you have not received confirmation of an interview date within 6-8 weeks of your application, please assume on this occasion that you have been unsuccessful.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Rotherham Doncaster and South Humber NHS Foundation Trust is committed to our responsibilities for safeguarding and promoting the welfare of children, young people and adults at risk as outlined in Working Together to Safeguard Children 2015 and Care Act 2014. &lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;We are committed to recruiting candidates who share the commitment to safeguarding, and therefore we apply robust recruitment and selection procedures to ensure that the people selected are right for the job, and that all candidates are appropriately screened prior to appointment and periodically during their employment&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;DBS disclosures are mandatory before commencement of employment within the Trust. Therefore, if you are in a position that is deemed a regulated adult and/or child care role, you will not be able to start your employment until we have received a satisfactory DBS clearance.&lt;/p&gt;\n&lt;p&gt;Safeguarding Policies for the Trust can be accessed via the document links.&lt;/p&gt;\n&lt;p&gt;The Trust is committed to equal opportunities in employment and welcomes applications from all sections of the community in order to maintain a workforce as diverse as the population it serves.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The first 6 months of employment with the Trust will be a probationary period which may be extended by the Trust for a further 6 months.&lt;span&gt;&lt;span&gt;&lt;span&gt;&lt;br /&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121483.jpg", "name": "Rotherham Doncaster and South Humber NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121483"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Rotherham", "postalCode": "S26 4TH"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3679", "longitude": "-1.32198"}}, "title": "Staff Nurse (Band 5) RRP £2,600", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253698", "validThrough": "2020-12-01T23:59:59+0000"}