{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30112", "minValue": "24214", "unitText": "YEAR", "value": "£24,214 - £30,112 per annum"}}, "datePosted": "2020-10-22T12:01:16+0100", "description": "&lt;p&gt;We are looking to recruit 2 capable and committed Mental Health Professionals to join our busy, but friendly team. This is an exciting opportunity for a clinician to work within the Crisis Service in the Scarborough, Whitby, Ryedale area.&lt;/p&gt;\n&lt;p&gt;You will be a member of a multi-disciplinary team and there is ample opportunity to develop and enhance your existing clinical skills. You will receive regular supervision and there are good training opportunities. The service operates a shift system over 7 days a week.&lt;/p&gt;\n&lt;p&gt;As a member of the team you will provide a service to those individuals who present with a mental health crisis who may require a period of crisis intervention as an alternative to admission, playing an important role in the planning, implementation and evaluation of care to clients in mental health crisis, supporting their recovery through providing expert psychological interventions&lt;/p&gt;\n&lt;p&gt;You will be suitably qualified and registered with some community experience and have a commitment to working within Crisis Resolution and Home Treatment services, including provision of Home Intensive Treatment. You will have some experience in community mental health care and be enthusiastic and confident in your communication with a range of professionals, service users and carers.&lt;/p&gt;\n&lt;p&gt;Due to the nature of the role it is essential that applicants are able to travel independently across the locality and have access to a suitable vehicle for business purposes.If necessary, adjustments can be considered in accordance with the Equality Act 2010.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Emma Cory (Team Manager) &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;01723 384647&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;07384235494&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;emma.cory@nhs.net&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122252.jpg", "name": "Tees, Esk and Wear Valleys NHS Foundation Trust ", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122252"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Cross Lane Hospital, Scarborough", "postalCode": "YO12 6DN"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.2967", "longitude": "-.424244"}}, "title": "Home Intensive Treatment Clinician", "url": "https://www.jobs.nhs.uk/xi/vacancy/916238303", "validThrough": "2020-11-16T23:59:59+0000"}