{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum"}}, "datePosted": "2020-11-05T17:16:25+0000", "description": "&lt;p&gt;&lt;strong&gt;CONSULTANT IN INTERVENTIONAL &amp; DIAGNOSTIC NEURORADIOLOGY&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Based within the Neuro Radiology Department – Royal Preston Hospital / Chorley District General Hospital&lt;/p&gt;\n&lt;p&gt;Opportunities exist to join our regional neurosciences centre for Lancashire and South Cumbria. There have been several major service developments recently. These include accreditation as a major trauma centre and designation as a tertiary vascular centre.&lt;/p&gt;\n&lt;p&gt;We are looking for someone to join our dynamic team at this exciting time of our service development and help provide a comprehensive Interventional and diagnostic neuroradiology service supporting our 6 existing neuro-radiologists, three of whom perform neuro-intervention.&lt;/p&gt;\n&lt;p&gt;The adult Neurology department is staffed by 10 Consultant neurologists. There are also 2 paediatric neurologists who have links with Central Manchester Children’s Hospital.&lt;/p&gt;\n&lt;p&gt;The Neurosurgery department is staffed by 12 Consultant neurosurgeons providing a comprehensive adult neurosurgical services. There are specialist neurology and neurosurgery trainees from North West Deanery rotating to Royal Preston Hospital regularly as part of their training.&lt;/p&gt;\n&lt;p&gt;We would like to invite you to be a part of our exciting personnel and equipment expansion, including state of the art CT, PET-CT, hybrid interventional theatre, and a brand new 3T MRI scanner suite.&lt;/p&gt;\n&lt;p&gt;We are one of the largest providers of healthcare in the area offering new ‘state of the art’ facilities and have a complement of over 900 beds for a local population of 390,000 and a regional population of 1.5 million.&lt;/p&gt;\n&lt;p&gt;The post will involve 10 programmed activities of imaging support (8 DPAs plus an indicative 1.5 SPAs) and will predominantly provide a comprehensive diagnostic neuroradiology service and will provide support for the 6 existing neuro-radiologists, three of whom perform neuro-intervention. The successful candidate will be expected to participate in a neuro-radiology on call rota with 1:8 frequency.&lt;/p&gt;\n&lt;p&gt;Any person who is unable to work full-time for personal reasons will be eligible to be considered for the post and if appointed the job plan will be discussed on a personal basis in discussion with colleagues.&lt;/p&gt;\n&lt;p&gt;The applicants should hold or be eligible for CCT within 6 months of interview.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Dr James Simpson Job title Clinical Director - Radiology Email address ruth.mills@lthtr.nhs.uk Contact via email only &lt;/p&gt;\n&lt;p&gt;Informal clinical enquiries and requests to visit are welcome and arrangements should be made to:&lt;/p&gt;\n&lt;p&gt;Dr James Simpson, Clinical Director of Diagnostic Imaging or Dr Kamna Mehta, Associate Clinical Director via:&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Ruth Mills, Personal Assistant – EMAIL ONLY - &lt;/em&gt; ruth.mills@lthtr.nhs.uk;&lt;/p&gt;\n&lt;p&gt;Opportunities will then be offered to meet colleagues and also the Speciality Business Manager, Mrs M Barrow, telephone (01772) 522419.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Lancashire Teaching Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121125"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "RPH, Preston", "postalCode": "PR2 9HT"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7909", "longitude": "-2.70449"}}, "title": "Consultant Interventional Neuro Radiologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258704", "validThrough": "2020-12-03T23:59:59+0000"}