{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum"}}, "datePosted": "2020-11-05T17:16:24+0000", "description": "&lt;p&gt;Northampton General Hospital NHS Trust&lt;/p&gt;\n&lt;p&gt;Applications are invited for the post of Consultant in Urological Surgery at Northampton General Hospital. The appointee will provide a general urological service but can develop a special interest to complement and add to the existing consultant body.&lt;/p&gt;\n&lt;p&gt;The successful candidate will replace an existing post in a team of 5 consultants at present. The appointee will join a young, dynamic department with a focus in delivering a high quality, modern urology service.&lt;/p&gt;\n&lt;p&gt;On calls are supported with a full urology middle-grade on call cover.&lt;/p&gt;\n&lt;p&gt;The Urology department provides an extensive range of surgical procedures including open and laparoscopic renal surgery, endoscopic stone surgery including PCNL, brachytherapy (one of the oldest established units in the country) and options for bladder outflow surgery including UroLift, bipolar TURP and HoLEP. We have a dedicated Urology centre where our diagnostic urology and one-stop clinics are performed. We are planning in the new-year to implement local anaesthetic transperineal prostate biopsies via our rapid prostate cancer pathway.&lt;/p&gt;\n&lt;p&gt;The department and the hospital are dedicated in delivering the educational programme of the University of Leicester medical school as well as receiving students from Oxford University. Opportunities are available to become more actively involved in the medical school. Furthermore, there are strong links to Health Education East Midlands and becoming active in the administration of the deanery.&lt;/p&gt;\n&lt;p&gt;Northampton town provides easy access to London, Oxford and the North of England. The county has several beautiful and picturesque villages as well as boasting a rich sporting heritage.&lt;/p&gt;\n&lt;p&gt;If you are thinking of joining us and have a partner or family, please contact us as we have a variety of employment opportunities within the trust. There are also several major businesses that have based their headquarters or major operation centres here.&lt;/p&gt;\n&lt;p&gt;Applicants are required to be on the GMC Specialist Register, or be within six months of their expected date of receipt of a CCT/EU equivalent certification at time of interview.&lt;/p&gt;\n&lt;p&gt;Potential applicants can obtain further in formation and/or arrange a visit by contacting Mr Tom Swallow, Clinical Lead and Urology Consultant, on 01604 545315 or thomas.swallow@ngh.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121063.jpg", "name": "Northampton General Hospital NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121063"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Northampton General Hospital, Northampton", "postalCode": "NN1 5BD"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.2371", "longitude": "-.886673"}}, "title": "Urology Consultant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258703", "validThrough": "2020-12-03T23:59:59+0000"}