{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62001", "minValue": "53168", "unitText": "YEAR", "value": "£53,168 - £62,001 pa"}}, "datePosted": "2020-10-30T10:01:52+0000", "description": "&lt;p&gt;This is an exciting opportunity to work at a senior level in the in-house Legal Team at University Hospitals of Derby and Burton NHS Foundation Trust (UHDB). The Deputy Head of Legal Services will assist (and deputise for) the Associate Director of Legal Services in all aspects of the Legal Services Department’s work.&lt;/p&gt;\n&lt;p&gt;You will be responsible for managing a large and busy caseload of clinical negligence claims and Coroner’s Inquests, to include conducting advocacy in the Coroner’s Court. You will advise senior Trust staff on the full range of general health law issues that arise in a busy acute hospital.&lt;/p&gt;\n&lt;p&gt;The role will encompass a case handler (defending the Trust against claims and inquests and protecting the reputation of both the Trust and individual clinicians), legal advisor (to the Board and clinicians on all matters legal), trainer and educator (raising awareness of the legal process and responsibilities to all staff) and contributing to the Legal Services’ Department Strategic role in identifying trends and learning from claims and inquests, to support the Quality Strategy and drive improvements in patient safety.&lt;/p&gt;\n&lt;p&gt;You will also be responsible for the line management of two Paralegals/Legal Executives.&lt;/p&gt;\n&lt;p&gt;You will be a qualified Solicitor or equivalent (Barrister, FILEX). You will also have significant experience of managing a substantial caseload of legal claims including clinical negligence and personal injury claims and inquests, with minimal supervision. Experience of working in the NHS or with NHS clients and NHSR would be an advantage. The role requires an individual who has the confidence and experience to communicate effectively with a wide range of health and legal professionals at senior level.&lt;/p&gt;\n&lt;p&gt;The role is based at the Royal Derby Hospital but you will be required to meet regularly with clinical and managerial staff across the Trust’s five sites in Derby, Burton, Tamworth and Lichfield.&lt;/p&gt;\n&lt;p&gt;In terms of location, Derby and Burton offer the best of both worlds – city life on the doorstep of a stunning rural environment. We border the National Forest and we are in easy reach of the Peak District, offering outstanding natural beauty. Centrally located, we have excellent transport links to the rest of the country including major cities.&lt;/p&gt;\n&lt;p&gt;This is a full time, 37.5 hours per week role.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;In return we will offer:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Development opportunities, including both professional and leadership development, together with an opportunity to work across some or all of our 5 sites depending on specialty&lt;/li&gt;\n&lt;li&gt;Support through every step of the way from recruitment to when you join our team and beyond&lt;/li&gt;\n&lt;li&gt;Friendly, supportive and caring colleagues&lt;/li&gt;\n&lt;li&gt;A variety of other staff benefits including employee assistance programme, discounted gym membership, onsite fitness classes, car schemes&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Key facts about our Trust: &lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Every day our hospitals see more than 4,000 outpatients&lt;/li&gt;\n&lt;li&gt;We see more Trauma &amp; Orthopaedic outpatients than any other Trust – over 3,300 per week&lt;/li&gt;\n&lt;li&gt;An average 860 patients are seen in A&amp;E every day – the 6th largest in the country&lt;/li&gt;\n&lt;li&gt;Our hospitals admit more than 220 emergency patients every day&lt;/li&gt;\n&lt;li&gt;We carry out more planned surgical operations than any other Trust in England with almost 50,000 operations taking place in our 52 operating theatres&lt;/li&gt;\n&lt;li&gt;We are one of only 5 Trusts nationally with more than 50 operating theatres&lt;/li&gt;\n&lt;li&gt;We carry out more than 300 elective procedures each working day&lt;/li&gt;\n&lt;li&gt;We employ 12,000 staff across our 5 hospital sites&lt;/li&gt;\n&lt;li&gt;We have a Director of Allied Health Professionals who is committed to provide leadership, progression and direction to AHPs&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Closing Date: 22 November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview Date: 4 December 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Due to COVID-19 and the Governments guidance on social distancing your interview may be carried out via Microsoft Teams. If this is the case you will be notified in advance so that if you don’t have the app you can download it either on to your phone or computer/laptop. The download is free of charge. Where your interview is face to face, the Trust will ensure social distancing. You will be required to wear a mask on all UHDB premises. If you have Covid-19 related symptoms or are shielding and have been invited for a face to face interview please request a Microsoft Teams interview.&lt;/p&gt;\n&lt;p&gt;Trac emails can sometimes go in to your junk mail so please check this for feedback on your application.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Kathryn Fearn - Associate Director of Legal Services&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Email: kathryn.fearn@nhs.net&lt;/p&gt;\n&lt;p&gt;Phone: 01332 785451&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120972.jpg", "name": "University Hospitals of Derby and Burton NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120972"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Derby Hospital, Derby", "postalCode": "DE22 3NE"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9104", "longitude": "-1.51382"}}, "title": "Deputy Head of Legal Services", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249605", "validThrough": "2020-11-22T23:59:59+0000"}