{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum"}}, "datePosted": "2020-11-03T13:15:58+0000", "description": "&lt;p&gt;&lt;strong&gt;Specialist Assessment and Treatment Services and Inpatient Forensic Services for people with Intellectual Disabilities:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Highly Specialist Clinical or Forensic Psychologist – 1 x 1.0 WTE, full time, permanent Band 8a post (or band 7 development post) &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;0.5 WTE (2.5 days) Specialist Assessment &amp; Treatment Service, 0.5 WTE (2.5 days) Inpatient Forensic Services.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for an experienced Clinical or Forensic Psychologist to join our established team of Applied Psychologists and Psychological Therapists working with people with Intellectual Disabilities at Brooklands Hospital in Marston Green, Birmingham.&lt;/p&gt;\n&lt;p&gt;Although this post is being advertised at an 8a banding, there is the possibility for this to be a development post. Newly qualified psychologists are therefore invited to apply and, if successful, would go through a period of development so that they could transition into an 8a post in approximately 18 months via a documented and agreed procedure.&lt;/p&gt;\n&lt;p&gt;The advertised post is split across the Specialist Assessment and Treatment Service (also known as Amber Unit) and Inpatient Forensic Services for adults with Intellectual (Learning) Disabilities. Both services are on the Brooklands site.&lt;/p&gt;\n&lt;p&gt;0.5 of this post is to input into Amber Unit, which is a 12 bed specialist assessment and treatment service that provides care and support to men and women with learning disabilities who may have additional psychiatric, behavioural, physical and developmental disorders, such as autistic spectrum disorder and attention hyperactivity disorder.&lt;/p&gt;\n&lt;p&gt;0.5 of this post is to provide clinical and forensic input into the Secure Service which consists of male low and medium secure units and a female low secure unit. The secure service ethos is to help and support people who present considerable risk to others (as well as to self) to return to a less restrictive environment and/or the community as soon as possible.&lt;/p&gt;\n&lt;p&gt;The psychology department at Brooklands is a well-established, supportive and friendly service. Psychologists are fully integrated within collaborative multi-disciplinary teams and their contribution is highly valued both within the teams and the wider service. All members of the psychology team receive excellent support and supervision and opportunities for continuing professional development. Relevant support and training will be provided to the post holder to support the development of their forensic assessment skills and/or therapeutic skills in a model applicable to the service user population.&lt;/p&gt;\n&lt;p&gt;The successful post holder will have opportunity to use the whole range of their psychological skills and experience in the form of assessments (including assessments of risk), individual and group therapies, team formulation, reflective practice as well as supporting other staff to undertake psychological interventions. Positive Behavioural Support (PBS) is a key component of our treatment approach and philosophy. The post holder will also supervise others (dependent on experience) and be involved in training others, such as ward staff and multidisciplinary colleagues. Training others and contributing to service development projects and undertaking audit and research is an important part of this role.&lt;/p&gt;\n&lt;p&gt;The successful applicant will receive support to further develop their skills and knowledge, through good quality supervision and training opportunities. The team work from a number of different therapeutic approaches including CBT, CFT, EMDR and Schema Therapy. We also have a full DBT programme operating successfully, and provide a number of well-established and structured offence group programmes as part of the service user’s comprehensive treatment pathway.&lt;/p&gt;\n&lt;p&gt;The service has strong links with local clinical and forensic training doctorate courses and regularly provides placements for trainee clinical and forensic psychologists, supervision for research, and teaching on the courses. There are also strong links with community learning disability teams across Coventry, Warwickshire and Solihull.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please note interviews are currently taking place through Microsoft Teams, this can be downloaded either through the App Store or Google Play for use on your phone/tablet. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Dr Joanne Lomas, Acting Lead Psychologist, Secure Services, Brooklands on 07903 847536.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Coventry and Warwickshire Partnership Trust (CWPT)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121204"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Brooklands Hospital, Birmingham", "postalCode": "B37 7HH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4694", "longitude": "-1.74281"}}, "title": "Highly Specialist Clinical or Forensic Psychologist - Band 8a", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254101", "validThrough": "2020-11-22T23:59:59+0000"}