{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pa"}}, "datePosted": "2020-11-03T12:46:07+0000", "description": "&lt;p&gt;&lt;strong&gt;Paediatric Band 5 Staff Nurse for Child Health Northbrook Ward Winchester &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Full/Part-time&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We currently have Band 5 vacancies available on the acute paediatric inpatient ward at Winchester (Northbrook ward). The ward is a general Paediatric ward and provides 24-hour care for up to 18 children and covers all specialties. We are looking for individuals who are flexible, innovative, keen to work within a team and eager to learn.&lt;/p&gt;\n&lt;p&gt;In child health, we provide services to children, young people and their families in a variety of settings. These include acute inpatients, Ambulatory services, Neonatal care, and Learning Disability and Special School provision. We deliver these across two hospitals and community sites in Basingstoke and Winchester&lt;/p&gt;\n&lt;p&gt;Family centred care along with quality and safety are important to us. We are looking for paediatric nurses who share those values and are prepared to commit themselves to our services. If this means you, then you will be joining like-minded staff who want to take forward the paediatric nursing vision with pride, passion and professionalism.&lt;/p&gt;\n&lt;p&gt;In return, you will have the opportunity to gain a range of clinical experience whilst providing care to children and young people in a variety of settings. Successful candidates will benefit from developmental opportunities and be supported by a great preceptorship programme.&lt;/p&gt;\n&lt;p&gt;If you are passionate about caring for children and their families then we would like to meet you.&lt;/p&gt;\n&lt;p&gt;Flexible working will be considered for all nursing applicants.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact: Judith Bennett on judith.bennett@hhft.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121094.JPG", "name": "Hampshire Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121094"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Royal Hampshire County Hospital, Winchester", "postalCode": "SO22 5DG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.0614", "longitude": "-1.33095"}}, "title": "Staff Nurse Child Health Northbrook Ward", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254015", "validThrough": "2020-11-17T23:59:59+0000"}