{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "23197", "minValue": "23197", "unitText": "YEAR", "value": "£13.80 ph inc WTR"}}, "datePosted": "2020-10-20T17:47:29+0100", "description": "&lt;p&gt;Bank Band 4 Rotational Pharmacy Technician&lt;/p&gt;\n&lt;p&gt;Would you like the opportunity to work in the excellent Pharmacy team in a busy modern NHS Hospital? Are you a registered Pharmacy Technician and able to think on your feet, and work in a dynamic and flexible way or are looking for a new challenge?&lt;/p&gt;\n&lt;p&gt;There are lots of good reasons to use this opportunity to come and work at Imperial College Healthcare NHS Trust as a Rotational Pharmacy Technician.&lt;br /&gt;&lt;br /&gt;Imperial College Healthcare NHS Trust aims to be a hospital of choice for patients and an employer of choice for staff. In order to improve all aspects of the patient experience, we rely upon having a highly skilled, motivated, diverse, productive and patient focused workforce.&lt;/p&gt;\n&lt;p&gt;Imperial College Healthcare NHS Trust is one of the largest acute trusts in the country and in partnership with Imperial College London is one of the UK&#39;s first academic health science centres (AHSCs). The creation of the AHSC is a major advance for patient care, clinical teaching and scientific invention and innovation.&lt;/p&gt;\n&lt;p&gt;The Trust consists of Charing Cross, Hammersmith, Queen Charlotte&#39;s &amp; Chelsea, St Mary&#39;s and Western Eye hospitals.&lt;/p&gt;\n&lt;p&gt;As one of the team of rotational technicians at Hammersmith, St Mary’s and Charing Cross Hospitals you will have the opportunity to gain experience including the following and much more:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Providing an effective pharmacy service&lt;/li&gt;\n&lt;li&gt;Assist in the provision of a high quality patient focused dispensing service to patients of the Trust and associated hospitals including the dispensing of prescriptions and updating of computerised medication records&lt;/li&gt;\n&lt;li&gt;Dispensing controlled drugs and clinical trials&lt;/li&gt;\n&lt;li&gt;IT Systems including Automated dispensing &amp; Prescription Tracking&lt;/li&gt;\n&lt;li&gt;Maintaining good stock control of medicines&lt;/li&gt;\n&lt;li&gt;Aseptic services compounding chemotherapy and clinical trials for oncology and haematology patients using isolator and laminar flow technology Sterile and non-sterile manufacture&lt;/li&gt;\n&lt;li&gt;Ward services – medicines management&lt;/li&gt;\n&lt;li&gt;Supporting and training staff&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Pharmacy technician applicants will need an NVQ Level 3 Diploma in Pharmacy Services QCF and a BTEC in Pharmaceutical sciences or an equivalent community based qualification, and must be registered as a Pharmacy Technician with the General Pharmaceutical Council or be registered by October 2019&lt;/p&gt;\n&lt;p&gt;Interviews will take place in the Pharmacy Department at St Mary’s Hospital on the 17th and 19th September 2019&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;“We are committed to equal opportunities and improving the working lives of our staff and will consider applications to work flexibly, part-time or job share. Please talk to us at interview about the flexibility you may need”&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Radhika Poonwasi radhika.poonwasi@nhs.net&lt;/strong&gt;&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123032.jpg", "name": "Imperial College Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123032"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "London, St Mary&#39;s Hospital", "postalCode": "W2 1NY"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5171", "longitude": "-.174187"}}, "title": "Bank Band 4 Rotational Pharmacy Technician", "url": "https://www.jobs.nhs.uk/xi/vacancy/916235455", "validThrough": "2021-01-28T23:59:59+0000"}