{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30675", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,675 per annum"}}, "datePosted": "2020-10-23T10:05:23+0100", "description": "&lt;p&gt;We have an exciting pioneering opportunity at a friendly South Hampshire GP Network on the river Hamble. The Network is looking to recruit pharmacy technicians to join their clinical pharmacist team in a developmental role within Primary Care to enhance the care to our patients. This role provides fantastic opportunity alongside a highly competitive salary package.&lt;/p&gt;\n&lt;p&gt;Our Network covers four practices operating across 4 sites and operates within a well-established and successful GP Federation.&lt;/p&gt;\n&lt;p&gt;The role has the potential to help manage general practice workload and significantly improve quality of care and safety for patients. Secondment opportunities may be considered for this role.&lt;/p&gt;\n&lt;p&gt;Pharmacy technicians play an important role, complementing clinical pharmacists, community pharmacists and other members of the PCN multi-disciplinary team. Pharmacy technicians are different to clinical pharmacists as they are not able to prescribe or make clinical decisions, instead working under supervision to ensure effective and efficient use of medicines.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "External Practice", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=134914"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Eastleigh Southern Parishes Network", "postalCode": "SO31 4NQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.876", "longitude": "-1.32727"}}, "title": "Pharmacy Technician", "url": "https://www.jobs.nhs.uk/xi/vacancy/916239969", "validThrough": "2020-11-20T23:59:59+0000"}