{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 to £44,503 per annum"}}, "datePosted": "2020-11-06T14:39:13+0000", "description": "&lt;h1&gt;Service Manager&lt;/h1&gt;\n&lt;p&gt;An opportunity has arisen within the Older Persons Medicine, Rehabilition and Stroke Care Group for a bright, talented, and dynamic individual to fill the role of Service Manager within Older Persons Medicine.&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity as we continue to embed change across the Care Group and improve the experience for staff and patients.&lt;/p&gt;\n&lt;p&gt;You will be a key member of the senior management team demonstrating your ability to work collaboratively with Medical and Nursing colleagues to deliver the effective integrated clinical, operational and financial performance of the Care Group and high quality patient care, in our busy acute hospital.&lt;/p&gt;\n&lt;p&gt;You will provide leadership and expert advice to your teams to help deliver high standards of care and a quality, patient-centred service with a positive attitude to continuous improvement.&lt;/p&gt;\n&lt;p&gt;This is a challenging operational role, but represents an exciting opportunity for the right candidate. The role represents an ideal opportunity for the post holder to further their skills and progress their career in other senior management role.&lt;/p&gt;\n&lt;p&gt;In addition, the successful candidate will operationally support the Junior Doctors Rota Co-ordinator.&lt;/p&gt;\n&lt;p&gt;As this is a senior operational role there is a requirement to participate in a weekend duty rota and represent the Care Group as as part of our daily Bronze command.&lt;/p&gt;\n&lt;p&gt;To request an informal discussion about this opportunity please contact Lewis Wilkinson – Care Group Manager for Older Persons Medicine, Rehabilitation and Stroke by email: lewis.wilkinson@porthosp.nhs.uk&lt;/p&gt;\n&lt;p&gt;Closing date 13/11/2020&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120645.png", "name": "Portsmouth Hospitals University NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120645"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Portsmouth", "postalCode": "PO6 3LY"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8502", "longitude": "-1.06936"}}, "title": "Service Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916260160", "validThrough": "2020-11-13T23:59:59+0000"}