{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 £31,365 - £37,890 per annum"}}, "datePosted": "2020-11-05T16:46:21+0000", "description": "&lt;p&gt;Are you an experienced Occupational Therapist who is passionate about the care of older people accessing community mental health services?&lt;/p&gt;\n&lt;p&gt;Do you want to work in a team that is really supportive, thinks creatively and is always looking to continue to develop to provide the best possible care to our patients and their families?&lt;/p&gt;\n&lt;p&gt;Do you want to work for a leader that shares your passion for good quality care, and will support you to be the best Occupational Therapist you can be?&lt;/p&gt;\n&lt;p&gt;Then, look no further. We have just the role for you!!!&lt;/p&gt;\n&lt;p&gt;We need someone with experience in good quality mental health assessment and interventions and occupational performance assessments, that can deliver these according to the values of our organisation.&lt;/p&gt;\n&lt;p&gt;We also encourage innovative ideas around group work and utilising the voluntary sector in supporting service users with activities of daily living and leisure interests in order to better manage their mental health.&lt;/p&gt;\n&lt;p&gt;Your clinical competence and confidence is important to us, but in equal measure with your genuine kindness and compassion for your colleagues and patients; coupled with effective leadership skills that we will expect of you as a senior clinician. We need someone that can support and nurture our less experienced staff, and to work effectively with the multi-disciplinary team.&lt;/p&gt;\n&lt;p&gt;In return, we will offer you a thorough induction programme, an honest and genuine commitment to your career development, regular supervision and appraisal, and 1:1 coaching with a trained coach if you would like it. We will work with you to ensure you are able to work flexibly to balance your home and work life, whilst being able to fulfil your responsibilities to the service.&lt;/p&gt;\n&lt;p&gt;Please give us a call to discuss further. Ask us any questions you have, and give us the opportunity to tell you more about us and the role.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDarelle EllwoodJob titleTeam LeaderEmail addressdarelle.ellwood@nhs.netTelephone number01732 228241Additional contact information&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Darelle Ellwood&lt;/p&gt;\n&lt;p&gt;Team Leader&lt;/p&gt;\n&lt;p&gt;darelle.ellwood@nhs.net&lt;/p&gt;\n&lt;p&gt;01732 228241&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121464.jpg", "name": "Kent and Medway NHS and Social Care Partnership Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121464"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Highlands House, Tunbridge Wells", "postalCode": "TN1 2JN"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.1323", "longitude": ".272045"}}, "title": "Community Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258637", "validThrough": "2020-11-19T23:59:59+0000"}