{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 £45,753 - £51,668 per annum"}}, "datePosted": "2020-10-22T14:00:51+0100", "description": "&lt;p&gt;Be at the centre of an exciting, digitally-enabled future at one of the UK’s largest Acute Trusts.&lt;/p&gt;\n&lt;p&gt;On 1 October 2017, Manchester University NHS Foundation Trust (MFT) was created from the merger of Central Manchester University Hospitals NHS Foundation Trust (CMFT) and University Hospital of South Manchester NHS Foundation Trust (UHSM). The merger was founded on a desire to deliver significant improvements in health outcomes and healthcare for the people of Manchester and surrounding areas.&lt;/p&gt;\n&lt;p&gt;We are the main provider of hospital care to approximately 750,000 people in Manchester and Trafford and the single biggest provider of specialised services in the North West of England. We are also the lead provider for a significant number of specialised services including Breast Care, Vascular, Cardiac, Respiratory, Urology Cancer, Paediatrics, Women’s Services, Ophthalmology and Genomic Medicine.&lt;/p&gt;\n&lt;p&gt;The Trust comprises of nine hospitals across six separate sites, providing a wide range of services from comprehensive local general hospital care through to highly specialised regional and national services.&lt;/p&gt;\n&lt;p&gt;Our vision is to improve the health and quality of life of our diverse population by building an organisation that:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Excels in quality, safety, patient experience, research, innovation and teaching&lt;/li&gt;\n&lt;li&gt;Attracts, develops and retains great people&lt;/li&gt;\n&lt;li&gt;Is recognised internationally as a leading healthcare provider&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Did we mention these are exciting times?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The MFT Group Informatics service must respond quickly and flexibly to the demands of this new organisation, ensuring that we provide multiple services fit for purpose, whilst evolving our capability and tools to deliver an ambitious transformation change programme for the future.&lt;/p&gt;\n&lt;p&gt;An opportunity has arisen within the Information Services department for the right individual to join a progressive and forward-thinking team and contribute to the ongoing development of the services and products we provide. Information and data is at the heart of decision making; providing intelligence to support better patient care and outcomes, supporting how we shape our services, monitoring performance and risks, and helping drive forward change across the health economy. Our Information Services department is at the forefront of advanced data services, reporting, and analytics. With the expansion of the department’s scope into clinical decision tools and intelligence, this is an exciting time to become part of an experienced and highly rated team.&lt;/p&gt;\n&lt;p&gt;You will play a key role in maintaining and supporting the development of the Trust data service products and services (data warehousing, business Intelligence, analytical modelling, visualisations, machine learning, streaming services) used by Information Services and the wider organisation. You will lead on the management and optimisation of data sets, security and auditing, data flows, data dissemination and SQL Server products and platforms to enable Information Services to deliver a first class, comprehensive and proactive service to the Trust.&lt;/p&gt;\n&lt;p&gt;You must be able to work under time pressures, reliable, and be attentive to detail.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameGareth SummerfieldJob titleHead of Data ServicesEmail addressGareth.Summerfield@mft.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Manchester University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121137"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Based within Corporate Group Informatics Service with requirements to perform duties across all Trust sites, Manchester", "postalCode": "M13 9WL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4625", "longitude": "-2.22771"}}, "title": "Database Administrator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916238798", "validThrough": "2020-11-12T23:59:59+0000"}