{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "35207", "minValue": "28691", "unitText": "YEAR", "value": "£28,691 - £35,207 pro rata, inc HCA"}}, "datePosted": "2020-10-29T11:16:55+0000", "description": "&lt;p&gt;King’s College Hospital NHS Foundation Trust part of King&#39;s Health Partners Academic Health Sciences Centre (AHSC), is one of the UK’s largest and busiest teaching hospitals with a turnover of nearly £1 billion, 1.5 million patient contacts a year and more than 12,600 staff based across 5 main sites in South East London and Kent.&lt;/p&gt;\n&lt;p&gt;The Trust provides a full range of local hospital services across its different sites, and specialist services from King’s College Hospital (KCH) site in Camberwell and the Princess Royal University Hospital (PRUH) site in Bromley, Orpington Hospital, and some services at Beckenham Beacon and Queen Mary’s Sidcup.&lt;/p&gt;\n&lt;p&gt;The Trust is recognised internationally for its work in liver disease and transplantation, neurosciences, cardiac, haemato-oncology, fetal medicine, stroke, major trauma, and Emergency Department.&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for a motivated Band 5 Staff Nurse with excellent communication skills to work as part of the Outpatient nursing team at Orpington and Princess Royal University Hospital.&lt;br /&gt;&lt;br /&gt;Outpatient’s is a diverse, multidisciplinary environment which requires flexible and adaptable skills, an aptitude to learn and a motivation to develop your own skills.&lt;br /&gt;&lt;br /&gt;If you are a dynamic individual who enjoys a challenge and would like to join a team who are passionate about providing high quality care to their patients, then we want to hear from you.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be enthusiastic, organised and committed to give high quality nursing care and be able to work autonomously as well as part of a team. You will consistently ensure that a patient’s privacy, dignity and psychological well-being is maintained and at all times, that the care given is patient centred.&lt;br /&gt;&lt;br /&gt;You need to have excellent communication and interpersonal skills. We require individuals who are forward thinking, well organised and with a positive attitude towards flexibility and change.&lt;br /&gt;&lt;br /&gt;This is a 30 hours a week post within the General Outpatients Department between Orpington Hospital and Princess Royal University Hospital Outpatient Departments.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Jill Austin&lt;/p&gt;\n&lt;p&gt;Job title: Nurse Manager&lt;/p&gt;\n&lt;p&gt;Telephone number: 01689 865089&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "King's College Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120921"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Orpington Hospital &amp; Princess Royal University Hospital, Orpington", "postalCode": "BR6 9JU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3625", "longitude": ".095177"}}, "title": "Staff Nurse - Outpatients Department - ORP/PRUH", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248049", "validThrough": "2020-11-12T23:59:59+0000"}