{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 to £110,683"}}, "datePosted": "2020-10-21T12:00:45+0100", "description": "&lt;p&gt;&lt;strong&gt;Are you an experienced clinician in orthodontics committed to delivering clinical care to high standards?&lt;/strong&gt;&lt;strong&gt;Do you have a research degree and are passionate about delivering outstanding research, research-informed teaching and scholarship and an exceptional student experience? Are you able to use your experience and skills to bring out the best in others and support their development? Are you looking to develop yourself?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are seeking a highly motivated individual committed to further develop their skills in research and teaching in orthodontics as well as their overall leadership. Your academic responsibilities will focus on research development and supervision with contributions to teaching.&lt;/p&gt;\n&lt;p&gt;You will be committed to developing your own research profile within the School’s research themes and to contribute to high quality outputs with associated impact as well as contributing to high-quality postgraduate research student supervision. You will have a commitment to teaching and scholarship that is forwards looking and reflects the needs of current students. You will have a commitment to you own development as well as the development of others within a team approach to deliver an exceptional student experience.&lt;/p&gt;\n&lt;p&gt;You will also work as an Honorary Consultant in Orthodontics with Mid Yorkshire Hospitals NHS Trust as part of a consultant team contributing to the clinical orthodontics service delivery with an emphasis on high quality patient outcomes and experience. You will be responsible for meeting the requirements of the Trust in terms of clinical governance and fulfilling an agreed job plan (see appendix A).&lt;/p&gt;\n&lt;p&gt;You will have a BChD or BDS degree (or equivalent), full registration with the UK General Dental Council and be on the GDC Specialist List in Orthodontics. To be eligible for appointment at Consultant level you will also have completed successfully an SAC-approved 2-year minimum training programme in a Fixed Term Training Appointment (FTTA) in Orthodontics, or its equivalent.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;To explore the post further or for any queries you may have, please contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;University: Professor Bernadette Drummond;b.k.drummond@leeds.ac.uk;&lt;/p&gt;\n&lt;p&gt;Clinical: Mr James Spencerjamesspencer@nhs.net&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;The University of Leeds is committed to providing equal opportunities for all and offers a range of family friendly policies. The University is a charter member of Athena SWAN and holds the Bronze award. The School of Dentistry gained the Silver Award in October 2017. We are committed to being an inclusive medical school that values all staff, and we are happy to consider job share applications and requests for flexible working arrangements from our employees.&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "The University of Leeds", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122913"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Leeds", "postalCode": "LS9 7TF"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8073", "longitude": "-1.51908"}}, "title": "Clinical Lecturer in Orthodontics with Honorary Consultant Status", "url": "https://www.jobs.nhs.uk/xi/vacancy/916236237", "validThrough": "2020-11-20T23:59:59+0000"}