{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "25000", "minValue": "24000", "unitText": "YEAR", "value": "£24,000 - £25,000 (pro-rata)"}}, "datePosted": "2020-11-05T11:47:27+0000", "description": "&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About The Role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The role is pivotal in ensuring all patients receive the best possible care and service, supporting the key ambitions of the Network member practices in coordinating all key activity including access to services, advice, and information, and ensuring health and care planning is timely, efficient, and patient-centred. The role will include supporting digital initiatives and includes responsibilities for the co-ordination of the patients journey through primary care.&lt;/p&gt;\n&lt;p&gt;You will contribute to tackling inequalities in health and social care particularly regarding individuals with long-term conditions. An ethos of promotion of independence, shared decision making, personalisation and partnership-working is integral to this post. As the role evolves you will undertake direct work with patients and families to develop personalised care plans.&lt;/p&gt;\n&lt;p&gt;In this role you will be involved in driving continuous improvement by delivering processes that are the best they can be, removing waste from the process, and thereby reducing inefficiencies and costs, whilst increasing performance to deliver quality to the customer on time and in full. Throughout the process you will develop structured continuous improvement activities, maximising operational effectiveness and efficiencies through the development of people, process and systems.&lt;/p&gt;\n&lt;p&gt;You will support the Network in developing a support to Grays care homes. You will assist PCN provider practices in our ambition to improve the quality and continuity of care by acting as a point of contact and coordinating virtual ward rounds and timely intervention as part of the care home MDT.&lt;/p&gt;\n&lt;p&gt;Your role is an essential part of our evolving dynamic and forward-thinking PCN, working to provide enhanced care experience to patients in line with a draft Job Description with a view to improving health inequalities.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Other Duties include:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Act as a point of contact between GP, patients and carers and other agencies&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Liaise with GPs and practice teams to identify patients who are elderly, frail or who have long term health needs and support&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Develop and embed the use of Group Consultations to help support the care arrangements for patients with long term conditions.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Support patients to access community care assessments as well as carers assessments&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Undertake visits or telephone contact to manage patients on the PCNs case load following any unplanned hospital admissions where appropriate.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Participate in MDT meetings to discuss patients actively being managed by the Care Homes Team and any other patients from the PCNs case load needing discussion.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Raise awareness of health promotion, screening and NHS Health Checks and LD Health Checks in practices&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Co-ordinate PCN clinics, and contact identified patients with appointments&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Manage patient initiated calls for help/signposting etc., ensuring patients are directed to appropriate service&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Document and monitor aspects of patient co-ordination and service delivery, supporting data collection and audit using the practices clinical system&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Demonstrate the ability to recognise and respond appropriately when faced with a sudden deterioration or emergency situation, alerting the team or enabling a rapid response&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Support national screening and immunisation programmes and encourage uptake&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Monitor referrals to ensure tasks are completed and care delivered by keeping in regular telephone contact&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;About The Candidate&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;You will need to have the following skills / qualifications :&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;You will have experience of working within healthcare or the voluntary / community sector, supporting vulnerable groups;&lt;/li&gt;\n&lt;li&gt;Ideally you will have a Diploma/HNC level/NVQ Level 2 in Health and Social Care or equivalent qualification;&lt;/li&gt;\n&lt;li&gt;You will have strong listening and communication skills;&lt;/li&gt;\n&lt;li&gt;You will be familiar on local resources and services and how to access them;&lt;/li&gt;\n&lt;li&gt;You will be motivated by helping people, with care and empathy;&lt;/li&gt;\n&lt;li&gt;In delivering person-centered support in a non-judgmental way;&lt;/li&gt;\n&lt;li&gt;Experience of completing holistic person centered care planning assessments&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About Us:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is an exciting time to join an innovative and forward thinking &lt;strong&gt;Primary Care Network in Grays &lt;/strong&gt;with a strong reputation for Quality Improvement and investing in people. Our PCN spans 10 member Practices embracing a patient list of almost 73,000 patients and is widening our scope of Practice and skill mix to enable improved access to high quality healthcare.&lt;/p&gt;\n&lt;p&gt;We are committed to improving the care provided to patients, reducing health inequalities and raising the quality and standards of GP practice. We are looking for a dedicated Clinical Care Coordinator to work with the Network Member Practices in order to deliver integrated care based around the needs of our local population.&lt;/p&gt;\n&lt;p&gt;As PCN Care Coordinator you will work as a key part of the primary care network (PCN) multi-disciplinary team. You will ensure care is seamless and that everyone involved is working together. You will provide the capacity and expertise to support patients in preparing for or in following-up clinical conversations they have with PCN primary care professionals.&lt;/p&gt;\n&lt;p&gt;You will work closely with the Clinical Directors, local GPs and other primary care professionals within the PCN to identify and manage a caseload of identified patients, making sure that appropriate support is made available to them and their carers, and ensuring that their changing needs are addressed.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;KEY BENEFITS &amp; REMUNERATION &lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;NHS Pension Scheme&lt;/li&gt;\n&lt;li&gt;6.5 Weeks Leave Inc. Bank Holidays (Pro Rata)&lt;/li&gt;\n&lt;li&gt;Study Leave and Protected Learning Time&lt;/li&gt;\n&lt;li&gt;Peer Support and Mentorship&lt;/li&gt;\n&lt;li&gt;Regular Clinical and PCN Meetings&lt;/li&gt;\n&lt;li&gt;Ongoing Training, Education and Development&lt;/li&gt;\n&lt;li&gt;PCN Opportunities and Progression&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;This role is also being advertised on the Essex Primary Care Careers website – please complete only one application.&lt;/p&gt;\n&lt;p&gt;We have the right to close the advert earlier if we reach the maximum number of applications.&lt;/p&gt;\n&lt;p&gt;NO AGENCIES PLEASE&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/135914.JPG", "name": "Essex Primary Care", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=135914"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Grays", "postalCode": "RM17 5JY"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4807", "longitude": ".327949"}}, "title": "Care Co-ordinator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257517", "validThrough": "2020-11-20T23:59:59+0000"}