{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 p.a. pro rata"}}, "datePosted": "2020-10-16T09:17:53+0100", "description": "&lt;p&gt;&lt;em&gt;Tempted to embark on new career/change of specialism?&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;We are looking to recruit an enthusiastic nurse from either Childrens or Adult background&lt;em&gt;. &lt;/em&gt;An exciting opportunity has arisen within the Solent NHS Children’s Continence Service for a band 5 Nurse. This post requires an enthusiastic motivated individual with a passion for working with children who is able to provide an holistic approach working autonomously.&lt;/p&gt;\n&lt;p&gt;The service treats children who present with day/night wetting, faecal incontinence, chronic constipation and impaction, and toilet training needs. Detailed bladder and bowel assessments are carried out in a community clinic setting on all children following devised care plans relevant to their specific needs.&lt;/p&gt;\n&lt;p&gt;Ideally knowledge and experience in dealing with such conditions would be advantageous, however training would be provided for the appropriate candidate.&lt;/p&gt;\n&lt;p&gt;The Children’s Continence Service works collaboratively with children and families. The service is based at Battenburg Clinic Portsmouth, and currently covers providing clinics and specialist nurse advice for children and young people with level 2 continence needs. The service works closely with other health care professionals, both within the community and acute Trust.&lt;/p&gt;\n&lt;p&gt;If you regard yourself as an exceptional Registered Nurse who thrives working within a small specialist team with a passion for improving continence outcomes for children and young people, are committed, motivated and reliable, and can demonstrate the ability to provide high quality care, support and information to children and their families, then we would love to receive your application.&lt;/p&gt;\n&lt;p&gt;This opportunity is for 30 to 37.5 hours per week.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Please note that should this post attract sufficient interest, we may choose to close at an earlier date. We strongly suggest that you apply at an early stage.&lt;strong&gt;If we have not contacted you within four weeks of the closing date of this post, please presume that you have not been selected.&lt;/strong&gt;Candidates selected for interview will be contacted within 2-3 weeks; therefore you should check your emails regularly including junk mail folders.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/126954.jpg", "name": "Solent NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126954"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Portsmouth", "postalCode": "PO1 2AL"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7973", "longitude": "-1.09127"}}, "title": "Paediatric Continence Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916229411", "validThrough": "2020-11-08T23:59:59+0000"}