{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Competitive"}}, "datePosted": "2020-10-16T14:39:36+0100", "description": "&lt;p&gt;&lt;strong&gt;Consultant Psychiatrist - Low Secure Women&#39;s Mental Health&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location: Birmingham&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Competitive Salary and Benefits Package&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Full Time post (37.5 hours per week)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;You can achieve more at St Andrew’s Healthcare&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt; A top 20 UK charity, St Andrew’s is a unique provider of specialist care in mental health and learning disability. We aspire to deliver truly world class, holistic services within our outstanding, modern facilities. Our independence means we can always put patients’ interests at the heart of decision making, while re-investing surpluses in frontline services.  We are currently transforming the Charity to deliver ‘Value Based Healthcare’ which will ensure our patients consistently get the best possible outcomes and local teams gain more control and responsibility.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Birmingham Service&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;St Andrew’s Birmingham is a 124 bedded adult mental healthcare facility, located in Stirchley and comprises of eight wards which cover medium and low security. At present, 6 of the wards provide services for Men and two are for women.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;St Andrew’s Birmingham is a core partner of the West Midlands REACH OUT project, a wave one New Care model/Provider Collaborative alongside Birmingham and Solihull Mental Health Foundation Trust and Midlands Partnership Foundation Trust. The aim of this partnership is to provide the highest quality care to our patients as close to home as possible, and the partnership is nationally recognised as one of the leading New Care Models, recently being highly commended by the Health Service Journal. We have also recently started a pilot project with Birmingham and Solihull Mental Health Foundation Trust whereby a dedicated community forensic service is being embedded with St Andrew’s which is a unique and ground-breaking project.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Our patients and your colleagues will expect you to live the St Andrew’s CARE values of Compassion, Accountability, Respect and Excellence every single day&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Role / Person&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are seeking to appoint an exceptional candidate to join our team here at St Andrew’s to provide Consultant leadership specifically to the Women’s Low service and to become an integral part of the REACH OUT partnership. The successful candidate will lead a full MDT, including the support of a speciality doctor and physical health care team, and will help shape services further through strategic decision-making, improvement projects and joint working with our NHS partners. You will also be able to undertake research projects as part of St Andrews commitment to innovation and world-class care.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Birmingham Site also offers an excellent opportunity to deliver value-based healthcare focusing on clinical outcomes. The hospital is focusing on using up-to-date data on outcomes based on the recommendations of International Consortium of Health Outcome Measures to continually adapt care to best meet every patient’s needs.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Applicants must have MRCPsych or equivalent and hold a CCT in Forensic or General Adult Psychiatry. Forensic experience is beneficial as is experience of working within a women’s service.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Development&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are extremely proud to empower the careers of our medical professionals, and our Executive Medical Director and all of our Clinical Directors have grown and developed into their current roles within the Charity&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We also support a number of our Consultant Psychiatrists through an Executive MBA programme at some of the most prestigious business schools in the country.  There are also opportunities to attend our regular internal CPD events and for you to develop a medico-legal out-patient practice as part of the St Andrew&#39;s Consultancy Service.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; Why Choose St Andrew’s?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Competitive salary&lt;/li&gt;\n&lt;li&gt;41 days annual leave including bank holidays&lt;/li&gt;\n&lt;li&gt;A tailored comprehensive induction programme&lt;/li&gt;\n&lt;li&gt;Medical indemnity cover&lt;/li&gt;\n&lt;li&gt;Supportive working environment&lt;/li&gt;\n&lt;li&gt;Enhanced sickness pay&lt;/li&gt;\n&lt;li&gt;Huge opportunities for Continuing Professional Development with regular onsite educational &amp; training events&lt;/li&gt;\n&lt;li&gt;Autonomy to make decisions to improve patient outcomes&lt;/li&gt;\n&lt;li&gt;Relocation allowance available  (subject to status)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Interested? &lt;/span&gt;&lt;/strong&gt;&lt;br /&gt; We welcome your application and would encourage anyone who is interested in finding out more about the role or package, to contact &lt;strong&gt;Dr Ankur Agarwal&lt;/strong&gt;, Clinical Director, on 0121 432 2175  aagarwal@standrew.co.uk or our internal Recruitment Consultant, James Farrelly&lt;strong&gt; &lt;/strong&gt;on 01604 616624 jcfarrelly@standrew.co.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/129496.jpg", "name": "St Andrew’s Healthcare", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=129496"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Birmingham", "postalCode": "B30 2XR"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4357", "longitude": "-1.91556"}}, "title": "Consultant Psychiatrist - Birmingham Low Secure Service", "url": "https://www.jobs.nhs.uk/xi/vacancy/916230665", "validThrough": "2020-11-08T23:59:59+0000"}