{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-11-02T15:01:32+0000", "description": "&lt;p&gt;We have an exciting opportunity for a Registered Mental Health Nurse to work on a Full time permanent basis (Band 6, 2.0 wte) in the Prison Mental Health Inreach Team (PMHIT).&lt;/p&gt;\n&lt;p&gt;This small but extremely dedicated Multidisciplinary Team works across both HMP Parc and Swansea, delivering a Secondary Care MH Service. The team works in line with the ‘All Wales MH Measure’ (2010). The role includes assessment of Prisoners experiencing severe and enduring, often complex mental health difficulties with formulation of cohesive and comprehensive management plans. Clinicians hold a caseload of service users of whom they support through the recovery journey utilising a range of interventions.&lt;/p&gt;\n&lt;p&gt;Our focus is to identify staff with a strong belief in recovery, rehabilitation and community re-integration. The role would suit a dynamic, motivated and dedicated individual looking to work in a rewarding and diverse role.&lt;/p&gt;\n&lt;p&gt;The PMHIT also offers consultation to other teams and works in partnership with Primary care MH Team/GPs, Social workers, Inpt settings, Probation, Police, Courts, Ministry of Justice (MOJ) and provides representation at Multi-Agency Public Protection Arrangement (MAPPA) Panel and Care and Treatment Panning (CTP) Meetings.&lt;/p&gt;\n&lt;p&gt;The ideal candidate will have experience of working in a Forensic setting and/or working with complex mental health needs as a Community MH Practitioner. You will be able to demonstrate a strong team work ethic and sense of accountability accompanied by an ability to work under considerable pressure at times and a desire for innovation.&lt;/p&gt;\n&lt;p&gt;We have a supportive management structure that values the Well-being of all staff and that would support any prospective candidate to meet their personal objectives&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Please note that Prison Vetting will need to be undertaken for this role. If successful at Shortlisting stage, you will be invited for an interview.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; English and/or Welsh speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Feroz PeerbaccusTeam Manager&lt;/p&gt;\n&lt;p&gt;feroz.peerbaccus@wales.nhs.uk&lt;/p&gt;\n&lt;p&gt;Tel No 01656 753454&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123207.jpg", "name": "Swansea Bay University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123207"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "HMP Parc Bridgend/Swansea", "postalCode": "CF35 6AP"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.531", "longitude": "-3.56316"}}, "title": "Prison In-Reach CPN", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252534", "validThrough": "2020-11-16T23:59:59+0000"}