{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "31500", "minValue": "26100", "unitText": "YEAR", "value": "£26,100. - £31,500. per annum inclusive salary"}}, "datePosted": "2020-11-05T11:52:27+0000", "description": "&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;St Luke&#39;s Hospice is an outstanding provider of expert palliative and end of life care. We are also a prominent and respected charity at the heart of the local community with a large range of specialist services to support patients, their families and friends. The In-Patient Unit (IPU) is an 8 bedded unit providing Specialist End of Life Care, Symptom Management and respite to Palliative Care patients (and families), with a Cancer diagnosis or Life limiting disease. As a Registered Nurse you&#39;ll work as part of an integrated team of nurses and health care assistants delivering high quality care.&lt;/p&gt;\n&lt;p&gt;The post is offered on afull time, permanentbasis (although part time applicants will be considered). We have a friendly, experienced and supportive team and will join an environment where you have the time to provide the highest standards of personalised care. A Chance to &lt;em&gt;be part of a Speciality team&lt;/em&gt;, with ongoing support and guidance, where &lt;em&gt;training and education&lt;/em&gt; is high priority you will be &lt;em&gt;working in a relaxing environment.&lt;/em&gt; Our staff satisfaction and staff retention rates are both high.&lt;/p&gt;\n&lt;p&gt;Previous experience in palliative care and related study/courses is desirable, and a willingness to advance skills with opportunities for personal and professional development within a creative and unique environment is essential.&lt;/p&gt;\n&lt;p&gt;These are exciting times to join us with development plans including a new build Hospice and the re development of our main site to further improve our facilities.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We also offer:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Funded Clinical Supervision&lt;/li&gt;\n&lt;li&gt;Variable shift pattern with flexibly to meet your needs&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Discounted gym membership&lt;/li&gt;\n&lt;li&gt;Home cooked staff meals cooked on site at subsidised rate.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Central location in Basildon close to major road networks and within walking distance of Basildon Station.,&lt;/li&gt;\n&lt;li&gt;Pension package, opportunity to continue in the NHS Pension if already a member.&lt;/li&gt;\n&lt;li&gt;27 days annual leave, in addition to public holidays&lt;/li&gt;\n&lt;li&gt;Excellent commitment to learning and development including external training&lt;/li&gt;\n&lt;li&gt;Active Staff Wellbeing programme&lt;/li&gt;\n&lt;/ul&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "St Luke's Hospice", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132494"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Basildon", "postalCode": "SS16 5NJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5613", "longitude": ".451789"}}, "title": "Registered Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257523", "validThrough": "2020-11-22T23:59:59+0000"}