{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-11-06T10:46:29+0000", "description": "&lt;p&gt;Following an internal restructure exercise additional new maintenance posts have been created within the Estates department at the Scunthorpe General Hospital at Scunthorpe&lt;/p&gt;\n&lt;p&gt;An Engineering career within the NHS has so much to offer. The working environment is very diverse and the equipment is highly specialised and unique to healthcare. No two days will be alike when you work within an Acute Hospital setting; the diverse nature of the work could see you working in the corridors of the hospital, or within Plant Rooms that serve the Operating Theatres, numerous Mechanical Plants and Medical Gas systems, not forgetting the Boiler House, the Emergency Standby Generators and also the Wards to name but a few.&lt;/p&gt;\n&lt;p&gt;An Estates Maintenance Craftsperson plays a key role in the Estates Engineering Maintenance Services. The individual will support the Estates Officers and maintenance team in the delivery of maintenance programmes that will contribute to the Trusts objectives been carried out in a safe, cost effective, efficient manner and compliant with legislation, Health Technical Memorandums (HTM) and good practice.&lt;/p&gt;\n&lt;p&gt;The post holder will undertake works relating to the maintenance and repairs of Trust properties, equipment, grounds &amp; gardens ensuring compliance with Statutory requirements, HTM’s, Trust Policies and procedures to ensure a clean, safe and functional environment for patients, public and staff to support the delivery of patient care.&lt;/p&gt;\n&lt;p&gt;Your professional development and career progression is also important and there are various ways to continuously develop and further your career within the NHS&lt;/p&gt;\n&lt;p&gt;Those already working here admit that a major advantage is the great work life balance, the teamwork and the ability to make a difference… Working locally and being at home at the end of the working day is a huge selling point, many of our employees have endured the long distance travel involved with other jobs which can eventually take its toll. In addition to this you will receive a generous annual leave entitlement, access to an excellent pension scheme, staff benefits including discount schemes and the staff lottery.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Bryan Stephenson, Senior Estates and Property Manager&lt;/p&gt;\n&lt;p&gt;b.stephenson@nhs.net&lt;/p&gt;\n&lt;p&gt;03033 302200&lt;/p&gt;\n&lt;p&gt;or&lt;/p&gt;\n&lt;p&gt;Colin Taylor, Estates Officer&lt;/p&gt;\n&lt;p&gt;03033 302789&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121065.png", "name": "Northern Lincolnshire and Goole NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121065"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Scunthorpe", "postalCode": "DN15 7BH"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5875", "longitude": "-.666943"}}, "title": "Multi Skilled Craft Person (Electrical bias)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259280", "validThrough": "2020-11-22T23:59:59+0000"}