{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-11-03T12:00:51+0000", "description": "&lt;p&gt;The United Lincolnshire Hospitals NHS Trust is one of the largest hospital trusts in the country. We provide a comprehensive range of hospital based medical, surgical, paediatric, obstetric and gynaecological services to over 800,000 people across the county of Lincolnshire. We operate 4 hospital sites and deliver services in a range of other settings; we employ around 7,800 staff, and have a turnover in excess of £400m per annum.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the Department…&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Integrated Discharge Hub has been set up to help manage the increasing number of complex Discharges within ULHT. With the increasing ageing population it is imperative that these patients are discharged safely and timely once their period of acute illness has come to an end. It is the Hub’s responsibility to hold daily MDT’s to ensure that there are minimal delays built into their length of stay. The members of the hub include colleagues from the community, palliative care team, adult social care and mental health.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the Role….&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The complex case manager will be a registered nurse, responsible for Key working more complex discharges that have been identified through MDT, and will be expected to follow the patient through from admission to discharge. Experience of assessing people with complex health and social care needs is not essential for the role, however having experience in planning simple and complex discharges is. Training and education will be provided for the successful candidate.&lt;/p&gt;\n&lt;p&gt;Some experience of Continuing Health Care and the Community Care (delayed discharge) Act 2003 would be of benefit as well as having a good understanding of the roles of other disciplines within a healthcare setting.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What we’re looking for…..&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for an enthusiastic member of staff who will be dedicated to help facilitate safe and timely discharges out of the hospital setting. Applicants must be a team player, but also able to work independently. Have good time management skills and the ability to prioritise work. Good keyboard and IT skills, including knowledge of Microsoft Outlook, Word and Excel are also essential.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Kathryn Sayles&lt;/p&gt;\n&lt;p&gt;Job title: Matron/Discharge lead&lt;/p&gt;\n&lt;p&gt;Email address: kathryn.sayles@ulh.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number: 07733003073&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121077.jpg", "name": "United Lincolnshire Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121077"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Pilgrim Hospital, Boston", "postalCode": "PE21 9QS"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.991", "longitude": "-.009786"}}, "title": "Complex Case Manager/Discharge Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253852", "validThrough": "2020-11-24T23:59:59+0000"}