{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 pa"}}, "datePosted": "2020-10-21T14:01:07+0100", "description": "&lt;p&gt;The Improvement Unit are experts at supporting NHS partners with their improvement, transformation and innovation plans, projects and strategies - improving clinical outcomes, delivering better patient experiences and driving down the cost of care. Our clients include NHS trusts, Sustainability and Transformation Partnerships / Integrated Care Systems, Clinical Commissioning Groups, GP Federations and NHS England.&lt;/p&gt;\n&lt;p&gt;Our support ranges from project management of small, bespoke interventions to major change and improvement strategies and nationwide initiatives involving multiple partners. We have a track record of achieving excellent outcomes for our clients and supporting effective cross-organisational and cross-sector collaboration. We achieve this by working with our clients to fully understand their needs and then developing tailored solutions.&lt;/p&gt;\n&lt;p&gt;The Unit has grown significantly in recent months and continues to expand through further recruitment. Continuing clinical and financial challenges for the NHS and the emerging architecture of Integrated Care Systems provides an increasing portfolio of opportunity and demand for our services. Equally the CSU benefits from internal improvement support to realise our corporate objectives and strategic goals, and to uphold our organisational values.&lt;/p&gt;\n&lt;p&gt;Our assignments frequently continue into an implementation phase, with the team taking an operationally focussed, hands-on approach to delivering solutions which realise meaningful benefits and lead to improved outcomes.&lt;/p&gt;\n&lt;p&gt;This is where you come in.&lt;/p&gt;\n&lt;p&gt;We are looking for 3 Improvement Consultants to join our team.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Improvement Consultant, salary £38,890 - £44,503&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As an Improvement Consultant you will be involved in managing projects, delivering transformation and improvement programmes. Your will be required to work closely with our clients and actively support them to deliver sustainable improvements and change. The team needs people who can:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Lead/manage projects. &lt;/strong&gt;This means taking responsibility for customer liaison, project planning and managing the input of others. You will therefore have first-rate interpersonal skills, alongside an enquiring mind and focus on quality and high standards; you will be capable of building teams and motivating the people around you.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Communicate clearly. &lt;/strong&gt;The topics we work on are typically complex, yet our communication must be as simple and concise as possible. You will be responsible for producing and presenting a wide range of information to diverse audiences.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Work creatively and think innovatively whilst retaining high standards and best practice. &lt;/strong&gt;We use a variety of recognised best practice tools and techniques but need to recognise how to modify or adapt our approach according to demands of individual pieces of work.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Demonstrate and utilise a wide range of skills and capabilities. &lt;/strong&gt;We need people with the skills to gather and interpret information, to track progress against plans, engage well with others and to prioritise work effectively. You may need to develop new processes, problem solve and handle sensitive information with tact and diplomacy.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Operate with drive, integrity and enthusiasm. &lt;/strong&gt;You must be comfortable with fluidity and ambiguity, capable of working flexibly whilst maintaining direction and energy, in the face of challenges and change.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Forge their own path. &lt;/strong&gt;We want people who are motivated, self-starting, and able to work autonomously, managing their own workload and working to tight and changing timescales.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Work collaboratively and develop positive working relationships.&lt;/strong&gt; We want people who are quick to form positive working relationships with a range of colleagues, clients and stakeholders to collaboratively develop and implement improvement activity.&lt;/p&gt;\n&lt;p&gt;Working for The Improvement Unit provides excellent personal development opportunities, working alongside system leaders and senior colleagues to implement change and transformation across a wide range of projects.&lt;/p&gt;\n&lt;p&gt;If you are committed to making a difference, enjoy variety and have the skills and attributes to consistently deliver and succeed then this is a fantastic opportunity to join a great team covering a number of geographies.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location:&lt;/strong&gt; The team’s geographical footprint covers a number of regions. We have three main office locations: Leyland, Stoke-on-Trent and West Bromwich. The Improvement Unit are keen supporters of agile working and will provide you with the equipment and technology required to perform your job effectively, from a location which best suits the needs of the business and your individual needs – be it from one of our office locations, a client location, or at home.&lt;/p&gt;\n&lt;p&gt;For further details please contact&lt;/p&gt;\n&lt;p&gt;Joanne Wilkes&lt;/p&gt;\n&lt;p&gt;Senior Improvement Consultant&lt;/p&gt;\n&lt;p&gt;Email address:   Joanne.Wilkes3@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number     07720342726&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/128334.png", "name": "Midlands and Lancashire Commissioning Support Unit", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128334"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Flexible, Flexible", "postalCode": "ST4 4LX"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9918", "longitude": "-2.16773"}}, "title": "Improvement Consultant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916236740", "validThrough": "2020-11-06T23:59:59+0000"}