{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615"}}, "datePosted": "2020-10-26T09:46:18+0000", "description": "&lt;p&gt;This is a unique opportunity to join the Directories and Knowledge Resource Team, based in Norwich, and part of Arden &amp; Gem Commissioning Support Unit (CSU).&lt;/p&gt;\n&lt;p&gt;The Directories and Knowledge Resource Team provide high quality information management services to a range of Clinical Commissioning Groups (CCGs), including a bespoke Knowledge Resource System and several Directories of Services (DoS’), including the 111 DoS.&lt;/p&gt;\n&lt;p&gt;We are looking to recruit an ambitious, detail focused and systems minded Directory of Services Officer into the team.&lt;/p&gt;\n&lt;p&gt;The successful candidate will work with the Directories and Knowledge Resource (DKR) Manager in maintaining and developing the local Directory of Services (DoS), national DoS and related systems;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Management of local Directories of Services (DoS), including the 111 DoS, local professional and public directories, and liaison / collaboration with NHS organisations, Council, Social Care and voluntary sector initiatives.&lt;/li&gt;\n&lt;li&gt;Ensure timely and accurate data entry whilst following maintenance procedures for the service directories (including 111 Dos) and other departmental databases.&lt;/li&gt;\n&lt;li&gt;Act as first point of contact for the department, dealing with routine and specialist enquiries in a pleasant and helpful manner, from system users and information providers, communicating relevant information to stakeholders.&lt;/li&gt;\n&lt;li&gt;Look to understand the underlying issue and work with stakeholders to remediate the problem. Escalating when appropriate to do so.&lt;/li&gt;\n&lt;li&gt;Develop subject matter expertise in DoS and advise internal and external customers and stakeholders on implementation and monitoring of best practice and quality outcome delivery in those areas, as specified in objectives e.g. National DoS initiatives.&lt;/li&gt;\n&lt;li&gt;For DoS, compare a range of technical options, analyse their implications, compare and advise on a suitable direction.&lt;/li&gt;\n&lt;li&gt;Translate specialist technical information and present it to the clients in an accessible manner whilst pitching at the correct level. This will be from 1:1 to large group settings.&lt;/li&gt;\n&lt;li&gt;Enable the business and its customers to understand and use the information at their disposal in the most effective manner and for positive effect, including demonstrations, 1:1 support and presentations.&lt;/li&gt;\n&lt;li&gt;Developing and maintaining standard operating procedures for the areas of responsibility, to ensure consistent processes are followed, and to support continuity in the absence of staff&lt;/li&gt;\n&lt;li&gt;Liaise with the rest of the team to co-ordinate data across the Knowledge platforms; local DoS, national DoS (including 111 DoS), Knowledge Anglia, local GP systems etc.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name - Anna Clark&lt;/p&gt;\n&lt;p&gt;Job title - Directories and Knowledge Resource Manager&lt;/p&gt;\n&lt;p&gt;Email address - anna.clark2@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number - 07884 003435&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/127894.jpg", "name": "NHS Arden and Greater East Midlands Commissioning Support Unit", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127894"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Lakeside 400, Norwich", "postalCode": "NR7 0WG"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6294", "longitude": "1.37179"}}, "title": "Directory of Services (DoS) Officer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241899", "validThrough": "2020-11-09T23:59:59+0000"}