{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 £24,907 - £30,615 pa pro rata"}}, "datePosted": "2020-10-31T08:15:21+0000", "description": "&lt;p&gt;An exciting opportunity is available for band 5 nurses to join our forward thinking team in Acute Respiratory Medicine at Blackpool teaching hospital. We are looking for highly motivated and committed band 5 staff nurses to work on our acute respiratory wards. We care for a variety of patients with both acute and long term conditions including patients stepping down from ITU/HDU. We have strong links with both the hospital respiratory nurse specialists and community staff to ensure best treatment and continuity.&lt;br /&gt;&lt;br /&gt;We require enthusiastic individuals with a can do attitude who have the ability to work within our friendly ward teams. They must be as passionate as we are in getting things right first time, every time. Acute Respiratory Medicine is continuously expanding its service and we require staff nurses who have the ambition to help drive these changes and help expand the service we offer.&lt;br /&gt;&lt;br /&gt;Commitment to undertake ongoing training and development is essential. You should be motivated, keen to learn and ready to embrace change. Our commitment to you is to provide the environment for this to happen and ensure that you are part of our defined preceptorship programme.&lt;br /&gt;&lt;br /&gt;If you are motivated to deliver high standards of care and have the personal qualities and characteristics as outlined in the Blackpool person then this could be the post for you. Please come and meet the team and have a look around.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;These positions are available to Student Nurses, we would also welcome applicants who are interested in a Secondment Opportunity.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Flexible Working Patterns may also be available upon discussion, such as Night Shifts or Part-time hours, please discuss at Interview stage&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameHelen SherlockJob titleUSC Recruitment SisterAdditional contact information&lt;/p&gt;\n&lt;p&gt;Ward Managers Lynette Reid 01253 953410, Lorraine Harwood 01253 953458 or Sam Rossi 01253 57277&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Blackpool Teaching Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120954"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Blackpool Teaching Hospitals NHS Foundation Trust, Blackpool", "postalCode": "FY3 8NR"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8207", "longitude": "-3.01626"}}, "title": "Staff Nurse Respiratory", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251120", "validThrough": "2020-11-15T23:59:59+0000"}