{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 to £44,503 Per Annum"}}, "datePosted": "2020-10-20T09:25:56+0100", "description": "&lt;p&gt;Applications for this new role are invited from experienced, enthusiastic and highly motivated therapy radiographers to be a lead on Training and Education within a forward thinking and technically advancing department.&lt;/p&gt;\n&lt;p&gt;We focus on giving our patients the best outcomes of care and an excellent experience whilst in our hospital. By ensuring a skilled and motivated staff group, we aim to best meet patients’ needs and ensure excellent productivity.&lt;/p&gt;\n&lt;p&gt;The Plymouth Oncology Centre is purpose built to combine a radiotherapy, chemotherapy and outpatients department. The department has a dedicated pre-treatment area using a GE Discovery Wide-bore CT scanner, with a fully equipped mould room with trained technicians. Our 3-D treatment planning uses the Varian Eclipse system and Prosoma for our extensive Virtual Simulation service. We deliver both Radiographer and Oncologist led clinics for patients in this area.&lt;/p&gt;\n&lt;p&gt;The treatment floor houses 3 Varian Linacs all with IMRT and IGRT capabilities. We have a mixture of Trubeam, IX and Novalis units which are all beam matched. No two days are ever the same in radiotherapy due to the interesting mix of patients and equipment as we offer a diverse workload including Total Body Irradiation, Stereotactic Radiosurgery and Radiotherapy, SABR Lung and gynaecological brachytherapy service. The department is also moving towards becoming a paperless facility. This does offer plenty of learning opportunities for all staff members and all Radiographers receive additional training to extend their scope of practice in these areas.&lt;/p&gt;\n&lt;p&gt;The department is also in the early stages of a machine replacement program with a new decant bunker being built alongside a purpose built brachytherapy unit.&lt;/p&gt;\n&lt;p&gt;The department actively participates in national clinical trials.&lt;/p&gt;\n&lt;p&gt;Joining our Radiotherapy team, you will benefit from working as part of a friendly and well organised group. We routinely support post graduate training for Radiographers, CPD, training and skills development, both in-house and through external courses. You will participate in the training of Student Radiographers and in the On-call Rota.&lt;/p&gt;\n&lt;p&gt;Closing Date: 19th November 2020. Anticipated Interview Date: 3rd December 2020.&lt;/p&gt;\n&lt;p&gt;A presentation will be required as part of the interview.&lt;/p&gt;\n&lt;p&gt;For more information or to apply, please NHS JOBS quoting the appropriate vacancy reference number above. For additional information or to organise an informal visit, please call the Radiotherapy department on 01752 431871 and ask for Chris Bowen&lt;/p&gt;\n&lt;p&gt;Please note that applications from temporary workers who have been engaged with the Trust for a minimum of 3 months are welcome.&lt;/p&gt;\n&lt;p&gt;Available as a fixed term contract or secondment opportunity. (With current line manager&#39;s agreement).&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120815.jpg", "name": "University Hospitals Plymouth NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120815"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "PLYMOUTH", "postalCode": "PL6 8DH"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.4167", "longitude": "-4.11371"}}, "title": "Training and Education Lead Radiographer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916233552", "validThrough": "2020-11-19T23:59:59+0000"}