{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "73664", "minValue": "63751", "unitText": "YEAR", "value": "£63,751 - £73,664 per annum"}}, "datePosted": "2020-10-26T10:30:49+0000", "description": "&lt;h1&gt;Associate Director of Safeguarding&lt;/h1&gt;\n&lt;p&gt;As a newly formed Trust this places us in a unique and strong position to build on our existing safeguarding offer across the Black Country STP. As an experienced leader for safeguarding who has a passion to deliver excellent services that safeguard our most vulnerable population you will be joining the team at a really exciting time.&lt;/p&gt;\n&lt;p&gt;You would be expected to function as the Strategic Lead for Adult and Children’s safeguarding across the Trust and will take a strategic, and professional lead with the Named Doctor on all aspects of the health service contribution to safeguarding children and adults across Black Country Healthcare NHSFT; which includes being accountable to all partner safeguarding Boards, the Clinical Commissioning Groups (CCGs) and ensure Divisions are supported with commissioners’ contractual requirements.&lt;/p&gt;\n&lt;p&gt;You will inform the strategic thinking and direction of the Trust, and work in partnership with Acute Trusts, community providers and local partners and will be directly involved with commissioners in the development and monitoring of child protection and adult safeguarding standards. A high degree of communication, networking and liaison will be required to establish and maintain good working relationships within Health and with other agencies to ensure that information relating to child protection and adult safeguarding is up to date and embedded in practice.&lt;/p&gt;\n&lt;p&gt;As the Associate Director you will form part of the senior nursing leadership team and advise on matters of safeguarding and will provide direction and supervision for the internal safeguarding team within the Trust.&lt;/p&gt;\n&lt;p&gt;“This post has not, at the time of advertising, been formally through the local job evaluation process. The level we require the post holder to be working at is 8c level. The successful applicant will be advised if there are any amendments to the Job description prior to them formally accepting the offer of employment.”&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Please note, Dudley and Walsall Mental Health Partnership NHS Trust and Black Country Partnership NHS Foundation Trust have merged together as one organisation to create Black Country Healthcare NHS Foundation Trust from 1st April 2020. Our aim as one trust is to provide sustainable, high quality, accessible and responsive services. Combining resources, strategies and talented workforce enables us to deliver a wider variety of outstanding services that are based on best practice and are continually improving. We are really excited by this opportunity and hope that you are too, we look forward to you expressing an interest in working joining us.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For an informal discussion please contact: &lt;/strong&gt;&lt;strong&gt;judymcdonald@nhs.net&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;**Following text to be included in NHS jobs not body of advert**&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For new or existing NHS staff, upon commencement at Black Country Healthcare NHS Foundation Trust your incremental (pay step) date will be in line with your start date in your new post. For existing NHS Staff remaining on the same band, upon commencement at Black Country Healthcare NHS Foundation Trust your incremental (pay step) date will remain the same.&lt;/p&gt;\n&lt;p&gt;Due to the nature of the work some posts may be subject to a Standard or Enhanced Disclosure and Barring Service (DBS) check, through the Disclosure and Barring Service as stipulated under part V of the Police Act 1997.&lt;/p&gt;\n&lt;p&gt;Successful applicants for clinical posts up to and including Band 4 are expected to hold the national Care Certificate qualification and will be supported to attain this once in post.&lt;/p&gt;\n&lt;p&gt;The Trust is committed to equal opportunities, providing opportunities for flexible working and is a non-smoking organisation.&lt;/p&gt;\n&lt;p&gt;Please note, we reserve the right to bring the closing date forward for this vacancy at any time should we receive an overwhelming response of applications. We therefore encourage applicants to apply early if you wish to be considered for this post.&lt;/p&gt;\n&lt;p&gt;If you do not hear from the recruitment 4 weeks within the advertised closing date please assume that you have been unsuccessful at the shortlisting stage. Please ensure that you check your NHS Jobs Account on a regular basis for any recruitment updates regarding this vacancy. Please note CV’s will not be accepted.&lt;/p&gt;\n&lt;p&gt;The successful applicant will be notified in the same manner that they have applied. For example, online applicants will be notified via NHS Jobs using the email address provided (your NHS Jobs username). All further correspondence will be via the same method, so it is important that you regularly check your NHS Jobs account after the closing date for this post. For paper applications, applicants will be notified by post.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameJudy McDonaldJob titleInterim Cheif Nursing OfficerEmail addressjudymcdonald@nhs.netTelephone number0121 612 8087&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120845.png", "name": "Black Country Healthcare NHS Foundation Trust (formerly known as Black Country Partnership Foundation Trust)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120845"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Trust Headquarters, West Brom/Dudley", "postalCode": "B70 9PL"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5193", "longitude": "-2.0188"}}, "title": "Associate Director of Safeguarding", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242021", "validThrough": "2020-11-09T23:59:59+0000"}