{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 Per annum"}}, "datePosted": "2020-10-28T14:16:26+0000", "description": "&lt;p&gt;We are adding to our existing team and putting in place a 24/7 Duty Manager role across both our hospital sites, we would very excited to hear from you if:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;You have experience of working on an acute hospital site, particularly as a senior nurse, AHP or operationally and understand patient flow.&lt;/li&gt;\n&lt;li&gt;You are able to come in to a challenging day/ night with a smile on your face and a good sense of humour (although we understand it may not be possible to maintain both for the entire shift!).&lt;/li&gt;\n&lt;li&gt;You are enthusiastic and positive about making changes within the organisation, even when it feels like slow progress.&lt;/li&gt;\n&lt;li&gt;You can work flexibly and collaboratively with colleagues from lots of different backgrounds in order to ensure we give our patients the best experience possible.&lt;/li&gt;\n&lt;li&gt;You are good at jigsaws.&lt;/li&gt;\n&lt;li&gt;You have the confidence to make decisions based on the information you have at that time, or know when and how to access the information you need.&lt;/li&gt;\n&lt;li&gt;You can stay cool, calm and collected when others might be struggling or need a plan.&lt;/li&gt;\n&lt;li&gt;You enjoy working with lots of people and moving around the hospital sites to build and maintain relationships – this is not a desk job!&lt;/li&gt;\n&lt;li&gt;You are comfortable with learning new IT applications, and training and supporting others to use them as well, often in a clinical environment.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;If any of the above applies to you, we want to speak to you, and receive your application. This role is new to the organisation and will operate across the Royal Hampshire County Hospital and Basingstoke and North Hampshire Hospital (and will provide telephone support to Andover War Memorial Hospital). We are happy to receive applications for part time and full time hours (no less than 23 HPW) and do ask that candidates are prepared to work at both sites, days/ nights/ weekends and bank holidays – we will be providing consistent and supportive advice and plans for the hospitals and will take the responsibility of the role very seriously.&lt;/p&gt;\n&lt;p&gt;As a new element of an existing team we will be working together to look at what might delay or prevent patient flow throughout the hospitals and working with internal and external stakeholders to make changes to support our patients, and our staff. We are looking for breadth of experience and skills within the team so there are two job descriptions, Duty Manager, for non-clinical operational candidates, and a Clinical Duty Manager job description for registered healthcare professionals; please indicate on your application which you are applying for.&lt;/p&gt;\n&lt;p&gt;If you would like to discuss this opportunity, you can speak to Beth Norton, Associate Director of Operations by booking a call in via Wendy Slocombe on 01256 852814.&lt;/p&gt;\n&lt;p&gt;Applications need to be received by midnight Sunday 15th November. You will be informed of shortlisting on Tuesday 17th November. The interviews and assessment sessions will be: Tuesday 24th &amp; Thursday 25th November at one of the HHFT hospital sites.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Wendy Slocombe - EA to Chief Operating Officer&lt;/p&gt;\n&lt;p&gt;wendy.slocombe@hhft.nhs.uk&lt;/p&gt;\n&lt;p&gt;01256 852814&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121094.JPG", "name": "Hampshire Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121094"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Basingstoke, Basingstoke", "postalCode": "RG24 9NA"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2806", "longitude": "-1.10986"}}, "title": "Clinical/Non Clinical Duty Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246950", "validThrough": "2020-11-15T23:59:59+0000"}