{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "46294", "minValue": "40681", "unitText": "YEAR", "value": "£40,681 - £46,294 per annum pro rata incl HCAS"}}, "datePosted": "2020-10-30T15:44:09+0000", "description": "&lt;h1&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Computer Scientist&lt;/span&gt;&lt;/h1&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;The role:&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An experienced researcher with a scientific computing background is required to join the NCCPM section in Medical Physics working primarily on a research project called Million Women’s Study. The post holder’s main duties will be the development of deep learning algorithms to predict breast density and breast cancer risk using mammography images and to undertake specialised and complex systems development and support for medical image collection and analysis.&lt;/p&gt;\n&lt;p&gt;You should have a good honours degree in a relative subject and a PhD in a related area. Considerable experience in a scientific computing setting is required. Advanced level programming skills using a variety of languages and platforms are expected. Expertise in large scale data manipulation/storage and experience with HPC and virtualisation are prerequisites. Experience using and/or developing deep learning algorithms and performing clinical research is required.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;The Department:&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Department of Medical Physics at the Royal Surrey County Hospital NHS Foundation Trust, Guildford provides medical physics services to the hospital, especially to St Luke’s Cancer Centre, and to a number of surrounding hospitals. The work of the Department covers six main areas: the National Coordinating Centre for the Physics of Mammography (NCCPM); Nuclear Medicine Physics and Radiopharmacy; Radiotherapy Physics; the Regional Radiation Protection Service; Scientific Computing and Technical Services. The Department is administratively in the Strategic Business Unit of Oncology and Medical Physics.&lt;/p&gt;\n&lt;p&gt;The Scientific Computing Section provides the specialised scientific and clinical computing support that is essential for the safe and effective delivery of many of the Department&#39;s services. This includes the management of commercial and proprietary software and solutions and the design, development and support of clinical, image processing and administration systems and databases.&lt;/p&gt;\n&lt;p&gt;The NCCPM section of the Medical Physics department initiates programmes of research leading to improvements in how breast screening is provided by the NHS and is a leading centre of expertise in this field.&lt;/p&gt;\n&lt;p&gt;The Trust is an equal opportunity employer.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Informal enquires:&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Prospective candidates are invited to contact Dr Mark Halling-Brown (Tel:01483 571122 x 6876) or Dr Lucy Warren (Tel: 01483 571122 x 2487, email lucy.warren@nhs.net) for informal discussion.&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120970.jpg", "name": "Royal Surrey NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120970"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Guildford, Surrey", "postalCode": "GU2 7XX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.241", "longitude": "-.607442"}}, "title": "Computer Scientist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250796", "validThrough": "2020-11-27T23:59:59+0000"}