{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "18702", "minValue": "17460", "unitText": "YEAR", "value": "£17,460 to £18,702 Per Annum Pro Rata"}}, "datePosted": "2020-11-06T16:33:25+0000", "description": "&lt;p&gt;&lt;strong&gt;This job advert will close as soon as sufficient applications have been received. Please apply for this job as soon as you can, if interested in the role.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;East Cheshire NHS Trust is looking to recruit enthusiastic, self motivated and compassionate people to work on our hospital bank.&lt;/p&gt;\n&lt;p&gt;Our bank service aims to supply appropriately skilled staff to cover temporary shortages across the organisation. Joining the bank provides an excellent opportunity for those who wish to gain insight and experience into diverse areas and specialities while providing you with the flexibility to choose your own working hours with the option of Weekly pay. It can also provide the opportunity to gain experience with the trust as a precursor to permanent employment.&lt;/p&gt;\n&lt;p&gt;We are looking for kind, caring and compassionate people who share our values. Successful applicants will have excellent communication skills and be committed to assisting in the delivery of high quality patient care using the 6C&#39;s approach. Capable of working in a busy, challenging and rewarding environment, you will maintain a high degree of confidentiality and be able to work to deadlines, both individually and as part of the wider team.&lt;/p&gt;\n&lt;p&gt;The role of a bank health care assistant includes providing a high standard of care by attending to aspects of patient personal hygiene, maintaining patient tissue integrity and providing pressure area care, recording of observations, liaising with the patient’s families and the general public and supporting your colleagues in providing a positive experience for the patient. Please read the attached ‘day in the life of a health care assistant&#39; for further information.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Health Care Assistant Induction and Training&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;When you join East Cheshire NHS Trust as a Health Care Assistant (HCA) you will take part in an Induction programme that will support you in developing the skills and knowledge required to deliver safe and compassionate care to our patients. Our Corporate induction and core clinical statutory and mandatory day will introduce you to our organisation and our values and behaviours.&lt;/p&gt;\n&lt;p&gt;East Cheshire NHS Trust strongly believes in investing in the training and education of its workforce to support the delivery of the high standard of care expected by our patients. In order to achieve this all HCA’s are required to attend a clinical statutory and mandatory training day, complete allocated e-learning modules as well as attend our three day Be AWARE to Care Course, which incorporates the nationally accredited AWARE course.&lt;/p&gt;\n&lt;p&gt;Consolidation of the skills and knowledge acquired from attending this training programme, together with the support of Trust colleagues from various departments will help you to complete the nationally recognised Care Certificate over a six month period.&lt;/p&gt;\n&lt;p&gt;Please access the skills for care website for more details on this training by going to the Standards section, and then click into the Care Certificate link. Alternatively this link is available within the attached HCA information sheet under the Additional Documentation section.&lt;/p&gt;\n&lt;p&gt;To discuss this opportunity further, or to enquire about the nature of bank work, please contact Jill Marshall or the Central Staffing Team using the contact details given.&lt;/p&gt;\n&lt;p&gt;This post is Bank&lt;/p&gt;\n&lt;p&gt;Hours per week: Zero&lt;/p&gt;\n&lt;p&gt;Closing date: &lt;strong&gt;22nd November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Value based recruitment exercise&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;East Cheshire NHS Trust is looking for staff who share the NHS Values or believe in the quality of patient care. To find out if your values are aligned to the values of the Trust we recommend you undertake a short value based exercise - please see the additional information document&lt;/p&gt;\n&lt;p&gt;**Please be aware that this post requires an Enhanced Disclosure and Barring Service (DBS) check, at a cost of £47 of which is payable by the successful candidate**&lt;/p&gt;\n&lt;p&gt;If you have lived or worked abroad for 6 months or more in the last 5 years you will need to obtain an overseas police clearance. Further information can be found on the additional information links at the bottom of the advert.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;To keep up to date with all of our latest Recruitment activity here at East Cheshire NHS Trust, take a look at our Facebook and Twitter pages, links to which can be found on the right hand side:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Visit our Facebook page: Careers at East Cheshire NHS Trust&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Follow us on Twitter: @CareersECT&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121085.jpg", "name": "East Cheshire NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121085"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Macclesfield District General Hospital, Victoria Road, Macclesfield, Cheshire", "postalCode": "SK10 3BL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.2623", "longitude": "-2.14158"}}, "title": "Bank Health Care Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916260638", "validThrough": "2020-11-22T23:59:59+0000"}