{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "pro rata"}}, "datePosted": "2020-11-03T11:16:23+0000", "description": "&lt;p&gt;&lt;strong&gt;BE A REMARKABLE PERSON &lt;br /&gt; IN AN EXTRAORDINARY PLACE&lt;/strong&gt;&lt;br /&gt; &lt;br /&gt; Hull University Teaching Hospitals is seeking an exceptional individual for the role of Director of Governance and Corporate Affairs … and what a unique time it is to join us! &lt;/p&gt;\n&lt;p&gt;Covid-19 has presented many challenges but our hospital team has remained resolute in our commitment and desire to provide safe and quality care to the people of Hull and East Riding. &lt;/p&gt;\n&lt;p&gt;We are now looking for a Remarkable Person to join our Extraordinary Place at this unprecedented time. We are looking for a Director to join us who is driven, innovative, responsive and can provide outstanding leadership and direction to the Governance and Corporate Affairs directorate.&lt;/p&gt;\n&lt;p&gt;Applicants will require exceptional leadership qualities, a commercial acumen, strong relationship management skills, and a strong business understanding and credibility. You will be passionate about improvement and influencing change; a natural leader who will facilitate and support collaborative working both internally and externally to the trust,  ensuring the delivery of high quality patient care.&lt;/p&gt;\n&lt;p&gt;Working closely with the Chief Medical Officer and Chief Nurse, you will lead the development, implementation and maintenance of trust wide systems and processes that place patient quality at the core of trust practice and business. You will also ensure that the trust has appropriate policies and systems to deliver sound corporate governance to enable it to comply with its obligations, and to manage risk effectively.&lt;/p&gt;\n&lt;p&gt;Working as part of the Executive Management Team, you will be capable of leading and supporting the delivery of major policy implementation and service developments, enabling strategies, policies and business plans to deliver the objectives of the trust. Key to this will be the Quality Strategy, and supporting the Trust Board in meeting its obligations to ensure ongoing compliance with the legislative and regulatory framework.&lt;/p&gt;\n&lt;p&gt;You will support the Chief Executive in fulfilling their Accountable Officer responsibilities with respect to good governance and in maintaining the highest standards of prudence, propriety and regularity, and will also act as Company Secretary.&lt;/p&gt;\n&lt;p&gt;As an employer, we aim to make it easy for our people to do their best work with us. We want everyone to be a shining example of a happy, healthy, high performing workplace. All in the  middle of a great region to live, work, and unwind.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;If you believe you can lead, shape and enhance what we do, we would really like to hear from you.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Be a part of it, you’ll love it. We PROMISE. &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further information about Hull University Teaching Hospitals NHS Trust including a copy of the Trust’s annual report and financial statements, please visit our website &lt;br /&gt;&lt;/p&gt;\nFor further details and informal visits please contact our Chief Executive, Chris Long by telephone on 01482 675783. ", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121128.jpg", "name": "Hull University Teaching Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121128"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hull Royal Infirmary, Hull", "postalCode": "HU3 2JZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7444", "longitude": "-.358277"}}, "title": "Director of Governance and Corporate Affairs", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253672", "validThrough": "2020-11-17T23:59:59+0000"}