{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 to £44,503 pa"}}, "datePosted": "2020-10-23T14:00:15+0100", "description": "&lt;p&gt;&lt;strong&gt;Hampshire Primary Care Psychological Therapy Service – italk Step 3&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;strong&gt;Senior Psychological Therapist &lt;strong&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/strong&gt;&lt;/strong&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;italk is an exciting, transformative and expanding psychological therapies service within which to work. We are commissioned by North Hampshire, West Hampshire, South East Hampshire and Fareham &amp; Gosport CCGs to deliver the IAPT services in these communities.&lt;/p&gt;\n&lt;p&gt;We are a strong partnership service; comprised of a collaboration between Southern Health NHS Foundation Trust and Solent Mind charity. We strive to deliver a high quality, evidence-based, patient-centred therapy service, to the population of Hampshire. We are looking to employ Psychological Therapists to deliver high quality therapeutic interventions to our local residents.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;italk is comprised of 3 ‘strands&lt;/p&gt;\n&lt;p&gt;1.         &lt;strong&gt;italk core&lt;/strong&gt;, delivers evidence based psychological therapeutic interventions for our local population in Hampshire.&lt;/p&gt;\n&lt;p&gt;2.         &lt;strong&gt;italk health&lt;/strong&gt;, italk work in collaboration with local health services including community respiratory, musculoskeletal, perinatal and diabetes teams.&lt;/p&gt;\n&lt;p&gt;3.         &lt;strong&gt;italk@work&lt;/strong&gt;, offers a range of services to enable organisations and industries to support the emotional wellbeing of their employees.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are dedicated to delivering superb quality assessment and evidence-based interventions, with the patient always at the heart of our offer.  The range of psychologically focused therapies we deliver include: &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Step 2: Guided self-help, Psycho-education groups, (guided/unguided) computerised CBT&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Step 3: Cognitive Behavioural Therapy (CBT), Interpersonal Therapy (IPT), Mindfulness Based Cognitive Therapy (MBCT), Cognitive Analytic Therapy (CAT), Compassion Focused Therapy (CFT), Comprehend, Cope and Connect (CCC), Eye Movement Desensitisation and Reprocessing (EMDR) and Couples Therapy.  These therapies are delivered through a stepped care service model and italk operate as an established Improving Access to Psychological Therapies (IAPT) Service.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;At italk, patients are at the heart of what we do. We are a passionate and supportive team, dedicated to improving mental health in our local communities. &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Our service delivers a stepped care IAPT model as a partnership, with Solent Mind providing Step 2 interventions and SHFT delivering treatments at Step 3. Together, we enable over 1,500 patients each month to feel like themselves again.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Our Step 2 work includes outreach to ensure our local communities know we’re here for them when they need us, psychoeducational groups and workshops to equip patients with healthy coping skills, and guided self-help to empower patients to achieve their recovery goals independently.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Our Step 3 team enable patients to recover from common mental health conditions, using evidence-based treatments tailored to the individual needs and recovery goals of our patients. Our therapists practice Cognitive Behavioural Therapy (CBT) Interpersonal Therapy (IPT), Cognitive Analytic Therapy (CAT), Couples Therapy for Depression, Mindfulness Based Cognitive Therapy (MBCT) and Comprehend, Cope and Connect in individual and group settings.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Our therapists have opportunities to pursue their professional specialisms through programmes like our Long-Term Conditions pathways, work with the Ministry of Defence, Primary Care Networks, and co-facilitated groups with Health Visitors for new mothers experiencing postnatal mental health conditions.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Does this sound like a service you could strengthen and thrive in?&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;If so, italk has vacancies for Senior Psychological Therapists to be involved in the South West Cluster which comprises of Eastleigh, Romsey, Southern Parishes and the New Forest.&lt;/p&gt;\n&lt;p&gt;As a Senior Psychological Therapist, you will be part of our friendly and dynamic team, receiving support through regular clinical supervision and access to frequent skills development opportunities.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The ideal candidate will share our values of innovation, teamwork and outstanding patient care, plus evidence of a qualification in CBT and may also be trained in additional therapy modality such as CAT, IPT, MBCT or Couples Therapy.&lt;/p&gt;\n&lt;p&gt;Working as part of the senior team, you will support junior colleagues to reflect on their practice and develop their skills through clinical supervision on a regular basis.&lt;/p&gt;\n&lt;p&gt;Applicants should be familiar with the values of the NHS Constitution, and the visions of Southern Health; to improve patient and user experience, to improve outcomes for patients and carers, and finally, reducing our costs to ensure that we operate in the most efficient manner possible. &lt;/p&gt;\n&lt;p&gt;If you would like to find out more about these posts please contact:&lt;/p&gt;\n&lt;p&gt;Natalie Brown-Kennedy (Clinical Manager, South West Hampshire): nat.brown@nhs.net /07500991945&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;span&gt;Vicky Hammond (Clinical Manager, South West Hampshire): &lt;/span&gt;&lt;/span&gt;vicky.hammond@nhs.net/&lt;span&gt;07768293310&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interviews will take place week commencing 23 November 2020. Interview dates may be flexible/held remotely dependent on COVID-19 government restrictions in place at the time.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Southern Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120646"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Eastleigh", "postalCode": "SO50 9FH"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.97", "longitude": "-1.35236"}}, "title": "Senior Psychological Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240818", "validThrough": "2020-11-08T23:59:59+0000"}