{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 per annum"}}, "datePosted": "2020-10-23T11:31:27+0100", "description": "&lt;p&gt;We’re looking for an enthusiastic Communications and Marketing Assistant who can help deliver a range of targeted communications, ensuring our channels are a source of timely, accurate and relevant information for our audiences.&lt;/p&gt;\n&lt;p&gt;You’ll work primarily in the Internal Communications and Engagement team, but also provide support to the wider team including our Marketing and Events team and Media and Campaigns team.&lt;/p&gt;\n&lt;p&gt;You’ll provide support to the Internal Communications and Engagement Officers to collate and schedule content for our internal channels including the intranet and on-line collaboration tools such as Yammer, support with events (currently these are virtual events), and provide support for internal campaigns.&lt;/p&gt;\n&lt;p&gt;You should be comfortable using technology such as Office 365 including Sharepoint, Teams and Yammer.&lt;/p&gt;\n&lt;p&gt;You’ll also work with our Creative Designers to develop content including graphics, video, audio, podcasts for internal and external projects, campaigns and initiatives.&lt;/p&gt;\n&lt;p&gt;You’ll have excellent communication, administrative and organisational skills, enjoy creative, challenging work and be able to progress multiple tasks in a busy environment so good time management skills are a must.&lt;/p&gt;\n&lt;p&gt;A positive outlook and attitude are essential as well as being keen to try out new ideas. As the team is currently working remotely, we&#39;re looking for someone who is flexible and enthusiastic.&lt;/p&gt;\n&lt;p&gt;For an informal conversation about the post please contact Sharron Hodson, Internal Communications and Engagement Manager - 07776 680618 / sharron.hodson@nhs.net.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NHS Business Services Authority", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121052"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Stella House, Newcastle upon Tyne", "postalCode": "NE15 8NY"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.9689", "longitude": "-1.71259"}}, "title": "Communications and Marketing Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240336", "validThrough": "2020-11-08T23:59:59+0000"}