{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "82096", "minValue": "51069", "unitText": "YEAR", "value": "£82,096 £32,478-£51,069"}}, "datePosted": "2020-11-02T10:46:12+0000", "description": "&lt;p&gt;&lt;strong&gt;Job Summary: &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are seeking an enthusiastic physician to join our team of Acute Physicians to participate in the on-going development and evolution of our Acute Medicine Unit (AMU) and to play a key role in the management of emergency admissions. With this new appointment we expect to be fully compliant with the London Quality Standards.&lt;/p&gt;\n&lt;p&gt;These posts have been developed in order to be able to deliver a sustainable model of acute care. The London Quality Standards recognise the importance of a dedicated Acute Physician team leading acute care. These posts present an excellent opportunity for a clinician, with experience and considerable understanding of all aspects of acute medicine with or without a specialist interest, to join a team dynamic team of physicians committed to the delivery of the highest standard of patient care. This individual will be expected to contribute to the ongoing development of the clinical interface with both Primary Care and the Emergency Department at St George’s&lt;/p&gt;\n&lt;p&gt;The Acute Medicine Directorate has continually evolved in recent years in order to meet the demand for acute care. This has increased consultant input within the initial 24-48 hours following admission. These posts are pivotal to the assessment and management of acutely unwell adult patients. We are also striving to continually improve geriatric services which most recently has seen integration across the acute and community based teams&lt;/p&gt;\n&lt;p&gt;The current job plan has been designed to provide a sustainable post in Acute Medicine and a complementary specialty. The job plan is designed on an annualised basis which allows some flexibility, which is particularly helpful in terms of participating in specialty work. There will be an expected commitment to all aspects of the service including; the acute medicine on call rota, physician of the week rota, ambulatory assessment area rota, weekend working and acute short stay unit&lt;/p&gt;\n&lt;p&gt;The appointee is expected to participate in undergraduate, postgraduate and multi-disciplinary education programmes and to play a full part in Clinical Governance.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Applicants wishing to discuss the post and to visit the department should contact:&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Dr Nicola Neary, Care Group Lead for Acute Medicine&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Secretary 020 8266 6092 nicola.neary@stgeorges.nhs.uk&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Once we have received a sufficient number of applications this post will close.&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "St George's University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121185"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St Georges Hospital Tooting, Tooting", "postalCode": "SW17 0QT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4267", "longitude": "-.175721"}}, "title": "Locum Consultant in Acute Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251653", "validThrough": "2020-11-16T23:59:59+0000"}