{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 to £44,503 pa"}}, "datePosted": "2020-10-27T22:00:12+0000", "description": "&lt;p&gt;As a key member of the Nursing Care Team within Blood Donation, the Regional Lead Nurse, plays an essential role in ensuring standards of nursing practice across Blood Donation through clearly defined and monitored benchmarks.&lt;/p&gt;\n&lt;p&gt;You will be responsible for ensuring established systems and processes are fit for purpose; identifying areas for improvement or redesign to promote best practice in relation to blood donation whilst ensuring product safety, regulatory compliance and professional standards are upheld.&lt;/p&gt;\n&lt;p&gt;As part of your role, you will also lead a regional team in the delivery of the training plan for clinical and non-clinical staff ensuring staff receive an effective and robust induction and training programme to enable them to meet and maintain competency.&lt;/p&gt;\n&lt;p&gt;You will also ensure access and availability to development and career opportunities for clinical and non-clinical staff to enable them to meet and maintain regulatory and professional standards and registration, and drive a reduction of adverse events across regional blood donation teams, in line with the NHSBT strategic plan.&lt;/p&gt;\n&lt;p&gt;Whilst you will be covering the East Region, your main focus will be essentially South of Thames ie. Kent/Surrey/Sussex.&lt;/p&gt;\n&lt;p&gt;For further information please contact Tracy Green, Regional Matron at tracy.green@nhsbt.nhs.uk or on 07823 351720&lt;/p&gt;\n&lt;p&gt;Closing date for applications is 23:59 hrs on 11 November 2020&lt;br /&gt; Interviews will be held online on 23 November 2020 (subject to confirmation)&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NHS Blood and Transplant (NHSBT)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120628"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Kent/Surrey/Sussex", "postalCode": "TN23 1EJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.1487", "longitude": ".855889"}}, "title": "Regional Lead Nurse (East)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245664", "validThrough": "2020-11-11T23:59:59+0000"}