{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 Per annum/Pro rata"}}, "datePosted": "2020-11-03T12:46:51+0000", "description": "&lt;p&gt;&lt;strong&gt;Successful candidates will be invited to an Assessment Day on Friday 18th Dec 2020 held at Bodmin. Please note this will be either a morning or afternoon session to be confirmed.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We have a recently opened new Mental Health Inpatient Ward in Longreach House, Redruth.&lt;/p&gt;\n&lt;p&gt;This ward is a 15 bedded unit with a multi-disciplinary team providing fast stream rehabilitation and recovery for patients in Cornwall. It provides an exciting opportunity to support our patients to receive high quality care in the County.&lt;/p&gt;\n&lt;p&gt;Cove Ward will provide care, treatment and support to any person experiencing mental illness following an admission. Facilities available include access to a gym, supported kitchen, activity space and a garden.&lt;/p&gt;\n&lt;p&gt;You could be part of this multi-disciplinary team, working to bring innovative, quality solutions to support people with mental health conditions. You could work with our specialist team to look for future models and service developments to change care across Cornwall and Isles of Scilly in line with the 5 year forward view.&lt;/p&gt;\n&lt;p&gt;We are looking for a highly motivated, hard working, enthusiastic people, who are passionate about making a difference, to work as Band 3 Healthcare Assistants alongside the Ward Manager and wider team in making this new ward in the west of Cornwall a success. Candidates will need to be able to demonstrate how they would work to provide a refreshed innovative, creative, dynamic and evidenced based service model within this environment.&lt;/p&gt;\n&lt;p&gt;Extra skills, such as exercise qualifications, outdoor pursuits and experience of running creative groups would be advantageous.&lt;/p&gt;\n&lt;p&gt;This is a full time post working 37.5 hours per week, both day and night shift working is required to fulfill this post.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameJoby PlantJob titleCove Ward ManagerEmail addressjoby.plant@nhs.netTelephone number01209 318 988Additional contact information&lt;/p&gt;\n&lt;p&gt;Joby Plant – Cove Ward Manager by emailing joby.plant@nhs.net or 01209 318 988.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120947.png", "name": "Cornwall Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120947"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Longreach, Redruth", "postalCode": "PL31 2QN"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.472", "longitude": "-4.74269"}}, "title": "Healthcare Assistant - Mental Health - Redruth - Band 3", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254044", "validThrough": "2020-11-22T23:59:59+0000"}