{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum Plus HCAS"}}, "datePosted": "2020-11-03T16:16:57+0000", "description": "&lt;p&gt;&lt;strong&gt;CAMHS Practitioner CYP-IAPT Trainee – Systemic Family Practice (SFP)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;One year fixed-term, full-time post&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Agenda for Change Band 5&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are recruiting a CAMHS Practitioner CYP-IAPT trainee in &lt;strong&gt;Systemic Family Practice&lt;/strong&gt; (SFP). This graduate level practitioner will be employed by Whittington Health NHS Trust to train for a one-year qualification in the Systemic Family Practice CYP-IAPT programme through Kings College London (KCL).&lt;/p&gt;\n&lt;p&gt;This training will equip the successful applicant with the skills and knowledge to work more effectively and confidently with children, adolescents and their families. You will be introduced to the core principles of CYP-IAPT practice, along with a range of systemic approaches to family based interventions, consistent with the SFP programme. Full details of this training can be found in the course brochure attached to this advert.&lt;/p&gt;\n&lt;p&gt;The postholder will be based in Islington CAMHS for at least 2.5-3 days of the week and use their newly-developed skills to see families, under supervision whilst attending the KCL training programme for the other days. The post-holder will work with families from diverse socio-economic and cultural backgrounds, using interpreters when necessary and should be committed to equal opportunities.&lt;/p&gt;\n&lt;p&gt;Islington CAMHS is an integrated multi-disciplinary service providing child and family mental health care to the population of Islington aged 0-18 years. The service provides a range of community based, multi-disciplinary interventions and specialist treatments and consultation to partnership agencies, and has been part of the CYP-IAPT initiative for many years. Our local Future in Mind Transformation Plan has been refreshed and we are recruiting to meet the aspirations of the new plan, including workforce development and early intervention.&lt;/p&gt;\n&lt;p&gt;The population we serve come from the 40,500 children and young people in Islington. 60% are from ethnic backgrounds other than White British, which accounts for the other 40%. One hundred and twenty different languages are spoken in the homes of Islington children. Islington is the fourth most deprived Local Authority in London and twelfth most deprived local authority in England. &lt;strong&gt;We are an equal opportunities employer and keen to grow a workforce that is reflective of the diverse communities we work with. We welcome applicants with insight and understanding of different cultures and backgrounds.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Applicants are invited who can demonstrate:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Normally a minimum of a second-class Bachelor’s degree from a UK university or equivalent in a relevant subject e.g. psychology, social work &lt;strong&gt;AND&lt;/strong&gt; a registerable professional qualification in a relevant subject (e.g. psychology, social work, counselling, nursing, occupational therapy) from a UK university or equivalent. Applications&lt;strong&gt; MAY &lt;/strong&gt;be considered from those with a relevant first degree who do not have a registerable professional training if they have at least 3 years experience in a CAMHS or equivalent setting.&lt;/li&gt;\n&lt;li&gt;Experience of working with children / young people in a mental health, social care or equivalent setting.&lt;/li&gt;\n&lt;li&gt;Experience and skills to engage with children and families presenting with a range of emotional and behavioural difficulties and tolerate emotionally distressing situations.&lt;/li&gt;\n&lt;li&gt;An interest in Systemic Family Practice and motivation to learn and be challenged&lt;/li&gt;\n&lt;li&gt;Knowledge and understanding of issues relating to safeguarding children and young people&lt;/li&gt;\n&lt;li&gt;Capability to complete academic work at postgraduate diploma level, including IELTS or equivalent to the appropriate level for students with English as a foreign language (BAND D).&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Please also note the important information below .&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;When you apply to this role, your name will be shared with the Higher Education Institute running the course. This is an integral part of the process to confirm that you have applied and that you meet the University requirements. Please apply to the University at the same time as applying to this job position.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Candidates will need to be in post and ready to begin training at KCL in January 2021. Applicants will only be considered if they can meet this timescale.&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;The post-holder will undertake Postgraduate Certificate level training at KCL alongside their work in Islington CAMHS. Applicants will only be considered if they are eligible for this course.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Shortlisted Candidates should have completed an application to KCL for a place on the SFP course, before they attend the interview&lt;/strong&gt;. &lt;strong&gt;See university guidance attached&lt;/strong&gt;.&lt;/li&gt;\n&lt;li&gt;Applications will not be considered from applicants who are formally registered (or re-sitting examinations) for another concurrent programme of study at KCL or any other Higher Education Institution.&lt;/li&gt;\n&lt;li&gt;Due to Health Education England funding requirements, former CWP and EMHP trainees who graduated after January 2019 are not eligible for this role.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameMarie McBrideJob titleFamily &amp; Systemic Psychotherapist /Team ManagerEmail addressmariemcbride@nhs.netTelephone number0203 316 1824&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121035.JPG", "name": "Whittington Health", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121035"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Northern Health Centre, London", "postalCode": "N7 6LB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.561", "longitude": "-.123609"}}, "title": "CAMHS Practitioner CYP-IAPT Therapy in Systemic Family Practice (SFP)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254770", "validThrough": "2020-11-08T23:59:59+0000"}