{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum plus Outer HCAS"}}, "datePosted": "2020-11-05T09:48:22+0000", "description": "&lt;p&gt;NHS South West London Clinical Commissioning Group (CCG) is responsible for planning, commissioning and buying health services for people living and working in South West London. We were formed on the 1st April 2020 through the merger of six borough CCGs. As a CCG, we are a membership organisation made up of over 180 GP practices within South West London. We serve just under 1.5 million people across our six diverse boroughs: Croydon, Kingston, Merton, Richmond, Sutton and Wandsworth.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;It is our job to make sure that the people of South West London benefit from convenient and high quality healthcare services whenever they are needed – whether this is advice from a pharmacist or GP, a procedure in hospital, help at home through local community services, or if you need support with your mental health.&lt;/p&gt;\n&lt;p&gt;As a member of the SWL CCG Performance team, this post will support the design and implementation of the performance management framework that will assist in the delivery of national and local targets. Using their expert knowledge and experience in data management and manipulation, the post holder will be responsible for delivering high quality performance reports on a monthly basis and leading on gathering system intelligence to support decision making. In addition, the post holder will lead on the development of performance reporting tools in line with NHSE and Department of Health guidance.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The post holder must be able to use their own initiative to decide on actions and make recommendations to the Performance team members, with the aim of improving deliverables and value for money. This will involve making decisions on difficult issues and working to tight and often changing timescales. A proactive approach will be required to ensure horizon scanning, performance improvement and delivery of actions to agreed timescales across South West London.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NHS South West London CCG", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128178"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Across the SWL patch and working from home", "postalCode": "SW19 1RH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4196", "longitude": "-.200973"}}, "title": "Senior Performance Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257117", "validThrough": "2020-11-19T23:59:59+0000"}