{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-10-29T17:30:20+0000", "description": "&lt;p&gt;&lt;span&gt;&lt;span&gt;An exciting opportunity has arisen for an experienced and enthusiastic Band 6 Senior Nurse Practitioner to join our secondary care multi-disciplinary Recovery Team (CMHT) in the Borough of Halton, which includes the towns of Runcorn and Widnes in the picturesque county of Cheshire. The area has excellent transport links to all major road and rail networks and is within easy reach of the major cities of Liverpool, Manchester and Chester, whilst also being close to North Wales and the Peak District.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Nurses are valued members of the multi-disciplinary team which also includes Medics, Psychologists, Social Workers and OT’s and they offer specialist assessment, care planning, risk assessment, individual and group interventions and provide the role of Care Coordinator.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;We are an established integrated team specialising in supporting service users with severe and enduring mental illness through a recovery based model.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;This is a full time opportunity working Monday to Friday between 9am and 5pm, except Bank Holidays.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;The role would involve, Care Coordination, Supervising and Supporting Junior staff and student nurses, as well as providing and promoting the development of specialist approaches for highly complex service users including those with a Personality Disorder, Psychosis, Dual Diagnosis and Depression. The post-holder will be clinically supported and supervised by the MDT and will be offered opportunities to enhance and develop their skills through both in-house and external training.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;IMPORTANT &lt;/span&gt;&lt;/strong&gt;&lt;span&gt;The ability, means and willingness to travel between multiple sites in the course of performing duties is essential in this post. The role will involve regular travel across multiple sites in the North West Boroughs Healthcare NHS Foundation Trust catchment area. Therefore, the post holder must be able to meet the travel requirements of this post. Please indicate on your application how you meet this requirement.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The successful candidate must have the ability to communicate in a variety of settings where they can work effectively with multi-disciplinary teams and professionals from similar backgrounds as well as clients and their families / carers. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will benefit from:&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;• A friendly and supportive working environment&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;• Managerial supervision and Professional Development opportunities&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;• Opportunities for both internal and external training You will need to be registered with the Nursing and Midwifery Council or equivalent specialist social work qualification and have a proven track record of Continuous Professional Development.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This post is subject to &lt;strong&gt;&lt;span&gt;an enhanced with adult barred list &lt;/span&gt;&lt;/strong&gt;Disclosure and Barring Service (DBS) Check. Successful candidates will either have a valid DBS check with the Trust or will be required to pay for the cost of the DBS Disclosure which is £47.50 for an enhanced disclosure, the cost of which will be deducted from first salary.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Martyn Veevers&lt;/p&gt;\n&lt;p&gt;martyn.veevers@nwbh.nhs.uk&lt;/p&gt;\n&lt;p&gt;01928 753968&lt;/p&gt;\n&lt;p&gt;Laura Spooner Clinical Lead - laura.spooner@nwbh.nhs.uk&lt;/p&gt;\n&lt;p&gt;Katie Cole Deputy Manager - katie.cole@nwbh.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120746.jpg", "name": "North West Boroughs Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120746"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St Johns/Brooker Centre, Widnes/Runcorn", "postalCode": "WA7 2DA"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3233", "longitude": "-2.69459"}}, "title": "Senior Mental Health Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249231", "validThrough": "2020-11-12T23:59:59+0000"}