{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-11-05T13:01:39+0000", "description": "&lt;p&gt;We are a large, welcoming team of pharmacy staff who invite you to join our pharmacy family.&lt;br /&gt;Any hard-working, motivated and enthusiastic pharmacists will be a great addition, and easily fit in to our pharmacy team to join of 19 band 6 pharmacists!&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;The opportunities for newly qualified pharmacists or any pharmacists looking for a new challenge are vast at East Kent. The programme provided by the trust offers an extensive and varied development plan laid out to all pharmacist in advance. Rotations that are provided include: Paediatrics, Acute Medicine, Antimicrobial, Medicines Information, Clinical Governance, Renal Services, Stroke, and General Surgery and a rotation to the Kent and Medway Mental health Trust.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Further to this, all band 6 pharmacists are provided with a rotational role across our 3 largest hospital sites to experience these specialities in different working environments.&lt;br /&gt;Alongside the extensive training received in-house, enrolling on to the clinical diploma course will also be encouraged. This training will be heavily supported by a network of educational supervisors, practice supervisors and experienced pharmacists and technicians that will all be available to you.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;The overall pharmacy service at East Kent is highly clinically based – As a band 6 pharmacist, you will be solely responsible for the day to day running of an allocated ward representative of your current rotation speciality-but at the same time have constant support from a specialist pharmacist. This provides opportunities to participate in ward rounds and become an integral member of the multi-disciplinary team. You may also be assisted on the ward by one of our highly trained clinical technicians, or clinical pharmacy assistants.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameRebecca MorganJob titleLead Clinical Services PharmacistEmail addressrebecca.morgan15@nhs.netTelephone number07973946586&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "East Kent Hospitals University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121462"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "East Kent Hospitals University NHS Foundation Trust, Trustwide", "postalCode": "CT1 3NG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2666", "longitude": "1.08711"}}, "title": "Foundation Pharmacist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257768", "validThrough": "2020-11-19T23:59:59+0000"}