{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Dependent on experience"}}, "datePosted": "2020-10-27T15:19:47+0000", "description": "&lt;p&gt;Poole Central Primary Care Network is a group of 6 GP Practices in Poole, Dorset, covering a population of approximately 64,000. The practices work cohesively to develop local based services to support the needs of the population we serve. &lt;/p&gt;\n&lt;p&gt;Within the PCN we already have an established Enhanced Care Team, which includes nurses, paramedics, clinical pharmacists and administrative roles. This versatile team deliver proactive care for frail patients and those with complex needs and work in close collaboration with the other local services.&lt;/p&gt;\n&lt;p&gt; The PCN is expanding its service provision and as such is seeking an Operations Manager to support the day to day operational administration.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The role; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for an enthusiastic, organised and self-motivated person with excellent communication, HR, organisational and IT skills who enjoys working in a busy team environment. The role will involve operational and organisational management to ensure effective delivery of all PCN services under the direction of the PCN Management Team.  The successful candidate would have previous experience in operational management, HR, IT and finance, preferably within a General Practice or Healthcare setting. However, we will consider applicants from other fields. Knowledge and application of SystmOne is desirable but not essential.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further information please contact;&lt;/p&gt;\n&lt;p&gt; Rachel McCready, PCN Business Manager rachel.mccready@dorsetgp.nhs.uk  or Laura Evans laura.evans@dorsetgp.nhs.uk&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "The Adam Practice", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130115"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Poole", "postalCode": "BH15 4JQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7209", "longitude": "-2.01054"}}, "title": "Operations Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245173", "validThrough": "2020-11-15T23:59:59+0000"}