{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum"}}, "datePosted": "2020-11-03T10:16:57+0000", "description": "&lt;p&gt;As one of the largest acute Trusts in the UK – and with more than 20,000 employees – Manchester University NHS Foundation Trust (MFT) is on an exciting mission to deliver high-quality care to the people of Manchester, Trafford and beyond. Our vision is to create and deliver a seamless 24/7 service that extends beyond excellent care within our nine hospitals and community services within our Local Care Organisations.&lt;/p&gt;\n&lt;p&gt;You will provide strategic and operational clinical support to the estates and facilities teams following the disaggregation of NCA group wide roles.&lt;/p&gt;\n&lt;p&gt;You will work with the Estates and Facilities (E&amp;F) team the post holder and play a key role in developing a partnership relationship between the clinical teams and the Estates and Facilities managers and team leaders, identifying potential problems and finding solutions; specifically related to patient environment, nutrition, hydration and the personalised patient dining experience.&lt;/p&gt;\n&lt;p&gt;You will be an effective communicator and an excellent team worker.&lt;/p&gt;\n&lt;p&gt;You will provide clinical and professional leadership. Reporting to the Head of Facilities to ensure the key functions of the Estates and Facilities Matron are undertaken on behalf of the Hospital and in partnership with the Estates and Facilities Team. Professionally accountable to the Assistant Chief Nurse&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Manchester University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121137"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "North Manchester General Hospital, Manchester", "postalCode": "M8 5RB"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5179", "longitude": "-2.22948"}}, "title": "Estates and Facilities Matron", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253410", "validThrough": "2020-11-18T23:59:59+0000"}