{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 to £51,668 pa/pr"}}, "datePosted": "2020-10-27T13:00:31+0000", "description": "&lt;p&gt;&lt;strong&gt;Band 8a - Advanced Nurse Practitioner – Frailty - Bank&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Jean Bishop Integrated Care Centre, Frailty Support team (ICC-FST) has been operational since May 2018,and in that time provided innovative, anticipatory patient tailored care to frail residents of Hull and the surrounding areas, including those residing in care homes . The ICC-FST has already been recognized for national awards and continues to receive outstanding patient feedback. The ICC-FST also featured on NHS England’s website dedicated to the NHS Long Term Plan as the leading case study in the Ageing Well section. The team working at the ICC-FST feel privilege to be a part of delivering transformed care for older people in Hull.&lt;/p&gt;\n&lt;p&gt;During the pandemic, the service re-operationised to provide a re-active advice and guidance telephone service to the wider healthcare system including support to care homes. Having now re-commenced previous pro-active services the ICC-FST has continued to operate the advice and guidance line model. As a team, we also provide medical support to several community bedded units, used as a step up/down facility to support hospital admission prevents and also the discharge to assess model (D2A)&lt;/p&gt;\n&lt;p&gt;This is an amazing varied opportunity for an independent prescriber with advanced practice qualifications who is passionate about caring for older and frail patients, who also has the drive to help further develop a high profile service care within the community.&lt;/p&gt;\n&lt;p&gt;In this role you will work as an expert autonomous practitioner across all work-streams supported by the ICC-FST; assessing and pro-actively planning the care and treatment of older people and those with frailty, working closely with the multi-disciplinary team and community services to ensure patients receive holistic and comprehensive care and support. You will need to possess the necessary skills to deliver services to patients with a wide range of complex clinical needs. In particular, experience of working with patients suffering long term conditions would be advantageous&lt;/p&gt;\n&lt;p&gt;The abilities to communicate professionally and effectively whilst in a caring manner with patients and their carers together with experience of working within a multi-disciplinary team are also essential, as is working experience/knowledge of local pathways and referral procedures.&lt;/p&gt;\n&lt;p&gt;If you require any further information of wish the opportunity for an informal visit to the ICC please contact Tracey Woodrow Operations Manager:- tracey.woodrow@nhs.net&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/124994.jpg", "name": "City Health Care Partnership CIC", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=124994"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Jean Bishop Integrated Care Centre", "postalCode": "HU3 4AE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7302", "longitude": "-.374505"}}, "title": "Advanced Nurse Practitioner Frailty", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244632", "validThrough": "2020-11-08T23:59:59+0000"}