{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum pro rata"}}, "datePosted": "2020-10-05T13:53:02+0100", "description": "&lt;p&gt;Are you looking for a leadership opportunity? Are you a B6 Nurse Specialist Community looking for a new challenge or an experienced Community Nurse looking for the next step in your career pathway?&lt;/p&gt;\n&lt;p&gt;This is a Full Time Fixed term Contract for 1 Year to support the leadership of a large team of Community Nurses working alongside another Band 6 Nurse Specialist Community. The team are based in a city practice covering a wide geographical area delivering nursing care to patients in their home setting.&lt;/p&gt;\n&lt;p&gt;The postholder will offer direction, leadership and professional supervision to unregistered and registered community nursing staff in the team. Working with support and direction from a Community Nurse Team Manager and using leadership skills and knowledge you will be resonsible for the caseload. You will require the knowledge and skills to assess, implement and evaluate nursing care for patients with complex health care needs. Monitoring and maintaining standards of care for all those on the caseload will be an essential part of your role as well as supporting the team to enable patients to maximise their independence and optimise their quality of life whilst remaining at home or their preferred place of care and reducing the risk of admission to hospital.&lt;/p&gt;\n&lt;p&gt;This is an exciting time in community nursing with the introduction of a new electronic patient record across the RDE Trust, this will allow new ways of working and promote innovation and improved communication for Health and Social Care Teams. As a B6 Nurse Specialist Community you would lead and support the team in the implementation of this system and it’s daily use to enhance patient care.&lt;/p&gt;\n&lt;p&gt;The successful candidate would be expected to be educated to degree level, provide evidence of Continual Professional Development and have a teaching/assessing qualification or equivalent experience. Part of the role would be as a Practice Assessor or Supervisor to Student Nurses/Trainee Assistant Practioners and Associate Nurses. Having the Specialist Practitoner Qualification and leadership qualifications relevant to community nursing would be desirable however we do offer this as part of continuous professional developemnt.&lt;/p&gt;\n&lt;p&gt;(This is a fixed term contract for 12 months. For current NHS Employees this post could be a secondment opportunity)&lt;/p&gt;\n&lt;p&gt;Our vision is to provide safe, high quality seamless services delivered with courtesy and respect. To achieve our vision we expect all our staff to uphold our Trust values. Our Trust values are: &lt;br /&gt; Honesty, Openness &amp; Integrity&lt;br /&gt; Fairness&lt;br /&gt; Inclusion &amp; Collaboration&lt;br /&gt; Respect &amp; Dignity&lt;/p&gt;\n&lt;p&gt;***Preference will be given to staff with ‘Priority’ and &#39;At Risk&#39; status including NHS At Risk staff throughout Devon.***&lt;/p&gt;\n&lt;p&gt;DUE TO THE ANTICIPATED HIGH NUMBER OF APPLICATIONS FOR THIS POST WE RESERVE THE RIGHT TO CLOSE THE VACANCY BEFORE THE CLOSING DATE.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121044.jpg", "name": "Royal Devon and Exeter NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121044"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Exeter", "postalCode": "EX1 1SR"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7234", "longitude": "-3.52041"}}, "title": "Community Nurse Specialist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916212998", "validThrough": "2020-11-15T23:59:59+0000"}