{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890000", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 Band 6 - £30,401 - £37,267"}}, "datePosted": "2020-11-02T09:31:00+0000", "description": "&lt;p&gt;Sussex Partnership is offering an exciting opportunity for a special person to join us as a Band 6 Primary Mental Health Worker in our Ashurst team. You will have a core qualification such as nursing, social work, OT , teaching and a sound knowledge of mental health difficulties in children and young people and their families. The successful applicant will join a well-established team of highly skilled and motivated clinicians and are looking for someone with passion, enthusiasm and commitment to join them.&lt;/p&gt;\n&lt;p&gt;As part of this role, the post holder will work within the Single Point of Access Service where all new referrals are received into the service. This is a key role within the wider CAMHS service. You will be able to deliver a set of special skills. You will require a high level of skill in assessing new referrals, collating information, undertaking telephone assessments, liaising with families and professionals and developing comprehensive care plans and risk safety plans.&lt;/p&gt;\n&lt;p&gt;You will need to be able to make theoretically and clinically informed decisions. You will be able to provide a timely response, often managing a high level of emotional need. The work is busy and challenging but rewarding and offers a very good learning environment. You will have opportunities to develop therapeutic skills in evidenced based direct work and group work intervention to young people and families. The appointed member of staff will also have the opportunity to participate in some consultation and training to external agencies, as well as public events hosted by CAMHS.&lt;/p&gt;\n&lt;p&gt;The service is entering into a period of new development within the service as we look to expand our work into schools and offers an exciting opportunity to be involved in service development. As a Trust, we recognise the impact of the nature of our work and are committed to staff well-being, providing activities that promote the positive health of our staff, such as arts projects and staff development. We are committed to regular line management and supervision.&lt;/p&gt;\n&lt;p&gt;The post holder will require a high degree of professional autonomy and self-management, and will be required to account for their professional practice through appraisal, professional registration and validation and audit. As a trust we are committed to developing skills and therapeutic interventions and use a wide variety of evidence-based therapy approaches with children and young people. There will be opportunities for further professional development within the service. All staff receive regular clinical supervision, access to a variety of CPD sessions with Clinical Leads, clinical and caseload discussions with senior colleagues.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameJennifer SlinnJob titleNorth and West Hants Early help Service ManagerTelephone number0300 304 0050 option 1 or 2Additional contact information&lt;/p&gt;\n&lt;p&gt;Jenny Slinn&lt;/p&gt;\n&lt;p&gt;Early Help Service Manager&lt;/p&gt;\n&lt;p&gt;0300 304 0050 option 1 or 2&lt;/p&gt;\n&lt;p&gt;or&lt;/p&gt;\n&lt;p&gt;Lynne Gardiner&lt;/p&gt;\n&lt;p&gt;West Primary Mental Health Worker team lead&lt;/p&gt;\n&lt;p&gt;Tel 02380 743030&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121074.jpg", "name": "Sussex Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121074"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Advertiser House, Andover", "postalCode": "SP10 2PE"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2061", "longitude": "-1.47527"}}, "title": "Primary Mental Health Worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251406", "validThrough": "2020-11-16T23:59:59+0000"}