{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19500", "minValue": "19500", "unitText": "YEAR", "value": "19500"}}, "datePosted": "2020-10-27T13:21:18+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;em&gt;“I have had many job roles in my past from driving a wagon to retail, being a Screener really is the best job I have ever had. It doesn’t matter what you did in the past as full training is given from day one. I like most people thought I really wouldn’t be able to do it, but after about 4 weeks I got it, you really do not need to come from a medical background.”&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Screener/Grader for InHealth Intelligence - Testimonial&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Thanks for your initial interest in becoming a Retinal Screener, we appreciate that not many people know what a Retinal Screener is, but hopefully throughout your application process you’ll have a better understanding.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;So, what is Retinal Screening? Some people with diabetes develop serious complications with their eyes, called diabetic retinopathy. If they don’t get this treated properly, it can lead to sight loss. Diabetic eye screening is a test to check for eye problems caused by diabetes. The eye screening test can find eye problems before sight is affected. Pictures are taken of the back of the eyes to check for any changes.&lt;/p&gt;\n&lt;p&gt;Who are InHealth Intelligence? InHealth Intelligence has been and continues to be a proud supporter of the Diabetic Eye Screening Programmes across NHS England and since 2011, InHealth Intelligence has grown to offer fully managed services across the country. To increase efficiency, we also built our own software system which enables us to adapt and change to meet the requirements our employees to achieve a better user experience.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;strong&gt;Who we are looking for?&lt;br /&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Compassionate individuals who are empathetic towards the requirements of each individual patient&lt;/li&gt;\n&lt;li&gt;Someone who is happy to travel to our screening services in Central London, Hammersmith &amp; Fulham however, some travel to North West London maybe expected&lt;/li&gt;\n&lt;li&gt;Although we will provide full training, we are looking for individuals who are able to take detailed/up close pictures of the eye and remain composed&lt;/li&gt;\n&lt;li&gt;People who consider themselves adaptable and possess the ability to think quickly and resolve problems&lt;/li&gt;\n&lt;li&gt;Flexible in their working week as occasional weekend work is required and can commit to completing their Health Screener Diploma&lt;/li&gt;\n&lt;li&gt;Those looking for a career in a care profession in their next position&lt;/li&gt;\n&lt;li&gt;Individuals who enjoy working with the public, are caring and have an in built need to help others&lt;/li&gt;\n&lt;li&gt;People who take pride in the level of customer service they offer&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Key duties of a Screener&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Ensure that patients are made to feel welcome and comfortable throughout the screening process&lt;/li&gt;\n&lt;li&gt;Undertake the screening Checklist to ensure the screening environment is safe (for yourself and your patients)&lt;/li&gt;\n&lt;li&gt;Basic maintenance of the camera and equipment to enable the best possible images are taken&lt;/li&gt;\n&lt;li&gt;Safely administer the eye drops (to enlarge pupils), and undertake photographs ensuring correct field of view&lt;/li&gt;\n&lt;li&gt;Identify any patients requiring urgent onward referral at the time of their screening appointment&lt;/li&gt;\n&lt;li&gt;Maintaining a sufficient stock of consumables&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Our Application processes&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We’re really grateful that you’ve read this far, hopefully you now have a better understanding of the importance of a screeners job, not to worry if you have any further questions, we’ll be able to answer them during the application process.&lt;/p&gt;\n&lt;p&gt;If this is of interest, please hit apply! If successful, you’ll be sent a link in which you’ll be asked to carry out a 2-5 minute video interview in which you’ll be asked 3 questions. Don’t worry if you’re a bit nervous about video interviews, we’ll bear this in mind when viewing! It may be an idea to have a look over our website prior to help when answering the questions.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Health Intelligence Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133174"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Marble Arch", "postalCode": "W1H"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5161", "longitude": "-.158662"}}, "title": "Trainee Screener", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244713", "validThrough": "2020-11-23T23:59:59+0000"}