{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "35368", "minValue": "35368", "unitText": "YEAR", "value": "£21.04 per hour"}}, "datePosted": "2020-10-22T15:15:37+0100", "description": "&lt;p&gt;The post holder will contribute to the positive and aspirational development of the nursing team, by promoting an agenda of recovery from the dependence on drugs and/or alcohol within the client group and which supports the goals of reducing re-offending, increasing re-integration into meaningful and sustained occupation and improving social and family relationships, with integrated models of care across the 7 prisons in the North East:&lt;br /&gt; &lt;br /&gt; • HMP Frankland&lt;br /&gt; • HMP Low Newton&lt;br /&gt; • HMP Durham&lt;br /&gt; • HMP Deerbolt&lt;br /&gt; • HMP Northumberland&lt;br /&gt; • HMP Holme House&lt;br /&gt; • HMP Kirklevington Grange&lt;br /&gt; &lt;br /&gt; The Substance misuse nurse will be part of the multi-professional/skilled team delivering healthcare to patients working as part of the integrated community services model in each prison estate.&lt;br /&gt; &lt;br /&gt; Opportunities to achieve dual training in substance misuse will be encouraged to support integrated substance misuse treatment pathways&lt;br /&gt; &lt;br /&gt; The post holder will work collaboratively with the GPs, Advanced Nurse Practitioners and other key stakeholders under the Reconnected to Health ethos to meet the needs of patients, through the effective delivery of substance misuse services including clinical assessment, diagnosis, treatment, safe and effective prescribing, care planning and evaluation of care. The post holder will demonstrate safe, clinical decision-making and expert care.&lt;br /&gt; &lt;br /&gt; The post holder will also be required to support the delivery of clinical policies and procedures and provide clinical leadership to the establishment as required. &lt;br /&gt; &lt;br /&gt; A commitment to a quality service, excellence in clinical practice and continuous professional development are integral to the role and the development of the service.&lt;br /&gt; &lt;br /&gt; The post holder will participate in promoting and advancing Spectrum Community Health.&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/126014.jpg", "name": "Spectrum Community Health", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126014"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Durham", "postalCode": "DH1 3HU"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.7734", "longitude": "-1.56696"}}, "title": "Bank Band 6 Substance Misuse Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916239074", "validThrough": "2020-11-06T23:59:59+0000"}