{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907-£30,615 per annum pro rata"}}, "datePosted": "2020-10-27T11:16:20+0000", "description": "&lt;p&gt;Please note this is an&lt;strong&gt; INTERNAL VACANCY ONLY for NUH employees&lt;/strong&gt;, therefore only current employees of Nottingham University Hospitals NHS Trust will be considered for the post&lt;/p&gt;\n&lt;p&gt;An Exciting opportunity have arisen within the Emergency Gynaecology and Early Pregnancy services at Nottingham University Hospitals Trust for 1st level registered nurses/dual qualified nurse/midwives who are enthusiastic, motivated and caring, and are keen to develop their professional knowledge and abilities.&lt;/p&gt;\n&lt;p&gt;Ward A23 is a 16 bedded Gynaecology emergency admissions inpatient short stay ward, with additional Early Pregnancy Assessment clinic, and a 24/7 Hydration suite, Procedure room, and the Emergency Assessment Triage Unit (part of NUH, Emergency Pathway). We are situated in a purpose built area at the Queens Medical Centre and care for women in the early stages of pregnancy (up to 20 weeks gestation).incorporating caring for women who are experiencing complications in early pregnancy and miscarriage, as well as caring for bereaved families.&lt;/p&gt;\n&lt;p&gt;We are a forward thinking specialist service; aspiring the provision of nurse led services and we pride ourselves on team work, the delivery of high standards of care and patient safety. This opportunity provides the ability to increase specialist knowledge in women&#39;s health. .&lt;/p&gt;\n&lt;p&gt;Personal and professional development is actively supported. There are numerous opportunities for nurses with a keen interest in the continuing development and provision of link nurse roles. We offer opportunities for professional development, role related packages including venepuncture/cannulation/ECG/ Entonox administration and other appropriate training in order provide the highest quality of care.&lt;/p&gt;\n&lt;p&gt;You will be joining a caring and supportive team of nurses, working together with our Shared Governance team, made up of ward team members who are dedicated to the delivery of effective and compassionate patient care.&lt;/p&gt;\n&lt;p&gt;You should be educated to 1st level RN as an adult nurse on the NMC register as a minimum; you must show a passion for women’s health, ideally with some previous experience in women’s health or early pregnancy or as an addition emergency care, this can be either during training or work experience. We would expect the optimum candidates to have excellent verbal, ICT and written communication skills. You should be able to prioritise your workload and work well as a member of the team.&lt;/p&gt;\n&lt;p&gt;As a caring, non-judgemental and positive person you must be committed to delivering high quality care whilst adhering to trust values and behaviours.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Sarah Kordula&lt;/p&gt;\n&lt;p&gt;Job title Ward Sister&lt;/p&gt;\n&lt;p&gt;Email address sarah.kordula@nuh.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number 0115 9249924 ext 69023&lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;Ella.Ashley@nuh.nhs.uk&lt;/p&gt;\n&lt;p&gt;Ward Sister&lt;/p&gt;\n&lt;p&gt;A23 Ward&lt;/p&gt;\n&lt;p&gt;60269 /60268 Sisters Office.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122234.jpg", "name": "Nottingham University Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122234"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "QMC Campus, Nottingham", "postalCode": "NG7 2UH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9435", "longitude": "-1.1858"}}, "title": "Staff Nurse ***NUH APPLICANTS ONLY***", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244186", "validThrough": "2020-11-09T23:59:59+0000"}