{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110658", "minValue": "73330", "unitText": "YEAR", "value": "£73,330 to £110,658 per annum, pro rata"}}, "datePosted": "2020-11-03T16:03:34+0000", "description": "&lt;p&gt;Are you looking to work at a perfectly situated Trust where the Peak District meets the Cheshire Plains, yet only 20 minutes from Central Manchester and its airport?&lt;/p&gt;\n&lt;p&gt;Are you a dedicated GP who wants to be part of an innovative and ambitious Out of Hours team?&lt;/p&gt;\n&lt;p&gt;Do you want to support the community of Eastern Cheshire by providing excellent care both within a primary care setting and at the patient’s home?&lt;/p&gt;\n&lt;p&gt;Here at Macclesfield GP Out of Hours we are looking for someone who is a motivated and driven to join our forward thinking team of health care professionals. We operate from multiple locations such as Macclesfield District General, Congleton War Memorial, Handforth Clinic and Knutsford Community Hospital.&lt;/p&gt;\n&lt;p&gt;Our current vacancy is for a Locum GP, covering sessions that are suited to your availability conducting:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Home Visits (Driver provided evenings, weekend and nights)&lt;/li&gt;\n&lt;li&gt;Base Appointments&lt;/li&gt;\n&lt;li&gt;Doctor Advice Calls&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;As a Trust Employee you will be given a full induction to both to East Cheshire Trust and the Out of Hours Service. With continuing support and learning opportunities.&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Operational meeting with Out of Hours Staff to ensure support and learning&lt;/li&gt;\n&lt;li&gt;Fast Track Physio Service for all staff&lt;/li&gt;\n&lt;li&gt;Educational Events&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Closing date: 17th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Please be aware that this post requires an Enhanced with Barred listDisclosure and Barring Service (DBS) check, the cost of which is payable by the successful candidate.&lt;/p&gt;\n&lt;p&gt;If you have lived or worked abroad for 6 months or more in the last 5 years you will need to obtain an overseas police clearance. Further information can be found on the additional information links at the bottom of the advert&lt;/p&gt;\n&lt;p&gt;To keep up to date with all of our latest Recruitment activity here at East Cheshire NHS Trust, take a look at our Facebook and Twitter pages.&lt;/p&gt;\n&lt;p&gt;Visit our Facebook page: Careers at East Cheshire NHS Trust&lt;/p&gt;\n&lt;p&gt;Follow us on Twitter: @CareersECT&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Katie Hankinson&lt;br /&gt; 01625 619937&lt;br /&gt; Email: katie.hankinson@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121085.jpg", "name": "East Cheshire NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121085"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Macclesfield District General Hospital, Macclesfield District General Hospital", "postalCode": "SK10 3BL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.2623", "longitude": "-2.14158"}}, "title": "Locum GP - GP Out of Hours", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254715", "validThrough": "2020-11-17T23:59:59+0000"}