{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615"}}, "datePosted": "2020-10-30T13:16:18+0000", "description": "&lt;p&gt;Community Mental Health Practitioner&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen to work in Cumbria as part of our progressive Memory &amp; Later Life service. We are looking to recruit an enthusiastic Mental Health Nurse to work with us to continue to develop our Memory Assessment Team.&lt;/p&gt;\n&lt;p&gt;As a member of the South Lakes Memory and Later Life Service, you will use your mental health nursing skills and knowledge of evidence based practice to provide assessment and treatment for older adults with a range of mental health issues, working closely with multi-disciplinary colleagues to deliver recovery-based care pathways. You will primarily be working with people who have cognitive impairments across a range of care pathways, from early memory needs to established dementia, and living in various community settings. You will use specialised memory and nursing assessments to assist with the assessment, planning and implementation of care for diagnostic purposes and post diagnosis support.&lt;/p&gt;\n&lt;p&gt;We use a range of comprehensive assessment tools including the ACE3 to support patients and their carers in the diagnosis of memory impairment in the Memory and Later Life Service, and there will be many opportunities to develop and consolidate your skills. You will receive a comprehensive induction, regular supervision, and will attend memory assessment forums which provide peer and organisational support to develop your clinical practice in addition to regular in-service training opportunities.&lt;/p&gt;\n&lt;p&gt;You will also support and supervise AP’s, support workers and student nurses in the team and you will provide advice on nursing and memory perspectives within the MDT.&lt;/p&gt;\n&lt;p&gt;You will be a registered mental health nurse and, as this is a community post, the ability to travel as required is essential and the Trust operates a subsidised lease car scheme.&lt;/p&gt;\n&lt;p&gt;Please note that further communication from Lancashire &amp; South Cumbria NHS Foundation Trust (LCFT) will normally be to the email address given on the application form. You should also ensure that email addresses and telephone numbers are provided for your referees, to enable LSC FT to contact them.&lt;/p&gt;\n&lt;p&gt;Please ensure that you read the Person Specification attached below as your application will be measured against this document. Applications from job share partners are welcome and other forms of flexible working will be considered for all posts. &lt;br /&gt;&lt;br /&gt;For all posts which require a Disclosure &amp; Barring Service (DBS) check please be aware of the Disclosure &amp; Barring Service Code of Practice, a copy of which is available by logging on to the DBS website. If the post is subject to DBS disclosure, a charge will be made to the successful candidate(s).&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Helen Bradford, email Helen.Bradford@lscft.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121124.png", "name": "Lancashire & South Cumbria NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121124"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Kendal, Kendal", "postalCode": "LA9 7RG"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.3067", "longitude": "-2.73255"}}, "title": "Community Mental Health Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250335", "validThrough": "2020-11-12T23:59:59+0000"}