{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum, pro rata"}}, "datePosted": "2020-11-03T16:17:05+0000", "description": "&lt;p&gt;Whatever you need to be your best, you’ll find it all here with Manchester University NHS Foundation Trust (MFT). Bringing together hospitals and community services from across Manchester, Trafford and beyond, we’re pooling our resources, state-of-the-art facilities and specialist services to deliver even better patient care. With a diverse pathology and an extensive ground-breaking research portfolio, we’re also the providers of one of the UK’s largest laboratory services.&lt;/p&gt;\n&lt;p&gt;We have an exciting opportunity for a Practitioner Biomedical Scientist within our Paediatric Histopathology laboratory at the Oxford Road site. The Paediatric Histopathology department at the Oxford Road Campus works closely together with Adult Histopathology to provide a wide range of specialist histopathology diagnostic investigations. Plans are currently in progress to consolidate Paediatric and Adult Histopathology into the Clinical Sciences building with full refurbishment of the laboratory areas.&lt;/p&gt;\n&lt;p&gt;The department also works alongside Molecular Genetics and offers genetic and molecular testing to compliment both histological diagnosis and research.&lt;/p&gt;\n&lt;p&gt;Every kind of opportunity will be provided for staff to rotate across the main areas of the service, including specimen reception and dissection, routine histopathology, special staining techniques, immunohistochemistry and cryotomy, and experience in muscle enzyme histochemistry would be beneficial&lt;/p&gt;\n&lt;p&gt;As a progressive department, we currently provide a significant amount of specialist services to both clinical users and external laboratories and invest in staff development offering support and encouragement in CPD with the opportunity to attend approved seminars and external courses when available.&lt;/p&gt;\n&lt;p&gt;We’re looking for enthusiastic, aspirational and highly motivated HCPC registered Biomedical Scientists who have experience within the Histopathology department and a passion for clinical excellence, quality and a drive for career development.&lt;/p&gt;\n&lt;p&gt;You will be required to work core hours from Monday to Friday, however this may be subject to change depending on the service requirements. The post holder will be based at Oxford Road but may be expected to work at the Wythenshawe site, depending on service needs.&lt;/p&gt;\n&lt;p&gt;Suitable candidates will require post-registration Histopathology experiences. Candidates must be HCPC registered and in possession of an IBMS registration portfolio in Cellular Pathology or equivalent to be appointed at Band 5.&lt;/p&gt;\n&lt;p&gt;The department has full HCPC training status for pre and post registration IBMS portfolios and full ISO 15189 accreditation.&lt;/p&gt;\n&lt;p&gt;So, join us and you’ll discover more ways to make progress. We want talented people from all backgrounds to choose to join our diverse teams. The Trust aims to support work-life balance with flexible working options, and, with the best of both inner city and country living on our doorstep, you can enjoy a better quality of life too.&lt;/p&gt;\n&lt;p&gt;Discover more about the roles available and apply at &lt;strong&gt;mft.nhs.uk/careers&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameEmma JacobsJob titleLead Biomedical ScientistEmail addressemma.jacobs@mft.nhs.ukTelephone number0161 701 2240&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Manchester University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121137"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Manchester Foundation Trust, Manchester", "postalCode": "M13 9WL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4625", "longitude": "-2.22771"}}, "title": "Practitioner Biomedical Scientist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254775", "validThrough": "2020-11-16T23:59:59+0000"}