{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51069", "minValue": "32478", "unitText": "YEAR", "value": "£32,478 to £51,069 pa"}}, "datePosted": "2020-10-30T14:00:19+0000", "description": "&lt;h1&gt;&lt;strong&gt;Trust Doctors (CT1-2 level) in Intensive Care Medicine&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;We have an exciting opportunity for a Trust Doctor to join our Intensive Care Medicine Team.&lt;/p&gt;\n&lt;p&gt;The 13-bed critical care unit admits approximately 800 patients per year: approximately 50% are medical patients, 50% are surgical and 95% of admissions are emergencies. Approximately 55% require advanced respiratory or multi-organ support. The mean APACHE II score is 16 and the ICU mortality rate is 20%. The unit is staffed to care for up to 13 critically ill patients at one time, made up of seven level 3 (ICU) patients plus six level 2 (HDU) patients (or eleven level 3 patients).&lt;/p&gt;\n&lt;p&gt;This is a non-training post that provides excellent learning opportunities to help prepare candidates for primary qualifications in their chosen field, as long as the relevant minimum training period has been obtained. We are able to provide training for FICE accreditation and have an internationally acclaimed consultant body who provide fantastic training opportunites. We are highly rated in the GMC survey and get consistently good results from our local trainee feedback. All doctors, regardless of training status receive an educational supervisor and study budget.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Options for additional experience paired with anaesthesia if desired and successful at interview. For informal contact please ring Dr Clare Hommers on 01225 825056 (ITU).&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121339.png", "name": "Royal United Hospitals Bath NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121339"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bath", "postalCode": "BA1 3NG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3917", "longitude": "-2.3912"}}, "title": "Trust Doctor CT1-3 in Intensive Care Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250446", "validThrough": "2020-11-13T23:59:59+0000"}