{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-11-04T11:01:43+0000", "description": "&lt;p&gt;We have an exciting opportunity for an enthusiastic, dynamic and committed registered mental health nurse to work within Central Locality CBU, Secure Services at Bamburgh Clinic on Aidan Ward a medium secure mental health based ward at St Nicholas Hospital in Gosforth.&lt;/p&gt;\n&lt;p&gt;We are seeking a confident individual who is keen to contribute to the delivery of high quality nursing care and service development. You should have an interest in working within a busy and challenging environment, have a high level of resilience and patience and possess excellent verbal and written communication skills, as well as the ability to demonstrate a warm, patient centred approach to care.&lt;/p&gt;\n&lt;p&gt;The post holder will undertake Primary/Named Nurse responsibilities within a multi-disciplinary team, developing collaborative, and needs based care plans, through assessment, planning, implementation and evaluation. They will provide excellent professional, skilled and effective person centred, evidence based nursing care and be actively involved in the health and well-being of staff and service users.&lt;/p&gt;\n&lt;p&gt;The post holder will need to be visible and accessible to patients, families and carers working together to ensure efficient, effective and caring services, and contribute to the education and development of the workforce and students.&lt;/p&gt;\n&lt;p&gt;You will have the ability to work both independently and within a team. You will demonstrate the ability to liaise with both internal and external agencies. You will need to be skilled and comfortable in dealing with patients who have multiple, often challenging and complex needs, including issues around risk management.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Jackie Hudson Ward Manager jackie.hudson@cntw.nhs.uk 0191 2467253&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121049.jpg", "name": "Cumbria, Northumberland, Tyne and Wear NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121049"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Gosforth", "postalCode": "NE3 3XT"}, "geo": {"@type": "GeoCoordinates", "latitude": "55.0063", "longitude": "-1.63477"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255511", "validThrough": "2020-11-18T23:59:59+0000"}