{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "25365", "minValue": "22987", "unitText": "YEAR", "value": "£22,987 - £25,365 per annum, pro rata (incl of HCA"}}, "datePosted": "2020-10-29T11:17:16+0000", "description": "&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;Are you an experienced and enthusiastic Multi Therapy assistant who would like a Band 4 post within a friendly multi -disciplinary team? Would you enjoy the challenge of a varied caseload in a variety of settings (clinic, wards and the community) providing rehabilitation (predominately Physiotherapy but with some Occupational therapy interventions) for Older Adults? We have 2 part time posts (22.5 hrs each).&lt;/strong&gt; &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;As a valued member of the team you will have an opportunity to develop your skills in a proactive and supportive environment.&lt;/p&gt;\n&lt;p&gt;Clinically you will be working with rehabilitation, medical, palliative and neurological patients.&lt;/p&gt;\n&lt;p&gt;The successful candidate will have a good knowledge base, good time management skills and be computer literate.&lt;/p&gt;\n&lt;p&gt;You will also need to have some experience working in a healthcare rehabilitation setting to apply for this role.&lt;/p&gt;\n&lt;p&gt;Your work base will be St Marks Hospital in Maidenhead in the Royal Borough of Windsor and Maidenhead which has excellent transport links into London and the South. There is free parking for staff on site.&lt;/p&gt;\n&lt;p&gt;Berkshire Healthcare Foundation Trust (BHFT) is a progressive employer committed to the use of values based recruitment and appraisal processes for which you will receive comprehensive training. The trust has a learning and development budget and continuous professional development is a priority.&lt;/p&gt;\n&lt;p&gt;BHFT is a joint Community and Mental Health Trust which brings a diverse area of expertise and enables us to provide holistic person centred care. We are CQC rated Outstanding.&lt;/p&gt;\n&lt;p&gt;For further information, an informal chat about this exciting opportunity, or to arrange a site visit please contact:&lt;/p&gt;\n&lt;p&gt;Cathy Jeffery on 07500975646 or Becky Ratford on 01753638439&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameJulia PrinceTelephone number07810857071&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120886.PNG", "name": "Berkshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120886"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "ARC Therapists, Maidenhead", "postalCode": "SL6 6DU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5248", "longitude": "-.744843"}}, "title": "Multi Therapy Assistant Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248061", "validThrough": "2020-11-10T23:59:59+0000"}