{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 per annum pro rata"}}, "datePosted": "2020-11-02T13:01:15+0000", "description": "&lt;p&gt;Times are challenging at the moment and we are offering you to come and work with us in a supportive environment where team work is essential.&lt;/p&gt;\n&lt;p&gt;Both the ward manager Alison Sharp and the Matron Stephanie Tempest, have been nominated for leader of the year over the past few years in the trusts celebrating excellence awards. Gate A2 is a low complaints area and have excellent audit results, check us out on the National SSNAP audit. We are classed as a green area from a Covid perspective.&lt;/p&gt;\n&lt;p&gt;We offer an excellent training and support package which is lead by one of our Band 6&#39;s. So this post is suitable for newly qualified nurses, returning to practice nurses, or nurses from the community or other areas. We get very good feedback for this. We also have 18 band 6 posts on the ward and many of these are our previous band 5&#39;s so if you are a band 5 who is ready for the this role then this may be a good career move for you.&lt;/p&gt;\n&lt;p&gt;We admit stroke patients directly to our assessment hub which is a 4 bedded unit, directly from CT scan, we miss out ED where possible, once treatment such as thrombolysis, thrombectomy and BP monitoring has occurred as part of the assessment and treatment process patients will be transferred to one of our 12 beds in the hyper acute part of the ward, you would be one of 4 staff who worked in this area, it is spacious and has bed side monitoring and equipment.&lt;/p&gt;\n&lt;p&gt;Once stable if the patient doesn&#39;t go home then patients will step down to on of our 26 beds on A2. You will be one of 8 staff in the day or 7 staff on a night shift who care for these patients.&lt;/p&gt;\n&lt;p&gt;We offer palliative care on the ward and one of the band 6&#39;s leads on this and we are working towards gold standards accreditation.&lt;/p&gt;\n&lt;p&gt;Another success on A2 is that we have 10 TNA posts. We have our 2nd NA qualifying in January 2021 and 3 further TNA qualifying next June. This role massively improves the skill mix and helps the Registered Nurse in the care of her patients.&lt;/p&gt;\n&lt;p&gt;So if you fancy a change and want to come and have a look round or chat with Alison Sharp, and want to work in a unit that has high standards and will support you then get in touch.&lt;/p&gt;\n&lt;p&gt;Applicants are welcome from staff who value their colleagues and want to work as part of a team and adhere to trust values and behaviours.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120735.png", "name": "Mid Yorkshire Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120735"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wakefield", "postalCode": "WF1 4DG"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.6949", "longitude": "-1.48592"}}, "title": "Registered Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252131", "validThrough": "2020-11-23T23:59:59+0000"}