{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "490736", "minValue": "490736", "unitText": "YEAR", "value": "£49,0736"}}, "datePosted": "2020-10-23T10:37:16+0100", "description": "&lt;p&gt;&lt;strong&gt;Health Education England, working across the south west&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Postgraduate Dental Education&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;NIHR Clinical Lectureship in Prosthodontics&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Vacancies: 1 (Based across Musgrove Park Hospital Taunton and Plymouth)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Level: ST1 or ST2&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Duration: up to 5 Years &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview date: 15th January 2021&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing date for applications: 20/11/2020 @ 4pm&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Applications are invited for appointments as an NIHR Academy Clinical Lecturer on the Specialty Training Programme in Prosthodontics in Plymouth University&lt;strong&gt;. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Applicants to ST1 level posts will be required to undertake clinical benchmarking for ST1 Restorative Dentistry. &lt;/p&gt;\n&lt;p&gt;Applicants that do not already hold a National Training Number (NTN) or Deanery Reference Number (DRN) in the GDC specialty to which they are applying for will also be required to undertake the national clinical recruitment process and attend an assessment/interview for that GDC specialty as appropriate. If applicants require clinical benchmarking then they will be required to fill out a separate standard clinical application form. For further details please refer to the &#39;NIHR website link&#39; available in the hyperlinks section on Oriel.&lt;/p&gt;\n&lt;p&gt;This is for completion of &lt;strong&gt; CCT/ CESR (CP)&lt;/strong&gt; subject to satisfactory progression.&lt;/p&gt;\n&lt;p&gt;Please note there are two person specifications relevant to this post; the NIHR supplementary person specification (available via the ‘NIHR Guidance Link’ on this page and the matched national specialty person specification which can be found via the National Specialty Training Website.&lt;/p&gt;\n&lt;p&gt;Before you complete your online application it is imperative that you download and read the linked documents which can be found in the documents section of the vacancy.&lt;/p&gt;\n&lt;p&gt;These documents contain specific and detailed information with regards to the application form and process, and the person specification. Please read them thoroughly to ensure that you fill out your application form correctly.&lt;/p&gt;\n&lt;p&gt;All applicants applying to medical specialties are required to have essential competences or equivalent depending on the level they are applying for. For more information on competences please refer to the resource bank on Oriel&lt;/p&gt;\n&lt;p&gt;Applicants should note that all training programmes are equally open to those who may, either from the outset or subsequently, wish to train less than full time.&lt;/p&gt;\n&lt;p&gt;If your employment is subject to immigration control, you should visit the HEE website for Specialty Training for information about how this will affect your application. In some cases applications will not be considered, or only once the resident labour market test can be satisfied.&lt;/p&gt;\n&lt;p&gt;Please note that there is a strict application policy that applications cannot be accepted after the deadline.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please note: All applicants who do not already hold a National Training Number (NTN) or Deanery Reference Number (DRN) in the GDC specialty to which they are applying for will be required to undertake the national clinical recruitment process and attend an assessment/interview for that GDC specialty as appropriate.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If you require clinical benchmarking then you must also complete a separate standard clinical application form during the appropriate National Round.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Applications via the Oriel Recruitment Portal.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further information, contact the Restorative Training Programme Director - matthew.jerreat@plymouth.ac.uk&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Tips for submitting an application:&lt;br /&gt;&lt;br /&gt;• On completion save and re-open the application and then check prior to pressing the submit button. This will allow you time to review your completed application and check for any discrepancies.&lt;br /&gt;• Submit your application no later than 30 minutes before the deadline as there is a strict policy that applications cannot be accepted after the deadline.&lt;br /&gt;• If you are in the process of completing an application at the point of closure a warning message will appear and you will not be able to submit the application or retrieve any of the data input.&lt;br /&gt;Please refer to the Job Description and ACF person specification prior to starting your application.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Health Education England South West", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128754"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Taunton", "postalCode": "TA1 5DA"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.012", "longitude": "-3.11979"}}, "title": "Clinical Lectureship (CL) in Prosthodontics", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240109", "validThrough": "2020-11-20T23:59:59+0000"}