{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "56490", "minValue": "50575", "unitText": "YEAR", "value": "£50,575 - £56,490 per annum including HCA"}}, "datePosted": "2020-10-21T14:46:29+0100", "description": "&lt;p&gt;This is an exciting opportunity for a qualified clinical or counselling psychologist to work in the North Recovery Team, as a senior member of the wider multidisciplinary service.&lt;/p&gt;\n&lt;p&gt;The service aims to lead in creating a psychologically literate workforce across services in the London Borough of Newham and to bring a psychological perspective to the work of individuals, groups, teams and systems. It focuses both on evidence-based clinical excellence and developing practice-based evidence relevant to meeting the needs of a very diverse population.&lt;/p&gt;\n&lt;p&gt;We are looking for a motivated and skilled psychologist to join the vibrant team of psychologists in the wider borough supporting Service Users with complex, chronic and comorbid mental health problems. You will be contributing to a high quality clinical service providing psychological assessments and/or interventions drawing from a range of models suited to the needs of the Service Users. Skills in consultation within MDTs and supporting staff will also be required.&lt;/p&gt;\n&lt;p&gt;Work opportunities include direct clinical work as well as organisational development, teaching, training, audit, research and Quality Improvement (QI) opportunities. We have strong links with the local University and actively encourage continuing professional development. Our general ethos is to create a seamless psychological therapies service across primary, secondary and tertiary care.&lt;/p&gt;\n&lt;p&gt;Newhams Psychological Therapies Services take pride in its social, cultural and political sensitivities. We are committed to the principle of equal opportunity and particularly welcome applicants interested in transcultural mental health care. Applicants need to have experience of working in secondary care mental health services.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120781.jpg", "name": "East London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120781"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "LONDON", "postalCode": "E7 8QR"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5396", "longitude": ".044061"}}, "title": "Clinical/Counselling Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916236951", "validThrough": "2020-11-29T23:59:59+0000"}