{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Competitive Salary Plus Benefits + Pension"}}, "datePosted": "2020-11-05T16:24:40+0000", "description": "&lt;p&gt;Northern Health Care provides outcome focused mental health recovery services across the UK. Our services include both residential units and community outreach including 24 hour support and access to experienced, clinically qualified staff.&lt;/p&gt;\n&lt;p&gt;Due to organisational expansion, an opportunity has arisen within Northern Healthcare for a Occupational Therapist to join our expanding clinical team at Amy Johnson House in Hull Town Centre.If you are looking for a flexible working week, whilst working either part time or full time, then this could be the role for you.&lt;/p&gt;\n&lt;p&gt;In line with the philosophy of the unit the post holder will be responsible for the assessment, planning, implementation and evaluation of care for the identified service users, acting as support for service users with complex and challenging needs within an enhanced supported living environment.&lt;/p&gt;\n&lt;p&gt;You will be responsible for managing a defined caseload using Northern Healthcare’s clinical pathway to assess, plan, implement and evaluate interventions within the service. You will be required to abide by the College of Occupational Therapy Code of Ethics and Professional Conduct and the College of Occupational Therapy Professional Standards for OT Practice.&lt;/p&gt;\n&lt;p&gt;As part of this role your will provide clinical, professional and leadership direction for support staff within the organisation and develop skills and knowledge through participation in a Professional Development Planning process.&lt;/p&gt;\n&lt;p&gt;If you are passionate about putting people first and making a difference, then we want to hear from you.&lt;/p&gt;\n&lt;p&gt;Applicants must have current HCPC professional registration.&lt;/p&gt;\n&lt;p&gt;Applicants should note that an enhanced disclosure check via the Criminal Records Bureau will be required before appointment.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/135974.JPG", "name": "Northern Healthcare", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=135974"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Amy Johnson House, Hull", "postalCode": "HU1 3HR"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.745", "longitude": "-.339815"}}, "title": "Occupational Therapist (Hull)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258548", "validThrough": "2020-12-31T23:59:59+0000"}