{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "15549", "minValue": "15549", "unitText": "YEAR", "value": "£9.25 Per Hour"}}, "datePosted": "2020-10-30T10:47:09+0000", "description": "&lt;p&gt;Benefits of Working with us:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Meals Provided, On-site parking available, Enhancement for Night Shifts &amp; Bank Holidays&lt;/li&gt;\n&lt;li&gt;Work Place Pension with Legal &amp; General&lt;/li&gt;\n&lt;li&gt;Comprehensive Learning &amp; Development Package, Progression Opportunities, We also offer Health &amp; Social Care QCF qualifications&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Company Funded Benefits: Free DBS check, Flu vaccination and Hepatitis B vaccination&lt;/p&gt;\n&lt;p&gt;About the Role: As a Team Leader you will take a key role in delivering the services within the home ensuring the promotion of good working practice and offering a role model to support staff. You will work closely with the Deputy Manager to provide professional support, supervision and guidance to Support Workers, and ensure continuity of care.&lt;/p&gt;\n&lt;p&gt;As a Team Leader you will be involved in monitoring and reviewing care plans in conjunction with the Deputy Manager, Care Managers/Social Workers, service users and their relatives. You will be able to take part in coordination of the rotas for Support Workers and ensure continuity of care.&lt;/p&gt;\n&lt;p&gt;You will also be involved in the implementation of the Company&#39;s procedural requirements including Disciplinary, Health and Safety, Financial and Quality Assurance systems.&lt;/p&gt;\n&lt;p&gt;About the Service: Rockfield House is based in Anfield, Liverpool and is a spacious community based residential home for people living with a learning disability. The home offers intensive support using active support, person centred planning (PCP) and positive behavioural support (PBS) methods.&lt;/p&gt;\n&lt;p&gt;The home enables and supports individuals to develop their living skills by supporting them with their chosen path, we offer commitment to develop pathways that reflect individual ambitions and aspirations and work towards achieving independence and full quality lives.&lt;/p&gt;\n&lt;p&gt;Skills: Strong communicator, creative, motivated, ability to cope in challenging situations, understand and support individuals to lead a good quality of life whilst achieving positive outcomes along the way.&lt;/p&gt;\n&lt;p&gt;Salary: £9.25 per hour&lt;/p&gt;\n&lt;p&gt;Desirable/ Requirements: QCF Level 3 Health &amp; Social Care or willing to work towards. Experience in a leadership role is desirable.&lt;/p&gt;\n&lt;p&gt;Hours of Work: 42 per week&lt;/p&gt;\n&lt;p&gt;Contract Type: Temporary&lt;/p&gt;\n&lt;p&gt;Equal Opportunities: MHC are an equal opportunities employer and welcome applications from all who believe they fit the essential requirements for this role regardless of their race, sex, disability, religion/belief, sexual orientation or age.&lt;/p&gt;\n&lt;p&gt;How to Apply: Please complete the short application and upload your CV, alternatively for an informal discussion about this role you can contact MHC Workforce on 01824 572 020.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;(We reserve the right to bring forward our closing date, without notice in the event of high volumes of interest).&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/131854.jpg", "name": "Mental Health Care (UK) Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=131854"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Anfield, Liverpool", "postalCode": "L6 4BB"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4225", "longitude": "-2.94262"}}, "title": "TEMPORARY TEAM LEADER - ROCKFIELD HOUSE", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249810", "validThrough": "2020-11-29T23:59:59+0000"}