{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Competitive"}}, "datePosted": "2020-10-19T12:49:22+0100", "description": "&lt;p&gt;Nuffield Health is Britain’s largest not-for-profit healthcare organisation. Join us as a Pharmacist in our Plymouth Hospital and play your part in building a healthier nation.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;The Role&lt;br /&gt;&lt;br /&gt;You will be part of the wider multi-disciplinary team at Nuffield Health and you will feel the benefit from processes that fully integrate medicines into the personalised pathway of care for our patients.&lt;br /&gt;&lt;br /&gt;This is an excellent opportunity for you to develop your career and gain a wide range of skills. As a Pharmacist you will;&lt;br /&gt;&lt;br /&gt;- Deliver high quality clinical care and advice to our customers.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;- Offer services to a range of departments including the pre-assessment clinic, outpatient department, ward and theatres.&lt;br /&gt;&lt;br /&gt;The Person&lt;br /&gt;To succeed as a Pharmacist you will;&lt;br /&gt;&lt;br /&gt;- Be a Registered Pharmacist with the General Pharmaceutical Council.&lt;br /&gt;&lt;br /&gt;- Proven post qualification experience as a Pharmacist.&lt;br /&gt;&lt;br /&gt;- Have excellent communication and people skills. This is essential as you will be working closely with patients as well as a variety of clinical staff.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Nuffield Health Plymouth Hospital&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Nuffield Health Plymouth Hospital is situated next to the Nuffield Health Devonshire Gym, in Derriford, Plymouth and we have been part of the Plymouth community since 1971. We have 3 main theatres – 2 laminar flow and 1 digital, a fully JAG accredited endoscopy suite, a 35-bedded ward with one 4 bedded bay and one 2 bedded bay. Our outpatients department has 12 consulting rooms with a dedicated ophthalmology suite and ENT service.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We strive to provide a 5 star service to our patients with Consultant led care and dedicated teams who are fully supported with access to further development and a range of training courses via our training academy. We are particularly proud of our preceptorship programme for newly qualified nurses which has been shortlisted in the Nursing Times 2020 Nurse Education Provider of the Year award.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We carry out treatment under a range of specialities including Orthopaedics, Plastic Surgery and Neurosurgery. We recently were rated in the top 50 hospitals in the country for our total hip replacement patient outcomes&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;The Benefits&lt;br /&gt;&lt;br /&gt;We want you to be the best you can be. We promise that we will support you with training opportunities, career development options and our unique health &amp; wellbeing focused benefits package. This includes free membership across all of our Fitness &amp; Wellbeing clubs, along with free private healthcare. Not only this but we also offer a range of lifestyle and financial wellbeing benefits.&lt;br /&gt;&lt;br /&gt;Be your best and join us in building a healthier nation.&lt;br /&gt;&lt;br /&gt;&lt;em&gt;Location - Nuffield Helath Plymouth Hospital&lt;br /&gt;Weekly Hours - 37.5&lt;br /&gt;Contract Type - Permanent&lt;br /&gt;Salary - £39,000 pro rata&lt;br /&gt;Closing Date - 16/11/2020&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Applications will be considered as they are received and interviews will be arranged accordingly. We reserve the right to close adverts early, for example, where we have received an unprecedented high volume of applications. Therefore please apply early to ensure you are considered for the post. &lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/132134.jpg", "name": "Nuffield Health", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132134"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Plymouth", "postalCode": "PL6 8BG"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.4187", "longitude": "-4.11449"}}, "title": "Pharmacist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916232345", "validThrough": "2020-11-16T23:59:59+0000"}