{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 Per annum/Pro rata"}}, "datePosted": "2020-11-06T15:16:18+0000", "description": "&lt;p&gt;&lt;strong&gt;Successful candidates will be invited to an Assessment Day on Friday 18th December 2020 Please note this will be either a morning or afternoon session to be confirmed.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Cornwall Partnership NHS Foundation Trust (CFT) is excited to offer opportunities for qualified Nurses within our newly developed CATU (Community Assessment and Treatment Unit).&lt;/p&gt;\n&lt;p&gt;Patients are admitted direct for assessment from home or ED.&lt;/p&gt;\n&lt;p&gt;Are you passionate about providing high quality patient care and would like to be part of this new development in the patient pathway?&lt;/p&gt;\n&lt;p&gt;Do you enjoy acute nursing and dynamic patient flow? The CATU model is an innovative and dynamic patient pathway of which a key aspect is the assessment of the acute patient and treatment of symptoms aiming to return the patient to their home with the right support. You will be empowered to utilise a range of nursing skills to support patients through a clinical admission, assessment and ongoing treatment.&lt;/p&gt;\n&lt;p&gt;You should possess commitment to team working and innovative delivery of excellent standards of care. You will need to be able to demonstrate a real enthusiasm for using extended skills and a desire for on-going professional development.&lt;/p&gt;\n&lt;p&gt;There will be opportunities to lead patient care, taking on differing nursing roles on the unit and ensuring that patient care is kept to a high standard.&lt;/p&gt;\n&lt;p&gt;This post will require you to undertake a range of Long Days and Night duties on a rotational basis in order to support 24 hour nursing care, 7 days per week.&lt;/p&gt;\n&lt;p&gt;Visits to the ward by prospective applicants are encouraged.&lt;/p&gt;\n&lt;p&gt;Take the next step and enjoy a rewarding career in the beautiful county of Cornwall with CFT&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Sarah Yates&lt;/p&gt;\n&lt;p&gt;Job title Ward Manager&lt;/p&gt;\n&lt;p&gt;Email address sarah.yates9@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number01726 873002&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120947.png", "name": "Cornwall Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120947"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St Austell  Community Hospital, St Austell", "postalCode": "PL26 6AA"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.3271", "longitude": "-4.77309"}}, "title": "Registered Nurse -SACH - Band 5", "url": "https://www.jobs.nhs.uk/xi/vacancy/916260316", "validThrough": "2020-12-06T23:59:59+0000"}