{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503"}}, "datePosted": "2020-10-30T17:10:07+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Please note that we reserve the right to bring the closing date forward for this vacancy at any time should we receive an overwhelming response of applications. We therefore encourage applicants to apply early if they wish to be considered for the post.&lt;/strong&gt;&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Note:&lt;/strong&gt;Prior to completing the application you must read the advert, job description and person specification. Within the application you are required to state how your current knowledge, skills and abilities meet the criteria&lt;strong&gt; and include answers to specified questions for this particular job at the bottom of this page&lt;/strong&gt;. This information will be reviewed as part of the shortlisting process. If you fail to answer specified questions in your application you will not proceed to the shortlisting stage.&lt;/p&gt;\n&lt;p&gt;We are seeking an enthusiastic and motivated individual to join our busy, friendly team to work in our progressive Department. This is an excellent opportunity to gain experience of working in a progressive department and support the development of a single Quality system across Birmingham and Solihull Pathology Services.&lt;/p&gt;\n&lt;p&gt;You must have a BSc in Biomedical Science (or equivalent) with HCPC registration with experience of Cellular Pathology and completed IBMS Specialist Portfolio (or equivalent). As this is a senior role the candidate &lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;MUST&lt;/span&gt;&lt;/strong&gt;also have a ‘Level 7 qualification’ e.g. an MSc or Higher Specialist Diploma awarded by the IBMS or an equivalent Quality Management and/or Audit qualification.&lt;strong&gt;Note:&lt;/strong&gt;Suitably experienced candidates without the required Level 7 qualification may be considered for shortlisting for this post but if successful would need to undertake suitable additional study in an agreed timeframe. Successful outcome under a formal Learning Contract would be a pre-requisite for progression to Band 7 in order to meet the minimum qualification requirement of the post.&lt;/p&gt;\n&lt;p&gt;The post holder will be based in Cellular Pathology at QEHB, leading on quality management and audit. The successful applicant will be actively involved in cross site integration of Cellular Pathology quality systems and working across Pathology disciplines as part of the Quality Team. The post holder will perform internal and cross site audits to support continuous quality improvement and HTA and ISO15189 compliance.&lt;/p&gt;\n&lt;p&gt;Applicants seeking part-time work who meet the post and services requirements will be considered. Core working hours for the post holder are Monday to Friday, 09:00 to 17:00 with a thirty minute lunch break.&lt;/p&gt;\n&lt;p&gt;The post holder will be expected undertake any training required and to maintain competency including and a specialist level understanding of all the processes they participate in and supervise. All professionally registered staff are expected to maintain evidence of Continuing Professional Development which should be up to date and relevant to the post and we support Continuous Professional Development. Encouragement is given to attend and participate in both internal and external lectures / seminars.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;strong&gt;Additional questions to be answered in the Supporting Evidence of your application:&lt;/strong&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;1. Describe your involvement and experience with a laboratory quality management system and associated software.&lt;/em&gt;&lt;br /&gt; &lt;em&gt;2. Describe your experience carrying out audit.&lt;/em&gt;&lt;br /&gt; &lt;em&gt;3. Give examples of service improvement with which you have been involved.&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University Hospitals Birmingham NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123452"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Birmingham", "postalCode": "B15 2TH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4533", "longitude": "-1.93628"}}, "title": "Band 7 Senior Biomedical Scientist, Quality Lead, Cellular Pathology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251039", "validThrough": "2020-11-27T23:59:59+0000"}