{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 to £44,503 pa"}}, "datePosted": "2020-10-26T13:15:11+0000", "description": "&lt;p&gt;An exciting opportunity has arisen within SWYPFT Safeguarding Team, for a Safeguarding Advisor.&lt;/p&gt;\n&lt;p&gt;The role is varied and interesting and its main focus is to support staff at all levels to act within the best interests of those who use our services to ensure that both adults and children are safeguarded from abuse and neglect.&lt;/p&gt;\n&lt;p&gt;As the successful candidate you will need to be confident and resilient, caring and motivated to do make a difference to the lives of others.&lt;/p&gt;\n&lt;p&gt;Self-motivation and flexibility are key requisites to the role and you will be expected to work both independently and as part of a very supportive team. As a Trust-wide post, this covers a range of services and specialties.&lt;/p&gt;\n&lt;p&gt;If you are passionate about safeguarding, flexible and motivated we would love to hear from you.&lt;/p&gt;\n&lt;p&gt;This role is open to all those who have a professional qualification, for example: nursing, social work, allied health professional etc..&lt;/p&gt;\n&lt;p&gt;For further information please contact Carol Morgan (Specialist Advisor Safeguarding Adults on 01924 316175 or Janet Smith (Named Nurse Safeguarding Children) on 01924 316175.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "South West Yorkshire Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122193"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wakefield", "postalCode": "WF1 3SP"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.6988", "longitude": "-1.49218"}}, "title": "Safeguarding Advisor", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242604", "validThrough": "2020-11-10T23:59:59+0000"}