{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "36856", "minValue": "36856", "unitText": "YEAR", "value": "up to £36,856 - dependent on experience"}}, "datePosted": "2020-10-23T14:24:02+0100", "description": "&lt;h1&gt;&lt;strong&gt;Are you looking for something unique?&lt;br /&gt;&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;Prisons are one of the most challenging, yet rewarding places for healthcare professionals to work. If you are a qualified nurse, or soon to qualify, and want a role where you can develop your existing skills and learn something new every day in an environment that never stands still, then this is it!&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;As a healthcare provider, we recognise the fact that prisoners are a socially excluded group with complex healthcare needs that can often be associated with poor outcomes. We believe in putting the patient first, regardless of the environment or their history. We are the market leader, providing care to over 30,000 patients in over 40 prisons across the country.&lt;br /&gt;&lt;br /&gt;Our core values are; everyone makes a difference, patients are at the heart of everything we do and together we make things better. If you share these values and have transferable skills we want to meet you!&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;h1&gt;&lt;strong&gt;Interested in clinical/clerical development?&lt;br /&gt;&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;We could give you the opportunity to develop in to a specialist role of your interest and benefit to the service i.e. ANP, BBV, sexual health, plastering, ILS (intermediate life support), health promotion, phlebotomy, vaccinations, suturing, wound care, RCGP, and long term condition courses.&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;h1&gt;&lt;strong&gt;What can we offer you?&lt;br /&gt;&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;As a Registered Nurse Adult/ Registered Mental Health Nurse, you’ll be an integral part of the healthcare team by bringing your top notch clinical skills and passion for care. You could be involved in anything from developing and leading clinics, undertaking examinations and tests as well as answering emergency bells and potentially being the first person to attend an emergency.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;You’ll receive an annual salary of up to £36,856 FTE - depending on experience; free DBS check, free uniform, free mandatory training, indemnity cover, CPD and re-validation support.&lt;br /&gt;&lt;br /&gt;As well as a number of benefits including a company pension scheme, 25 days annual leave plus 8 public bank holidays (pro-rata for part-time) plus other benefits including cycle to work scheme and clinical development opportunities.&lt;br /&gt;&lt;br /&gt;Onsite benefits at HMP Wormwood Scrubs include access to an onsite gym, free parking and subsidised café/restaurant.&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;h1&gt;&lt;strong&gt;How will we support you?&lt;br /&gt;&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;• Bespoke induction&lt;br /&gt;• Competency framework&lt;br /&gt;• Preceptorship (newly qualified practitioners)&lt;br /&gt;• Regular clinical supervision&lt;br /&gt;• Supported development into specialities such as diabetes or asthma&lt;br /&gt;• Regional and national career development opportunities&lt;br /&gt;• Our bespoke Learning Management System to address your learning needs&lt;br /&gt;• Support from the wider team&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;h1&gt;&lt;strong&gt;Next steps&lt;br /&gt;&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;If you are shortlisted, you will be contacted by the Internal Recruiter for this role. The recruiter will submit your CV to the hiring manager and in turn the Recruiter will arrange an interview for you to attend at HMP Wormwood Scrubs if the hiring manager feels that you are suitable for the job.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h1&gt;&lt;strong&gt;More information&lt;br /&gt;&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;HMP Wormwood Scrubs is a category B remand prison, and the maximum roll is 1279. It is based in the London Borough of Hammersmith and Fulham. It is closely located to Hammersmith Hospital.it is 11 mins away from White City station.&lt;br /&gt;&lt;br /&gt;We have vacancies for full-time hours of 37.5 and also part-time at 15 hours per week.&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;&lt;em&gt;Please note that this role is subject to Practice Plus Group UK Terms &amp; Conditions and offers of employment are subject to satisfactory receipt of references, enhanced DBS check and prison vetting.&lt;/em&gt;&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;&lt;em&gt;At Care UK we actively promote diversity and equal opportunities.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Practice Plus Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130136"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "London", "postalCode": "W12 0AE"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.516", "longitude": "-.240459"}}, "title": "Substance Misuse Nurse - HMP Wormwood Scrubs", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240908", "validThrough": "2020-11-06T23:59:59+0000"}