{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "32234", "minValue": "32234", "unitText": "YEAR", "value": "up to £32,234 per annum (depending on experience)"}}, "datePosted": "2020-10-30T17:05:22+0000", "description": "&lt;p&gt;&lt;strong&gt;Permanent contract&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is a great time to join us as we embark on an innovative approach to fully embed Occupational Therapy within our Norfolk First Response Service. This exciting transformation will see Occupational Therapy at the heart of our approach to enable people to be as independent as possible, to keep our service users out of hospital or to enable them to return home as soon as possible.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;As a qualified Occupational Therapist, you will manage a caseload of a mixed complexity cases as allocated by the Reablement Practice Consultant OT and Service Manager. You’ll assess the occupational and functional needs of people in their own home and take appropriate action to enable, influence and motivate them to live as independently as possible in the community, with due regard to statutory requirements, departmental policy, quality of life and good professional practice.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;With outcome focussed reablement plans, you’ll aim to reduce the impact of disability and ill health, using your skills and specialist disability/assistive equipment or housing adaptations to enable a home first approach.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You might be a newly qualified Occupational Therapist or have already carved out a career in the profession. What’s important is your determination to embrace and grow the independence of our service users and promote their independence. We will also grow you into a level 2 experienced Occupational Therapist through our competency framework.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;As a qualified Occupational Therapist with HCPC registration, you will evidence knowledge of current policy and practice within Health and Social Care. You’ll have experience of formulating reablement plans, using outcome measure tools and managing plans through an electronic case management system.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You’ll be aligned to one specific NFS locality, however you may be requested to support other teams across the county to ensure business continuity. You must be able to travel to venues that may not be accessible by public transport and there may be a required to work unsocial hours when necessary.       &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This is a great opportunity to join our team of specialist Occupational Therapists in supporting the community of Norfolk to live as independently as possible. It’s new, it’s exciting and we’d love you to come and join us.&lt;/p&gt;\n&lt;p&gt;All our office-based roles are currently working from home as part of our Smarter Working plans and to support the health and safety of all our colleagues. We anticipate that working remotely will be a key feature of this role and when offices re-open your office base will be discussed with your line manager.  Our technology platform and equipment are first class enabling you to connect and collaborate remotely. We ask that you have in place good Broadband connectivity.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Interviews will take place via video technology, where you will have the opportunity to discuss these working arrangements.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For informal enquiries please contact Faye Gower-Smith, Principle Occupational Therapist on 07450742871.  &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Norfolk County Council", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=129523"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Norfolk - South", "postalCode": "NR1 2DH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6154", "longitude": "1.30769"}}, "title": "Occupational Therapists (Level 1)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251035", "validThrough": "2020-11-10T23:59:59+0000"}