{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum, pro rata"}}, "datePosted": "2020-10-29T10:31:49+0000", "description": "&lt;p&gt;&lt;strong&gt;Are you an ambitious Radiographer looking to progress your career as a CT specialist? &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Then we have the perfect opportunity for you as, due to an exciting expansion in our CT department, we are now looking for radiographers to join our friendly team!&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Do you want to work for a Radiology Service that excels in its service delivery and benefits from impressive equipment standards? &lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;With QSI accreditation this is a forward thinking and progressive Radiology service in an 800+ bed acute DGH.&lt;/li&gt;\n&lt;li&gt;The Radiology department has a busy CT department, currently running five CT scanners within the Trust, providing specialist CT examinations including cardiac CT, CT colonography and CT guided biopsies.&lt;/li&gt;\n&lt;li&gt;In partnership with Althea, the department benefits from a managed equipment service which ensures equipment is kept up to date and looks after our 3 MRI scanners, brand new US department, interventional suites, 5 CT scanners and 3 cath labs.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Would you like to feel supported and valued whilst caring for others? &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As well as taking pride in caring for our patients, we also prioritise taking care of our employees! You will be part of a dynamic team who understand the challenges of working in a CT department and the importance of supporting each other.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Would you like to work in one of the most desirable places within the UK? &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Musgrove Park Hospital is in Taunton, with excellent transport links and easy access to the coast and surrounding countryside. There are excellent educational facilities in the area and both regional centers of Bristol and Exeter are accessible by road in less than an hour.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Is this the role for you? &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Applications from CT trained or enthusiastic band 5 radiographers are welcome. If you are passionate about providing an exemplary service to patients and keen to work hard to excel then we would love to hear from you!&lt;/p&gt;\n&lt;p&gt;As part of this role, you will get the opportunity to participate in our 24/7 out of hours, service provision and will work at a number of peripheral sites.&lt;/p&gt;\n&lt;p&gt;We encourage and welcome informal calls and visits so please get in touch if you would like to find out more …&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;em&gt;What to expect at interview: &lt;/em&gt;&lt;em&gt;As part of the interview process, you will be required to bring the following with you: Proof of any essential qualifications stated on the Job Description, proof of NHS payslip if coming from another NHS Organisation and all ID to prove your identity and Right to Work (More details will follow for successful applicants invited to interview). &lt;/em&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details contact:&lt;/p&gt;\n&lt;p&gt;Adam Turner&lt;/p&gt;\n&lt;p&gt;Job title&lt;/p&gt;\n&lt;p&gt;Operatonal Manager&lt;/p&gt;\n&lt;p&gt;Email address Hannah.J.Parker@SomersetFT.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number 01823 34 2406&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Somerset NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121360"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Musgrove Park Hospital, Taunton", "postalCode": "TA1 5DA"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.012", "longitude": "-3.11979"}}, "title": "CT Specialist Radiographer (Band 6)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247925", "validThrough": "2020-11-12T23:59:59+0000"}