{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pa pro rata"}}, "datePosted": "2020-10-16T12:02:57+0100", "description": "&lt;p&gt;Are you a highly motivated, dynamic and enthusiastic nurse who wants to be part of a growing, vibrant and friendly multidisciplinary team delivering a high standard of care?....... Then come and join us in the Emergency Department at Tunbridge Wells Hospital!&lt;/p&gt;\n&lt;p&gt;If you enjoy new challenges and are looking to grow within your career and develop new clinical skills and knowledge and are seeking a career pathway with developmental opportunities then this is the department for you.&lt;/p&gt;\n&lt;p&gt;The Emergency Department at Tunbridge Wells Hospital is a busy department seeing approximately 80,000 patients per year and is a designated Trauma Unit (TU) working as part of the SELKaM network. Based in Pembury we offer good rail link to London and the South coast and a free staff bus service from the main line rail station at Tonbridge .&lt;/p&gt;\n&lt;p&gt;We work as a team to deliver high quality emergency care to patients presenting with a broad spectrum of conditions within our new state of the art department which comprises of a 6 bedded resuscitation room, 16 majors cubicles, a rapid assessment area, designated paediatric emergency department, minor injuries and triage streaming.&lt;/p&gt;\n&lt;p&gt;We offer a compressive orientation and education programme including an in-house Emergency Care Foundation course that is accredited to the University of Greenwich. We also offer a career pathway and support the RCN competencies in Emergency Care to ensure that all our staff received not only the extended clinical skills and knowledge that they require but also to ensure that they have personal support when working in this challenging clinical environment. All staff are supported by the ED Matron, a Practice Development Nurse and a dynamic team of Band 7 Senior staff.&lt;/p&gt;\n&lt;p&gt;You will be expected to attend the Trust’s Induction Programme for RNs, RMs and ODPs (which starts on the first day of employment). The programme is full-time (please contact the programme lead if this is problematic: nicola.henthorn@nhs.net), lasts for two weeks and will involve travelling to both Trust sites. The programme includes supernumerary shifts in the clinical area and classroom-based study days which run from 9am to 5pm.&lt;/p&gt;\n&lt;p&gt;Please note that appointment to this post will be subject to a satisfactory Disclosure &amp; Barring Service Check at enhanced level. (Enhanced level now includes regulated checks against vulnerable adults and children)&lt;/p&gt;\n&lt;p&gt;We are passionate in supporting our staff to develop and have great opportunities for career progression. We take equality and diversity seriously and seek to empower all diverse groups within our trust. We seek to develop a culture where diversity in all its forms is celebrated. We are committed to ensuring that women are empowered to work at all levels of management and that working patterns are as flexible as possible giving all members of staff opportunity to flourish in using their skills for our patients. We work across our trust to enable those who consider themselves to have a disability both visible and invisible to have access to all they need to thrive in their work environment. We work with Stonewall to embed an inclusive and accepting culture for all lesbian, gay, bisexual and transgender staff. We have 78 nationalities working in our trust and we are proud of this. We are active in embracing the ethnic and cultural diversity in our trust. We work to empower people with any protected characteristic to have opportunities to work in an environment that helps them to contribute to the best of their ability, recognising and valuing the unique contributions each of us brings for best quality care and service to our patients. We are committed to supporting the delivery of the Equality Act with zero tolerance for any discrimination, harassment or victimisation of applicants and staff with these protected characteristics&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;Closing Date: Sunday 15th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview Date: TBC&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameSarah HarrisonJob titleED MatronEmail addresssarah.harrison1@nhs.netTelephone number01892 635838&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120635.png", "name": "Maidstone and Tunbridge Wells NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120635"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Tunbridge Wells Hospital, Tunbridge Wells", "postalCode": "TN24QJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.1491", "longitude": ".307289"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916230065", "validThrough": "2020-11-15T23:59:59+0000"}