{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum pro rata"}}, "datePosted": "2020-11-02T16:31:16+0000", "description": "&lt;p&gt;&lt;strong&gt;Continuity of Care Midwife/ Experienced Midwife/ Community Midwife&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are looking to expand our team of midwives to support the implementation of Continuity of Carer and would be interested in applications from highly motivated and innovative midwives who would like to join this very friendly and high performing Trust. The Trust is set over three sites in the beautiful Hertfordshire countryside, with its excellent transport links.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The National Maternity Review (2016) sets out a vision for maternity services to provide a safe and personalised service, based around the needs of the woman and her family. At the heart of this vision is the development of relationships based on mutual trust and respect and continuity of carer throughout the journey to parenthood. It is well documented that good continuity of carer during pregnancy, birth and the postnatal period can reduce interventions and positively influence maternal and neonatal outcomes, maternal satisfaction and midwives’ job satisfaction. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Role and responsibilities:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;To provide high quality, personalised care to a defined caseload of women in the community, hospital and/or birthing unit setting. As the named midwife, you will be responsible for coordinating care and developing an ongoing relationship of trust, breaking down barriers to positively impact clinical outcomes and maternity experience.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The post holder will: &lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Be a part of a small team of 6-8 midwives exploring innovative ways of working&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Provide antenatal (including parent education), intrapartum and postnatal care in all settings based on a team continuity model with a defined caseload&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Work closely with specialist colleagues and our multidisciplinary teams to deliver choice and personalised care to women and families&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Work autonomously and flexibly managing your own time to meet the needs of the women within your caseload, including undertaking on calls, while supporting a suitable work-life balance and family care arrangements&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Contribute to data collection and evaluation relating to the continuity team&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Participate in engagement events both in Trust and the wider community promoting continuity of carer&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;We have a staged approach to the implementation of Continuity of Carer and we would like applications from midwives who are interested in any of the 3 posts below:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;1. Continuity of Carer midwife post - ready to join a Continuity of Carer team immediately&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;2. Community midwife post - to support us in our traditional community midwifery models prior to the full implementation of Continuity of Carer at which point you will join at Continuity of Carer team&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;3. Maternity Unit Midwife Post - to support our maternity unit based services prior to implementation of full Continuity of Carer at which point you will join a Continuity of Carer team&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;At the East and North Hertfordshire NHS Trust we are proud of the range of maternity services we provide and the excellent high quality care we give to the women babies and their families who trust us to support them at this very important time in their lives. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Our facilities are state of the art, with bright airy modern rooms and an alongside midwifery led birthing unit. Our community teams cover a vast geographical area and there is also the opportunity to rotate throughout all areas of maternity so whatever your interest, we would be happy to discuss this with you.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We pride ourselves on being able to offer excellent continuous career development opportunities, a preceptorship programme, flexible working arrangements to support your work / life balance, childcare vouchers and support for working parents and carers.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If you are looking for a challenge and would like to come and discuss the next role in your career pathway and the amazing contribution which you can help us make towards maternity transformation and improving the outcomes for women and their families, please submit your application. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We have made the recruitment process easy so that you can start the job you have always dreamt of and our midwifery team are waiting to help, support and guide you through every stage of this process.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please contact us if you would like to ask any questions or discuss these roles further, we are open to thoughts, ideas and innovative approaches to delivery of maternity care.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If you would like to discuss the Continuity of Carer roles, please contact either:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Frankie Kilmurray - Consultant Midwife - fkilmurray@nhs.net&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Pam Langford - Better Births Midwife - pamlangford@nhs.net&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If you would like to discuss the Community Midwife role moving towards Continuity of Carer, please contact either:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Aisling Thurley - Community Midwife Team Leader - aisling.thurley@nhs.net&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If you would like to discuss the Maternity Unit Midwife role moving towards Continuity of Carer, please contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Susan Norris - Maternity Matron - susan.norris@nhs.net&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120840.jpg", "name": "East and North Hertfordshire NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120840"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Lister Hospital, Stevenage", "postalCode": "SG1 4AB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.9242", "longitude": "-.211889"}}, "title": "Continuity of Carer Midwife/ Experienced Midwife/ Community Midwife", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252873", "validThrough": "2020-11-23T23:59:59+0000"}