{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 p.a. pro rata"}}, "datePosted": "2020-11-03T16:16:16+0000", "description": "&lt;p&gt;&lt;strong&gt;Our Trust&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Cambridge University Hospitals (CUH) NHS Foundation Trust comprises Addenbrooke’s Hospital and the Rosie Hospital in Cambridge. With over 11000 staff and over 1100 beds the priorities of the Trust focus on a quality service which is all about people – patients, staff and partners. Recognised as providing ‘outstanding’ care to our patients and rated ‘Good’ overall by the Care Quality Commissioner, is testament to the skill and dedication of the people who work here. CUH’s values – Together- safe, kind, excellent – are at the heart of patient care, defining the way all staff work and behave. The Trust provides accessible high-quality healthcare for the local people of Cambridge, together with specialist services, dealing with rare or complex conditions for a regional, national and international population.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are looking to recruit on a permanent basis a Patient Safety Manager. We are looking for a highly motivated individual to manage operational elements of governance processes in relation to Patient Safety. A key element of this role will be supporting the organization to undertake high quality Serious Incident investigations. This is an exciting time for Patient Safety in the NHS as CUH begins to implement the NHS Patient Safety Strategy and Patient Safety Incident Response Framework. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This role will include:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Support the effective implementation of the Trust’s policy “Management of incidents and serious incidents requiring investigation” on behalf of the Head of Patient Safety Improvement. You will undertake the role(s) of the Trust’s Patient Safety Managers.&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;You will be responsible for the implementation, provision and maintenance of robust systems and processes for the management of patient safety and incident management across the Trust. You will promote the reporting of all incidents, including potential serious incidents and Never Events across the Trust. They will support the work of Head Patient Safety Improvement as directed and will take lead roles on any new national and regional initiatives.&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;You will be expected to strengthen and promote a culture of patient safety, providing a visible presence to front line staff to support the investigation of incidents and serious incidents, and to promote the implementation of learning arising from investigation to ensure safety improvement takes place.&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;A key role within this will be to identify, develop and deliver training in incident reporting and investigation techniques to include root cause analysis skills, and action planning, to enable that lessons learned from incidents are robust and to encourage to staff to feel empowered to take action to minimise risk to patient safety, patient experience and clinical effectiveness.&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;You will carry an individual portfolio of work, which is discrete, measurable and which drives the direction of travel in relation to patient safety. This will include leading on specific patient safety projects/initiatives as directed by the Director for Clinical Quality or the Head of Patient Safety Improvement.&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;You will work in partnership, providing professional support to the divisional quality managers to ensure consistent delivery of the patient safety agenda and encourage the development of the devolved clinical governance structure.&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;We strongly encourage informal visits/discussions to find out more about this exciting opportunity within Patient Safety Team. &lt;br /&gt;&lt;/strong&gt;&lt;strong&gt;&lt;br /&gt;&lt;/strong&gt;This vacancy closes on: - 16 November 2020 Midnight&lt;/p&gt;\n&lt;p&gt;Please note if you would like to discuss the required hours of this role further, you should approach the contact given. In some cases alternative working hours will be considered.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Benefits to you&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We offer development opportunities and a wide range of benefits including on-site leisure facilities, shopping concourse, day nurseries and access to a great transport system with easy access to airports and rail travel. For further details of our fantastic benefits please refer to the attachment below - CUH Benefits. Please note if you would like to discuss the required hours of this role further, you should approach the contact given. In some cases alternative working hours will be considered. We welcome applications from the Armed Forces.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameRichard SmithJob titleHead of Patient Safety ImprovementEmail addressrichard.smith@addenbrookes.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Cambridge University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121319"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Addenbrookes Hospital - Division Corporate, Cambridge", "postalCode": "CB2 0QQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1751", "longitude": ".141751"}}, "title": "Patient Safety Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254741", "validThrough": "2020-11-16T23:59:59+0000"}