{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-10-29T10:01:30+0000", "description": "&lt;p&gt;&lt;strong&gt;Coventry and Warwickshire Partnership Trust&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Integrated Community Services&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Out of Hospital &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Are you a reliable, dynamic, enthusiastic and well-motivated person with experience of working in a community, hospital and/or rehabilitation setting? Are you looking for a new exciting challenge in a band 6 role?&lt;/p&gt;\n&lt;p&gt;An opportunity has arisen within our Integrated Care offer to recruit band 6 physiotherapists with both full and part time hours available; to provide therapy for patients discharged from hospital with ongoing rehabilitation needs, both in their own home and in reablement units.&lt;/p&gt;\n&lt;p&gt;The team, based at CWPT will work alongside colleagues from Occupational Therapy and Social Care within Coventry City Council to provide holistic care to meet a variety of patient reablement and rehabilitation needs.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;As a senior physiotherapist, you will be expected to work independently and effectively in the Community whilst supervising unregistered members of the team. All rehabilitation is patient centred and values based to ensure a high standard of meaningful patient care with an aim to enable patients to live as a safe and independent lives as possible.&lt;/p&gt;\n&lt;p&gt;This post offers the successful candidate the opportunity to consolidate and develop clinical skills through structured development and supervision, working alongside a Specialist Physiotherapist supporting increased scope of practice in managing patients in a Community setting. We deliver a comprehensive in-service training programme and support opportunities to attend internal and external courses&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The successful candidate will be able to illustrate and reflect upon complex patient management and demonstrate sound clinical reasoning. You will be able to prioritise your workload and time effectively to support appropriate caseload management and delegation.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Service is committed to upholding the Visions and Values of Coventry and Warwickshire Partnership Trust. There will expectation that you are able to exemplify the Trust Visions and Values, with evidence of such in your application and at interview.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;It is essential that the post holder owns, is able to use and drive a car for the purpose of this post. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;* This post is subject to a DBS check.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further information or to arrange an informal visit please contact&lt;/p&gt;\n&lt;p&gt;Clare Mee on 03002000396&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Coventry and Warwickshire Partnership Trust (CWPT)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121204"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Paybody Building, Coventry", "postalCode": "CV1 4FS"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4181", "longitude": "-1.49965"}}, "title": "Physiotherapist - Band 6", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247800", "validThrough": "2020-11-22T23:59:59+0000"}