{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum pro rata"}}, "datePosted": "2020-10-22T09:31:37+0100", "description": "&lt;p&gt;We are seeking an enthusiastic individual to work as a Band 5 Occupational Therapist on George Ward. This is a 16 bedded male acute mental health ward at the Highcroft site.&lt;/p&gt;\n&lt;p&gt;Our Occupational Therapy (OT) staff are fully integrated members of the ward teams so post holders are expected to work shift patterns that include long days, early and late shifts to be provided over a 7 day period and are included within ward shift numbers for a proportion of the week.&lt;/p&gt;\n&lt;p&gt;Working closely with the Ward Manager, Lead Occupational Therapist, Senior Occupational Therapist and the ward multidisciplinary team, you support with delivering OT provision to a designated caseload, focusing on occupational performance and specific mental health and risk issues.&lt;/p&gt;\n&lt;p&gt;You will require interpersonal skills and commitment to work with adults within the field of mental health as well as the ability to work on your own initiative and be a committed team player. You will be required to coordinate a team of Nurses, Health Care Assistants and Activity Worker offering supervision and direction on a busy acute ward.&lt;/p&gt;\n&lt;p&gt;You will be joining a hard-working multi-disciplinary team dedicated to achieving the best outcomes for Service Users and Carers. You will be involved in various professional roles, supporting the day to day decisions, organisation of various individuals, projects and service developments. This will support you to embrace our philosophy of care; that the service user is at the heart of everything that we do. You will be expected to be flexible in your approach and welcome the opportunity to build and develop your knowledge and skills.&lt;/p&gt;\n&lt;p&gt;This position would be ideal for an enthusiastic Occupational Therapist with a vision to develop their career and clinical expertise within an acute mental health environment. The post would require the successful applicant to have understanding of mental health and have an awareness of risk management. You will be expected to have an understanding of the Model of Human Occupation (MOHO) which is primarily used within the trust.&lt;/p&gt;\n&lt;p&gt;In return, we can offer training and development opportunities linked to your personal development plan and the opportunity to be involved in shaping the services of the future.&lt;/p&gt;\n&lt;p&gt;The successful candidate will provide professional support towards the team, and will be heavily involved in quality initiatives, and implementing change that supports the trust strategy.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameEmma MaynardTelephone number0121 301 7360&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Birmingham and Solihull Mental Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120844"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Highcroft site, Birmingham", "postalCode": "B23 6DW"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5233", "longitude": "-1.85513"}}, "title": "Band 5 Occupational Therapist - George Ward", "url": "https://www.jobs.nhs.uk/xi/vacancy/916237722", "validThrough": "2020-11-12T23:59:59+0000"}