{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 to £24,157 pa"}}, "datePosted": "2020-10-28T16:15:15+0000", "description": "&lt;p&gt;The Senior Personal Assistant will provide comprehensive office and administrative support to the Medical Director of Organ Tissue Donation and Transplantation (OTDT), also provide support to other members of the OTDT Clinical Team.&lt;/p&gt;\n&lt;p&gt;The candidate will be responsible for the preparation of papers for meetings, taking minutes, researching the internet for relevant literature and co-ordinating travel, accommodation arrangements, diary co-ordination and communication with senior personnel within the OTDT Clinical Team and NHSBT.&lt;/p&gt;\n&lt;p&gt;A high standard of written and spoken English is required, together with good keyboard skills supported by RSA level 2 or equivalent. This is a demanding role which will require excellent organisational skills with experience of working in a busy office environment and a high level of competency using Microsoft Office, including creation of spreadsheets and PowerPoint presentations. The postholder must also be a flexible team player with good communication and customer care skills.&lt;/p&gt;\n&lt;p&gt;In return we offer a range of NHS benefits - including a generous holiday allowance, attractive pension scheme and discounts - and plenty of opportunities for development in a lively, friendly environment.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NHS Blood and Transplant (NHSBT)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120628"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "National", "postalCode": "BS34 8RR"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5061", "longitude": "-2.55128"}}, "title": "Senior PA", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247333", "validThrough": "2020-11-15T23:59:59+0000"}