{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62001", "minValue": "53168", "unitText": "YEAR", "value": "£53,168 - £62,001 per annum  / pro rata"}}, "datePosted": "2020-11-06T10:46:30+0000", "description": "&lt;p&gt;&lt;strong&gt;Head of Employee Relations&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Division: Corporate&lt;/p&gt;\n&lt;p&gt;Care Group: Human Resources&lt;/p&gt;\n&lt;p&gt;Band: 8B&lt;/p&gt;\n&lt;p&gt;Salary: £53,168 - £62,001 per annum / pro rata&lt;/p&gt;\n&lt;p&gt;Interview Date: Friday 4th December 2020&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Looking for a commitment to a &#39;Just Culture&#39;, not &#39;Just a Job&#39;?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As the new Deputy Director of HR &amp; OD at the Trust I am pleased to have the opportunity of appointing to this critical role within my senior HR team. Medway NHS Foundation Trust is an improving Trust that is going from strength to strength in delivering Well-Led services to our patients, and this role will be pivotal in continuing our commitment to embedding a Just and Learning Culture.&lt;/p&gt;\n&lt;p&gt;This is a perfect opportunity for an experienced senior HR professional to shape our approach to employee relations over the next few years and build a solid framework for the provision of proactive, quality advice.&lt;/p&gt;\n&lt;p&gt;The ideal candidate will be able to strike the right balance between championing quick, informal resolution of issues whilst being steadfast in supporting managers to take appropriate formal action where appropriate.&lt;/p&gt;\n&lt;p&gt;The role will directly manage a small team of HR Managers / Advisors and will work closely with the Divisional HR Business Partners to ensure staff feel supported and managers confident in people management.&lt;/p&gt;\n&lt;p&gt;This will include setting up a framework of ongoing training, for the prompt escalation of issues, for quality assuring policies / practises, the approach to complex issues, and partnering with key stakeholders (including union colleagues, Freedom to Speak Up Guardian and employment law solicitors) to ensure there is full confidence in the services provided.&lt;/p&gt;\n&lt;p&gt;The successful candidate will need to demonstrate experience of managing a high performing team, providing clear expert advice in complex employee relations cases and advanced communication skills. Mediation skills are highly desirable, though training can be provided if required.&lt;/p&gt;\n&lt;p&gt;The Trust and its employees are all committed to creating and maintaining a fair and supportive working environment and culture.&lt;/p&gt;\n&lt;p&gt;As part of our commitment to you, we will give you the opportunity to utilise and enhance your talents to assist us in the development of shaping the future of Medway NHS Foundation Trust.&lt;/p&gt;\n&lt;p&gt;The Trust offers a number of apprenticeships and training opportunities in Leadership and Management, Business Services, Finance, Accounting, Human Resources, Clinical Support Work, Research and Innovation, Nursing Associate and Assistant Practitioner alongside our in-house comprehensive clinical pathways.&lt;/p&gt;\n&lt;p&gt;Our hope is that our education pathways will play a key role in enabling you to challenge the practices of the past and build capability for the future.&lt;/p&gt;\n&lt;p&gt;The Trust is committed to the protection of children, young people, their families and vulnerable adults accessing its services. Promoting the message that “safeguarding is everyone’s business” is vital to ensure our patients are protected and safe from abuse. To this end you must comply with Trust’s and the Kent and Medway Safeguarding Board’s policies on safeguarding children, young people and vulnerable adults.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Dave Hurrell - Deputy Director of HR &amp; OD&lt;/p&gt;\n&lt;p&gt;david.hurrell1@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121062.png", "name": "Medway NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121062"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Gillingham", "postalCode": "ME7 5NY"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3783", "longitude": ".542246"}}, "title": "Head of Employee Relations", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259281", "validThrough": "2020-11-19T23:59:59+0000"}