{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum (pro rata)"}}, "datePosted": "2020-10-23T17:01:04+0100", "description": "&lt;p&gt;&lt;strong&gt; Are you passionate about working with older adults in a rehabilitation setting with a range of physical and mental health needs?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Are you able to work holistically in a patient-centred environment?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking to recruit an Occupational Therapist to join our therapy team on the wards at Lings Bar Hospital. The focus of the hospital is to maximise and enable independence of the individual and the nature of work is fast paced.&lt;/p&gt;\n&lt;p&gt;The role of the Occupational Therapist is:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To hold a patient caseload to facilitate effective rehabilitation and timely discharges of potentially complex patients with support of the Senior therapists.&lt;/li&gt;\n&lt;li&gt;To manage your caseload effectively and to contribute to the MDT management of the patients.&lt;/li&gt;\n&lt;li&gt;To delegate appropriate caseloads to Assistant Practitioners and tasks to support staff.&lt;/li&gt;\n&lt;li&gt;To provide support and clinical supervision to support staff.&lt;/li&gt;\n&lt;li&gt;To take Occupational Therapy students once relevant training has been completed.&lt;/li&gt;\n&lt;li&gt;To take a lead on a delegate Link Role such as Falls Management, Tissue Viability or Palliative care. This will involve attending training sessions and feeding back to the team as needed.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We are a well-established therapy team and work closely with the Short Stay Reablement Unit and Community Therapy teams to ensure effective transitions through the system. We are also developing links with MHSOP and NUH for learning and service development opportunities.&lt;/p&gt;\n&lt;p&gt;You can expect from us:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Regular clinical supervision on a 1:1 and peer group basis.&lt;/li&gt;\n&lt;li&gt;In-service training as needed.&lt;/li&gt;\n&lt;li&gt;Links with MHSOP and NUH for shadowing and learning opportunities.&lt;/li&gt;\n&lt;li&gt;Full induction program.&lt;/li&gt;\n&lt;li&gt;Commitment to your development and learning needs whenever possible.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;You will need to be motivated, resourceful and committed to providing excellent interventions to older people. A full UK driving licence and vehicle for business use is required for this post; however reasonable adjustments will be made for disabled individuals in line with the Equality Act 2010.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Applications are also welcome from those out of clinical practice who would like to return to the profession through the Return to Practice Program. Please contact Amy Freeman or look on the HCPC website for further details if you are interested in this option. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact Amy Freeman, Therapy Team Leader on amy.freeman@nottshc.nhs.uk or 0115 9691300 Ext 13637/13738&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;You could also contact Laura Huguenin, Senior Physiotherapist on 0115 9691300 Ext 13637/13738 if Amy Freeman is not available.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120975.jpg", "name": "Nottinghamshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120975"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Lings Bar Hospital, Nottingham", "postalCode": "NG2 7PR"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9334", "longitude": "-1.1332"}}, "title": "Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241395", "validThrough": "2020-11-08T23:59:59+0000"}