{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "48639", "minValue": "36411", "unitText": "YEAR", "value": "£36,411 to £48,639 p.a. pro rata"}}, "datePosted": "2020-10-29T17:54:20+0000", "description": "&lt;p&gt;&lt;strong&gt;Safeguarding Health Practitioner- MASH&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary: £36,411 to £48,639 p.a. pro rata&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;15 hours per week&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Fixed term contract or secondment opportunity for 12 months maternity cover &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;There has never been a more exciting time to work in Swindon’s Children, Families and Community Health service. We’ve already taken huge strides forward with our journey for an integrated approach to children’s health, education support and social care and now we’re ready to move on to the next stage in our development.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;As we move forward it’s vital that everything we do and every service we provide is delivered in a robust way and is in line with national standards and protocols. That’s where you come in!&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This post has responsibility for the quality assurance of the safeguarding aspects of community health activities within the Children, Families and Community Health service. You will provide oversight and scrutiny of the delivery of high quality community health safeguarding services to vulnerable children and ensure they are in line and comply with national legislation, policies and guidance. In addition you will have a key role in promoting and sharing good professional practice, providing advice and expertise to our wide range of health professional practitioners and ensuring excellent safeguarding training is in place and being accessed by staff.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The post-holder will report directly to the Principal for Health and Wellbeing, who is the CQC registered manager for our regulated health activities across children’s community health activities.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are inviting applications from suitably qualified and experienced candidates from a relevant, registered health professional background. You should be able to demonstrate substantial child protection experience, excellent interpersonal and communication skills, know how to apply support and challenge to effectively support practice improvement and the ability to work in a multi-disciplinary environment.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This is an important and autonomous role for an experienced and motivated professional. If you have the background and experience to deliver in this exciting and challenging role, we want to hear from you.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This role is a fixed term contract or secondment opportunity for 12 months maternity cover. Internal interested parties are required to discuss a secondment opportunity with their own line manager before applying.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;In return for your talents, we offer a range of benefits including:&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Flexible working&lt;/li&gt;\n&lt;li&gt;25 days holiday&lt;/li&gt;\n&lt;li&gt;A career average revalued earnings (CARE) pension scheme&lt;/li&gt;\n&lt;li&gt;Purchase of annual leave&lt;/li&gt;\n&lt;li&gt;Leisure and Legal Services discounts&lt;/li&gt;\n&lt;li&gt;Eating Out, Shopping and Entertainment discounts&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Please note candidates must be fluent in the English language (as a requirement of Part 7 of the Immigration Act – for the effective performance of a customer-facing role).&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;To discuss this role in more detail please contact Natalie Herring, Named Nurse for Safeguarding Children on 07890 394643 alternatively email nherring@swindon.gov.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing date: 09 November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview date: 17 November 2020&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Swindon Borough Council", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130035"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Swindon", "postalCode": "SN1 2JG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5602", "longitude": "-1.77996"}}, "title": "Safeguarding Health Practitioner- MASH", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249246", "validThrough": "2020-11-09T23:59:59+0000"}