{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 to £21,142"}}, "datePosted": "2020-10-23T09:53:46+0100", "description": "&lt;p&gt;We help people do something extraordinary - donate blood, organs, tissues or stem cells to save someone in need.&lt;/p&gt;\n&lt;p&gt;In Tissue and Eye Services our specialist Retrieval Teams travel the country carrying out tissue retrievals to provide grafts for life saving and life enhancing surgery. We have an exciting opportunity for a new Retrieval Assistant to join our Liverpool team based in our state-of-the-art Tissue Bank in Speke.&lt;/p&gt;\n&lt;p&gt;As a Retrieval Assistant you will receive extensive hands on training to enable you to carry out the physical retrieval of tissues such as eyes, hearts, skin and bone from deceased donors – this process often takes place in a mortuary setting. You will be trained in the specialist tissue banking techniques that ensure NHSBT provide gold standard grafts to recipients all over the country. You will start work with NHSBT as a Retrieval Assistant (Band 3 - £19,737 to £21,142) progressing to Senior Retrieval Assistant (Band 4 – £21,892 to £24,157) following successful completion of your training – we anticipate this will take 6-12 months. As a Senior Retrieval Assistant, you will be responsible for the retrieval of eyes without supervision.&lt;/p&gt;\n&lt;p&gt;Due to the urgent nature of tissue donation you will be required to work evenings and weekends within a 7-day, 365 scheduled rota. It is essential that you are willing and able to drive long distances in various NHSBT vehicles (Full UK driving licence cat B required).&lt;/p&gt;\n&lt;p&gt;You will have NVQ level 3 in Care or Science or 4 GCSE’s at Grade C or above including English and Maths and/or equivalent knowledge of science or health care work acquired through formal training and experience. You will have excellent communication skills and will have the flexibility to deal with changing priorities throughout your working day. You must have good IT and organisational skills as you will have considerable administrative duties.&lt;/p&gt;\n&lt;p&gt;NHS Blood and Transplant (NHSBT) offers a dynamic and friendly working environment where diversity and teamwork are highly valued. Personal development is also considered a priority and is supported through extensive training and development opportunities open to all employees.&lt;/p&gt;\n&lt;p&gt;You can watch our teams in action on the BBC documentary “The Human Tissue Squad” (you can find this on Vimeo) where you can see how the amazing work carried out by our Retrieval Team transforms recipients lives.&lt;/p&gt;\n&lt;p&gt;For informal enquiries please contact Francesca Stevens at Francesca.stevens@nhsbt.nhs.uk. The advert will close for applications at midnight on the evening of Sunday 8th November and interviews are anticipated to be held on Wednesday 18th November.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NHS Blood and Transplant (NHSBT)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120628"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Liverpool", "postalCode": "L24 8RB"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3456", "longitude": "-2.87258"}}, "title": "Retrieval Assistant/ Senior Retrieval Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916239902", "validThrough": "2020-11-08T23:59:59+0000"}