{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "46294", "minValue": "40681", "unitText": "YEAR", "value": "£40,681 - £46,294 PA inc. HCAS - Pro-rata"}}, "datePosted": "2020-11-02T12:15:50+0000", "description": "&lt;p&gt;&lt;strong&gt;West Hertfordshire community respiratory service provided by CLCH has an exciting opportunity for an enthusiastic forward thinking specialist respiratory physiotherapist to join our friendly multi-disciplinary team. The post holder will provide patient centered integrated care, providing&lt;/strong&gt;&lt;strong&gt; specialist services including pulmonary rehabilitation, hospital at home for bronchiectasis / COPD, management of disordered breathing and home oxygen assessments. This will include engaging in novel ways of virtual service delivery. Working effectively within a multi-disciplinary team and demonstrating effective communication skills is essential.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Central London Community Healthcare NHS Trust (CLCH) works across London and Hertfordshire, and is rated Good by the Care Quality Commission. We’re also in the HSJ best places to work list and in Stonewall’s top employers index. Did you know Central London Community Heath NHS Trust has recently become responsible for delivering West Hertfordshire Community Adult Services? We are a Trust that specialises in delivering community healthcare across Hertfordshire and 11 London Boroughs. Community healthcare is our focus and our passion. We champion the role of community health professionals to make sure our patients get great care closer to home.&lt;/p&gt;\n&lt;p&gt;Our vision is to ensure that our patients are provided with an excellent experience and an excellent standard of care. We are a caring, dedicated and progressive team and aim to be the best within our field of care. If you share our vision and have what it takes to lead and support a team on this exciting journey of excellence then we would love to hear from you.&lt;/p&gt;\n&lt;p&gt;You will need to display excellent communication skills, and offer care in a kind and compassionate manner. You will be dynamic, innovative, hardworking, and have excellent written and verbal communication skills. We can offer you the opportunity to develop your therapy and management skills as well as supporting you to develop your leadership style and skills that will support you throughout your career.&lt;/p&gt;\n&lt;p&gt;We offer a range of staff benefits including travel loans, childcare vouchers and accommodation support.&lt;/p&gt;\n&lt;p&gt;We strongly encourage applications from all sections of the community including: disabled people, those from black and minority ethnic backgrounds and lesbian, gay, bisexual and transgender people.&lt;/p&gt;\n&lt;p&gt;You can look forward to award-winning training and development, excellent benefits including assistance with transport, child care, parking and comprehensive pension and health care schemes.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/125514.jpg", "name": "Central London Community Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=125514"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "West Herts Community Respiratory, HEMEL HEMPSTEAD", "postalCode": "HP2 4AD"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7509", "longitude": "-.468577"}}, "title": "Respiratory Physiotherapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251997", "validThrough": "2020-11-16T23:59:59+0000"}