{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 pro rata"}}, "datePosted": "2020-10-23T16:30:47+0100", "description": "&lt;p&gt;Band 6 Midwives&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for rotational/core midwives to join our enthusiastic and committed midwifery team. You will be joining a well-established team, dedicated to the on-going promotion of women-centered care and better births.&lt;/p&gt;\n&lt;p&gt;As a member of our team you will be professional, reliable, safe and compassionate for women, babies and their families. You will work collaboratively within our multidisciplinary team in an environment that is open, supportive and empowering.&lt;/p&gt;\n&lt;p&gt;Your experience will ensure that you provide a high standard of care to mothers and their relatives/carers. This in turn will be supported by our well established and robust in-house training programmes alongside an accessible approach to supervision.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Band 6 midwife&lt;/strong&gt; – for those who have successfully completed a preceptorship programme and/or are experienced midwives.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Benefits:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Flexible shifts including days, weekends and nights are available to support our growing population and service needs.&lt;/li&gt;\n&lt;li&gt;Competitive rate of pay&lt;/li&gt;\n&lt;li&gt;Paid annual leave&lt;/li&gt;\n&lt;li&gt;Training and development opportunities&lt;/li&gt;\n&lt;li&gt;The Trust supports regular bank only midwives in their revalidation plans.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Buckinghamshire Healthcare Trust is committed to providing staff with learning and development opportunities to support their career progression. We offer opportunities to work alongside specialist services including our internationally acclaimed spinal unit. Our maternity services provide care for approximately 4,800 women and their families. We offer a variety of birth choices for our diverse population and have a dedicated suite for women experiencing bereavement. We have a level 2 neonatal service and close links with the John Radcliffe Hospital in Oxford.&lt;/p&gt;\n&lt;p&gt;We positively promote flexible working practices and to ensure that our workforce reflects the population we serve. An onsite subsidised childcare facility is available and parking is available on all Trust sites.&lt;/p&gt;\n&lt;p&gt;Interested in joining our team? Have any questions? Do not hesitate to contact Kerie Eastgate Matron for Postnatal and Antenatal ward to arrange an informal visit/chat.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;If you have any further queries please contact :&lt;/p&gt;\n&lt;p&gt;Kerie Eastgate ( Matron for Antenatal and Postnatal ward )&lt;/p&gt;\n&lt;p&gt;Email address : kerie.eastagte@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number : 01296 316282 / 01296 315102&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Buckinghamshire Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120887"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Stoke Mandeville, Aylesbury", "postalCode": "HP21 8AL"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7983", "longitude": "-.802734"}}, "title": "Rotational Midwife Band 6", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241313", "validThrough": "2020-11-06T23:59:59+0000"}