{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum pro rata"}}, "datePosted": "2020-10-21T16:16:03+0100", "description": "&lt;p&gt;This 7PA Consultant post is required to support the Sutton Clinical Oncology team.&lt;/p&gt;\n&lt;p&gt;Around 1000 patients are referred to the Sutton Clinical Oncology team per year, with around 550 radical prostate treatments conducted annually. Patients with metastatic disease are cared for, using multiple lines of systemic therapy. The clinical practice is wide ranging and includes complex radiotherapy planning, palliative radiotherapy, SBRT, MR-guided radiotherapy, palliative chemotherapy, androgen-targeted therapies and radioisotopes for prostate cancer. A small number of penile cancer patients are referred to us for adjuvant or palliative radiotherapy each year. Participation in clinical trials is expected and leadership of clinical trials is encouraged. Clinical care across prostate and penile cancer is run as a team, with shared practice and shared patient care.&lt;/p&gt;\n&lt;p&gt;No regular inpatient duties are required, but the post-holder would be asked to provide senior cover to the ward teams occasionally.&lt;/p&gt;\n&lt;p&gt;The key aim of this post will be to work together with the existing Consultant team to deliver a high quality clinical service. The post holder will make a major contribution to the Unit’s programs of research.&lt;/p&gt;\n&lt;p&gt;The post holder will be based in Sutton but might be required to support services at the Chelsea branch of the Royal Marsden on occasion.&lt;/p&gt;\n&lt;p&gt;Full registration with the GMC is essential. Research experience, including a higher degree, is also essential.&lt;/p&gt;\n&lt;p&gt;Applicants are requested to upload a copy of their CV along with their application forms.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Dr Susan Lalondrelle,, Consultant Clinical Oncologist and Clinical Lead, susan.lalondrelle@rmh.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "The Royal Marsden NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123033"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Royal Marsden NHS Foundation Trust, Sutton", "postalCode": "SM2 5PT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3436", "longitude": "-.190366"}}, "title": "Consultant Clinical Oncologist -Uro Oncology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916237234", "validThrough": "2020-11-20T23:59:59+0000"}