{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 p.a. pro rata"}}, "datePosted": "2020-10-21T11:07:30+0100", "description": "&lt;p&gt;&lt;span&gt;Solent NHS Trust have an exciting opportunity for a Senior Community Nurse to join the Crisis team in Portsmouth community. We are looking for Mental Health or Learning Disability registered nurses for this position.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;As the successful applicant, you will be expected to assess patients in crisis and offer practical alternatives to hospital admission. The role will provide rapid assessment, planning and delivering effective, Evidence-Based home treatment in collaboration with service users, Carers and professionals from other established services. A strong emphasis is placed on assisting service users to learn from the crisis. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Assessment and risk assessment skills with the ability to work across a 24 shift rota will be required. Experience of working autonomously and within a team environment is also essential.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We will accept full and part time applications for these opportunities.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;For further enquiries about this role please contact Kim Lambe, A2i and CRHT Clinical Manager on kim.lambe@solent.nhs.uk or 0300 123 6610. We also welcome informal visits to our team. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Being a car driver and having access to transport is required for this role.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Please note that should this post attract sufficient interest, we may choose to close at an earlier date. We strongly suggest that you apply at an early stage.&lt;strong&gt;If we have not contacted you within four weeks of the closing date of this post, please presume that you have not been selected.&lt;/strong&gt;Candidates selected for interview will be contacted within 2-3 weeks; therefore you should check your emails regularly including junk mail folders.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/126954.jpg", "name": "Solent NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126954"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Portsmouth", "postalCode": "PO3 6AD"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8004", "longitude": "-1.06359"}}, "title": "Senior Mental Health / Learning Disability Community Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916236050", "validThrough": "2020-11-22T23:59:59+0000"}