{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-10-28T11:47:15+0000", "description": "&lt;p&gt;An opportunity has arisen for an experienced Mental Health professional to join the newly established children and young people mental health support team in Warrington.&lt;/p&gt;\n&lt;p&gt;The ‘Transforming Children and Young People’ Mental Health Provision: Green paper’ 2017 sets out ambition to ensure that children and young people showing early signs of distress are always able to access the right help, in the right setting, when they need it.&lt;/p&gt;\n&lt;p&gt;One of the key elements in this is the funding of new Mental Health Support Teams (MHSTs) mobilised in waves to provide specific extra capacity for early intervention and ongoing help. Their work will be managed jointly by schools, colleges and the NHS. These teams will be linked to groups of primary and secondary schools and to colleges, providing NICE guided interventions to support those with mild to moderate needs and supporting the promotion of positive mental health and wellbeing.&lt;/p&gt;\n&lt;p&gt;The MHSTs are committed to being child and young people focused. The needs and rights of children, young people and their families/carers are at the centre of the clinical services we provide.&lt;/p&gt;\n&lt;p&gt;We are looking for experienced and highly committed practitioners to support us in ensuring we deliver outstanding patient care, every time. The post holder will be working closely with Senior Management and the clinical team to support the implementation of the THRIVE model of service delivery.&lt;/p&gt;\n&lt;p&gt;You will recognise that, working with children, young people and their families, there is a need to ensure that the best interests of the child/young person is of primary consideration. The need to promote a service that is safe, respects the views of the child/young person by actively encouraging choice, engagement and involvement together in partnership with families and other agencies is fundamental to the delivery of the service.&lt;/p&gt;\n&lt;p&gt;The post holder will demonstrate an attitude which respects and values service users and their carers and will embrace the core values of the organisation. You will adopt the principles of Recovery and these principles will recognise the need to:&lt;/p&gt;\n&lt;ol&gt;\n&lt;li&gt;Promote safe practices&lt;/li&gt;\n&lt;li&gt;Value the aims of service users&lt;/li&gt;\n&lt;li&gt;Work in partnership and offer meaningful choice&lt;/li&gt;\n&lt;li&gt;Be optimistic about the possibilities of meaningful change&lt;/li&gt;\n&lt;li&gt;Value social inclusion&lt;/li&gt;\n&lt;/ol&gt;\n&lt;p&gt;This post is subject to &lt;strong&gt;an enhanced with adult&#39;s and children&#39;s barred lists &lt;/strong&gt;Disclosure and Barring Service (DBS) Check. Successful candidates will either have a valid DBS check with the Trust or will be required to pay for the cost of the DBS Disclosure which is £47.50 for an enhanced disclosure, the cost of which will be deducted from first salary.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Lisa Simpson - Operational Manager&lt;/p&gt;\n&lt;p&gt;lisa.simpson@nwbh.nhs.uk / 01925 664000&lt;/p&gt;\n&lt;p&gt;Peter Styzaker - Team Manager&lt;/p&gt;\n&lt;p&gt;Peter.Styzaker@nwbh.nhs.uk / 01924 664000&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120746.jpg", "name": "North West Boroughs Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120746"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Warrington", "postalCode": "WA2 8WA"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4284", "longitude": "-2.60844"}}, "title": "Senior Mental Health Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246428", "validThrough": "2020-11-08T23:59:59+0000"}