{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum, pro rata"}}, "datePosted": "2020-10-30T11:31:43+0000", "description": "&lt;p&gt;&lt;strong&gt;Are you a mental health professional who is passionate about improving the lives of children and young people with an Eating Disorder? &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Alongside the Somerset Clinical Commission Group, we have spent the last 3 and a half years establishing a dedicated team of skilled professionals to work with children and young people with an Eating Disorder, and their families and carers. Following the success of the team, we have excellent retention of staff and are excited to welcome a new Band 6 clinician to our CAMHS Community Eating Disorder Team in Somerset.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Would you like to be a part of highly regarded and specialist service that takes a holistic whole family approach to assessment and intervention? &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The multi-disciplinary team is made up of family therapists, psychologists, mental health practitioners, paediatric nurses, systemic family practitioners (SFP), psychiatrists, paediatricians, support workers, occupational therapists, and dieticians. Several clinicians have dual training. The service holds team working and a shared culture and ethos at its core. All cases have at least two clinicians involved and much of the work is conducted in therapeutic pairs.&lt;/p&gt;\n&lt;p&gt;The service has a systemic underpinning with family based treatment/single family therapy for eating disorders as its core intervention. This is within a comprehensive community offer comprising of Multi-family therapy, Cognitive behavioural Therapy-enhanced, Radically Open Dialectical Behavioural Therapy (RO-DBT), Psychiatric assessment and management, physical monitoring and physical risk management, dietetic advice and review, paediatric assessment and management including supported brief admissions to paediatric unit (3 week pathway), active liaison/training with the wider system, care co-ordination, and intensive support work out in the community. The service also has a dedicated Service-User-Participation group and is also developing a Parent group. The team pride themselves on creative and innovative working and see continued learning and professional development as essential for clinicians.&lt;/p&gt;\n&lt;p&gt;The team are proud to be part of the QNCC-ED assurance network and have had two extremely positive peer reviews. The team also recently won the Somerset ‘Our People Working Together Award’ in recognition of their development and implementation of the successful paediatric pathway. The team have an exceptionally low referral rate to tier 4 specialist eating disorder units.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Would you like a varied role that allows you to strengthen and broaden your skill set as a Mental Health Practioner? &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Now is a great time to join our team as our new Band 6 Mental Health Practitioner. The role involves care-coordination and providing therapeutic input to young people and their families. There are also opportunities to be involved in teaching and training and supporting group interventions.&lt;/p&gt;\n&lt;p&gt;You will be supported through a specific training and induction programme by senior clinicians in the team alongside the Clinical Lead.&lt;/p&gt;\n&lt;p&gt;The team operate mainly core hours 9am to 5pm, Monday to Friday with travel across the region being a requirement of the post.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Would you like the opportunity to undertake further study at a Postgraduate level? &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Within the role there is opportunity to undertake a Postgraduate Diploma in Evidence Based Therapies for Children and Young People: Systemic Family Practitioner for Eating Disorders. This IAPT training course commences in February 2021 and runs for one year. It comprises clinical hours within the CEDS team and university time at Exeter University. This will be subject to the successful applicant meeting course admission criteria.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Would you like to work in one of the most desirable places within the UK?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Working in Somerset, you can soak up all that the idyllic countryside has to offer with our areas of outstanding beauty and stunning coastlines. You get to enjoy these perks whilst still only being a stone’s throw away from bustling city centres like Bristol, Bath and Exeter and only two hours away from London.&lt;/p&gt;\n&lt;p&gt;There are excellent educational facilities in the area and, when compared to other regions, house prices are reasonable. You get to experience the best of both in Somerset, the countryside and the cosmopolitan – there is truly something for everyone!&lt;/p&gt;\n&lt;p&gt;For further details contact:&lt;/p&gt;\n&lt;p&gt;Dr Sarah Ensoll Clinical Lead &amp; Principal Clinical Psychologist&lt;/p&gt;\n&lt;p&gt;Sarah.Ensoll@SomersetFT.nhs.uk&lt;/p&gt;\n&lt;p&gt;07919395450&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Somerset NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121360"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Broadway Health Park, Bridgwater", "postalCode": "TA6 5LX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.1277", "longitude": "-2.99723"}}, "title": "Senior Mental Health Practitioner (CEDS-CYP) (Band 6)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249958", "validThrough": "2020-11-10T23:59:59+0000"}