{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62001", "minValue": "53168", "unitText": "YEAR", "value": "£53,168 - £62,001 per annum plus Fringe HCAS"}}, "datePosted": "2020-11-05T13:06:58+0000", "description": "&lt;p&gt;Surrey Heartlands Integrated Care System (ICS), brings together a group of local partners including GPs, commissioners, borough councils, public health and adult social care, the local acute and community services provider along with the ambulance service, community, voluntary and faith sectors with mental health and the children’s services provider. This environment provides a data rich and environment upon which to bring together combined health and social care datasets.&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen to provide support for the delivery of the Surrey Heartlands strategic agenda. As Senior Information Manager for the Surrey Downs Integrated Care Partnership (ICP) you will play a lead role in providing the relevant insight and analytical support to enable improvement in clinical services and processes, data modelling and activity/financial monitoring for contracted provider services.&lt;/p&gt;\n&lt;p&gt;We are looking for a confident and resourceful informatics professional with excellent analytical skills and a capacity to work with and influence colleagues across a range of disciplines and seniority. You will support the Associate Director of Information in leading a small team of Information analysts for the ICP footprint that meets with their Business Intelligence requirements. Educated to degree level in a numerate/analytical discipline or equivalent experience, you will have at least three years’ experience in a senior informatics analysis role or post graduate qualification in health informatics. You will also have experience of managing and an ability to train and develop staff.&lt;/p&gt;\n&lt;p&gt;For an informal discussion about the post please contact David Howell, david.howell5@nhs.net.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Surrey Heartlands CCG", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128537"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Cedar Court, 36 Guildford Rd, Fetcham, Leatherhead KT22 9AE", "postalCode": "KT22 9AE"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2931", "longitude": "-.335021"}}, "title": "Information Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257793", "validThrough": "2020-11-19T23:59:59+0000"}