{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pa"}}, "datePosted": "2020-11-03T17:30:37+0000", "description": "&lt;p&gt;Are you a Nurse looking at returning to practice, are you a Nurse thinking of a new challenge, are you about to Qualify and can&#39;t decide what area you want to work in? The acute Elderly Care wards may just be the place for you.&lt;/p&gt;\n&lt;p&gt;SWBH has 4 Acute Medical Elderly care wards. Vacancies are available at our Sandwell Site. Sandwell Hospital comprises of Lyndon 5 which is a 33 bedded mixed gender ward and Lyndon 4 which is a 34 bedded mixed gender ward.&lt;/p&gt;\n&lt;p&gt;We are looking for a band 5 staff nurse who is hard working, motivated and committed to the delivery of high quality care to our patients. This is an exciting time in Elderly care as we are at the start of putting a focus on Frailty while introducing competencies for our staff nurses with the Clinical Frailty Scale in mind. Frailty is apart of the NHS plan and is a condition that we as Nurses need to keep a focus on to provide evidence based care to our ageing population.&lt;/p&gt;\n&lt;p&gt;We foster a collaborative interdisciplinary relationship that promotes mutual respect and teamwork, with the Patient at our centre. We utilise cohesive MDT working in our everyday practice and you will be engaging with all Allied Health Professionals during your working day.&lt;/p&gt;\n&lt;p&gt;We can offer you a supportive bespoke programme designed to meet the needs of your own professional development, this includes supernumerary period with a dedicated preceptor, close involvement with our practice development nurse who will work with you to achieve further nursing skills and enrolment onto a new Elderly Care Competency Programme which we are just starting to roll out. For newly Qualified nurses your initial NMC pin number fee will also be paid for you by the trust.&lt;/p&gt;\n&lt;p&gt;We have full and part time hours available and flexible working can also be arranged.&lt;/p&gt;\n&lt;p&gt;Please contact any of us if you want to discuss any thing further, we look forward to hearing from you.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Sr Vikki Howard, L5 - 01215072833&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Sr Sam Walden, L4 - 01215072781&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120738.gif", "name": "Sandwell and West Birmingham Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120738"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Sandwell Hospital, Sandwell &amp; West Birmingham", "postalCode": "B71 4HJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5274", "longitude": "-1.98788"}}, "title": "Acute Elderly Care Band 5 Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254930", "validThrough": "2020-11-17T23:59:59+0000"}