{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 Dependant on experience"}}, "datePosted": "2020-10-30T14:46:28+0000", "description": "&lt;p&gt;&lt;span&gt;&lt;span&gt;Are you passionate about patient safety and organisational learning? Would you like to be part of an enthusiastic and diverse team of risk and governance champions? This is a pivotal role in the management of the process of Serious Incident investigations and the provision of support in their undertaking to all levels of staff. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The team provides high quality risk, governance and health &amp; Safety, support to all services and specialities across the Trust. We work closely with Multi-Disciplinary teams to support patient and staff safety, incident investigation, risk management and non-clinical and clinical governance.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The successful applicant will need to demonstrate the ability to work closely with team members from all professions and with the wider risk team to help coordinate support and management in respect of the Serious incident investigation process&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;University Hospitals Dorset NHS Foundation Trust ( as Poole Hospital) is currently rated ‘Outstanding’ for the CQC Caring Domain and ‘Good’ in Well – Led, with the Quality and Risk Team being drivers for success in areas of governance. Come and join us as we continue this journey.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Previous experience of risk management procedures and Datix are desirable but not essential. Candidates should have excellent IT and communication skills and experience of working in a busy team.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;To support the delivery of a high quality, safe and compassionate healthcare service, all staff are expected to act as a role model to others in all aspects of their work and consistently demonstrate an approach of friendly, professional, person-centred care with dignity and respect for all.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Please note: if this job requires you to have a DBS check to enable you to properly fulfil the requirements of the job, on appointment you will be required to repay the cost of obtaining a DBS check and this amount will be reclaimed from your salary.&lt;/p&gt;\n&lt;p&gt;Closing date: 12/11/2020&lt;/p&gt;\n&lt;p&gt;Provisional interview date week commencing: 30/11/2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Janey Harbord (Head of Governance &amp; Risk)&lt;/p&gt;\n&lt;p&gt;Email address: janey.harbord@uhd.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number: 0300 019 4014&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120850.PNG", "name": "Royal Bournemouth and Christchurch Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120850"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Poole Hospital, Poole", "postalCode": "BH15 2JB"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.722", "longitude": "-1.97311"}}, "title": "Risk Adviser-Serious Incidents and LERNS", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250631", "validThrough": "2020-11-12T23:59:59+0000"}