{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "YC72 - £82,096-£110,683 per annum"}}, "datePosted": "2020-10-28T15:46:28+0000", "description": "&lt;p&gt;&lt;strong&gt;Consultant in Intensive Care Medicine&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Working Pattern&lt;/strong&gt;: 10 PAs per week &lt;strong&gt;Pay Band&lt;/strong&gt;: YC: 72 £82,096 -£110,683&lt;/p&gt;\n&lt;p&gt;We are looking to appoint a Consultant with a special interest in Intensive care to the Department of Anaesthetics. This vacancy has arisen due to retirements from the Anaesthetic department.&lt;/p&gt;\n&lt;p&gt;The post holders will work in collaboration with the existing Intensive Care and General Anaesthetist team to provide a high quality, progressive professional critical care and anaesthetic service to a broad range of specialties. The appointee must possess a special interest in critical care along with evidence to prove his/her advanced experience in intensive care in addition to wide experience in all aspects of Anaesthesia. This post is offered at 10 PAs per week plus up to two additional PAs per week following negotiation.&lt;/p&gt;\n&lt;p&gt;This is an opportunity to join a friendly, cohesive department currently consisting of 23 Consultants, 14 Specialty doctors, 2 SpR (Higher) 9 WTE CT1&amp;2, 2 WTE FY1, together with specialist nursing team, in Pain, Perioperative Medicine and Critical care response team.&lt;/p&gt;\n&lt;p&gt;To be eligible for this posts you must possess a Primary medical degree registrable in UK together with relevant CCT or equivalent (“equivalence” must be confirmed by PMETB/GMC by date of interview); FRCA or equivalent; FFICM or EDIC; Full GMC registration with a Licence to Practice. You must also be on the GMC’s Specialist Register (or entry expected within 6 months from the date of interview).&lt;/p&gt;\n&lt;p&gt;A specimen Job plan is contained within the Job Description but sessions may be rearranged to suit the interests of the successful candidates and the needs of the department.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDr Olukoga , Clinical Director, or Dr Aditya Kuravi, Critical Care Lead, via the departmental secretary on 01922-656969.Job titleCONSULTANT ANAESTHETISTTelephone number01922 656969Additional contact information&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Dr Olukoga Clinical Director, or Dr Aditya Kuravi, Critical Care Lead, via the departmental secretary on 01922-656969.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120984.jpg", "name": "Walsall Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120984"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Walsall Manor Hospital, Walsall", "postalCode": "WS2 9PS"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5822", "longitude": "-1.99918"}}, "title": "CONSULTANT ANAESTHETIST With a Special  Interest in Intensive Care Me", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247251", "validThrough": "2020-12-20T23:59:59+0000"}