{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "42712", "minValue": "36070", "unitText": "YEAR", "value": "£36,070 - £42,712 (pro rata) pa inclusive of HCAS"}}, "datePosted": "2020-11-02T10:16:05+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;span&gt;Senior Midwife&lt;/span&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We have an exciting opportunity to expand our current midwifery workforce and are seeking to recruit senior midwives (Band 6). We wish to nurture aspiring clinical experts and leaders and we regularly provide secondment or career opportunities within the service. We provide a well evaluated, in-house multidisciplinary training programme (including PROMPT) and staff have the opportunity to attend external study days or enroll for academic modules at our local higher education institutes.&lt;/p&gt;\n&lt;p&gt;Kingston Maternity is a popular service with approximately 4900 births per annum. The National Maternity Survey 2019 rated Kingston as one of the best performing maternity services within London. The Care Quality Commission rated Kingston Hospital’s Maternity Service as ‘good’ in 2018 and the Trust ‘outstanding’ in 2019, with staff positive about the hospital and the services they were able to offer women and their families. Leadership is strong and well respected and there is a culture of learning and a desire to improve the service.&lt;/p&gt;\n&lt;p&gt;The current ratio of midwives to women is 1:28 enabling high quality midwifery focused care to be provided. Current services include specialist clinics (Fetal Medicine, Pre-term Surveillance, Multiple Birth, Diabetes, and Specialist Midwives services); an effective alongside midwifery led unit (over 18% of births) and a growing home birth service (approx. 4-5% of births). Kingston is proud of its strong multi professional learning and working culture and we are focused on effectively implementing the recommendations of the Better Birth Report.&lt;/p&gt;\n&lt;p&gt;Kingston Maternity Services are committed to implementing the recommendations of The National Maternity Review - &lt;em&gt;Better Births: Improving outcomes of maternity services in England&lt;/em&gt;. One element of this is being achieved through new continuity of carer midwifery models providing antenatal, intrapartum and postnatal care. At Kingston the implementation of Continuity of Carer is working well, with teams in place since early 2019, with 10 specialist or geographically located teams at present. For October 2020, we had approximately 33% of women booked onto a Continuity of Carer pathway. Some women see around 10 or more midwives throughout their maternity journey. Often women find it difficult to retell their personal stories from the start every time they meet a new healthcare professional. Continuity of Carer promotes a culture where women are the centre of care and it has shown that outcomes are improved e.g. fewer episiotomies, premature births, epidurals and mid-trimester losses.&lt;/p&gt;\n&lt;p&gt;If you are a passionate midwife with excellent communication skills and a drive to provide high quality care to women and their families please apply to join our multi professional maternity team. &lt;br /&gt;&lt;br /&gt;Please see the job description before making your application.&lt;/p&gt;\n&lt;p&gt;Please be aware that this post requires you to work a mixture of day and night shifts, weekends and bank holidays.&lt;br /&gt;&lt;br /&gt;Assessment: Online&lt;/p&gt;\n&lt;p&gt;MS Teams Interview Date: 9th Dec 2020 am&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details please contact: &lt;/strong&gt;Anita Mason via email a.mason2@nhs.net&lt;/p&gt;\n&lt;p&gt;Please email the PDM office to arrange an informal visit - khft.pdm@nhs.net&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameAnita MasonJob titleLead for Recruitment &amp; PDMEmail addressa.mason2@nhs.netTelephone number020 8934 2125Additional contact information&lt;/p&gt;\n&lt;p&gt;PDM office at: khft.pdm@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Kingston Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120946"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Maternity Department, Kingston Hospital NHS Foundation Trust, Kingston Upon Thames", "postalCode": "KT2 7QB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4143", "longitude": "-.283067"}}, "title": "Senior Midwife", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251529", "validThrough": "2020-11-16T23:59:59+0000"}