{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 to £44,503 pa"}}, "datePosted": "2020-11-05T20:30:10+0000", "description": "&lt;p&gt;&lt;strong&gt;Looking for a rewarding role in which you can help to deliver a safe and effective blood and tissue programme…then read on!&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is your chance to play your part in saving lives using your extensive knowledge of IT systems. Working in a small team of Operational Shift Engineers with a diverse knowledge set across Network/Security and Server/Storage infrastructure, you’ll support the development and delivery of our IT Operational strategy. You’ll make sure everything runs smoothly every day with a meticulous, methodical approach to the operational maintenance and patching for our entire ICT estate. In fact, you’ll be the one to lead and manage any trouble shooting or technical issues, quickly finding the most effective solutions. Understandably, you’ll make data protection and security a top priority in everything you do, incorporating system backups, cross-site data replication and managing offsite storage.&lt;/p&gt;\n&lt;p&gt;Having a range of effective communication skills will be vital to your success. You’ll be able to translate the most complex technical knowledge into layman’s terms. Quickly enabling others to come round to your way of thinking, you’ll have finely tuned persuasive, motivational, negotiating and training skills. You’ll need to be as approachable as you are technically astute, with extensive experience of successfully resolving a broad range of IT problems in a highly complex IT infrastructure, in a large national or multi-national organisation. Committed to continuous development, you’ll be as much a mentor as you are a manager to your talented team.&lt;/p&gt;\n&lt;p&gt;Our dedicated team collects, tests, stores and delivers blood, plasma and tissue to every NHS Trust in England and North Wales, as well as matching, allocating and analysing organ donations UK wide. As an essential service, we’re committed to positive transformation and we’re currently embarking on an ambitious programme of change.&lt;/p&gt;\n&lt;p&gt;This is an excellent opportunity to take your expert knowledge of complex IT systems to a whole new level, and, in doing so, enable people in need to benefit from life-saving operations and treatments. Put simply, a chance to improve patients’ lives – and yours.&lt;/p&gt;\n&lt;p&gt;The normal working hours for this role will be between 08:00 – 20:00, Monday – Friday.&lt;/p&gt;\n&lt;p&gt;This is a national vacancy, the successful candidate may be based at any of our main centres in the UK, final location to be agreed at interview.&lt;/p&gt;\n&lt;p&gt;From time to time you may be required to travel and spend time away from base, which will involve working irregular hours and overnight stays when required, with prior notice&lt;/p&gt;\n&lt;p&gt;This vacancy will close at midnight on the 22nd November 2020. Interviews have been arranged for 4th December 2020&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Take charge of your career and apply now!&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NHS Blood and Transplant (NHSBT)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120628"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "National", "postalCode": "BS34 7QH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5179", "longitude": "-2.56889"}}, "title": "IT Operations Shift Engineer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258800", "validThrough": "2020-11-22T23:59:59+0000"}