{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "50400", "minValue": "50400", "unitText": "YEAR", "value": "Up to £50,400 Depending on Experience"}}, "datePosted": "2020-10-23T12:46:03+0100", "description": "&lt;p&gt;The Immunophenotyping Laboratory would like to recruit an enthusiastic, responsible and self-motivated HCPC registered Senior Biomedical or Clinical Scientist to support the dedicated team within the high-throughput reference laboratory. As a valued team member, the Senior Biomedical/Clinical Scientist would be expected to manage the handling of samples and reagents, support scientists with flow cytometric assays and microscopy preparation, analyse, interpret and report complex immunophenotyping results, monitor and maintain laboratory equipment and lead the quality management within the department. Training and development is a key focus at Viapath and this is an excellent opportunity to enhance skills and knowledge in a specialist laboratory environment. There is also a keen interest in R&amp;D within the department which is supported by various funds and collaborators as we endeavor to provide a leading and fit-for-purpose service to our patients. There is culture of continuous quality improvement that applies to both staff and laboratory development.&lt;/p&gt;\n&lt;p&gt;As part of a fully-integrated diagnostic service, the post holder will work closely with the clinical team as well as the morphology, cytogenetics, histopathology and molecular teams within LS-HMDS. This role provides the opportunity to contribute to advanced patient care, selecting appropriate investigations, analysing and composing complex clinical reports for a spectrum of referral indications. The post holder will help evolve the repertoire of testing available to our patients, and have the opportunity to discuss their work by presenting at local, national and international scientific meetings. As a HCPC registered Senior Biomedical/Clinical Scientist, excellent communication skills and a strong work ethic are essential for the role as the post holder will ensure the timeliness of reporting of complex analyses to enable rapid patient treatment decisions.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Your development and learning&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will have a suite of learning opportunities available through the Scientific Learning and Development Fund and the ViAcademy through which you can receive funding for advanced qualifications.&lt;/p&gt;\n&lt;p&gt;Through our Innovation Fund, you can apply for finance to get that new innovative scientific project off the ground, and participate with the wider scientific community through symposiums, conferences and other peer group meetings.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;A little about the lab and &lt;/strong&gt;&lt;strong&gt;us:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Immunophenotyping Laboratory at Kings College Hospital, Denmark Hill, is a comprehensive haematological malignancy flow cytometry service which provides a broad spectrum of testing for diagnosing, prognosis and monitoring of Chronic and Acute leukaemias/lymphomas. The laboratory is an integral part of the London South - Haematological Malignancy Diagnostic Service (LS-HMDS). As well as the haematological malignancies, the Immunophenotyping Laboratory is also part of a reference center for the analysis of Paroxysmal Nocturnal Haemoglobinuria (PNH). It is fully UKAS accredited and in addition to the scientific staff in the laboratory, we are supported by a dedicated quality and clinical teams to ensure the highest standards at all stages of the diagnostic pathway. The laboratory is staffed by scientists who are specialists in leukaemia/lymphoma immunophenotyping and have significant experience in complex multiparameter flow cytometry.&lt;/p&gt;\n&lt;p&gt;LS-HMDS is a regional center for diagnostic services, covering most of Southeast England and with one of the largest myeloid/transplant practices in Europe. It is actively expanding with year-on-year sample number growth and new referral centers benefitting from the integrated reporting of the service. There are a plethora of CPD activities offered on-site at Kings and within Viapath including case reviews, journal clubs, study days and pioneering talks from both internal and external speakers.&lt;/p&gt;\n&lt;p&gt;King’s College Hospital Foundation Trust is one of the UK’s leading NHS Foundation Trusts in specialist teaching. King’s has various divisions including Neurosciences, Haematology, Cancer and Cardiovascular sciences, where there are unlimited opportunities to develop and perfect your career.&lt;/p&gt;\n&lt;p&gt;Over the last 170 years, King’s has delivered nothing but world class service to all its patients from deprived communities as well as some of the wealthiest in London.&lt;/p&gt;\n&lt;p&gt;To learn more about this opening or arrange a visit, please see contact details below or simply apply through the application process.&lt;/p&gt;\n&lt;p&gt;Interview will be held: November 23, 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Katy Sanchez&lt;/p&gt;\n&lt;p&gt;Head of Immunophenotyping&lt;/p&gt;\n&lt;p&gt;k.sanchez@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Viapath Analytics LLP", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=131534"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Kings College Hospital, London", "postalCode": "SE5 9RS"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4684", "longitude": "-.09228"}}, "title": "Senior Biomedical Scientist / Clinical Scientist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240576", "validThrough": "2020-11-15T23:59:59+0000"}