{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum"}}, "datePosted": "2020-10-26T12:46:27+0000", "description": "&lt;p&gt;An exciting opportunity has arisen in our Freedom to Speak Up Service. We are looking for a caring, compassionate and highly motivated person to become our next Freedom to Speak Up Guardian. You should be someone who wants to make a real difference, who can successfully engage with our colleagues, while remaining positive and flexible in challenging situations. The role is supported by a network of Speak Up Champions across the Trust who raise awareness and signpost colleagues who wish to raise concerns.&lt;/p&gt;\n&lt;p&gt;As the Freedom to Speak Up Guardian, you will be seen and known as someone in the Trust who staff can speak to in confidence if they have questions about a public interest concern or have concerns they feel are not being dealt with effectively. You will play a key role in supporting staff to raise concerns and keeping them informed of progress and outcomes of any investigation. You will manage a confidential email and phone line and will record and respond to all enquiries.&lt;/p&gt;\n&lt;p&gt;You will help to develop and sustain an environment that is open and honest and to support a culture where staff feel safe and comfortable about raising concerns and issues, no matter how big or small. You will have the ability to recognise and handle information with a sensitive and honest nature. It is important that you have the ability and confidence to challenge at all levels of the Trust and to give feedback that may be of a less positive outcome in supportive manner.&lt;/p&gt;\n&lt;p&gt;You will have regular meetings with the Chief Executive and other board members, and be responsible for reporting regularly to Board committees and meetings. You will therefore have excellent communication skills, be able to demonstrate active listening, process and interpret information, remain neutral, yet supportive and ensure that staff are treated equally and fairly. You will be organised and able to prioritise by risk assessing your workload and use your initiative, thrive under pressure and manage difficult situations sensitively and effectively. The ideal candidate will be confident and able to work autonomously and in a flexible way.&lt;/p&gt;\n&lt;p&gt;Support for the role will be provided through a number of channels including the Executive Lead and the Senior Independent Director within the organisation.&lt;/p&gt;\n&lt;p&gt;The is currently 0.6WTE funding available for a permanent post and 0.6WTE funding available for a temporary post until early Summer 2021.&lt;/p&gt;\n&lt;p&gt;There are a number of flexible opportunities that could be available including:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A part time permanent post&lt;/li&gt;\n&lt;li&gt;A part time fixed term contract/secondment post&lt;/li&gt;\n&lt;li&gt;A full time fixed term/secondment until early Summer 2021 with a possibility for extending&lt;/li&gt;\n&lt;li&gt;Other combinations which we are happy to discuss&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Closing date for applications is two weeks after publication. Interviews with the Chief Executive, Senior Independent Director and the Executive Lead will take place virtually.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt; Alis Rasul &lt;strong&gt;Freedom to Speak up Guardian&lt;/strong&gt; &lt;strong&gt;Alis.rasul@bhamcommunity.nhs.uk&lt;/strong&gt;07540 673897&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;IMPORTANT&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Please ensure you check your Trac account regularly as this is how we will communicate with you during the shortlisting and selection process.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Please ensure all sections of the application form are completed fully. Please particularly ensure that you provide full details of all referees including business email address, telephone contact details and postal address.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Please be aware that BCHC utilises a third party recruitment system (TRAC). When applying via NHS Jobs, your submitted application will be imported into TRAC and any correspondence will be sent via TRAC. We advise that you check your junk/spam emails.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Be Part of Our Team...&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Birmingham Community Healthcare NHS Foundation Trust (BCHC) has more than 5000 staff working across Birmingham and the West Midlands in a wide range of community nursing and specialist healthcare roles. BCHC delivers over 100 clinical services, in people&#39;s homes, health centres, clinics and inpatient facilities. We deliver a wide range of services for children, young people, parents and families as well as adults and community services, two community hospitals, services for people with learning disabilities, the internationally recognised West Midlands Rehabilitation Centre and one of Europe’s leading Dental Hospitals and School of Dentistry. We deliver all of this with a commitment to integrated, personalised care that is rooted in our local communities. We have an ambition to deliver outstanding, integrated care as one of the key NHS providers in the West Midlands.&lt;/p&gt;\n&lt;p&gt;If you want to ‘Be Part of Our Team’ and work with a Foundation Trust which is continuously striving for best care and healthy communities, we want to hear from you.&lt;/p&gt;\n&lt;p&gt;Birmingham Community Healthcare NHS Foundation Trust is committed to providing a safe working environment for all staff.&lt;/p&gt;\n&lt;p&gt;As part of the Trust’s on-going response to the management of COVID-19 secure workplaces, strict health and safety measures and infection prevention and control has been put into place. As with any healthcare setting that cares for patients, we are and remain committed to ensure that we adhere to nationally mandated infection prevention and control policies and practices, alongside the appropriate training to ensure we protect all our staff, visitors and patients and minimise/eliminate risk in line with NHS Health Governance standards. The Recruitment programmes we are undertaking are in accordance with these measures to ensure the safety of all candidates. We are committed to protecting our staff and services users from infection and encourage our staff to uptake their annual flu vaccination.&lt;/p&gt;\n&lt;p&gt;As a Trust, we offer and encourage staff to complete either a Black and Minority Ethnic (BME) risk assessments, regular COVID-19 risk assessments and/or working at home risk assessments to identify additional support measures or reasonable adjustments&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/125654.jpg", "name": "Birmingham Community Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=125654"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Priestley Wharf, Birmingham", "postalCode": "B7 4BN"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4873", "longitude": "-1.88581"}}, "title": "Band 8a Freedom to Speak Up Guardian", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242493", "validThrough": "2020-11-13T23:59:59+0000"}