{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 p.a. pro rata"}}, "datePosted": "2020-10-22T16:16:26+0100", "description": "&lt;p&gt;Our Trust&lt;/p&gt;\n&lt;p&gt;Cambridge University Hospitals (CUH) NHS Foundation Trust comprises Addenbrooke’s Hospital and the Rosie Hospital in Cambridge. With over 11000 staff and over 1100 beds the priorities of the Trust focus on a quality service which is all about people – patients, staff and partners. Recognised as providing ‘outstanding’ care to our patients and rated ‘Good’ overall by the Care Quality Commissioner, is testament to the skill and dedication of the people who work here. CUH’s values – Together- safe, kind, excellent – are at the heart of patient care, defining the way all staff work and behave. The Trust provides accessible high-quality healthcare for the local people of Cambridge, together with specialist services, dealing with rare or complex conditions for a regional, national and international population.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Addenbrooke’s Hospital in Cambridge is seeking a motivated and dedicated individual with a passion for healthcare to join the innovative and diverse Ophthalmology department for a six month secondment post as an Advanced Ophthalmic Technician.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are looking for a highly motivated individuals to lead on our new innovative technician-led glaucoma service and deliver an ophthalmic diagnostic service.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Working as part of a multidisciplinary team, you will provide appropriate assessments (and interpretation of results where indicated) for Ophthalmology patients. You will have an interesting and varied work load, including some management duties and supervision of technician staff, as well as managing your own caseload of patients. You will be required to undertake associated clerical and administrative duties to ensure the effective running of clinics.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;You will also be responsible for ensuring all specialist Ophthalmology equipment is maintained and calibrated, performing regular checks and liaising with the Trust’s engineering department and manufacturers/service providers.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are looking for those with excellent leadership, administrative and clerical skills, who are able to use their own initiative to ensure outstanding patient care and service. You must be able to work under pressure alone and as part of a team, and remain kind and compassionate in your work. You must have a good level of general education and enjoy working in a team and with the public.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Technical training is provided on the job and you will be required to contribute to clinical audit, research, teaching and service improvement.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are recruiting for 1 full time fixed term/secondment, initially for 6 months (with potential for extension). This post will work in line with a 9 day working fortnight. Some sessions will be required at the our satellite clinics at Saffron Walden Community Hospital and Anglia Ruskin University therefore a driving license and use of a car would be desirable. This post will include Saturday working. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Please note:- Internal applicants on permanent contracts can only apply for this post as a secondment and must have the approval of your current line manager before applying.&lt;/p&gt;\n&lt;p&gt;This vacancy will close on 19th November 2020&lt;/p&gt;\n&lt;p&gt;Interviews are due to be held via video conferencing on 1st December 2020&lt;/p&gt;\n&lt;p&gt;Benefits to you&lt;/p&gt;\n&lt;p&gt;We offer development opportunities and a wide range of benefits including on-site leisure facilities, shopping concourse, day nurseries and access to a great transport system with easy access to airports and rail travel.&lt;/p&gt;\n&lt;p&gt;For further details of our fantastic benefits please refer to the attachment below - CUH Benefits.&lt;/p&gt;\n&lt;p&gt;Please note if you would like to discuss the required hours of this role further, you should approach the contact given. In some cases alternative working hours will be considered.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We welcome applications from the Armed Forces.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDebbie MullingerJob titleSpecialist OrthoptistEmail addressorthoptics@addenbrookes.nhs.ukTelephone number01223 216528Additional contact information&lt;/p&gt;\n&lt;p&gt;Nabil Uddin (Head Orthoptist)&lt;/p&gt;\n&lt;p&gt;Daisy MacKeith (Advanced Orthoptist)&lt;/p&gt;\n&lt;p&gt;Debbie Mullinger (Specialist Orthoptist)&lt;/p&gt;\n&lt;p&gt;01223 216528/orthoptics@addenbrookes.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Cambridge University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121319"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Addenbrookes Hospital-Division D, Cambridge", "postalCode": "CB2 0QQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1751", "longitude": ".141751"}}, "title": "Advanced Ophthalmic Technician", "url": "https://www.jobs.nhs.uk/xi/vacancy/916239315", "validThrough": "2020-11-19T23:59:59+0000"}