{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 pa"}}, "datePosted": "2020-10-13T18:00:31+0100", "description": "&lt;p&gt;We are looking for an enthusiastic, competent and committed consultant to join a well-established psychiatric liaison team for a fixed period of maternity cover.&lt;/p&gt;\n&lt;p&gt;This is a Core 24 18+ psychiatric liaison service that was established in 2014 and expanded two years ago. It covers the 400 bedded Bedford Hospital which is located in the English town of Bedford. The purpose of the service is to provide mental health input to the A&amp;E department and inpatient wards of the hospital. This is a well-resourced, well led service that has a lot of potential for development and works in close contact with the rest of the Crisis Pathway teams in this process. The service has also developed close connections with the clinicians and management of the acute hospital in order to make sure that transition of care is smooth.&lt;/p&gt;\n&lt;p&gt;The team consists of a general adult consultant psychiatrist, an old age consultant psychiatrist, a staff grade doctor, an operational manager, a team leader, 13 nurses (Band 6 &amp; 7) and an administrator. The team also hosts trainees, based on allocation. The advertised role is that of the general adult consultant psychiatrist who along with their old age counterpart provide clinical leadership to the team as well as supervision of the junior doctors. They also have an educational role within the hospital on the management of mental illness. &lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;At ELFT, and we are proud of our field leading Quality Improvement Programme and excellent leadership development support, which put improving care and developing staff at the core of what we do.&lt;/p&gt;\n&lt;p&gt;We work closely with the Institute of Health Improvement, and partner across the BLMK STP system to drive innovations in healthcare, and staff are actively encouraged to engage and lead transformation work.&lt;/p&gt;\n&lt;p&gt;Bedfordshire and Luton sit at the heart of the three counties in the rolling Chilterns, which have been designated an area of outstanding natural beauty.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;The area boasts a multitude of picturesque villages, and outstanding Ofsted rated state and independent schools, with St Albans, Hitchin and Berkhamsted, (Sunday Times Best Place to Live 2019), all a short distance away.&lt;/p&gt;\n&lt;p&gt;Bedfordshire and Luton are very well connected, with frequent direct trains to central London which can be reached in just over half an hour.&lt;br /&gt;The M1 and M25 are easily accessible, and Luton Airport enables direct links to cities across mainland Europe, and beyond. &lt;br /&gt;If you are looking to relocate when you join us, we can also offer you support with this.&lt;/p&gt;\n&lt;p&gt;We offer support to new consultant though our buddying scheme , enabling you access to practical and mentoring support when you need it.&lt;/p&gt;\n&lt;p&gt;There is also a coaching programme which the candidate could be involved with upon request to assist with personal and professional development&lt;/p&gt;\n&lt;p&gt;We recognised the importance of work life balance and encourage flexible working. Talk to us about your needs and we can adjust your job plan to accommodate this.&lt;/p&gt;\n&lt;p&gt;ELFT is a teaching trust, with many opportunities to teach medical student from Cambridge University and supervise Core and Higher Trainees from East of England Deanery as well as GP trainees for their psychiatric rotation.&lt;/p&gt;\n&lt;p&gt;ELFT actively support academic and clinical with close links with WHO affiliated research centre the Unit for Social and Community Psychiatry, part of Queen Mary and CLAHRC research network. Colleagues with an interest in research are actively encouraged and supported to engage with this.&lt;/p&gt;\n&lt;p&gt;This post is advertised as 10 PA post. If you want to discuss alternative working arrangement please contact us. We welcome job-share application.&lt;/p&gt;\n&lt;p&gt;Contact details:&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Dr Maria Fillipidou, Consultant Liaison Psychiatrist, or Dr Angharad Ruttley, Clinical Director Crisis Care Pathway, through E.A. Makeda Crawlle-Wright on 01525 638 539&lt;/p&gt;\n&lt;p&gt;If you would like to visit the service or have an informal conversation please contact Dr Carol Wilson, Consultant Old age Liaison Psychiatrist or Dr Angharad Ruttley, Clinical Director, Crisis Care Services through E.A Makeda Crawlle-Wright 01525638539.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120781.jpg", "name": "East London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120781"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "BEDFORD", "postalCode": "MK40 2NX"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1419", "longitude": "-.461148"}}, "title": "Locum Consultant Liaison Psychiatrist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916225215", "validThrough": "2020-11-15T23:59:59+0000"}