{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 Per Annum pro rata for Part time"}}, "datePosted": "2020-10-23T15:45:51+0100", "description": "&lt;p&gt;We are looking for Occupational Therapists who are keen to gain clinical experience as a Band 6 within a forward-thinking, supportive and friendly Adult Therapy Service.&lt;/p&gt;\n&lt;p&gt;You will be part of a well led, dynamic and friendly team consisting of Occupational Therapists, Physiotherapists and Therapy Assistants, who constantly strive for integrated working – optimizing patient care and team morale. The team works together to achieve both positive patient experience and successful outcomes. We have an interesting and varied rotational programme which includes core and experience of specialist areas:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Acute General Medicine, including Older People’s Services and Palliative Care&lt;/li&gt;\n&lt;li&gt;Frailty Services at Brentwood Community Hospital&lt;/li&gt;\n&lt;li&gt;Specialist Medicine&lt;/li&gt;\n&lt;li&gt;Respiratory and Critical Care&lt;/li&gt;\n&lt;li&gt;Stroke &amp; Neurology&lt;/li&gt;\n&lt;li&gt;Trauma and Elective Orthopaedics&lt;/li&gt;\n&lt;li&gt;Surgery and Vascular (including Amputees)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;In addition to core rotations there will be learning experience opportunities in the following areas:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Emergency Department &amp; Acute Frailty&lt;/li&gt;\n&lt;li&gt;Inpatient Paediatrics&lt;/li&gt;\n&lt;li&gt;Opportunities to have experience within MSE at both Broomfield Hospital and Southend Hospital&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;In all areas, you will be able to access senior OT professional support and opportunities for clinical professional training and development. There will also be opportunities to enhance skills in cognitive and behavioural assessments as part specialist rotational training.&lt;/p&gt;\n&lt;p&gt;You will be responsible for assessing patients, discussing patient agreed goals and expectations, delivering highly skilled treatments and providing education for both patients and carers. You will also be responsible for ensuring safe and timely discharges for patients in each of the clinical areas. As part of a Band 6 role, you will also be responsible for supervising Band 5 therapists and assistants and will contribute towards service development and departmental training.&lt;/p&gt;\n&lt;p&gt;Completing mixed rotations at Band 6 level provides you with a well-rounded set of clinical skills and an opportunity to promote the value and positive impact Occupational Therapy can have on people’s lives. Many OT skills are transferable between clinical settings therefore increasing your career prospects in the future; we actively encourage and support succession from Band 6 to Band 7 Occupational Therapist posts within our services.&lt;/p&gt;\n&lt;p&gt;Our ideal candidate will have a passion for OT and a desire to actively participate in all aspects of the role. They must be willing and able to lead on various elements of the work and training within this exciting area of OT. The successful candidate must be an effective team player with excellent communication and organizational skills and be able to demonstrate evidence of recent professional learning.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;As a service we offer:&lt;br /&gt;&lt;br /&gt;•Regular supervision&lt;br /&gt;• Opportunities for professional &amp; personal development&lt;br /&gt;• Service Development opportunities&lt;br /&gt;• In-service training &amp; postgraduate education&lt;br /&gt;• Clinical Supervision&lt;br /&gt;• Multidisciplinary team and uni-profession meetings&lt;br /&gt;• Flexible Working&lt;br /&gt;• Good multidisciplinary working&lt;br /&gt;• Regular staff integration and social events and Therapy Staff recognition awards.&lt;br /&gt;• NHS Bank work opportunities&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;MSE offer NHS Fringe Allowance and hospital accommodation for applicants wishing to relocate is available subject to availability&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Please note, our services run over seven days. Shift patterns vary between services and are currently 08:30 – 16:30 or 08:00-18:00.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Diane Parkins, Professional Lead Occupational Therapist (diane.parkins@btuh.nhs.uk) or&lt;/p&gt;\n&lt;p&gt;Michelle Ezeh, Integrated Therapy Lead for Stroke Services (Michelle.Ezeh@btuh.nhs.uk)&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDiane ParkinsJob titleIntegrated therapy leadEmail addressDiane.Parkins@btuh.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121033.jpg", "name": "Mid and South Essex NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121033"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Basildon Hospital, Basildon", "postalCode": "SS16 5NL"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5577", "longitude": ".450587"}}, "title": "Rotational Occupational Therapist Band 6", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241157", "validThrough": "2020-11-06T23:59:59+0000"}