{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "28180", "minValue": "21692", "unitText": "YEAR", "value": "£21,692 - £28,180 per annum / pro rata"}}, "datePosted": "2020-10-16T11:08:11+0100", "description": "&lt;p&gt;&lt;strong&gt;AVON 3&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;STAFF NURSE – BAND 5&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Are you: Enthusiastic; Hard working; Ambitious?&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Do you have a passion for medicine?&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Do you have a can do attitude and a willingness to learn?&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;If so then Avon 3 needs you!&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Avon 3 is a 20 bedded mixed specialty medical unit at Worcester royal hospital.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Our specialties are Infectious diseases and Endocrinology&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;On Avon 3 we require a high level of skill in venepuncture and cannulation, IV administration and a good level of knowledge in antibiotic usage and stewardship as well as PICC, midline and central line care.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;It would be advantageous for the candidate to already possess these skills but if not then all training can be provided.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Our senior nurses are being trained to insert midlines on the ward. They will then be able to train the remaining nursing staff who work on the ward. This is a very exciting opportunity for our ward and for nursing staff to gain a valuable skill and complete their competencies.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;On Avon 3 we have negative pressure rooms and are the only ward available to care for patients with pulmonary TB. Spoke days can be arranged to work alongside our specialist TB and BBV nurses in the community. With this in mind we require a candidate with a good understanding of infection control and meticulous infection control standards.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Many of our Endocrine patients will need strict blood glucose and ketone monitoring, the delivering of sliding scale insulin and a good understanding of insulin usage, this can be provided by spoke days with our excellent Diabetic specialist nursing team and Worcester university provide a 2 day intensive diabetic course, which we would encourage you to attend. Many of our diabetic patients who come in with complications of ulcers have developed osteomyelitis and need the mixed care of our infectious diseases and endocrine consultants as well as good knowledge of wound care, we have good relationships with our tissue viability nurses who provide training in Vac therapy used regularly on the ward.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We often provide care for patients with vasculitis, discitis, endocarditis and bacteremia’s with the need for prolonged antibiotic therapy, once our patients are stabilised and the correct lines in place we can tailor their discharge with good links to the home IV team.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;There is so much to learn while working on Avon 3, a busy but supportive environment with a vibrant and positive team to support and guide your development. We pride ourselves in being a welcoming, supportive team, providing many learning opportunities and encourage staff to take ownership of their learning and continuous professional development, including taking on a link nurse role where you will be able to attend specific training days to enhance your knowledge further to bring back to the ward.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;On Avon 3 we operate Long Day shifts (11.5 hours) and Night shifts (11.5 hours).&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;While working with us we can offer the trusts 6 months preceptorship program for newly qualified nurses and a tailored induction program unique to Avon 3.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will be supported by the ward manager to do any further training relevant to the role and are encouraged to attend training that will enhance your skills and knowledge.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Here is a sample of our bespoke Induction; subject to change due to availability of our specialist colleagues and your specific needs.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;Week 1 - &lt;/strong&gt;3 day Trust induction; 1 day on the ward shadowing a buddy mentor; 1 day Mandatory e-learning and IT training&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;Week 2 - &lt;/strong&gt;3 days on the ward shadowing buddy mentor; 1 day with Diabetic nurses; 1 day with TB nurses&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;Week 3 - &lt;/strong&gt;3 and a half days shadowing buddy mentor; 1 day with BBV nurses; Half day with Tissue viability&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;Week 4 - &lt;/strong&gt;Full week on the ward: 3 long days.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If you would like to arrange an informal visit or have any questions, please contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Claire James, Ward Manager for Avon 3 via switchboard on 01905 763333 Extn. 30162 or Emma Chapman – Ward Administrator.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;E RECRUITMENT TEAM**&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Worcestershire Acute Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120654"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Worcestershire Royal Hospital / Alexandra Hospital, Redditch / Kidderminster Treatment Centre", "postalCode": "WR5 1DD"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1912", "longitude": "-2.18114"}}, "title": "Staff Nurse, Avon 3, WRH", "url": "https://www.jobs.nhs.uk/xi/vacancy/916229817", "validThrough": "2020-11-20T23:59:59+0000"}