{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 to £51,668 pa"}}, "datePosted": "2020-10-27T12:45:24+0000", "description": "&lt;p&gt;&lt;strong&gt;Scheduled and Planned Care Network&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Forest Close Intensive Rehabilitation Service&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Clinical Psychologist &lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;Salary:Band 8a £45,753 - £51,668 pa pro rata (depending on experience)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location: Forest Close Intensive Rehabilitation Service, Worrall, Sheffield&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;Hours: 30 hours per week&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Post Ref: 457-20-082-PY&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen within the Rehabilitation and Recovery Pathway at Sheffield Health &amp; Social Care Trust. The post will require a highly skilled clinician to join the leadership team of the inpatient rehab &amp; recovery service.&lt;/p&gt;\n&lt;p&gt;Forest Close is a 30 bed intensive inpatient rehabilitation service located in the north of Sheffield. We support adults with enduring and complex mental health needs to recover meaningful lives, work towards more independence, and rebuild their ability and confidence to live in the community. We are an experienced and large multi-disciplinary team and we use a whole team approach to deliver least-restrictive evidence-based care and to continuously improve our service. We feel passionate about working collaboratively with services users and their families, and other care providers to ensure people experience smooth and timely transition from inpatient care. We have won national awards in recognition of our positive practice in mental health and are proud to be one of the first services in Sheffield to achieve the Accreditation for Inpatient Mental Health Services (AIMS) from the Royal College of Psychiatry.&lt;/p&gt;\n&lt;p&gt;We are looking for an experienced clinical psychologist, suitably qualified and registered with the Health Professions Council who is interested in developing and embedding a trauma focussed model of clinical delivery for both service users and staff who support them.&lt;/p&gt;\n&lt;p&gt;The successful candidate will lead a small team of Assistants Psychologists who are already strongly embedded within the service and who play a key and central role in all aspects of services we deliver. In addition, you would be providing a key role supervising the new professional role of clinical associate psychologists who are beginning their apprenticeship training and who will play a key part in service development.&lt;/p&gt;\n&lt;p&gt;The post holder will have an understanding of team formulation and promoting psychological understanding in teams and across systems and have a passion and the skills for indirect psychological working. Experience and expertise in working with service users who struggle to regulate their emotions and who use deliberate self harm as a method of coping with their feelings will be invaluable. Forest Close has a supportive leadership team who are excited about supporting development and change. The role will also be focussed on the exploring the treatment interface across the inpatient pathway.&lt;/p&gt;\n&lt;p&gt;We are looking for someone enthusiastic and ready to promote recovery focused and trauma informed ways of working and who has a positive and well-informed approach to risk management.&lt;br /&gt;You will benefit from being part of a thriving Adult Mental Health (AMH) clinical psychology grouping of around 60 people which in turn is part of Wider MDT Psychological Services across Sheffield Health and Social Care Trust. Peer support, clinical supervision, and line management are offered through the AMH Division. We also benefit from strong links with the Sheffield DClinPsy training course, offering teaching, mentoring, and placements.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Sheffield Health and Social Care NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120808"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Sheffield", "postalCode": "S35 0JW"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.421", "longitude": "-1.52012"}}, "title": "Senior Clinical Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244562", "validThrough": "2020-11-12T23:59:59+0000"}