{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 pa"}}, "datePosted": "2020-10-30T11:00:18+0000", "description": "&lt;p&gt;&lt;strong&gt;Community Nurse Band 5&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Community Team - Warminster &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;37.5 Hours/ Week&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Permanent &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Are you passionate about nursing and supporting people in their own homes?&lt;/p&gt;\n&lt;p&gt;Do you have the commitment to make a difference to people’s lives?&lt;/p&gt;\n&lt;p&gt;Do you ever wonder what happens to your patients after they are discharged from a ward?&lt;/p&gt;\n&lt;p&gt;Would you like to be part of preventing unnecessary admissions to hospital and in assisting people to manage their wellbeing in their own homes? If you answer yes to any of these questions, a post in our team may be for you! Our organisation is proactive in developing community specific training and can offer a supportive and friendly environment in which to learn new skills.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We currently require a Band 5 Nurse to work in the Warminster and Westbury Community Team. Our community nurses are expected to work in patients’ homes, in community clinical settings and to link closely with the GP Practices in the local area. The team is based at Warminster and Westbury Community Hospital and operates a shift pattern from 07.00 – 22.00. Nursing staff will be expected to work weekend rotas and cover early and late shifts.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Experience in front line NHS patient care is essential as is evidence of up to date clinical professional development. Applicants need to have excellent clinical skills, well developed communication skills and be able to work under pressure. The role is demanding but rewarding, and we are looking for an enthusiastic, motivated and hardworking individuals who can work flexibly and efficiently. Newly qualified staff nurses benefit from a perceptorship programme, community based training programmes and the expertise and supervision of our highly knowledgeable and experienced senior practitioners.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are a busy, friendly team, who would welcome the opportunity to work with a new member of staff willing to contribute to the on-going development of the services we provide.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For an informal discussion please contact:&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Tina Biggs or Kate Newton on 01985 224709.&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Wiltshire Health and Care", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=134394"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Warminster", "postalCode": "BA12 8QS"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2068", "longitude": "-2.18104"}}, "title": "Community Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249839", "validThrough": "2020-11-13T23:59:59+0000"}