{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "42712", "minValue": "36069", "unitText": "YEAR", "value": "£36,069 to £42,712 pa inc"}}, "datePosted": "2020-11-03T15:16:28+0000", "description": "&lt;p&gt;We are looking to recruit Band 6 Charge Nurses/Sisters to help in the effective and efficient day-to-day running on our elective surgery ward- Clarke ward. You will also rotate to our sister unit- the Surgical Assessment Unit (SAU) and help to manage its day to day running and ensure its effective operation.&lt;/p&gt;\n&lt;p&gt;They will actively help to ensure the delivery of a high standard and quality of patient care and be prepared to challenge and address poor practice, to ensure harm-free patient care.&lt;/p&gt;\n&lt;p&gt;They may be required to deputise for the Clinical Nurse Manager form time-to time. Active participation in audit &amp; service improvement required. A working knowledge of clinical governance is required.&lt;/p&gt;\n&lt;p&gt;Clarke ward is a 19 bedded ward catering for elective surgery patients.&lt;/p&gt;\n&lt;p&gt;SAU is located over 3 floors in the old TAU block and has a variety of trolley spaces, assessment rooms, a prodecure room and a waiting area and caters for a variety of surgical specialities (General Surgery, ENT, OMFS, Urology, Orthopaedic, Vascular &amp; Gynaecology).&lt;/p&gt;\n&lt;p&gt;The post holders will be registered nurses with surgical nursing experience and current NMC registration. Good communication skills (written &amp; verbal) and the ability to work as part of and to lead a team are essential, as is the ability to use own initiative.&lt;/p&gt;\n&lt;p&gt;Willingness to undertake further personal professional development relevant to the service essential. A teaching and assessing qualification would be desirable but not essential.&lt;/p&gt;\n&lt;p&gt;Candidates must possess IV Drug Administration and Cannulation &amp; Venepuncture competencies.&lt;br /&gt;&lt;br /&gt;We are seeking enthusiastic and committed individuals to join our team and be positive role models at all times, acting as a resource for others. Senior Band 5 nurses thinking of making the next step up in their career development will be considered.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameArthur ChindendereJob titleClinical Nurse ManagerEmail addresst.chindendere@nhs.netTelephone number0208 8692889/2834/2835Additional contact information&lt;/p&gt;\n&lt;p&gt;Email preferred contact method.&lt;/p&gt;\n&lt;p&gt;Informal visits welcome.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120623.png", "name": "London North West University Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120623"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Harrow, London", "postalCode": "HA1 3UJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5751", "longitude": "-.322459"}}, "title": "Charge Nurse/Sister - Clarke ward &amp; SAU", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254523", "validThrough": "2020-11-17T23:59:59+0000"}