{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum"}}, "datePosted": "2020-10-13T14:46:30+0100", "description": "&lt;p&gt;&lt;strong&gt;How would you like to make a difference?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Would you like to join a team that makes a real difference every day and at the same time expand your knowledge and experience of &lt;strong&gt;Thoracic Surgery&lt;/strong&gt; at one of the leading teaching hospitals in the country? If so then we would really love to hear from you.&lt;/p&gt;\n&lt;p&gt;We are currently looking for a &lt;strong&gt;full time, Locum Consultant for a period of 12 months&lt;/strong&gt;. You will be based in the &lt;strong&gt;Thoracic Surgery &lt;/strong&gt;department under the directorate of General Surgery at the Norfolk and Norwich University Hospital.&lt;/p&gt;\n&lt;p&gt;You will work closely with our senior clinical team and benefit from their experience and knowledge allowing you to expand your own clinical experience every day.&lt;/p&gt;\n&lt;p&gt;The Norfolk and Norwich University Hospital has over 1,000 beds and the thoracic service here serves a population of over 1.5 million people from Norfolk and other parts of East Anglia including parts of Suffolk and Cambridgeshire. The hospital is adjacent to the University of East Anglia, the Medical School established in 2002 and the world renowned Norwich Research Park. This ensures that our staff have unqualified access to research development and opportunities for under and post graduate teaching.&lt;/p&gt;\n&lt;p&gt;Norwich is quite rightly described as “a fine city.” Its skyline is dominated by a graceful cathedral and a massive Norman castle. It boasts countless attractions to interest and intrigue its residents, with all of the modern facilities you would expect in a vibrant city. Norwich schools are rated as some of the best within the country. The surrounding Norfolk countryside and long stretches of coastline are renowned for its beauty and tranquility. The Norfolk Broads provide a quintessential rural getaway with the North Norfolk villages providing a more traditional ambience. With excellent transport links to Cambridge and London, Norfolk offers everything you require to establish the perfect work life balance.&lt;/p&gt;\n&lt;p&gt;The appointee will work in the Department of Thoracic Surgery, which is currently under the directorate of General Surgery. This directorate encompasses thoracic, colorectal, breast and endocrine and upper gastrointestinal / hepatobiliary surgery.&lt;/p&gt;\n&lt;p&gt;We are looking for enthusiastic surgeon trained in whole spectrum of general thoracic surgery. A proven track record of safe lung resections with low morbidity and low mortality, and sound experience with thoracoscopic lung resections (VATS lobectomy and segmentectomy) is highly desirable. A keen interest in robotic thoracic surgery will be highly valuable together with projected interest in research and training. Personal qualities of good communication, professional honesty, reliability in team working, and easy collaboration with the other surgical specialties and our anesthesiology colleagues, are essential.&lt;/p&gt;\n&lt;p&gt;Applicants must have full GMC registration with a licence to practise and entry on the specialist register (or within 6 months of interview), have experience in thoracic surgery and hold a higher surgical qualification.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please refer to the ‘Job Description’ link to the right of the page for the full specification of responsibilities and requirements for this post.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing date 10th November 2020.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please attach a short CV.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Further information about the hospital can be obtained from our website.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameMr Jakub KadlecJob titleConsultant in Thoracic SurgeryEmail addressJakub.Kadlec@nnuh.nhs.ukTelephone number01603 286395Additional contact information&lt;/p&gt;\n&lt;p&gt;If you are interested in joining our team or have further questions, please contact Mr Jakub Kadlec on 01603 286395 or via Jakub.Kadlec@nnuh.nhs.uk for an informal discussion.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122492.jpg", "name": "Norfolk and Norwich University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122492"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Norfolk and Norwich University Hospital, Norwich", "postalCode": "NR4 7UY"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6181", "longitude": "1.22109"}}, "title": "Locum Consultant in Thoracic Surgery", "url": "https://www.jobs.nhs.uk/xi/vacancy/916224761", "validThrough": "2020-11-10T23:59:59+0000"}