{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907-£30,615 pa (pro rata)"}}, "datePosted": "2020-10-30T12:01:08+0000", "description": "&lt;p&gt;&lt;strong&gt;Staff Nurse - Caravelle Ward (Up to 37.5 hours per week)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Do you enjoy motivating patients to help them reach their full potential, and facilitating their safe discharge from hospital? If so, we are looking for Registered Nurses to become part of our multidisciplinary teams.&lt;/p&gt;\n&lt;p&gt;Caravelle is a newly refurbished, vibrant and friendly 28-bed ward in Crawley Hospital with close links to other community inpatient services. We pride ourselves in caring for patients of all ages with a variety of complex medical conditions and those who have post-surgical rehabilitation needs.&lt;/p&gt;\n&lt;p&gt;Our multidisciplinary team includes a doctor, Advanced Nurse Practitioners, Occupational Therapists, Physiotherapists and a social worker. To help our patients experience a high standard of care we also have input from a Specialist Nurses, a consultant from our local acute Trust, and community teams, all working together to support discharges from hospital.&lt;/p&gt;\n&lt;p&gt;The ward has a dynamic and compassionate team who aim to provide high quality, evidence-based care. The care and therapy our patients receive is delivered through careful patient-centred assessment, with involvement from the patients and their families. We are very lucky to have a therapy gym and a day room enabling us to provide an extensive activity timetable to maximise patient recovery. The feedback we have received from patients is that receiving care in this environment has been invaluable to them on their journey after an acute event.&lt;/p&gt;\n&lt;p&gt;Our last Care Quality Commission inspection rated our community inpatient services as &#39;Outstanding&#39; for Caring and our overall Trust rating as&#39; Good&#39;. If you are passionate about making a difference and want to contribute to an organisation which is continuously striving to improve then we would love to hear from you.&lt;/p&gt;\n&lt;p&gt;In return we can offer you:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Newly refurbished working environment&lt;/li&gt;\n&lt;li&gt;Flexible working patterns&lt;/li&gt;\n&lt;li&gt;Supportive learning environment including student placements&lt;/li&gt;\n&lt;li&gt;Dedicated career pathways and great opportunities for continuing professional development including relevant university modules&lt;/li&gt;\n&lt;li&gt;Commitment to and support for your health and wellbeing including support to transition from a non NHS environment&lt;/li&gt;\n&lt;li&gt;NHS Pension Scheme&lt;/li&gt;\n&lt;li&gt;NHS discounts and salary sacrifice schemes&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The surrounding area has good transport links to London and Brighton. We have onsite parking and are 15 minutes’ walk away from the train station and local town.&lt;/p&gt;\n&lt;p&gt;If you are committed to providing care in a compassionate and safe environment then working on Caravelle Ward in Crawley Hospital will be an opportunity for you to use your existing skills, gain new ones and be part of a great team.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Donna Stallibrass (Matron)&lt;/p&gt;\n&lt;p&gt;07785 303454 or donna.stallibrass@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Sussex Community NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120877"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Crawley Hospital, Crawley", "postalCode": "RH11 7DH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.1166", "longitude": "-.197547"}}, "title": "Staff Nurse - Caravelle Ward", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250082", "validThrough": "2020-11-09T23:59:59+0000"}