{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "23000", "minValue": "23000", "unitText": "YEAR", "value": "£23,000 per annum"}}, "datePosted": "2020-11-02T17:06:22+0000", "description": "&lt;p&gt;&lt;strong&gt;Employer: &lt;/strong&gt;London Central and West Unscheduled Care Collaborative (LCW UCC)&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Department: &lt;/strong&gt;NHS111&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location: &lt;/strong&gt;St. Charles Centre for Health &amp; Wellbeing, Exmoor Street, London, W10 6DZ. Please note thatthis role is office based at St Charles Centre for Health &amp; Well-Being, W10 6DZ and includes working at weekends, Unsocial Hours and Bank Holidays when required. It is therefore essential that you can travel to and are resident within reasonable commuting distance of this location.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary: &lt;/strong&gt;£23,000 per annum plus Shifts &amp; Enhancements for Unsocial Hours&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location: &lt;/strong&gt;St Charles Hospital.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Founded in 1994 out of a local GP cooperative,&lt;strong&gt;London Central &amp; West Unscheduled Care Collaborative (LCW UCC)&lt;/strong&gt;has evolved into one of London&#39;s largest and most successful providers of Integrated Urgent Care services (incorporating 111 and GP OOH) covering a population of about 3.2 million.&lt;/p&gt;\n&lt;p&gt;The organisation has in its 26-year history expanded its portfolio of services and our skill mix of clinicians who now include GPs, Advanced Nurse Practitioners, Nurses, Paramedics, and Pharmacists. In addition, we have grown our non-clinical support team. Most of our work is in the urgent care environment working in partnership with Commissioners, Acute and Community Trusts, GP Federations and other health and social care organisations in the development of integrated services.&lt;/p&gt;\n&lt;p&gt;LCW is a consistently high performer in all aspects of service delivery as well as other patient safety initiatives and compliance with best practice and statutory regulation. We were the first London provider to go live with a 24/7 Integrated Urgent Care service. We pride ourselves on the ability to innovate and collaborate and have supported many NHSE and local technology and workforce pilots within the development of Integrated Urgent Care.&lt;/p&gt;\n&lt;p&gt;A fantastic opportunity has arisen for two very pro-active, passionate, and dedicated full-time NHS 111 Operations Supervisor to join the NHS 111 Team on a 3-month rolling secondment.&lt;/p&gt;\n&lt;p&gt;You must possess the ability to work using your own initiative and without supervision.&lt;/p&gt;\n&lt;p&gt;You will report to the NHS 111 Senior Operations Coordinator, with a key focus of overseeing the successful delivery and management of the Integrated Urgent Care service.&lt;/p&gt;\n&lt;p&gt;You will also oversee the real time monitoring of all service targets, where you will take decisive action to achieve these targets and must be able to work within and support a large team comprising of clinical and non-clinical staff.&lt;/p&gt;\n&lt;p&gt;We offer a basic salary of £23,000 per annum, pro-rata.&lt;/p&gt;\n&lt;p&gt;In addition, we offer the following enhancements:&lt;/p&gt;\n&lt;p&gt;15% night time and Saturday&lt;/p&gt;\n&lt;p&gt;30% Sunday&lt;/p&gt;\n&lt;p&gt;50% bank holidays&lt;/p&gt;\n&lt;p&gt;We have a variety of shifts available in our 24/7 call centre.&lt;/p&gt;\n&lt;p&gt;LCW also offer the following benefits to our staff:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;25 days annual leave in addition to 8 bank holidays&lt;/li&gt;\n&lt;li&gt;NHS pension scheme&lt;/li&gt;\n&lt;li&gt;Employee Assistance Programme&lt;/li&gt;\n&lt;li&gt;NHS discount scheme&lt;/li&gt;\n&lt;li&gt;Eye care vouchers&lt;/li&gt;\n&lt;li&gt;Access to E-learning&lt;/li&gt;\n&lt;li&gt;Comprehensive training and induction programme&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;You must possess a professional and thorough approach to work, identifying, planning and prioritising to ever-changing demands. You will be expected to build upon your personal development and enhance your problem-solving skills. You will also receive internal training, to enable you to be fully equipped and empowered to totally perform this role.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;If you are successfully shortlisted for the role, you will be invited to attend an interview and an assessment.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing Date: 10th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview Dates: 13th November 2020&lt;/strong&gt;&lt;/p&gt;", "employmentType": "OTHER", "hiringOrganization": {"@type": "Organization", "name": "London Central and West Unscheduled Care Collaborative (LCW UCC)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132774"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "London", "postalCode": "W10 6DZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5224", "longitude": "-.217393"}}, "title": "111 Operations Supervisor", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252987", "validThrough": "2020-11-10T23:59:59+0000"}