{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "Band 5 - £24,907 - £30,615"}}, "datePosted": "2020-11-03T08:45:50+0000", "description": "&lt;p&gt;We are a passionate and innovative team working at the admission medium secure unit. Oak Ward is a 15 bed male acute High dependency ward which specialise in the assessment and treatment of people with complex and enduring mental health needs, who have had contact with the criminal justice system.&lt;/p&gt;\n&lt;p&gt;Hellingly Centre is a member of Quality Network for Forensic Mental Health Services. Guided by QNFMHS, Oak Ward recognises the importance of the therapeutic use of relational security whilst also promoting important principles around evidence-based care, patient and carer involvement, parity of physical healthcare, public health priorities, and good governance. QNFMHS benchmarks via peer reviews, creating opportunities for qualified staff to become certified peer reviewer for nationwide forensic services.&lt;/p&gt;\n&lt;p&gt;As a part of a Sussex Partnership Foundation Trust Forensic Clinical Academic Group, Hellingly Centre takes part in ongoing research, currently Oak ward has developed a service wide evaluation for the CDS. We are looking into implementation of Safewards model on Oak Ward, which creates many exciting opportunities, such as being a part of a pioneering Safewards intervention in secure environment&lt;/p&gt;\n&lt;p&gt;Oak Ward has a very strong Multidisciplinary Team, which consists of Nursing Team, Psychiatrists, Social Workers, Psychologists, Occupational Therapist, Family Liaison Assistant, Physical Health Team, and GP. Patient care is always based on multi-dimensional approach and gives learning opportunity for qualified nurse to be involved in clinical assessments including specialized forensic risk clinics, formulation of HCR-20, DUNDRUM-1, BVC scoring and many more.&lt;/p&gt;\n&lt;p&gt;As a part of patients&#39; care, Clinical Team runs Therapy Sessions and Groups tailored to patient&#39;s specific needs. Currently we facilitate Hearing Voices Group, Impatient Violence and Aggression Programme (IVAMP), Healthy Sexual Behaviour Group and more. Nurses are always welcomed to co-facilitate groups.&lt;/p&gt;\n&lt;p&gt;If you are a qualified or newly qualified nurse, you are ambitious and passionate, with a desire for self-development, then you are a perfect person to join our team. We encourage applications from both newly qualified staff and those who have had experience in other areas of mental health.&lt;/p&gt;\n&lt;p&gt;We work across a 24 hour period with a working pattern of 11.5 hour shifts. Please see attached Job description and Job specification&lt;/p&gt;\n&lt;p&gt;The Hellingly centre is also very active on Twitter so feel free to follow us and get connected!&lt;/p&gt;\n&lt;p&gt;If you would like to come for an informal visit of have any questions regarding the role of a band 5 nurse on Oak ward, forensic nursing or any question’s regarding working patterns please do not hesitate to contact Marta Bardecka Ward manager.&lt;/p&gt;\n&lt;p&gt;Marta.Bardecka@sussexpartnership.nhs.uk&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Oak Ward Manager - Marta Bardecka:&lt;/p&gt;\n&lt;p&gt;01323 244179&lt;/p&gt;\n&lt;p&gt;Marta.Bardecka@sussexpartnership.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121074.jpg", "name": "Sussex Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121074"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hellingly, Hellingly", "postalCode": "BN27 4ER"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8889", "longitude": ".268666"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253177", "validThrough": "2020-11-17T23:59:59+0000"}