{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62001", "minValue": "53168", "unitText": "YEAR", "value": "£53,168 - £62,001 per annum"}}, "datePosted": "2020-10-22T11:16:12+0100", "description": "&lt;p&gt;An exciting opportunity has arisen for a motivated candidate to join the Trust’s Business and Development Team. This is a developmental role for the post holder to gain experience across the full range of Business and Development activities, supporting the Assistant Directors with external facing activities including working with GP commissioners, NHS England, NHS Improvement, local authorities and other providers of clinical and other services. The role will contribute to the development and implementation of corporate strategies and decisions within the Trust.&lt;/p&gt;\n&lt;p&gt;It is anticipated that the individual will have significant experience in one or two areas initially but will need to develop into other areas of expertise appropriate to the role. As such (dependent on previous experience and development needs) the post holder will support leads and will have specific responsibility for aspects of the following areas:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Business and corporate planning and preparation of complex business cases&lt;/li&gt;\n&lt;li&gt;Strategy development, implementation and monitoring&lt;/li&gt;\n&lt;li&gt;NHS commissioning arrangements, contracts and funding streams&lt;/li&gt;\n&lt;li&gt;NHS Procurement processes and service tenders (as a provider)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;To do so, candidates must have an in-depth knowledge of the NHS and recent reforms, a degree level education supplemented by post graduate study and management or clinical experience to masters degree level or equivalent, excellent communication skills, and significant experience in one or two of the above business areas. This is a subset of the Essential Requirements and a full list is included in the full Job Description &amp; Person Specification.&lt;/p&gt;\n&lt;p&gt;Full Time 37 Hours 30 Minutes/Week&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121053.jpg", "name": "The Newcastle upon Tyne Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121053"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "317 01 Freeman Hospital", "postalCode": "NE7 7DN"}, "geo": {"@type": "GeoCoordinates", "latitude": "55.0028", "longitude": "-1.59341"}}, "title": "Senior Business Development Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916238105", "validThrough": "2020-11-08T23:59:59+0000"}