{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "87754", "minValue": "75914", "unitText": "YEAR", "value": "£75,914 to £87,754 pa"}}, "datePosted": "2020-11-02T12:11:30+0000", "description": "&lt;p&gt;Are you a dynamic, motivated, forward thinking and experienced leader with evidenced experience, skills and knowledge of Quality Assurance and Patient Safety? If so I want to hear from you.&lt;/p&gt;\n&lt;p&gt;Applicants are invited to apply for the exciting opportunity to become Deputy Director of Quality, supporting the Chief Nurse leading on the Quality assurance, Improvement and Patient Safety duties of the CCG.&lt;/p&gt;\n&lt;p&gt;The successful applicant will:&lt;/p&gt;\n&lt;p&gt;Lead a dynamic team to provide leadership to all elements of Quality, Patient Safety, experience and improvement&lt;/p&gt;\n&lt;p&gt;Be responsible for ensuring that Quality Frameworks provide assurance that all contracted providers and non-contracted providers are on the Sheffield CCG footprint and meet the CCG expectations&lt;/p&gt;\n&lt;p&gt;Drive strategic developments to promote the organisation’s leading role in the changing landscape and manage associated budgets and staffing.&lt;/p&gt;\n&lt;p&gt;Build long-lasting internal and external stakeholder relationships and to ensure effective leadership; motivating and developing staff within teams to ensure organisational objectives are met, and will include active development of the local health and social care system to ensure local and national strategies, policies and frameworks are implemented effectively.&lt;/p&gt;\n&lt;p&gt;Have experience working at a senior management level, preferably with a clinical background and healthcare qualification/registration or related managerial skills with the ability to maintain high levels of personal performance are both essential skills needed for this role.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NHS Sheffield Clinical Commissioning Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128238"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Sheffield", "postalCode": "S9 4EU"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3834", "longitude": "-1.41113"}}, "title": "Deputy Director of Quality", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251987", "validThrough": "2020-11-16T23:59:59+0000"}