{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "Band 7 £38,890 rising to £44,503 pro rata"}}, "datePosted": "2020-10-20T15:59:41+0100", "description": "&lt;p&gt;&lt;strong&gt;The Associate Designated Clinical Officer (Special Educational Needs and Disability) is a new role established following additional funding from BNSSG CCG. This is a unique opportunity for specialist clinicians with an interest in SEND to help shape the role, and contribute to improved outcomes for children and young people.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are seeking a Speech and Language Therapist with specialist experience and knowledge of children and young people with SEND. You will work in a small team of 3.0wte colleagues, reporting into a Children’s Operational Service Manager, with close collaboration with the Designated Clinical Officer. You will receive professional and clinical leadership and supervision from a Clinical Lead within your professional group.&lt;/p&gt;\n&lt;p&gt;The post holder will work within a newly formed team of staff responsible primarily for providing a health contribution for children and young people with Special Educational Needs and / or Disability (SEND) as part of their Education, Health and Care (EHC) needs assessment. The post-holder will work as part of the wider core Therapy, Nursing and Community Paediatric Teams within the Community Children’s Health Partnership (CCHP), in close collaboration with the CCG Designated Clinical Officer.&lt;/p&gt;\n&lt;p&gt;You will be responsible for providing a health assessment and report for children and young people with Special Educational Needs and / or Disability (SEND) as part of their Education, Health and Care (EHC) needs assessment. You will provide expert clinical opinion, support and guidance whilst acting as a conduit for information exchange between each of the three the Local Authorities (Bristol, South Gloucestershire and North Somerset) and the clinical services provided within the Children’s Community Health Partnership (CCHP). The post-holder will actively participate in quality assurance panels where health contributions from each LA area are scrutinised, cascading any learning back to the organisation and individual teams involved whilst continuing to champion best practice.&lt;/p&gt;\n&lt;p&gt;Location is flexible and will be dependent on the successful candidates. The CCHP covers 3 local authorities who refer children and young people for a needs assessment as part of their EHCP. You will be required to travel for the role, although currently many of our staff are home-based and using digital platforms to deliver care.&lt;/p&gt;\n&lt;p&gt;You will be registered with HCPC as a Speech and Language Therapist. You will have experience of providing specialist clinical assessment and treatment/support to children and young people with SEND. You will have knowledge and understanding of the key issues affecting outcomes for children, young people and families, particularly children and young people with SEND, and be familiar with SEND regulations and legislation. You will be flexible and innovative, with an ability to communicate with a wide range of internal and external partners. You will be keen to develop a strategic role as the CCHP SEND partner for the Local Authority, providing the link between the Local Authority and CCHP clinicians.&lt;/p&gt;\n&lt;p&gt;Please see the attached job description for more information. If you have any furher questions please contact Gerry Bates -Tel. No/Email Geraldine.bates@nhs.net / 07779 448177&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/127274.jpg", "name": "Sirona care and health CIC", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127274"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bristol, North Somerset, South Glos", "postalCode": "BS15 9TR"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4627", "longitude": "-2.50131"}}, "title": "Associate Designated Clinical Officer (Speech &amp; Language Therapy)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916235144", "validThrough": "2020-11-08T23:59:59+0000"}