{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum pro rata"}}, "datePosted": "2020-10-30T10:16:48+0000", "description": "&lt;p&gt;Are you a Registered Nurse looking to work in a large NHS Organisation? The Gastroenterology liver unit are recruiting Registered Nurses who are motivated, enthusiastic, and reliable with a passion for providing high quality patient care. We care for our patients 7 days a week, 24 hours a day and can consider a number working patterns to support work life balance of our staff. A degree of flexibility would be required to meet the needs of the service.&lt;/p&gt;\n&lt;p&gt;The Aneurin Bevan University Health Board is responsible for the delivery of health services to more than 600,000 people in South East Wales. The Health Board has ambition and a clear plan to modernise its service delivery and the care provided to its patients with a clear commitment to the development of its Registered nurses.&lt;/p&gt;\n&lt;p&gt;The Grange University Hospital in Llanfrechfa will deal with all major emergencies and treat and care for those needing complex, specialist or critical care. It will include a 24-hour Emergency Department and Assessment Unit dealing with emergencies and resuscitation cases and will have a broad range of diagnostic services, operating theatres, and a consultant-led obstetric unit. This is an excellent time to join the Health Board. The Clinical Futures model is extending Aneurin Bevan University Health Board’s successful implementation of its Care Closer to Home initiatives, strengthening and promoting its services in the community as well as centralising care of the most critically ill patients in the brand new state-of-the art Grange University Hospital.&lt;/p&gt;\n&lt;p&gt;C4W is a specialised 25 bedded unit caring for patients with a range of acute and chronic Gastroenterology conditions. The Gastroenterology liver unit will be relocating to The Grange University Hospital in November 2020 which will be specifically designed for the care and treatment of Gastroenterology patients. Plans are in progress to incorporate a hyper-acute bleeding bay on the new unit, offering higher levels of care for acutely unwell patients.&lt;/p&gt;\n&lt;p&gt;The ward works in collaboration with the ambulatory care unit which is currently located on ward C4W. The ambulatory care unit offers a range of patient services including; nurse-led infusion service, ‘hot clinics’ and paracentesis. The unit has undergone renovation with work which has been created solely for gastroenterology/liver services. The ward works closely with the alcohol and IBD service as well as the endoscopy department.&lt;/p&gt;\n&lt;p&gt;We are committed to exploring innovative ways of working to enhance patient experience. We know that our success depends on the commitment and dedication of our staff and we aim to recruit and retain the best staff possible. We want Aneurin Bevan University Health Board to be an enjoyable and fulfilling place to work. We know that feeling valued at work has a positive impact on both staff and patients and our Values and Behaviours Framework highlights our commitment to this.&lt;/p&gt;\n&lt;p&gt;If you are newly qualified and interested in applying for our posts you will be supported through mentoring and the ‘Journey of Excellence’ which is a bespoke programme that will assist you in the acquisition of knowledge and skills to facilitate your progression into a confident and competent post-registration nurse. Free parking is available across all hospital locations. We are able to offer full and part-time hours.&lt;/p&gt;\n&lt;p&gt;We will be able to offer training, mentorship and support for nurses of all grades and stages in their careers to gain experience and have an opportunity to be trained to work in a wide variety of settings. Education and training is strongly supported and nurses are encouraged to attend relevant courses and training conferences.&lt;/p&gt;\n&lt;p&gt;This is a fantastic opportunity to be part of a close specialised team and help shape future services.&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; Welsh and/or English speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt;Closing date: 15th November 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Ward Manager Sarah Hammett 01633234150&lt;/p&gt;\n&lt;p&gt;Senior Nurse Gemma Couch 07970531999&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123197.jpg", "name": "Aneurin Bevan University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123197"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Gwent Hospital, Newport", "postalCode": "NP44 8YN"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6463", "longitude": "-2.99634"}}, "title": "Registered Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249680", "validThrough": "2020-11-15T23:59:59+0000"}