{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "5043", "minValue": "5043", "unitText": "YEAR", "value": "Junior Doctors Payscale - MT03"}}, "datePosted": "2020-11-03T13:00:40+0000", "description": "&lt;p&gt;This post is designed to give an introduction to the role of Public Health and Clinical Commissioning, including the provision of strategic medical advice based on needs assessment and evidence. The skills developed are essential for the work of Public Health practitioners and are relevant to the work of General Practitioners and those from other disciplines intent on improving the health of the population they serve and the design of services and pathways that best meet clinical need within defined budgets.&lt;/p&gt;\n&lt;p&gt;The post holder will work within the CCG’s medical directorate to use available evidence to develop robust, evidence based care pathways. They will also provide advice to the commissioning and contract teams within the CCG to ensure that decisions are patient focused and based on best evidence.&lt;/p&gt;\n&lt;p&gt;This post will provide additional capacity to the health care public health/ medical director role in the CCG and will also develop commissioning, needs assessment, and clinical effectiveness skills and interest in the clinical workforce.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Key duties and responsibilities will include:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;• Identifying the need for and lead clinical audit projects, sharing outcomes in order to secure improvements.&lt;br /&gt;• Working with colleagues across the health and social care system to redesign services and care pathways to meet the CCG’s ambitions and national best practice.&lt;br /&gt;• Undertaking needs assessment to identify gaps in services.&lt;br /&gt;• Reviewing available evidence to inform commissioning decisions.&lt;br /&gt;• Supporting the clinical funding function in the CCG by providing clinical advice based on best practice and evidence. &lt;br /&gt;• Undertaking quality and clinical safety reviews, serious incident analysis and assessments.&lt;br /&gt;• In partnership with the CCG’s communications and engagement team, supporting health promotion and awareness campaigns.&lt;br /&gt;• Helping to develop strategies to address the health needs of the population.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/128256.jpg", "name": "East and North Herts CCG", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128256"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Charter House, Welwyn Garden City", "postalCode": "AL8 6JL"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.8027", "longitude": "-.207565"}}, "title": "Clinical Fellow in Public Health and Clinical Commissioning", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254077", "validThrough": "2020-11-15T23:59:59+0000"}