{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 to £51,668 pa"}}, "datePosted": "2020-10-29T14:22:36+0000", "description": "&lt;p&gt;&lt;strong&gt;INTERNAL ONLY TO NORTH CUMBRIA INTEGRATED CARE NHS FOUNDATION TRUST (NCIC) TRUST EMPLOYEES ONLY FORMALLY CUMBRIA PARTNERSHIP FOUNDATION TRUST &amp; NORTH CUMBRIA UNVERSITY HOSPITALS &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;North Cumbria Integrated NHS Foundation Trust is offering an exciting opportunity to work within the Emergency Care and Medicine Care Group as a Quality Matron. North Cumbria Integrated Care is at a truly exciting time of innovation and development.&lt;/p&gt;\n&lt;p&gt;Through the Trust strategy and values, we are committed achieving the delivery of safe, accessible, high quality and sustainable healthcare services in North Cumbria for future generations. We are committed to the long term development of a culture of continuous improvement as a way of working across all areas of the organisation to respond to changes in health care need and demand.&lt;/p&gt;\n&lt;p&gt;Applications are invited for the following key nursing role within the Care Group Structure, which has become available as part of transitional leadership arrangements for the coming months; the post will be available upon appointment until 30 June 2021, with review of progress commencing in March 2021, which is in line with full Care Group review arrangements, therefore the role is temporary in the first instance.&lt;/p&gt;\n&lt;p&gt;The Quality Matron is accountable to the Associate Director of Nursing and Governance for the Care Group.&lt;/p&gt;\n&lt;p&gt;Together with the Associate Director of Nursing and Governance and the Care Group Lead Nurse, the Quality Matron will foster a culture, which engages clinical staff to deliver high quality care in line with our #NCICway, ensuring we are a clinically led organisation, with safety &amp; quality at the heart of everything we do, ensuring every patient contact is a positive one, making NCIC a great place to work. This Quality Matron will be based at our West Cumberland Hospital site and will have a portfolio that will cover a variety of services to be discussed on appointment. The Quality Matron will be flexible to meet the needs of the services within their portfolio and will be expected to cover on our operational matron rota which includes weekend working and into the evening.&lt;/p&gt;\n&lt;p&gt;For informal enquiries or to discuss this role please contact Lead Nurse Diane Murchison by email - Diane.Murchison@ncic.nhs.uk.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Please ensure that you document evidence of meeting all the essential criteria in the supporting information.&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;If sufficient response is received this post could be closed earlier than the specified closing date, please apply as soon as possible to ensure that your application is considered.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;span&gt;The Trust is committed to safeguarding adults and children therefore if the post is subject to the Rehabilitation of Offenders Act (ROA) 1974 (Exceptions) Order 1975 (as amended) the successful candidate(s) will be subject to a criminal records check with the Disclosure and Barring Service (DBS). The cost of the DBS must be met by the successful candidate(s) through salary deduction. DBS charges are as follows &lt;strong&gt;if applicable to the post:&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Standard Check: £26 + Administration cost of £4.20 = deducted at £10.20 from 1st month salary and £10 deducted from salary over following 2 months.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Enhanced Check: £44 + administration cost of £4.20 = £15.20 deducted from 1st month salary and £11 deducted from salary over following 3 months.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;As part of the one of the largest employers in the UK NCIC future employees will have also access to the following benefits.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;A lease car may be available for this position; further details will be provided upon appointment if applicable.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;27 day holiday scheme rising to 33 after 10 years &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Flexible working Scheme &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Excellent opportunities for development &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Competitive NHS Pension scheme&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Access to NHS discounts with retailers and leisure companies&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;EAP (Employee Assistance Programme) a free, confidential counselling and information service to assist with personal or work-related problems&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;These schemes are subject to availability&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120898.png", "name": "North Cumbria Integrated Care NHS Foundation Trust (NCIC)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120898"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "West Cumberland Hospital, Whitehaven", "postalCode": "CA28 8JG"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.5302", "longitude": "-3.56318"}}, "title": "Quality Matron *Internal Applicants Only*", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248679", "validThrough": "2020-11-12T23:59:59+0000"}