{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "58558", "minValue": "52643", "unitText": "YEAR", "value": "£52,643 - £58,558 pa inc."}}, "datePosted": "2020-10-30T15:31:42+0000", "description": "&lt;p&gt;We are currently recruiting for a Continuing Healthcare Manager to join our CHC team.&lt;/p&gt;\n&lt;p&gt;As CHC Manager, you will report to the Team Manager of the CHC team to ensure the local health and social care system delivers safe and effective services to patients within the areas the North East London Commissioning Support Unit (NELCSU) provides CHC support.&lt;/p&gt;\n&lt;p&gt;You will also be responsible for leading on key operational areas of work relating to CHC and to the care provision of CHC and FNC eligible patients. The post holder will need to specifically ensure that the team is fully compliant with all requirements in the national framework for NHS Funded Continuing Healthcare and NHS-Funded Nursing Care. The post holder will use this expert knowledge to guide Multi-Disciplinary Panels when making decisions on CHC eligibility.&lt;/p&gt;\n&lt;p&gt;You will play a key role working with the Team Manager of the CSU Continuing Healthcare Team in bringing together the relevant stakeholders to ensure quality and value for money in the provision of NHS Funded Continuing Care (CHC) and NHS-Funded Nursing Care (FNC).&lt;/p&gt;\n&lt;p&gt;Additionally, you will support and manage joint working with the Children&#39;s Continuing Care Team(s) to ensure that the transition process from Children&#39;s to Adults services is of a high standard and is compliant with the national framework.&lt;/p&gt;\n&lt;p&gt;As CHC Manager you will also provide the appropriate contracting leads with support in relation to the development of services for CHC eligible patients, providing and informed perspective to the development of strategies and service planning for these vulnerable groups.&lt;/p&gt;\n&lt;p&gt;You will line manage the area Brokerage Team and ensure that they provide high quality service to patients, their families and Stakeholder Partners; including Hospital Discharge Teams and Social Services.&lt;/p&gt;\n&lt;p&gt;The post holder will liaise with the area Nursing Assessment Team to ensure that all assessments and reviews are carried out in a timely manner and to a high quality standard and provide specialist interpretation and analysis of performance data.&lt;/p&gt;\n&lt;p&gt;Further details on this role, please refer to the attached job description. Please ensure that you pay careful attention to the essentials and desirables of the person specification when completing your supporting statement.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Richard Brown, CHC Service Manager&lt;br /&gt;richard.brown16@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NEL Commissioning Support Unit", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127694"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Clifton House, London", "postalCode": "EC2A 2DU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5222", "longitude": "-.084148"}}, "title": "CHC Manager - Continuing Care", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250765", "validThrough": "2020-11-12T23:59:59+0000"}