{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "87754", "minValue": "75914", "unitText": "YEAR", "value": "£75,914 - £87,754 per annum + HCAS"}}, "datePosted": "2020-10-27T12:17:12+0000", "description": "&lt;p&gt;We are seeking a senior NHS Commissioning / Contracting professional to head our Contracting and Income team. The position reports to the Deputy CFO and leads a small team.&lt;/p&gt;\n&lt;p&gt;The post holder will lead the Trust’s complex commissioning and contracting relationships, maintaining strong relationships with commissioners to enable delivery of key contracting priorities. This will require strong negotiation, interpersonal and communication skills in order to effectively achieve delivery of the contracted level of performance. The post holder is responsible for income contracts totaling approximately £215 million.&lt;/p&gt;\n&lt;p&gt;The role will take a lead in the development of commissioning arrangements across the local area as the west Essex Integrated Care System matures.&lt;/p&gt;\n&lt;p&gt;Key responsibilities include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To evolve and deliver the Trust’s commissioning strategy including managing the changes required both in the commissioning function and trust wide resulting from national policy and the annual changes to commissioning terms&lt;/li&gt;\n&lt;li&gt;To lead on the day to day contract management for all NHS Commissioner and provider to provider contracts covering over £215m in income across 12 commissioning organisations.\n&lt;ul&gt;\n&lt;li&gt;negotiation of multi-year and annual contracts as well as any in-year contract variations.&lt;/li&gt;\n&lt;li&gt;quarterly and year end close down of all Commissioner contracts&lt;/li&gt;\n&lt;li&gt;quality assurance of all billing submission, ensuring that the latest contractual agreements are reflected&lt;/li&gt;\n&lt;li&gt;responding to commissioner challenges, ensuring provisions accurately reflect the expected size of the risk&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/li&gt;\n&lt;li&gt;To lead on developing and agreeing new contracting models within the west Essex Accountable Care System. Working closely with Commissioners and other Alliance partners in west Essex and across the STP to ensure the right balance of financial risk.&lt;/li&gt;\n&lt;li&gt;To lead on providing Executives and the Senior Management Team with strategic advice detailing opportunities and potential risks arising from commissioning contracts.&lt;/li&gt;\n&lt;li&gt;To lead on developing contract financial reporting and forecasting ensuring alignment to Trust-wide income / risk reporting.&lt;/li&gt;\n&lt;li&gt;To represent the Trust at SPQRG and Finance/Information group meetings with Commissioners.&lt;/li&gt;\n&lt;li&gt;To lead and develop the contracts team to ensure the provision of an efficient and proactive service to Health Care Groups within the Trust and to commissioners/STP, ensuring deadlines are met and the needs and objectives of the Trust are achieved.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;To be the Trust-wide go-to person on interpreting the NHS Standard Contract and National tariff, interpreting national finance guidance/policy/legislation on National Tariff Payment Systems and advising the organisation on how to implement in conjunction with relevant peers.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameAdrian BuggleJob titleInterim Deputy CFOEmail addressf.khatcherian@nhs.netTelephone number07903253889Additional contact information&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Adrian Buggle&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121503.PNG", "name": "The Princess Alexandra Hospital NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121503"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Princess Alexandra Hospital, Harlow", "postalCode": "CM20 1DR"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7708", "longitude": ".09132"}}, "title": "Head of Income and Contracts", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244457", "validThrough": "2020-11-27T23:59:59+0000"}