{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "42712", "minValue": "36070", "unitText": "YEAR", "value": "£36,070 - £42,712 pa inc. HCAS"}}, "datePosted": "2020-11-03T17:15:55+0000", "description": "&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for an experienced RMN with an interest in older people’s mental health to join the Waltham Forest based community mental health team. Our team is based in Red Oak Lodge which is close to Leytonstone High Street and a number of major transport links (Central Line, Overground and bus routes). There is car park on site for staff members who drive.&lt;/p&gt;\n&lt;p&gt;As an organization NELFT strives to deliver services within a recovery-focused and socially inclusive approach. You will work within a diverse community, developing quality services to improve the lives of local people.&lt;/p&gt;\n&lt;p&gt;The successful candidate will use their evidence based clinical skills to support older adults with dementia or functional mental illness and frailty. You will work within an experienced and established integrated team, delivering meaningful outcomes for service users and carers.&lt;/p&gt;\n&lt;p&gt;- You will care coordinate a caseload of service users that have complex and challenging needs and support them to achieve best quality of life.&lt;/p&gt;\n&lt;p&gt;- You will provide specialist nursing interventions in accordance with national guidelines and best evidence, also supporting families and care providers.&lt;/p&gt;\n&lt;p&gt;- You will deliver recovery focused health and social care interventions that include managing risk and safeguarding concerns.&lt;/p&gt;\n&lt;p&gt;- You will receive regular professional and managerial supervision, and be positively encouraged to access a range of clinical and professional development opportunities within the Trust in line with your career ambitions. We are committed to providing training where it needed including Dementia care.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Probationary Period&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This post will be subject to a probationary period. Internal applicants are exempt from the probationary period (unless you are an internal applicant currently part way through a probationary period or currently a bank member of staff).&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Assessment/Interview info&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;At NELFT we set very high standards to ensure we provide quality services. We require prospective employees to carry out an online literacy and numeracy test, equivalent to NVQ Level 2. For more information regarding our assessments, please visit our website. If you are shortlisted, invited for interview and successfully offered the post, you will be required to undertake an assessment for these skills during the pre-employment checks.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Starting with NELFT&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;NELFT place a great deal of importance on new starters being properly welcomed and inducted into the Trust. All new starters will join the Trust on the first Monday of each month and will undertake a comprehensive induction of up to two weeks which will include mandatory training, systems training and the allocation of equipment. As part of the process new starters will have the opportunity to also meet the executive team, senior managers and attend a number of drop in sessions focussing in engagement, health and wellbeing and key processes. The induction will be held at our head office in Rainham Essex&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;High Cost Area Supplement - London&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This post also attracts payment for High Cost Area Supplement of 15% of the basic salary (with a minimum of £3,784 to a maximum of £4,822).&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;NameShamara WilliamsJob titleClinical Lead NurseEmail addressshamara.williams@nelft.nhs.ukTelephone number03005551270 / 0300 555 1270Additional contact information&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Marcus Yorke- Clinical Lead&lt;/p&gt;\n&lt;p&gt;0300 555 1270&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NELFT NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120606"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Red Oak Lodge, 17 Thorne Close, Leytonstone, London, E11 4HU, London", "postalCode": "E11 4HU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5542", "longitude": ".004151"}}, "title": "Community Mental Health Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254904", "validThrough": "2020-11-12T23:59:59+0000"}