{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "107668", "minValue": "79860", "unitText": "YEAR", "value": "£79,860 - £107,668 per annum"}}, "datePosted": "2020-10-21T08:15:59+0100", "description": "&lt;p&gt;&lt;strong&gt;Consultant Psychiatrists&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;General Adult Psychiatry- 3 CMHT posts&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;12 programmed Activities Permanent&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;£79,860 - £107,668 per annum&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are looking for General Adult Consultant Psychiatrists to join our Community Mental Health Teams in Central Manchester. These posts are based at either the Rawnsley Building on the Manchester Royal Infirmary Site or half a mile from there at The Kath Locke Centre in Hulme.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are a dynamic and innovative Trust providing an excellent environment in which employees can develop and progress in their career. We value work- life balance and support our staff in achieving this.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This is an exciting time to join our dedicated teams and support further development of our Enhanced Community Model following the establishment of the new Greater Manchester Mental Health NHS Foundation Trust. The Trust was rated as &quot;Good&quot; in February 2018 by CQC ,with &quot;outstanding&quot; Substance Misuse services and &quot;outstanding&quot; for being Well Led.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are looking to recruit three full time Consultant Psychiatrists (12 Programmed Activities) to provide Clinical Leadership to the Central East and Central West CMHTS. The community teams in Manchester have undergone a major transformation in service model and delivery patterns with reintegration of previously fragmented functions, This will provides seamless community services which are responsive with clear assessment and treatment pathways and discharge routes. In addition there has been £0.75 million pound project to reduce Consultant only caseloads which have traditionally been high in Manchester, It was recognised that these caseloads precluded Consultants working in depth with patients under the team. The new service model no longer allows for step down to Consultant only nor referral direct to Consultants.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This is an exciting time to join two teams which are now working towards Royal College Accreditation. You will form part of the newly established Senior Leadership Team for the Central CMHTs and will be expected to be closely involved in Quality and Governance , particularly leading on learning from incidents and supporting the physical health agenda. Each Team has a Section 12 approved Staff Grade in post to support the medical work load.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Consultants are actively supported by the Lead Consultant and encouraged to develop special interests within SPA time. Research time and support from Manchester academics can be facilitated.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;It is also expected your role would include liaison with other agencies including the Local authority, Child Protection teams and Voluntary Sector Agencies. You will need you have an excellent knowledge of safeguarding of vulnerable adults and children.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Trust is committed to safeguarding children, young people and vulnerable adults and requires all staff and volunteers to share this commitment.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please refer to a job description and a person specification for further details about the post.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Dr Taseer Kazmi, Associate Medical Director at Taseer.kazmi@gmmh.nhs.uk on 0161 720 2918 or Dr Rosie Clarke Lead Consultant at Rosemary.clarke@gmmh.nhs.uk on 0161 271 0620&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121714.jpg", "name": "Greater Manchester Mental Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121714"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Manchester Royal Infirmary / Kath Locke Cenre, Hulme, Central Manchester", "postalCode": "M25 3BL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5368", "longitude": "-2.29146"}}, "title": "Consultant Psychiatrist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916235529", "validThrough": "2020-11-25T23:59:59+0000"}