{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 pa"}}, "datePosted": "2020-11-03T15:45:20+0000", "description": "&lt;p&gt;&lt;strong&gt;Rotational Pharmacist – plus on call availability – Band 6 – Pharmacy – 37.5 hours per week – Permanent &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Could you help West Suffolk Hospital to deliver the best quality and safest care to our local community?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The West Suffolk NHS Foundation Trust has significantly invested in its pharmacy department to further improve the service we provide our patients. We are expanding our team of pharmacists; could you help provide the best quality and safest care to our local community?&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Have you recently registered as a Pharmacist?&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Are you an established Pharmacist who wants to deliver high quality pharmaceutical care using an electronic prescribing and record system in a hospital team?&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Do you want to work in a supportive educational environment?&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Yes? Then come and be known at the West Suffolk NHS Foundation Trust.&lt;/p&gt;\n&lt;p&gt;West Suffolk Hospital is a ‘Global Digital Exemplar’ Trust. We have a fully integrated electronic prescribing and medication record system known as e-Care, which is supporting the pharmacy department to improve and monitor the care that we deliver. We have also recently had a replacement BD dispensing robot installed in May 2019. The Trust has also recently rolled out a real-time communication app for smartphones and desktops to replace the majority of physical pagers.&lt;/p&gt;\n&lt;p&gt;We are proud of our commitment to staff development. The post holder will support the delivery of ward, dispensary, medicines information and chemotherapy production services through a structured rotational programme tailored to the individual’s development needs to ensure that you have the necessary skills and competencies.&lt;/p&gt;\n&lt;p&gt;The pharmacy department:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Is well respected within the Trust&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Is a friendly team, with over 100 staff in both clinical and non-clinical roles&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Is located centrally at the West Suffolk Hospital&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Includes a chemotherapy production unit and a robotic dispensary&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Has well developed ward based clinical services with technician lead production and dispensary functions&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Actively promotes professional development – the department’s training and education team delivers training related to CPD/revalidation, pre-registration and post-registration.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Expectations of the role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Trust has implemented an extended hour seven-day, pharmacy service to improve patient experience, safety and clinical efficiency. Candidates will be expected to work their agreed contracted hours between 7.00am and 10.00pm over the seven-day period through a variety of flexible working patterns. The majority of full-time pharmacy staff work a 7.5 hour working day. The start and finish times will be dependent on the rostered shifts. The pharmacy department core working hours are between 8.30am and 5.00pm with all staff contributing to the extended hour’s periods on a rostered basis. NHS Agenda for Change pay enhancements will apply to weekend, bank holiday and unsocial hours worked.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Welcome!&lt;br /&gt; &lt;/strong&gt;Upon joining us, we will offer all new band 6 Pharmacists a welcome payment of £500* on appointment. Not only that, we offer a further £500* if you remain with the Trust after a year of employment.&lt;/p&gt;\n&lt;p&gt;       &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Come on, join our team!&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For an informal chat and to find out more about the role please contact David Hellens (Deputy Chief Pharmacist – Clinical Services) or Sam Holloway (Deputy Chief Pharmacist – Medication Safety) on 01284 712929.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;*Contractual terms will apply – employees leaving the Trust within the first or second year of employment will be required to repay a percentage of this payment on a sliding scale.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;h1&gt;&lt;strong&gt;**In order to improve efficiency, all correspondence relating to this vacancy, &lt;span style=&quot;text-decoration: underline;&quot;&gt;including invitations to interview will be by email only&lt;/span&gt;, via NHS Jobs. Would you therefore please ensure you check your emails on a regular basis**&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;In submitting an application form, you authorise West Suffolk NHS FT to confirm any previous NHS service details via the Inter Authority Transfer (IAT) process, should you be appointed to the post. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;CAR PARKING&lt;/strong&gt; - This post &lt;strong&gt;does&lt;/strong&gt; entitle you to apply to park on the Hospital site.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The successful candidate for this post will be required to apply for a Disclosure &amp; Barring Service (DBS) Disclosure at Enhanced level.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For Band 1 and Band 2 posts, the cost of the DBS Disclosure will be met by the Trust. However, any employees at Band 1 and Band 2 who leave the Trust within six months of commencing their post will have a £10 administration fee deducted from their final salary. For posts at Band 3 and above, the cost of the Disclosure will be met by the appointed employee and deducted in instalments from their salary over a period of three months. If the employee leaves the Trust within three months of commencing their post, any outstanding payments will be deducted from their final pay.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;All applicants should click on the link entitled “How will my application be processed?” prior to submitting their application form.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The closing date for this vacancy may change if we receive a strong response. Please ensure that you apply for any post you are interested in as soon as possible.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "West Suffolk NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120941"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bury St. Edmunds", "postalCode": "IP33 2QZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.2317", "longitude": ".709205"}}, "title": "Rotational Pharmacist - Band 6 - Pharmacy", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254610", "validThrough": "2020-11-17T23:59:59+0000"}