{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 pa pro rata for part time staff"}}, "datePosted": "2020-10-23T11:31:31+0100", "description": "&lt;p&gt;Want an exciting, fast moving research delivery and administration role with lots of opportunities for development? Look no further.&lt;/p&gt;\n&lt;p&gt;The newly structured Agile Research Team part of the Yorkshire and Humber Clinical Research Networks core team CRN Y&amp;H), are now recruiting a Band 4 Clinical Trials Support Officer role. The current vacancies represent an excellent opportunity for a motivated and hardworking person to be involved in all specialities of research.&lt;/p&gt;\n&lt;p&gt;You should ideally have experience in clinical research or be able to transfer your previously gained relevant clinical or administrative skills and knowledge of the NHS to the roles in this vacancy.&lt;/p&gt;\n&lt;p&gt;The Y&amp;H CRN Agile Research Team work on delivering large national portfolio research projects across a variety of clinical specialities within trusts , GP Practices and other community health and social care settings across the region, so you must be willing to be mobile and flexible in your working approach. You will be based at Royal Hallamshire Hospital, in the Clinical Research Network Office and employed by Sheffield Teaching Hospitals NHS Trust .&lt;/p&gt;\n&lt;p&gt;The Clinical Trials Support Officer will be responsible for the collection, recording and maintenance of patient data on NIHR portfolio studies.&lt;/p&gt;\n&lt;p&gt;The post holder will support current research staff in ensuring the completeness, accuracy and consistency of the data in order to meet standards expected for reporting to regulatory bodies.&lt;/p&gt;\n&lt;p&gt;This role will involve the recruitment and monitoring of patients undergoing clinical research and the collection and documentation of accurate clinical research data.&lt;/p&gt;\n&lt;p&gt;The post holder will work closely with, and support, research nurses/practitioners in providing the highest standards of patient care in line with research protocols and will ensure that such research safeguards the well-being of the patients and is conducted within ICH Good Clinical Practice guidelines for research.&lt;/p&gt;\n&lt;p&gt;Informal discussions about the Agile Research Team and the roles are encouraged.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The NIHR Clinical Research Network Yorkshire and Humber&lt;/p&gt;\n&lt;p&gt;The National Institute for Health Research (NIHR) was created as part of the Department of Health’s Research and development strategy, to provide a world-class infrastructure for clinical trials and high quality research in all areas of disease and clinical need within the NHS. The Clinical Research Network Yorkshire and Humber (CRN Y&amp;H) is part of the NIHR and is one of 15 Local Clinical Research Networks in England and aims to support clinical teams to recruit NHS patients to NIHR portfolio studies.&lt;/p&gt;\n&lt;p&gt;The CRN Y&amp;H area includes 22 Trusts and 21 CCGs and staff provide a coordinated and efficient infrastructure of research personnel and facilities to support recruitment and drive clinical research delivery performance across the locality.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This vacancy is advertised on a fixed term contract basis for a period of 2 years (until 31/03/2023) due to the post being externally funded. The fixed term contract status of the post holder will be reviewed in accordance with the Trust&#39;s legal obligations regarding fixed term contracts taking into consideration the ongoing source of the external funding and the requirement for the post to be maintained.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Eleanor Baldwin (Project and Workforce Administrator)&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Email: eleanor.baldwin7@nhs.net&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;As part of the recruitment process at application stage, Sheffield Teaching Hospitals will assess applicants’ individual values and behaviours to ensure that these behaviours align with our PROUD values: Patient First, Respectful, Ownership, Unity and Deliver.&lt;/p&gt;\n&lt;p&gt;Our values are what help to make us different and ‘a Brilliant Place to Work’. We expect all our employees to share our values and demonstrate them in every aspect of their role.&lt;/p&gt;\n&lt;p&gt;You will be required to undertake an online values assessment at application stage and the results of this assessment will be used as part of the on-going selection process to assess your suitability for the post.&lt;/p&gt;\n&lt;p&gt;The deadline for completing the online assessment is midnight 21/11/2020.&lt;/p&gt;\n&lt;p&gt;The link to the assessment can be found below, the address can be copied and pasted into a search engine e.g. google:&lt;/p&gt;\n&lt;p&gt;login.talentqgroup.com/Login/SelfService/BQZBJUPQQU&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;If you have any queries, require any assistance to complete this assessment or have already completed it within the past 12 months, please contact the Trust Recruitment Team at &lt;strong&gt;sth.centralrecruitment@nhs.net&lt;/strong&gt;&lt;strong&gt;.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt; &lt;/em&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121486.png", "name": "Sheffield Teaching Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121486"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Hallamshire Hospital, Sheffield", "postalCode": "S10 2JF"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3785", "longitude": "-1.49346"}}, "title": "Clinical Trials Support Officer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240339", "validThrough": "2020-11-08T23:59:59+0000"}