{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Competitive"}}, "datePosted": "2020-10-28T12:30:29+0000", "description": "&lt;p&gt;Be part of something special. Be part of a not for profit organisation driven by doing what’s best for people. At Nuffield Health, we reinvest every penny we make in our expert staff, our technology and our facilities, to provide accessible, innovative ways for people to be as healthy as they can be. Join us, and we’ll support you to be your best too.&lt;/p&gt;\n&lt;p&gt;Nuffield Health, one of the UK’s leading healthcare organisations, is currently seeking to recruit a highly motivated and enthusiastic professional registered Nurse to join the team in our busy Outpatients.&lt;/p&gt;\n&lt;p&gt;Nuffield Health is Britain’s largest and most pioneering healthcare charity, integrating fitness and well-being, prevention and cure. We’ve brought together our hospitals, clinics, fitness &amp; wellbeing centres as well as our diagnostic units into one holistic healthcare service provided from over 200 locations. A not-for-profit organisation, we reinvest every penny we make into helping the people of Britain to lead healthier, happier lives. In today’s healthcare market, we’re in an enviably strong position.&lt;/p&gt;\n&lt;p&gt;As a Staff Nurse in the Outpatients Department, you will perform a wide range of specialist duties to deliver high quality patient care which is clinically effective, evidence based and appropriate.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;You will also assist with investigations, treatments and procedures. The ability to deal sensitively with patients and staff at all levels is essential and experience of an Outpatients department would be an advantage. You will need to be flexible with regard to shift work covering evenings and weekends.&lt;/p&gt;\n&lt;p&gt;You’ll get to enjoy the rapport of team working within an innovative, clean, modern working environment. Use the experience you&#39;ve already gained in your career to make the most of this opportunity.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/132134.jpg", "name": "Nuffield Health", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132134"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Plymouth Hospital", "postalCode": "PL6 8BG"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.4187", "longitude": "-4.11449"}}, "title": "Staff Nurse - Outpatients", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246589", "validThrough": "2020-11-25T23:59:59+0000"}