{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "49036", "minValue": "49036", "unitText": "YEAR", "value": "£49,036 £49,036 p.a excl.LZ"}}, "datePosted": "2020-11-02T12:02:23+0000", "description": "&lt;p&gt;&lt;strong&gt;GUY’S AND ST. THOMAS’ HOSPITAL NHS FOUNDATION TRUST&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Toxicology and Emergency Medicine &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Senior Clinical Fellow in Clinical Toxicology and Emergency Medicine&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Nodal Point – 4 - £49,036 p.a excl. LZ&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Full Time – 40 hours per week&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Fixed Term – 1 year&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are recruiting to these 12 month OOPTE in Clinical Toxicology and Emergency Medicine that will be based at St Thomas’ Hospital and will start from February 2021 or as soon as possible thereafter. This post will enable an ST4–7 level trainee in Emergency Medicine (or international equivalent) to develop and expand their skills in Clinical Toxicology in a specialist centre and to undertake research in Clinical Toxicology. The post will be split 50:50 between Emergency Medicine and Clinical Toxicology. The postholder will participate in the ED night (60%) and weekend rota (75%) of the full time post&lt;/p&gt;\n&lt;p&gt;Clinical Toxicology: You will have the opportunity to undertake specialist training in Clinical Toxicology, with training in both inpatient and outpatient management of poisoned patients. You will have the opportunity to undertake clinical toxicology research in an area of interest of the department (e.g. recreational drug toxicity, deliberate self-poisoning) during the OOPTE; it would be expected that this would lead to submission of paper(s) for publication. You will have the opportunity to help deliver Clinical Toxicology education as part of the portfolio of the clinical toxicology department.&lt;/p&gt;\n&lt;p&gt;Emergency Medicine: You will participate in a middle grade rota working with other senior ED trainees and supervising junior middle grades, FY2s and ENPs. The Emergency Department is led by sixteen Adult and four Paediatric Emergency Consultants. The Department sees over 140,000 new patients per annum, has a 16-bed Emergency Medicine Unit and a separate Paediatric Emergency Department.&lt;/p&gt;\n&lt;p&gt;The post will have an educational supervisor in Emergency Medicine and an Educational Supervisor in Clinical Toxicology. Funding will be available to enable the postholder to attend relevant course(s).&lt;/p&gt;\n&lt;p&gt;Applicants must hold full registration with the GMC and currently be an ST3+ in Emergency Medicine in the UK (or international equivalent in the UK recognized by the RCEM).&lt;/p&gt;\n&lt;p&gt;For further details please contact Professor Paul Dargan (paul.dargan@gstt.nhs.uk)&lt;/p&gt;\n&lt;p&gt;As an organisation we are committed to developing our services in ways that best suit the needs of our patients. This means that some staff groups will increasingly be asked to work a more flexible shift pattern so that we can offer services in the evenings or at weekends.&lt;/p&gt;\n&lt;p&gt;For further information and to apply online, please go to our website quoting reference number &lt;strong&gt;MED2081-C.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing date: 13th Nov 2020, by midnight. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;As an organisation we are committed to developing our services in ways that best suit the needs of our patients. This means that some staff groups will increasingly be asked to work a more flexible shift pattern so that we can offer services in the evenings or at weekends.&lt;/p&gt;\n&lt;p&gt;Creating a world-leading Academic Health Sciences Centre.&lt;/p&gt;\n&lt;p&gt;All our vacancies can be viewed on our website.&lt;/p&gt;\n&lt;p&gt;Our excellent benefits include final salary pension scheme. Please visit our website to find out more.&lt;/p&gt;\n&lt;p&gt;Equality of opportunity is our Policy. The Trust provides health services to a diverse community.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;For further details please contact Professor Paul Dargan (paul.dargan@gstt.nhs.uk).&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121066.jpg", "name": "Guy's and St. Thomas' NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121066"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Guy&#39;s and St. Thomas&#39; Hospital, London", "postalCode": "SE1 9RT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5046", "longitude": "-.088964"}}, "title": "Senior Fellow in Clinical Toxicology and Emergency Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251970", "validThrough": "2020-11-13T23:59:59+0000"}