{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 pa"}}, "datePosted": "2020-10-28T13:00:20+0000", "description": "&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;*********£2500 ‘Golden Hello’ Payment**********&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;If you are successfully recruited you will receive £2500 (this does not apply to current HIOW NHS Staff)&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt; &lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for a band 6 registered Mental Health Nurse to join the older person’s community mental health team based at Parklands Hospital Basingstoke . The team is a highly supportive and innovative team that aspires to provide a responsive, safe, effective, caring service that is well led.&lt;/p&gt;\n&lt;p&gt;The successful candidate with be a band 6 nurse ideally with experience of working with older people with mental health problems.  They will be able to demonstrate knowledge of organic and functional mental illness and will also have some knowledge of physical health problems. They must be able to work independently and demonstrate good time management skills in order to carry a mixed caseload as well as being able to work as part of the team and with other agencies. The successful candidate will also be expected to contribute to the wider working of the team which would be participating in the ‘Triage’ system. Support and training with be given for this if required.  The successful candidate will work alongside the other team members to provide assessment and support to those living in their own homes and those in care homes in within the patch.&lt;/p&gt;\n&lt;p&gt;We are committed to ensuring the personal and professional development of our staff. We have a varied and comprehensive list of learning beyond registration courses alongside in house trust training and will support staff to engage in relevant, identified courses.&lt;/p&gt;\n&lt;p&gt;Car driver and access to vehicle is essential for this role&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For an informal discussion please contact Sheila Gascoigne  01256 376451 or email sheila.gascoigne@nhs.net@nhs.net&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Southern Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120646"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Basingstoke", "postalCode": "RG24 9RH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2827", "longitude": "-1.11187"}}, "title": "Community Mental Health Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246674", "validThrough": "2020-11-29T23:59:59+0000"}