{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30762", "minValue": "16625", "unitText": "YEAR", "value": "£9.89 - £18.30"}}, "datePosted": "2020-10-29T13:16:02+0000", "description": "&lt;p&gt;&lt;span&gt;&lt;span&gt;We are looking for organised and efficient people to provide Audio typing support on a temporary basis to cover different areas within the Trust.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;You must have previous audio typing experience and demonstrate excellent communication and organisational skills. Previous experience in a healthcare setting would be an advantage.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;You will be required to carry out a full range of office and administration duties from filing, minute taking, report writing and routine paperwork to supporting staff with small work based projects and generally maintaining an efficient office environment.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Experience in using Microsoft Office, particularly Word and Excel is essential, as is ability to use email. Candidates must be willing to learn new IT systems as required and have good typing skills.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Please note this work is &lt;strong&gt;&lt;span&gt;bank only&lt;/span&gt;&lt;/strong&gt;&lt;/span&gt;&lt;span&gt; on an ‘as and when required’ basis so the work is not guaranteed. Work is across both sites (Tunbridge Wells Hospital and Maidstone Hospital) with variable hours.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;We are passionate in supporting our staff to develop and have great opportunities for career progression. We take equality and diversity seriously and seek to empower all diverse groups within our trust. We seek to develop a culture where diversity in all its forms is celebrated. We are committed to ensuring that women are empowered to work at all levels of management and that working patterns are as flexible as possible giving all members of staff opportunity to flourish in using their skills for our patients. We work across our trust to enable those who consider themselves to have a disability both visible and invisible to have access to all they need to thrive in their work environment. We work with Stonewall to embed an inclusive and accepting culture for all lesbian, gay, bisexual and transgender staff. We have 78 nationalities working in our trust and we are proud of this. We are active in embracing the ethnic and cultural diversity in our trust. We work to empower people with any protected characteristic to have opportunities to work in an environment that helps them to contribute to the best of their ability, recognising and valuing the unique contributions each of us brings for best quality care and service to our patients. We are committed to supporting the delivery of the Equality Act with zero tolerance for any discrimination, harassment or victimisation of applicants and staff with these protected characteristics&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing Date: Friday 6th November 2020 &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interviews: Wednesday 18th November 2020 &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameNicole WilkinsJob titleStaff Bank Team LeaderEmail addressmtw-tr.staffbank@nhs.net&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120635.png", "name": "Maidstone and Tunbridge Wells NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120635"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Maidstone Hospital &amp; Tunbridge Wells", "postalCode": "ME16 9QQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2737", "longitude": ".484004"}}, "title": "Bank Audio Typist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248474", "validThrough": "2020-11-06T23:59:59+0000"}