{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 p.a."}}, "datePosted": "2020-10-14T10:04:03+0100", "description": "&lt;p&gt;&lt;span&gt;An exciting opportunity has arisen for a Highly Specialist Clinical Psychologist to work within our CAMHS Trauma Pathway as well as working with other agencies and professionals across Southampton to develop a trauma informed approach across the city. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;In CAMHS, there is often a high level of complexity in the children and young people we see. The role will involve offering assessments and specialist interventions to children and young people who have experienced trauma, including complex trauma. There are opportunities to further develop the intervention offers we currently have for these children and young people and a strong interest in this area is key. As a band 8a there will be an expectation to supervise other members of the wider psychology team and team members from other disciplines working within the trauma pathway. We have links to the University of Southampton doctorate training programme and regularly have trainees working within the service as well. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This post has been developed to support working towards a trauma informed city where all professionals and agencies working with children and young people have an understanding and awareness of trauma. The role of the clinical psychologist will be to lead on developing and delivering bespoke training alongside key professionals in partner agencies. There has recently been a good response to training on restorative practice across the city and broadening this to trauma informed ways of working with children and young people where anxiety and fear may be an underlying driver of their behavioural presentation is our vision. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This role will involve developing close links with schools and the MHST’s across the city as well as having good links with partner agencies (e.g. No limits YP service; children’s social care). There will be a strong focus on training and consultation to other services in trauma informed practice as well as considering how this work will be evaluated.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are looking for confident CAMHS professionals with a demonstrable track record of providing good quality evidence-based interventions, improving service quality with a strong interest in service development. This position calls for a professional with significant experience of working with children, young people and their families experiencing mental health and trauma difficulties. We are looking for a clinical psychologist who has an interest in trauma with experience of service development and leadership experience alongside the right attitude, skills and knowledge and who will share our passion to deliver the best quality care experience for children and their families. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We offer an exciting and dynamic environment where your ideas and career development will be valued. The post holder will be supported directly by the Consultant Clinical Psychologist in this exciting and innovative development. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;If you wish to have an informal conversation regarding the post please contact Dr Laura Roughan, Consultant Clinical Psychologist on 02381 030061 or email Laura.roughan@solent.nhs.uk&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Please note that should this post attract sufficient interest, we may choose to close at an earlier date. We strongly suggest that you apply at an early stage.&lt;strong&gt;If we have not contacted you within four weeks of the closing date of this post, please presume that you have not been selected.&lt;/strong&gt;Candidates selected for interview will be contacted within 2-3 weeks; therefore you should check your emails regularly including junk mail folders.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/126954.jpg", "name": "Solent NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126954"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southampton", "postalCode": "SO16 4XE"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.9252", "longitude": "-1.44603"}}, "title": "Highly Specialist Clinical Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916225610", "validThrough": "2020-11-11T23:59:59+0000"}