{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 per annum, pro rata"}}, "datePosted": "2020-11-02T14:16:16+0000", "description": "&lt;p&gt;&lt;strong&gt;Mental Health Band 3 Activity Co-ordinator&lt;/strong&gt; – Prospect Park Hospital, Reading&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;If you are looking to start your mental health career pathway, our acute wards can offer you a great environment that will enable you to develop your skills &amp; confidence as an Activity Co-Ordinator. We are looking to recruit two part time (30 hours) Activity Co-odinator’s for two of our mental health acute wards. &lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;strong&gt;Daisy&lt;/strong&gt; and &lt;strong&gt;Rose&lt;/strong&gt; are mixed 22 bed Acute Wards that &lt;/em&gt;&lt;em&gt;provide care for vulnerable adults. Based in Reading, located close to the amenities of the town centre and a leafy park, the ward works closely with patients and families to help them to identify their needs and participate actively in their care, providing a place of empathy, kindness and compassion. We have created a culture where everyone has a voice and where service users and staff collaborate to make positive change.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;The Activity Co-ordinator service operates seven days a week, where your working days will rotate (including weekends) with a second Activity Co-ordinator. Working hours that suit the needs of the ward can be discussed with the hiring Manager. &lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Under the supervision of a member of the ward staff /qualified practitioner the post holder will plan, coordinate and implement a range of individual and group activities designed to meet the social and recreational needs of in-patients. &lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;The post holder will be required to use their initiative when working independently on the wards and are expected to report any clinical progress, concerns or change to a qualified practitioner.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the Job&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To demonstrate a knowledge and awareness of current clinical issues in relation to people currently experiencing mental health problems.&lt;/li&gt;\n&lt;li&gt;To take the lead in planning a range of therapeutic activities that are appropriate for the needs of patients in agreement with the multi-disciplinary team.&lt;/li&gt;\n&lt;li&gt;To be able to establish effective therapeutic engagement and relationships with inpatients and carers.&lt;/li&gt;\n&lt;li&gt;To be able to assess patient’s well-being during activities and social interactions and monitor progress.&lt;/li&gt;\n&lt;li&gt;To adapt activities to meet the needs of people and provide a calming, de-escalating manner at all times.&lt;/li&gt;\n&lt;li&gt;To provide verbal and written feedback to relevant multidisciplinary team members following activities as required.&lt;/li&gt;\n&lt;li&gt;To complete robust documentation of each session within the patients’ care record following an activity.&lt;/li&gt;\n&lt;li&gt;To risk assess all activities provided and ensure individual risk assessments for patients participating in these activities on or off the ward is read and understood.&lt;/li&gt;\n&lt;li&gt;To agree with the Ward Manager appropriate equipment needed, oversee the maintenance of activities equipment used on the ward and prepare craft and any other appropriate equipment before patients arrive.&lt;/li&gt;\n&lt;li&gt;To engage in the Prevention and Management of Violence and Aggression training which will include physical intervention therefore the post hold will need to be physically fit.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Some of the benefits of joining our team:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Agenda for Change Salary ranging from &lt;strong&gt;£19,737 to £21,142&lt;/strong&gt; per annum, pro rata&lt;/li&gt;\n&lt;li&gt;Flexible working opportunities and a strong emphasis on your work, life balance&lt;/li&gt;\n&lt;li&gt;Annual leave – 27 days for new starters, plus bank holidays. Increasing to 29 days after 5 years and 33 days after 10 years NHS service. Pro rata for part time staff&lt;/li&gt;\n&lt;li&gt;Excellent learning and development opportunities&lt;/li&gt;\n&lt;li&gt;Salary sacrifice scheme for a new car&lt;/li&gt;\n&lt;li&gt;Access to onsite library&lt;/li&gt;\n&lt;li&gt;Generous maternity, paternity and adoption leave for eligible staff&lt;/li&gt;\n&lt;li&gt;Advanced IT enablement and support&lt;/li&gt;\n&lt;li&gt;Confidential telephone care service providing independent support and advice for staff.&lt;/li&gt;\n&lt;li&gt;And so much more&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The “must haves” for you to be considered for this role:&lt;/strong&gt;&lt;/p&gt;\n&lt;ol&gt;\n&lt;li&gt;GCSE Grade C or equivalent in English&lt;/li&gt;\n&lt;li&gt;Good knowledge of craft and social activities and how they can be used within a group&lt;/li&gt;\n&lt;li&gt;Basic knowledge of health and safety&lt;/li&gt;\n&lt;/ol&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;If you recognise yourself in these requirements, we would recommend you apply today!&lt;/p&gt;\n&lt;p&gt;We are happy to answer any questions that you may have. Please don’t hesitate to call one of our hiring Ward Managers on the contact numbers below who’ll be delighted to help.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Rose Ward Manager, Mark Wiltshire, on 0118 960 5391&lt;/p&gt;\n&lt;p&gt;Daisy Ward Manager, Isatu Sesay, on 0118 960 5249&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120886.PNG", "name": "Berkshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120886"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Reading", "postalCode": "RG30 4EJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4491", "longitude": "-1.0147"}}, "title": "Activity Co-ordinator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252377", "validThrough": "2020-11-08T23:59:59+0000"}