{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum"}}, "datePosted": "2020-11-06T15:46:44+0000", "description": "&lt;p&gt;We are looking for an enthusiastic and energetic Senior Clinical/Forensic/Counselling Psychologist to work in our acute mental health wards. You will be working in a dynamic environment delivering assessments and case formulations for complex clients. You will have an interest in providing brief, focused individual and group therapy interventions and supporting ward teams with psychologically informed practice ranging from positive behaviour support plans to reflective practice groups.&lt;/p&gt;\n&lt;p&gt;The Trust values its wards and across the Trust, has invested in new build and extensively refurbished wards. We are developing psychology leaders to take on the role of Responsible Clinician. Within the acute care group, ward teams value the therapy work, case consultation and staff support role provided by ward psychologists.&lt;/p&gt;\n&lt;p&gt;The post holder has an important strategic and liaison function to support the transition of patients between services. The successful candidate will also offer clinical supervision to assistant psychologists and trainees as well as Band 7 Psychologists. There will also be opportunity to develop your management skills. You will offer clinical supervision for our multi-disciplinary colleagues. There will be opportunities to take a lead role in service development, evaluating the outcomes of psychological work and publishing that research. We have good links to the Salomons Clinical Psychology training scheme.&lt;/p&gt;\n&lt;p&gt;We will support you though regular clinical and managerial supervision as well as training to develop both professionally and personally within the role. There are CPD options as well as opportunities to join specialist supervision groups such as the Trauma Clinical Network Group.&lt;/p&gt;\n&lt;p&gt;Doctoral level training in Clinical/Forensic/Counselling psychology or the equivalent is essential with some post-qualification expertise of patients with complex presentations and dual diagnoses. You must have current registration with the HCPC and be appointable to Band 8a under Agenda for Change. We are ideally looking for a full time candidate but candidates wishing to work part time (minimum of 3 days per week, 0.6 wte) will also be considered.&lt;/p&gt;\n&lt;p&gt;We can offer a virtual interview if required.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Belinda Demirbasa, Consultant Clinical Psychologist, Lead for Acute Care Inpatient Psychological Practice&lt;/p&gt;\n&lt;p&gt;Mobile: 07826 530911&lt;/p&gt;\n&lt;p&gt;belinda.demirbasa@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121464.jpg", "name": "Kent and Medway NHS and Social Care Partnership Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121464"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St Martins Hospital, Canterbury", "postalCode": "CT1 1TD"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2769", "longitude": "1.1062"}}, "title": "Senior Clinical/Forensic/Counselling Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916260452", "validThrough": "2020-11-22T23:59:59+0000"}