{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Band 5"}}, "datePosted": "2020-10-28T10:24:33+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;span&gt;&lt;strong&gt;&lt;span&gt;Are you looking to be part of something amazing?&lt;/span&gt;&lt;/strong&gt;&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;We have amazing new opportunities for experienced ODPs and Theatre Registered Nurses. &lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;With our new university hospital &lt;/strong&gt;opening in 2022, the Midland Metropolitan University Hospital will be the largest emergency hospital in the region, offering theatre teams supported by cutting-edge technology to treat patients. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are recruiting Band 5 Theatre Practitioners in &lt;strong&gt;Anaesthetic/Recovery &lt;/strong&gt;&lt;strong&gt;and &lt;/strong&gt;&lt;strong&gt;Scrub to develop our workforce to meet the needs of our patients for the future.&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Bring your ambition to life and secure your career pathway.&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Are you looking to be part of a dynamic organisation, with an overall aim to deliver exceptional surgical patient care?&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Do you have excellent clinical skills and a desire to further develop your career aspirations?&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Do you want to be part of a team where your contribution counts?&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;If your answer is yes then we can offer you excellent opportunities in theatre scrub, recovery and anaesthetics. Our culture is focussed on learning where senior members regularly host training sessions and provide mentoring support. Our management team has an open door policy and aims to provide guidance and help to face challenges or concerns. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We offer newly qualified, registered nurses, operating department practitioners and skilled theatre practitioners, opportunities to progress within the department. We are dedicated to supporting out theatre practitioners in their career aspirations and offer theatre career opportunities developments from band 5 – 8b. Over the last 12 months we have created an infrastructure with a dedicated training budget to support theatre practitioners at all levels in developing their skills and knowledge and offer a wide range of bespoke packages to ensure staff achieve their career aspirations including development from B5-B6 with a leadership package. We care about our employees and believe that a friendly and supportive team makes a difference to our staff. On joining our Theatres team we aim to make you feel part of our family. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Over the last 12 months the Trust has significantly invested in theatre resources and technology and our surgeons are committed to driving pioneer surgical interventions and research. We deliver surgical services across 2 acute hospital locations (Sandwell, West Birmingham Hospitals) and also offer regional ophthalmology surgery at our innovative and prestigious Birmingham Midland Eye Clinic. Each Hospital site offers a wide choice of specialties including &lt;/span&gt;&lt;strong&gt;Ophthalmology,&lt;/strong&gt;&lt;span&gt;Trauma and Orthopaedics, Ear Nose and Throat, General Surgery, Gynecology, Gynae-Oncology (Pan-Birmingham Centre), Obstetrics, Plastics, Breast Surgery and Urology.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;We offer exclusive staff benefits some of which include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;flexible working hours,&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Onsite free Gym on both hospital sites&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Childcare Facilities&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Car Lease Scheme&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Savings with local supermarkets / National and local discounts&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Financial advice through Neyber&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Opportunities for post registration training and development&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;span&gt;If you want to work as part of a flexible, dynamic, well supported team then Theatres at SWBH is the right place for you. Join our recruitment sessions and be part of something amazing&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120738.gif", "name": "Sandwell and West Birmingham Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120738"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Sandwell and West Birmingham", "postalCode": "B18 7QH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4898", "longitude": "-1.92942"}}, "title": "Band 5 Theatre Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246040", "validThrough": "2020-11-11T23:59:59+0000"}