{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pa"}}, "datePosted": "2020-11-04T11:31:21+0000", "description": "&lt;p&gt;&lt;strong&gt;Norfolk Learning Disabilities Service comprises of five community teams countywide and is made up of joint health and social care professionals delivering specialist health provision and social care to adults with learning disabilities. We work in the community to ensure adults with learning disabilities lead as independent and fulfilling lives as possible.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This is an exciting opportunity, we are seeking a highly motivated Band 5 Speech and Language Therapist (Newly Qualified Practitioners welcomed) to join the multidisciplinary team in West Norfolk. You would work alongside and be supported by an experienced Speech and Language Therapist to provide a clinically effective and timely communication service. This post is substantive and based in King’s Lynn. It would be helpful to have some experience in the following areas, but not essential:&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;• Working with Adults with Learning Disabilities or individuals with complex multiple disabilities&lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;• Working in a community setting&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;In return, we offer:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Full induction programme &lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;• RCSLT NQP Competency Support&lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;• Monthly clinical supervision&lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;• Annual performance reviews&lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;• Great team working&lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;• CPD opportunities&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;You will be required to work in a variety of settings including people’s homes, day services and respite placements. You will use your SLT assessment skills to set goals, plan and review interventions, working in partnership with the individual to support them to meet their goals.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;You will benefit from being part of a supportive, experienced group of Speech and Language Therapy staff working in Learning Disabilities across the county of Norfolk. They will receive regular supervision from experienced Learning Disability Specialist SLT’s.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;You will need to be highly motivated, flexible and enthusiastic and we encourage creativity and innovative thinking.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Effective communication and organisational skills are essential. We welcome applications from candidates who are able to work autonomously and who are enthusiastic about working in the community with vulnerable adults who have a wide range of learning disabilities.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Opportunities for personal and professional development exist through supervision, management and peer support, sharing of best practice and regular continuing professional education.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Apply now to join an organisation that has been awarded an ‘Outstanding’ rating by the Care Quality Commission (CQC), the highest possible rating and the first stand-alone NHS community trust in the country to be awarded the title.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameSally DebbageJob titleProfessional Lead Speech and Language Therapist – Adult Learning DisabilitiesEmail addresssally.debbage@nchc.nhs.ukTelephone number01603 475618.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Norfolk Community Health and Care NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120940"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Park View Resource Centre, Kings Lynn", "postalCode": "PE30 5QD"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.75", "longitude": ".404462"}}, "title": "Speech and Language Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255621", "validThrough": "2020-11-22T23:59:59+0000"}