{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "25366", "minValue": "25366", "unitText": "YEAR", "value": "From £15.09"}}, "datePosted": "2020-11-05T09:01:13+0000", "description": "&lt;h1&gt;&lt;strong&gt;Vacancies for 111 Clinical Advisors&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;&lt;strong&gt;Hours: &lt;/strong&gt;Full/Part-time Positions-Shift pattern will include weekday evenings and weekends.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Contract Type: &lt;/strong&gt;Permanent&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary: &lt;/strong&gt;From £15.09 per hour&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location:&lt;/strong&gt;Fox Talbot House-Chippenham&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Full Time/Part-time positions (minimum 16 hours) shift and bank holiday enhancements as applicable.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;There is a requirement for out of hours, weekend and bank holiday working&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are recruiting for NHS111 Clinical Advisors.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Are you looking for a development in your clinical career? Are you a qualified nurse or paramedic with current registration? To join us you will require at least 2 years post registration experience in relevant health care setting or specialities. If you are passionate about helping others and want to make a difference, we want to hear from you.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Who are we?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Vocare/Totally work in partnership with the NHS to provide accessible and high-quality integrated health care services. The Integrated Urgent Care Clinical Assessment Service operates 24/7, 365 days a year. It provides access to telephone triage, face to face consultation as well as digital online access points for patients and health care professionals. The service delivers urgent care to people who live, work or visit the area.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;111 Clinical Advisor&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The NHS 111 service is currently expanding as part of the NHS England changes to Integrated Urgent Care. We are looking for dedicated and passionate Clinical Advisors to join our team.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Our NHS 111 Clinician role is an essential component of the Integrated Urgent Care Clinical Assessment Service. As a NHS 111 Clinical Advisor you will be responsible for assessing callers with a wide spectrum of clinical conditions; advising them on home care management, next steps and referring them on to further care when appropriate. The computer-based clinical decision system ‘NHS Pathways’ will facilitate and support the advice you give.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This role involves working in a multidisciplinary/ multiagency team supporting each other to ensure that we provide high quality, evidence-based healthcare to the immediate needs of our patients. You will be required to show commitment to providing high quality service and continuous professional development.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Role Expectations&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Our Integrated Urgent Care Service operates 24/7 and 365 days a year. If you choose to apply and join our team your application will be subject to Disclosure and Barring Service checks. If you are successful you will be required to work during both in hours and out of periods. This will include weekends/bank holidays and may include night duty. On commencement you will be on probation, this is generally for six months. Please note: our training site is located in Chippenham, therefore you will not have to travel between sites. The classroom-based training is Monday to Friday 8-4pm and once you move to working with your coach this will be as per a designated shift pattern.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;If successful, you will be required to complete our company induction and the full NHS Pathways and systems training to prepare you for the role.&lt;/p&gt;\n&lt;p&gt;Our upcoming courses are on a full-time basis. Training is structured and intense in line with the NHS Pathways licence. You will initially receive three full weeks in the classroom. If you successfully complete the classroom assessments, you will move on to one-on-one coaching taking live calls. You will then return to the classroom for a further clinical update. On successful completion of the final clinical week you will then graduate and become fully fledged within our team.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Career Development&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;There will be on-going development opportunities once you have completed your probation period, these are in line with NHS Pathways and the NHS England workforce blueprint as well as any development needs you may identify via your appraisal.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Benefits of joining us:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Rotating Weekend Shifts&lt;/li&gt;\n&lt;li&gt;30 days pro rata holiday entitlement (including bank holidays)&lt;/li&gt;\n&lt;li&gt;Company Pension Scheme&lt;/li&gt;\n&lt;li&gt;Perkbox and access to NHS staff benefit schemes&lt;/li&gt;\n&lt;li&gt;Shift working&lt;/li&gt;\n&lt;li&gt;Eye test scheme&lt;/li&gt;\n&lt;li&gt;Employee Assistance Programme&lt;/li&gt;\n&lt;li&gt;Company sick pay after one year of service&lt;/li&gt;\n&lt;li&gt;Company Maternity/Paternity pay after one year of service&lt;/li&gt;\n&lt;li&gt;Access to updates and courses&lt;/li&gt;\n&lt;li&gt;Being part of a supportive and innovative team with scope for progression&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Closing date for ALL applications is 28th October 2020&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Please note the following shortlisting approach will be applied:&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Round 1&lt;/em&gt;&lt;/strong&gt;&lt;em&gt;- Any staff at risk of redundancy within the Totally plc group, who meet the essential criteria, will be considered in the first instance for this vacancy.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Round 2&lt;/em&gt;&lt;/strong&gt;&lt;em&gt;- If the vacancy has not been filled after round 1, any employee Affected by Change within the Totally plc group, who meet the essential criteria, will be then be considered for this vacancy.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Round 3&lt;/em&gt;&lt;/strong&gt;&lt;em&gt;- If the vacancy has not been filled after round 2, we will consider and shortlist all remaining applications in accordance with our recruitment policy.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please assume you have been unsuccessful with your application if you have not heard back from us within 2 weeks of the closing date.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;All successful applicants will be subject to a DBS Check&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Vocare Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133274"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Chippenham", "postalCode": "SN15 1BN"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4733", "longitude": "-2.12299"}}, "title": "111 Clinical Advisor", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256984", "validThrough": "2020-11-11T23:59:59+0000"}