{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "49357", "minValue": "43727", "unitText": "YEAR", "value": "£43,727 - £49,357"}}, "datePosted": "2020-10-02T13:21:37+0100", "description": "&lt;p&gt;We have a number of opportunities for Staff Nurses, working across our Mental Health inpatient services, to join our multi-disciplinary teams where you will work with patients and their families to support their treatment and recovery.&lt;/p&gt;\n&lt;p&gt;As a 1st level registered mental health nurse you’ll bring to the role a demonstrable understanding of the needs of the people requiring adult inpatient care. This will include the ability to carry out comprehensive risk assessments, co-produce care plans, and provide effective one-to-one interventions.&lt;/p&gt;\n&lt;p&gt;Although our preference would be to have 2 years post registration experience, applications will be considered from newly/recently qualified mental health nurses who demonstrate the values we are seeking for our team members.&lt;/p&gt;\n&lt;p&gt;Our people are so important, so with support from day one, you’ll have everything you need to make the move and start changing the lives of others, and your own. We’ll provide you with a generous relocation package, as well as continual training and development opportunities and the freedom to really rediscover why you love what you do, and who you are.&lt;/p&gt;\n&lt;p&gt;For an informal discussion about the roles available please contact Jane Roberts on 01534 443299 or Clare Ryder on 01534 445873.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Health and Community Services Jersey", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=135055"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Jersey", "postalCode": "JE1 3QS"}, "geo": {"@type": "GeoCoordinates", "latitude": "49.1833", "longitude": "-2.1"}}, "title": "Staff Nurses - Mental Health", "url": "https://www.jobs.nhs.uk/xi/vacancy/916210707", "validThrough": "2020-12-31T23:59:59+0000"}