{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum pro rata"}}, "datePosted": "2020-11-06T12:01:18+0000", "description": "&lt;p&gt;We are currently looking to recruit a full time enthusiastic and motivated Band 6 Community Psychiatric Nurse to join the Fenland Adult Locality Team. This is a great opportunity to join our friendly, dynamic and busy adult locality team.&lt;/p&gt;\n&lt;p&gt;Based at North Cambridgeshire Hospital in Wisbech, which is undergoing an £8m redevelopment, you would be a part of an established, well-integrated team including consultant psychiatrists, CPN’s, psychologists, peer support worker’s, social workers and OT’s with links to other specialist services within CPFT and a very interesting and developing 3rd sector.&lt;/p&gt;\n&lt;p&gt;Service delivery and care is very service user focused, and we seek to provide a high quality of effective treatment, care and support. We are motivated in delivering evidence based care for people with moderate to serious mental illness, which is informed by NICE guidelines.&lt;/p&gt;\n&lt;p&gt;The MDT approach of the team ensures that all disciplines are engaged with delivery of evidence based interventions, and we offer extensive clinical support.&lt;/p&gt;\n&lt;p&gt;There are ample opportunities to develop skills and Knowledge, both by training and working closely with very experienced and knowledgeable colleagues. There is also scope to be actively involved in service improvement.&lt;/p&gt;\n&lt;p&gt;As a nurse in the team you will act as a Care Coordinator for people who use the service, conduct physical health checks and promote carer involvement in the delivery of care with service user consent.&lt;/p&gt;\n&lt;p&gt;You will have the opportunity to manage a caseload of diverse service users, delivering a diverse range of clinical skills and building a therapeutic and recovery based relationship. We seek to empower service users to actively engage in their recovery journey, working toward an effective discharge with ongoing support from a wide range of third sector organisations and support.&lt;/p&gt;\n&lt;p&gt;The ideal candidate will have a strong team work ethic, sense of accountability, accompanied by an ability to work under pressure at times, and with a desire for innovation. We are able to support agile working for staff, using all appropriate I.T equipment and support.&lt;/p&gt;\n&lt;p&gt;This service covers Wisbech, March and the surrounding rural areas; therefore, successful applicants will need to be able to travel independently.&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Dominic Melton - Team Manager&lt;/p&gt;\n&lt;p&gt;dominic.melton@cpft.nhs.uk&lt;/p&gt;\n&lt;p&gt;01945 468450&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121760.JPG", "name": "Cambridgeshire and Peterborough NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121760"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Agenoria House, Wisbech, Wisbech", "postalCode": "PE13 3AB"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.665", "longitude": ".164213"}}, "title": "Community Psychiatric Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259564", "validThrough": "2020-11-22T23:59:59+0000"}