{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "13448", "minValue": "13448", "unitText": "YEAR", "value": "Band 8b-8c"}}, "datePosted": "2020-11-05T09:04:40+0000", "description": "&lt;p&gt;University College London Hospital are looking for a Senior Finance Manager to join their team on a 6-12 month placement. This is a full time vacancy however flexible working requests will be considered.&lt;/p&gt;\n&lt;p&gt;The post holder will be able to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Deliver a first class full finance business partnering service to the Director of Strategic Development on key projects, specifically COVID testing and vaccine rollout as well as supporting other strategic projects where capacity allows.&lt;/li&gt;\n&lt;li&gt;Support the Director of Strategic Development on all investment needs related to testing and vaccine rollout, providing or validating costings, establishing the approval required and navigating the approval process as quickly as possible to prevent delays.&lt;/li&gt;\n&lt;li&gt;Ensure that the financial impact and financial risk of commercial agreements in place across this remit is reflected in financial forecasts and alerted to stakeholders as required.&lt;/li&gt;\n&lt;li&gt;The postholder will be accountable to the Head of Financial Performance for successful delivery in a number of work areas including Core Financial Management, financial leadership and development of commercial relationships with new partners and minimise financial risk.   &lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Essential Requirement&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Available for immediate start&lt;/li&gt;\n&lt;li&gt;CCAB or Equivelent Qualification and current professional registration&lt;/li&gt;\n&lt;li&gt;Significant experience at Senior Financial Management level within NHS or other large complex multi professional organisation, including commercial or partnership arrangements&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Please apply directly to this advertisement and a member of the Recruitment Team will contact you to discuss your application in more detail.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "University College London Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120731"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "London", "postalCode": "NW1 2PG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5257", "longitude": "-.13737"}}, "title": "Band 8b - 8c Senior Finance Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256997", "validThrough": "2020-11-26T23:59:59+0000"}