{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30112", "minValue": "24214", "unitText": "YEAR", "value": "£24,214 to £30,112 pa"}}, "datePosted": "2020-10-28T14:16:27+0000", "description": "&lt;p&gt;We are looking for an enthusiastic, dynamic and highly motivated Band 5 Nurse to join our friendly, forward thinking Ophthalmology team at the East Lancashire Health Care trust on the Royal Blackburn &amp; Burnley general teaching hospital sites.&lt;/p&gt;\n&lt;p&gt;You will be responsible for a group of patients whom are attending for various ophthalmology procedures. You will work closely and provide support to all members of the multi-disciplinary team. You will primarily work within the Ophthalmology Day Unit. However your role will also involve assisting within other areas of ophthalmology as required and as your experience permits.&lt;/p&gt;\n&lt;p&gt;You must have excellent communication skills and be able to work effectively in a multi-disciplinary team. You must be flexible with working hours as this post includes evenings, weekends and bank holidays. You need to show initiative and have a positive outlook within the work place. You must be organised and have a desire to deliver a high standard of care in keeping with the Trust’s vision of delivering safe, personal and effective care at all times.&lt;/p&gt;\n&lt;p&gt;In return we can offer you a structured orientation programme with the support of the department Junior Sisters/Ward Manager. You will be supported to develop yourself with regular appraisals to enable you to gain the skills and competencies required. This post is offered on a full time basis.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This job advert will close as soon as sufficient applications have been received. Please apply for this job as soon as you can, if interested. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Dear Potential Applicant,&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;It is important you are made aware of the changes which East Lancashire Hospitals NHS Trust has implemented with regard to charging for the cost of undertaking Disclosure and Barring Scheme (DBS) Checks (previously known as Criminal Records Bureau or CRB) and how this may impact upon you.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;As this position is exempted from the Rehabilitation of Offenders Act 1974 and involves work that is identified as a regulated activity as defined in the Safeguarding Vulnerable Groups Act (2006), any offer of employment is provisional upon a satisfactory DBS check being obtained.&lt;/p&gt;\n&lt;p&gt;The cost of an Enhanced Disclosure will be £48.00, which includes a small handling fee.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;In line with other NHS organisations in the North West Region, the Trust is now passing the charge for undertaking a DBS check on to candidates in the event they are successfully appointed into the post for which they have applied. Candidates can choose whether to pay this over 1-3 months as a deduction from the monthly salary. By applying for this vacancy you are agreeing to this undertaking in the event you are successfully appointed.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameJackie ReillyJob titleOphthalmology Manager- Day unit/Triage/urgent eye clinicEmail addressjacqueline.reilly@elht.nhs.ukTelephone number13122Additional contact information&lt;/p&gt;\n&lt;p&gt;Jackie Reilly&lt;/p&gt;\n&lt;p&gt;01282 804898/ 01282 803122&lt;/p&gt;\n&lt;p&gt;Jacqueline.Reilly@elht.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "East Lancashire Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120742"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Burnley General Teaching Hospital, Burnley", "postalCode": "BB10 2PQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8098", "longitude": "-2.22817"}}, "title": "Staff Nurse - Ophthalmology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246951", "validThrough": "2020-11-11T23:59:59+0000"}