{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 pro rata per annum"}}, "datePosted": "2020-10-23T13:31:00+0100", "description": "&lt;p&gt;An exciting opportunity has arisen to apply for the role of an Advanced Practitioner Sonographer at East Suffolk and North Essex NHS Foundation Trust.&lt;strong&gt;A part time weekend position may be considered for the right applicant.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Colchester Hospital is part of East Suffolk and North Essex NHS Foundation Trust (ESNEFT) and provides Ultrasound services to the North East Essex region. The Trust has approximately 600 beds and employs over 4,500 staff. Colchester Hospital is a busy acute trust with 24 hour emergency services. In addition there are smaller sites located at Harwich, Clacton-on-Sea and Halstead.&lt;/p&gt;\n&lt;p&gt;This is an excellent opportunity to further your clinical experience in an exciting busy department (approximately 40,000 examinations per year). We are looking for an enthusiastic, highly motivated Sonographer with excellent organisational skills to complement our friendly, social and dynamic Radiology team.&lt;br /&gt;&lt;br /&gt;You should hold either the DCR (R), Degree or BSc Radiography or equivalent Relevant post-graduate qualification in ultrasound, a Pg Certificate or Diploma in Medical Ultrasound (DMU) or equivalent and current HCPC registration.&lt;/p&gt;\n&lt;p&gt;In addition, you must have excellent communication skills and be able to work on your own initiative and as a member of a team.&lt;/p&gt;\n&lt;p&gt;The trust is committed to its staff and their development and to equal opportunities and diversity. Applications are welcomed from all sections of the community.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;strong&gt;Previous applicants need not apply.&lt;/strong&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Polly Eves, Ultrasound Manager&lt;/p&gt;\n&lt;p&gt;01206 742594&lt;/p&gt;\n&lt;p&gt;polly.eves@colchesterhospital.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120729.jpg", "name": "East Suffolk and North Essex NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120729"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Colchester Hospital, Colchester", "postalCode": "CO4 5JL"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.9102", "longitude": ".899214"}}, "title": "Advanced Practitioner Sonographer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240725", "validThrough": "2020-11-08T23:59:59+0000"}