{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Competitive (DOE)"}}, "datePosted": "2020-10-29T15:18:27+0000", "description": "&lt;p&gt;We’re looking for an exceptional Scrub/Anesthetic Nurse’s &amp; ODP&#39;s with a passion for high standards and a meticulous eye for detail to join our team in our Nuffield Health Leeds Hospital.&lt;br /&gt; &lt;br /&gt;Whether you’re working in the NHS or in a private setting, now’s the time to apply to Nuffield Health. This is an opportunity to work with some of the best in the field, and to grow your career – to be valued and free from the constraints that currently prevent you from achieving job satisfaction.&lt;br /&gt; &lt;br /&gt;&lt;strong&gt;About the role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Working in this pressured environment as part of a close-knit multidisciplinary team, you’ll know that this role requires high levels of focus and engagement. Our reputation depends on your ability to understand, anticipate and develop those intuitive partnerships that are so key. In return, you’ll be valued and respected for your professionalism and expertise, feeling fulfilled by the knowledge of a job well done.&lt;br /&gt; &lt;br /&gt;You’ll work on a varied caseload using technology, equipment and facilities which are state-of-the-art and maintained to our high standards. We have an excellent infection control record in Nuffield Health hospitals.&lt;br /&gt; &lt;br /&gt;&lt;strong&gt;Your key accountabilities will be:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Supervising and supporting clinical support staff and junior staff in the delivery of care, providing education, training and mentorship to meet development needs, delivering high quality patient care, which is clinically effective, evidence based and appropriate, Assessing, planning, implementing and evaluating care as part of a collaborative programme &lt;br /&gt;&lt;br /&gt;&lt;strong&gt;Nuffield Health Leeds Hospital&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;Nuffield Health Leeds Hospital is proud to have received an &quot;Outstanding&quot; rating from the health care regulator, the Care Quality Commission (CQC), following an inspection in February 2017. The CQC highlighted that patient care was at the heart of the service and this is testimony to the commitment, skill and pride of the team at the hospital.&lt;br /&gt;&lt;br /&gt;Our highly successful, purpose-built hospital, deals with complex surgery and a vast range of specialities involving some 300 consultants. There are 80 bedrooms, an 8 bed Level 3 critical care unit and 6 theatres (2 Stryker laparoscopic and 2 laminar flow). These  facilities, and high standards of care, make us one of the leading providers of private healthcare in the area. Our staff are welcoming, friendly and supportive, headed by a caring and effective management team. We’re close to the city centre and central railway station.&lt;br /&gt; &lt;br /&gt;&lt;strong&gt;Qualifications, skills and values&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;As a registered Theatre Nurse or Operating Department Practitioner, you’ll have the qualifications and experience relevant to your registration. You’ll also have post-registration experience. Immediate / Advanced Life Support is desirable.&lt;br /&gt; You’ll be an excellent communicator and team worker – flexible and motivated. You’ll feel part of the wider hospital team and understand the importance of continuity in patient care.&lt;br /&gt; We understand what it means to be driven by quality, so we’ll never ask you to compromise.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Key employee benefits:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Continuing professional and career development&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Generous holiday and leave arrangements&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Flexible pension options&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Life assurance and healthcare schemes&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Health assessments (after a qualifying period)&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Free membership of our fantastic Nuffield Health Fitness &amp; Wellbeing Centres, with heavily subsidised memberships for family.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Cycle to work scheme&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Childcare vouchers&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Employee assistance programme for professional advice and counselling – legal, financial, etc.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Employee discounts on a wide range of products or services &lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Nuffield Health is committed to equal opportunities in the recruitment, training, and development of our employees. We have a duty to apply to the Disclosure and Barring Service (DBS) for disclosure on successful candidates.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Be your best and join us in building a healthier nation.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary - Competitive (Dependent on experience)&lt;br /&gt;Closing date - 26/11/2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location - Leeds Hospital &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Contract Type - Permanent&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Weekly Hours - 37.5 &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Applications will be considered as they are received and interviews will be arranged accordingly. We reserve the right to close adverts early, for example, where we have received an unprecedented high volume of applications. Therefore please apply early to ensure you are considered for the post. &lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/132134.jpg", "name": "Nuffield Health", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132134"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Leeds", "postalCode": "LS1 3EB"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8006", "longitude": "-1.55429"}}, "title": "Operating Department Practitioner - Anaesthetics &amp; Recovery (RGN)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248855", "validThrough": "2020-11-26T23:59:59+0000"}