{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum pro rata"}}, "datePosted": "2020-10-28T15:31:18+0000", "description": "&lt;p&gt;&lt;strong&gt;Theatre Nurses/ODPs, Manfield Orthopaedic Theatres&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Northampton General Hospital is proud to be the first NHS hospital in the UK to attain accreditation on the ANCC Pathway to Excellence, an internationally-recognised programme for nursing and midwifery standards.&lt;/p&gt;\n&lt;p&gt;The Pathway to Excellence is an American accreditation programme recognising hospitals with positive practice environments where nurses and care excel. This is measured with 6 practice standards essential to an ideal nursing practice environment.&lt;/p&gt;\n&lt;p&gt;The Pathway to Excellence® Program recognizes a health care organization’s commitment to creating a positive practice environment.&lt;/p&gt;\n&lt;p&gt;Northampton General Hospital Trust is based in the central midlands in the M1 corridor with excellent road and rail links to London and Birmingham. There is a lively social scene with 2 theatres, cinemas, sports facilities, museums and many bars and night clubs.&lt;/p&gt;\n&lt;p&gt;The hospital is a large district general hospital with busy ED, renal, vascular, cardiac, oncology and surgical departments which serves the local community and numerous villages, also working closely with Kettering General Hospital and the Coventry trauma centre.&lt;/p&gt;\n&lt;p&gt;We are looking for 3 enthusiastic qualified people, both Nurses and ODPs, to join our dedicated team in the orthopaedic theatres as scrub /anaesthetic/recovery practitioners&lt;/p&gt;\n&lt;p&gt;You will be part of a close, experienced, and supportive multi-disciplinary team undertaking elective and emergency surgery and recovery in 4 purpose built theatres. We undertake a variety of upper and lower limb surgeries with specialist surgeons and surgical care practitioners, and provide a dedicated 7 day-a-week trauma theatre.&lt;/p&gt;\n&lt;p&gt;You will gain experience in, and work across, the different orthopaedic specialities while being able to focus on a particular area, as you will be allocated to a team. The working week is over 7 days and you will be part of an out-of-hours on-call rota when sufficiently experienced. Full time is preferable but part time hours will be considered.&lt;/p&gt;\n&lt;p&gt;Training will be provided in the theatres by a mentor and all other staff, and through a dedicated Practice Development Department who provide new starters with study days and competency packs to work through as well as personalised support. Opportunities for further training are many and varied as staff development, both professionally and personally, is a cornerstone of the trust’s values.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameMark JacksonJob titleTheatre ManagerEmail addressmark.jackson@ngh.nhs.ukTelephone number01604544790Additional contact information&lt;/p&gt;\n&lt;p&gt;Sandra Thwaites or Donna Robinson Managers, Manfield Orthopaedic Theatres on 01604 544790&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121063.jpg", "name": "Northampton General Hospital NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121063"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Northampton General Hospital, Northampton", "postalCode": "NN1 5BD"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.2371", "longitude": "-.886673"}}, "title": "Theatre Practitioner Nurse and ODP", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247185", "validThrough": "2020-11-11T23:59:59+0000"}