{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 pro rata per annum"}}, "datePosted": "2020-11-04T08:16:28+0000", "description": "&lt;p&gt;Are you a nurse who has been taking a career break? &lt;br /&gt;&lt;br /&gt;Are you missing using those clinical skills and interacting with patients?&lt;br /&gt;&lt;br /&gt;Have you thought about doing a return to practice course to renew your nursing registration and re-enter practice as a qualified nurse?&lt;br /&gt;&lt;br /&gt;An exciting opportunity is available to you if you were a registered nurse but have had a break from nursing and your registration with the NMC is currently lapsed. &lt;br /&gt;&lt;br /&gt;Kent Community Health Foundation Trust is working in partnership with local HEIs to offer a programme of returnee-ship leading to a substantive Band 5 Adult nursing role upon successful completion within the organisation&lt;br /&gt;&lt;br /&gt;We are offering a permanent position initially starting as a Band 3 and on successful completion of registration becoming a Band 5 Registered General Adult Nurse, so to support you in gaining the skills and competencies required to register as a registered nurse along with a preceptorship programme post qualification &lt;br /&gt;&lt;br /&gt;If you are the kind of person who enjoys a diverse environment in which to work and feels passionate about providing quality services for people in their own homes or as near as possible; then we want to hear from you&lt;br /&gt;&lt;br /&gt;We are looking for keen committed health care individuals who are interested in pursuing their careers in community services and can offer a minimum of thirty hours per week.&lt;br /&gt;&lt;br /&gt;In return we can offer opportunities for you to develop your skills within a very supportive environment ; in-house competency framework, learning and development opportunities; regular clinical peer supervision networks, preceptorship programme and appraisal.&lt;/p&gt;\n&lt;p&gt;We can offer you:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Programme costs (currently: programme fees plus a £500 bursary on commencing the programme from Health Education England towards associated costs e.g. travel and childcare)&lt;/li&gt;\n&lt;li&gt;Regular clinical peer supervision networks&lt;/li&gt;\n&lt;li&gt;Practice placement to suit successful applicant’s learning requirement&lt;/li&gt;\n&lt;li&gt;Preceptorship programme (on regaining NMC registration)&lt;/li&gt;\n&lt;li&gt;In-house competency learning&lt;/li&gt;\n&lt;li&gt;Development opportunities&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Please make it clear in your supporting statement:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;When you originally registered with the NMC&lt;/li&gt;\n&lt;li&gt;When your NMC registration expired&lt;/li&gt;\n&lt;li&gt;Areas of Preference -:across West Kent/East Kent&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Successful applicants are required to have the qualification level specified in the person specification in order to carry out the job, however, we do welcome applicants from individuals wishing to further their knowledge and skills and to gain this recognised qualification, which we will support. So if you do not have the essential qualification for the role, this may not be an automatic barrier to you being offered an interview.&lt;/p&gt;\n&lt;p&gt;If you are successful at interview but do not have the essential qualification for the role, we will employ you as trainee and will support you to gain this qualification. You will develop new skills and knowledge whilst working with an established team, gaining valuable work experience and continuing to get paid. Once you receive the qualification you will automatically move into the position advertised.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;***Please Note: you MUST also apply DIRECTLY to the University of Greenwich or Canterbury Christ Church University via their Return to Practice application page and secure a place or interview on the programme &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;***Please Note: Unfortunately this programme is not suitable for nurses from overseas wishing to gain NMC registration in the UK – &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Flexible hours will be considered with a minimum 30 hours per week.&lt;br /&gt;&lt;br /&gt;Interviews will be held on the 23rd November 2020&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Gill Blackman-Cross&lt;/p&gt;\n&lt;p&gt;Job title Clinical Student Partner&lt;/p&gt;\n&lt;p&gt;Email address gillian.blackman-cross@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number 07917307626&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120633.png", "name": "Kent Community Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120633"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Community Hospitals and Services across Kent, Kent", "postalCode": "TN25 4AZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.1718", "longitude": ".870966"}}, "title": "Return to Practice Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255059", "validThrough": "2020-11-15T23:59:59+0000"}