{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "TBC"}}, "datePosted": "2020-11-03T17:21:54+0000", "description": "&lt;p&gt;&lt;span&gt;GP Practice Manager &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Maples &amp; Lakes Medical Centre – Manchester M23 2SY &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Full time or Part time considered &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Salary – Competitive salary reflecting qualifications, expertise &amp; experience&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Closing date – 27/11/20 &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;An exciting opportunity has arisen for an accomplished, highly motivated and versatile Practice Manager to lead and develop services at our Practice. This is a permanent position but we are happy to consider applications for an interim position of 3-6 months. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are looking for a manager who has strategic vision, innovative thinking and with excellent organisational skills. You must be highly IT literate, financially astute and have significant experience in HR and Line Management skills across multi-disciplinary teams to provide solid leadership to our team. Having previous experience of General Practice and the NHS is ideal. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will be supported by a finance manager as well as administrative and clinical teams. You will need to have the vision, willingness and drive to adapt to NHS targets and changes in order to maintain an efficient, profitable organisation and a happy, productive working environment.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will be joining a teaching practice that has approximately 9000 patients across two sites and is part of the Wythenshawe Primary Care Network. The team consists of 5 GP Partners and 2 Salaried GPs, as well as nursing, pharmacist, reception, admin and secretarial teams and a finance manager. Our GPs are highly motivated and most have specialist areas of interest such as diabetes, gastroenterology, learning disability, sepsis and education. A number of our GPs also hold external positions such as Clinical Leads at Manchester CCG (MHCC), Deputy Medical Director at CCG and GP Access Lead for Wythenshawe PCN as well as Director at Go To Doc Healthcare. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;A comprehensive job description can be obtained by email request. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;For general queries please contact Dr May Aldean at may.aldean@nhs.net&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central Advertising - General Practitioners", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130654"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Manchester", "postalCode": "M23 2SY"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3849", "longitude": "-2.28671"}}, "title": "GP Practice Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254924", "validThrough": "2020-11-27T23:59:59+0000"}