{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 pro rata"}}, "datePosted": "2020-10-28T11:47:00+0000", "description": "&lt;p&gt;This is an exciting opportunity to work as a Clinical Psychologist in a multi-disciplinary team that warmly welcomes psychological ideas and practices. We are seeking to appoint an 8a Clinical Psychologist to work in our North Manchester Mental Health Home Treatment Team (MHHTT). With a significant focus upon multi-disciplinary team working, the post will require a strong contribution to MDT meetings to support lead clinicians in decision making and care planning. The team focuses upon urgent assessments of acute mental health needs, comprehensive risk formulations, promoting psychological understanding of crises and supporting the guidance of service users into appropriate referral pathways.&lt;/p&gt;\n&lt;p&gt;The post holder will be expected to provide appropriate supervision and consultation to members of the MHHTT to support the development of psychological expertise within the team. There is also the opportunity to provide individual assessment and brief psychological intervention to support acute care delivery for individuals who present with severe and complex needs. The service also hosts placements for Trainee Clinical Psychologists.&lt;/p&gt;\n&lt;p&gt;Experience of being able to formulate risk and work with complex and enduring mental health problems is essential to this post. The post would be suitable for a clinical psychologist who could be confident in applying a flexible and theoretically integrative approach, given the wide range of mental health needs and risks that present to the team. &lt;br /&gt;&lt;br /&gt;The successful applicant will help shape the delivery and development of the MHHTT psychological therapy service provision across the city of Manchester. We are looking for an enthusiastic psychologist with an appreciation of the challenges and rewards of working within a culturally diverse city.&lt;br /&gt;&lt;br /&gt;Psychologists in the Manchester MHHTT’s are professionally managed and you will receive supervision, access to CPD and annual appraisals. We enjoy strong links to the regional Doctoral Clinical Psychology Training Courses and Academic Department at Manchester University.&lt;/p&gt;\n&lt;p&gt;The post is based in North Manchester and operational line management for the post is from the Principal Clinical Psychologist working in MHHTT.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDr Catherine CooganJob titleHead of SecondaryCare Psychology ManchesterEmail addresscatherine.coogan@gmmh.nhs.ukTelephone number0161 271 0695&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121714.jpg", "name": "Greater Manchester Mental Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121714"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "North Manchester General Hospital, Crumpsall", "postalCode": "M25 3BL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5368", "longitude": "-2.29146"}}, "title": "Clinical / Counselling Psychologist MHHTT", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246417", "validThrough": "2020-11-11T23:59:59+0000"}