{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "42109", "minValue": "26324", "unitText": "YEAR", "value": "£15.66 - 25.05 per hour"}}, "datePosted": "2020-11-06T16:16:06+0000", "description": "&lt;p&gt;&lt;strong&gt;Want to support our&lt;em&gt; NHS&lt;/em&gt; Nightingale Hospital Exeter?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The hospital has been set up to improve the resilience of the Peninsula/South West hospital network by providing up to 116 additional beds. &lt;/p&gt;\n&lt;p&gt;The NHS Nightingale Hospital Exeter will &lt;strong&gt;support the NHS to care for patients with coronavirus&lt;/strong&gt;. This hospital is designed to provide high quality specialist care for seriously ill coronavirus patients in Devon, Cornwall and the wider South West region.&lt;/p&gt;\n&lt;p&gt;As part of taking on the above role, full &lt;strong&gt;training and induction will be provided&lt;/strong&gt;, as well as &lt;strong&gt;hotel accommodation, free parking/park and ride, additional travel costs, and meal provision as appropriate&lt;/strong&gt;. You will also be provided with uniforms and ID.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please note:&lt;/strong&gt; this will be a highly challenging working environment, and it won’t be suitable for everyone. The Trust will support you to draw on your resilience and that of your colleagues too.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Staff welfare is paramount. &lt;/strong&gt; ‘The facility will only be able to run well if we take care of the wonderful staff who are working here. We recognise that they are at the core of the NHS Nightingale Hospital Exeter, and we will do everything within our power to take care of them, not just from an infection control perspective but also considering their physical and mental wellbeing, before, during and after their time working here.&lt;/p&gt;\n&lt;p&gt;Appropriate PPE will be provided for staff, and the hospital has been built to provide maximum infection control during high risk procedures. The hospital are working closely with experts in infection control to ensure that we have safe practices in place.’&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Who we are looking for:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for&lt;strong&gt; Registered General Nurses (Band 5)&lt;/strong&gt;- people who share our values and passion for caring for patients at this time of need, and can&lt;strong&gt; commit to working rostered shifts at this hospital for at least 4 weeks, all in line with working time directive.&lt;/strong&gt; The post holder will have responsibilities:&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To plan and manage the implementation of individual care programmes for patients, using the nursing process and the designated nursing model for Outpatients&lt;/li&gt;\n&lt;li&gt;To guide, instruct and monitor student nurses and support workers.&lt;/li&gt;\n&lt;li&gt;To practice in accordance with NMC Codes, statutory requirements and the Trust’s Vision for Nursing.&lt;/li&gt;\n&lt;li&gt;The post holder is expected to comply with Trust Infection Control Policies and conduct him/herself at all times in such a manner as to minimise the risk of healthcare associated infection&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Pay rate:             &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;-          &lt;strong&gt;Days £15.66 per hour&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;-          &lt;strong&gt;Nights and Saturdays £20.35 per hour&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;-          &lt;strong&gt;Sundays and Bank Holidays £25.05 per hour&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Essential Skills:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Understanding of general medical/surgical conditions&lt;/li&gt;\n&lt;li&gt;Full understanding of the Band 5 responsibilities and accountability&lt;/li&gt;\n&lt;li&gt;Listening skills&lt;/li&gt;\n&lt;li&gt;Excellent Communication skills&lt;/li&gt;\n&lt;li&gt;Intravenous drug administration&lt;/li&gt;\n&lt;li&gt;Cannulation and venepuncture&lt;/li&gt;\n&lt;li&gt;Male and Female Urethral Catheterisation skills&lt;/li&gt;\n&lt;li&gt;Post registration experience of working within an acute care environment (minimum 6 months)&lt;/li&gt;\n&lt;li&gt;Keen interest in nursing patients with acute injuries/illness&lt;/li&gt;\n&lt;li&gt;Urological experience&lt;/li&gt;\n&lt;li&gt;Experience of administration of intravesical treatments&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Duties will include but not exclusively:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt; &lt;/strong&gt;To assess, plan, deliver and evaluate the individual care requirements of patients using the designated nursing model and processes.&lt;/li&gt;\n&lt;li&gt;To liaise with, supervise and instruct student nurses and support workers in the implementation of specified care programmes.&lt;/li&gt;\n&lt;li&gt;To contribute to the monitoring and use of nursing and patient care standards.&lt;/li&gt;\n&lt;li&gt;To contribute to the implementation of action plans to improve patient care standards and services.&lt;/li&gt;\n&lt;li&gt;To contribute to the implementation of improvements to working methods and practices.&lt;/li&gt;\n&lt;li&gt;To participate in and contribute to changes and improvements within the Directorate and Trust.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Who are NHS Professionals?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;NHS Professionals (NHSP), owned by the Department of Health and Social Care (DHSC), we work in partnership with hospital trusts to provide a bank of highly skilled workers who want to work within the NHS. &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Apply &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Join today and let’s deliver the best patient care together.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Trust is committed to recruiting and supporting a diverse workforce and so we welcome applications from all sections of the community, regardless of age, disability, sex, race, religion, sexual orientation, maternity/pregnancy, marriage/civil partnership or transgender status The Trust expects all staff to behave in a way which recognises and respects this diversity, in line with the appropriate standards.&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "NHS Professionals - Flexible Workers", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121069"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Exeter", "postalCode": "EX2 7JG"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7246", "longitude": "-3.46457"}}, "title": "Registered General Nurse B5 - NHS Nightingale Hospital Exeter", "url": "https://www.jobs.nhs.uk/xi/vacancy/916260565", "validThrough": "2020-12-10T23:59:59+0000"}