{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 pro rata,pa"}}, "datePosted": "2020-11-04T13:31:38+0000", "description": "&lt;p&gt;&lt;strong&gt;12 MONTHS FIXED TERM CONTRACT / SECONDMENT&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;(PART-TIME HOURS CONSIDERED)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;ICS &amp; IDT COMMUNITY THERAPY SERVICES, CENTRAL LOCALITY SHREWSBURY, SHROPSHIRE. SUPPORTING DISCHARGE TO ASSESS MODEL WITHIN INTERMEDIATE CARE&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Do you want to be part of an exciting team meeting the demands of ‘Discharge to Assess’ model (D2A) whilst providing on going therapy to frail adults within the community?&lt;/p&gt;\n&lt;p&gt;Are you looking to develop your skills as an excellent patient focused holistic clinician?&lt;/p&gt;\n&lt;p&gt;Do you want to make a difference to a patient’s outcome?&lt;/p&gt;\n&lt;p&gt;Do you want to be part of an innovative and forward thinking organisation?&lt;/p&gt;\n&lt;p&gt;If so, then our team is the team you have been looking for.&lt;/p&gt;\n&lt;p&gt;An opportunity has arisen for a skilled, enthusiastic and motivated individual to join our Central Locality team. To provide a high quality Physiotherapy services within a multidisciplinary team, delivering a flexible approach to patient care, in a variety of settings throughout the locality, following the patient through their care pathway.&lt;/p&gt;\n&lt;p&gt;We will work closely with our health and social care partners to give patients more control over their own care and find necessary treatments more readily available. We support people with multiple health conditions, not just single diseases, and deliver care as locally and conveniently as possible for our patients. We strive to provide a service that is responsive to the needs of the local population as part of a cohesive multidisciplinary team.&lt;/p&gt;\n&lt;p&gt;We will develop our current and future workforce and introduce innovative ways to use technology&lt;/p&gt;\n&lt;p&gt;The role includes delivery of efficient and effective services in line with local, national and professional agendas.&lt;/p&gt;\n&lt;p&gt;You will need to develop assessment and intervention skills in order to plan and evaluate goal focused rehabilitation and reablement programs, as well as supporting complex discharges. You should be able to priorities your workload, manage your time effectively, and work flexibly within the team. An understanding of Health and Social care provision and ability to work closely with other organisations and stakeholders is essential.&lt;/p&gt;\n&lt;p&gt;We are looking for enthusiastic, motivated and conscientious Physiotherapist to work with the established therapy teams. We are a dynamic, developing organisation with well recognised rehabilitation services providing education, advice, support and rehabilitation for patients.&lt;/p&gt;\n&lt;p&gt;You will need to demonstrate how you meet our values and behaviours within the job description &amp; person specification.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/127016.jpg", "name": "Shropshire Community Health NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127016"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Shrewsbury", "postalCode": "SY3 8XL"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.7074", "longitude": "-2.79305"}}, "title": "Physiotherapist (ICS/IDT – Central Shropshire)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256033", "validThrough": "2020-11-18T23:59:59+0000"}