{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum plus Fringe HCAS"}}, "datePosted": "2020-11-06T09:17:48+0000", "description": "&lt;p&gt;•Are you a highly motivated and skilled &lt;strong&gt;Clinician&lt;/strong&gt; with an interest in Continuing Healthcare?&lt;/p&gt;\n&lt;p&gt;•Are you looking for 9- 5 working hours and no weekend work?&lt;/p&gt;\n&lt;p&gt;•Do you need flexible working arrangements to suit your lifestyle?&lt;/p&gt;\n&lt;p&gt;If so, we have a&lt;strong&gt; vacancy for Band 6 Case Coordinator&lt;/strong&gt; within the Surrey Continuing Healthcare Team.&lt;/p&gt;\n&lt;p&gt;The NHS Continuing Healthcare team in Surrey works across six CCGs – NHS Surrey Downs CCG, NHS North West Surrey CCG, NHS Guildford &amp; Waverley CCG, NHS North East Hampshire and Farnham CCG, NHS Surrey Heath CCG and NHS East Surrey CCG. We are hosted by NHS Surrey Downs CCG and our team’s office is based in Leatherhead with mobile working conditions.&lt;/p&gt;\n&lt;p&gt;As a &lt;strong&gt;CHC Case Coordinator&lt;/strong&gt; you will be responsible for the &lt;strong&gt;assessment and review&lt;/strong&gt; of Continuing Healthcare patients. You will use your knowledge and clinical skills to ensure that outcomes are determined in a consistent manner to ensure effective application and interpretation of the National Framework for NHS Continuing Health Care and NHS Funded Nursing Care.&lt;/p&gt;\n&lt;p&gt;You will be:&lt;/p&gt;\n&lt;p&gt;• A credible practitioner within your chosen field&lt;/p&gt;\n&lt;p&gt;• Experienced working within a team&lt;/p&gt;\n&lt;p&gt;• A car owner and driver (Travel locations not accessible via public transport).&lt;/p&gt;\n&lt;p&gt;Training and support will be given to the successful candidates.&lt;/p&gt;\n&lt;p&gt;This post requires you to have excellent verbal and written communication skills. The team has strong links with community services and collaborative working within the multi-disciplinary team and with our community colleagues in health and social care is essential.&lt;/p&gt;\n&lt;p&gt;We encourage opportunities for professional training and development to increase knowledge and skills.&lt;/p&gt;\n&lt;p&gt;This substantive post is suitable for an experienced Band 5 looking to progress their skills or an established Band 6 who wishes to specialise or gain experience in the Continuing Healthcare setting.&lt;/p&gt;\n&lt;p&gt;This is an excellent opportunity to gain a wide range of experience working with individuals who have a broad range of both complex social and health care needs and to work in a service that is constantly committed to improving patient care and experience.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Surrey Heartlands CCG", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128537"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Cedar Court, Guildford Rd, Fetcham, Leatherhead", "postalCode": "KT22 9AE"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2931", "longitude": "-.335021"}}, "title": "CHC Case Coordinator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259000", "validThrough": "2020-11-20T23:59:59+0000"}