{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "105000", "minValue": "95000", "unitText": "YEAR", "value": "£95,000 - £105,000 per annum"}}, "datePosted": "2020-10-28T16:30:39+0000", "description": "&lt;p&gt;&lt;strong&gt;All you need to be your best&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Whatever you’re looking for in your next career move, you’ll find it all at Manchester University NHS Foundation Trust. Bringing together hospitals and community services from across Manchester, Trafford &amp; beyond, we’re pooling our knowledge, skills and resources to provide even better care for the diverse communities of our thriving city and further. It also means more opportunities for you. With state-of-the-art facilities and strong research links, you can advance your specialism, progress your career, and take your knowledge further. We want talented people from all backgrounds to choose to join our diverse teams, and so we’ll support your work-life balance with flexible and agile working options. And, with the best of both inner city and country living on our doorstep, you can enjoy a better quality of life too.&lt;/p&gt;\n&lt;p&gt;For your next and best career move join us in this unique opportunity as the Director of Nursing and Healthcare Professions in our outstanding Clinical and Scientific Services Managed Clinical Services which has over 4,000 staff and encompasses anaesthetics and critical care, imaging, AHPs, pharmacy, laboratory medicine and IPC across MFT.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Clinical and Scientific Services (CSS) &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Our Clinical and Scientific Service works across all of the hospitals and community services across Manchester and Trafford. We’re seeking a passionate and driven leader to complement the experience and seniority of the leadership team for Clinical &amp; Scientific Services (CSS) at MFT. As Director of Nursing and Health Care Professions; contributing to the strategic planning for professional standards across the Group whilst ensuring that service objectives are implemented, you’ll be accountable for the delivery of the Health professions agenda on behalf of the Chief Nurse. This could be your next chance to shine in your career and make a real difference for our patients.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Role &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;A motivational individual, you will be focused on quality, promoting high standards to consistently improve patient outcomes. What’s more, you’ll be an effective role model for the profession and develop your own credibility through the demonstration of high standards of nursing care and lead the development and implementation of the Patient Experience Strategy for the MCS.&lt;/p&gt;\n&lt;p&gt;This role is particularly important to the success of our hospitals and as one of the largest providers of specialist services in England, it’s vital that we remain at the forefront of medical excellence and innovation. As such, the standards that you will help to set for clinical teams across the Trust will ensure we build confidence in our capabilities, raising our standards and ensuring patients feel safe. Taking the lead across a wide remit of areas such as quality, patient experience, workforce and infection control, you will challenge practice and ensure your teams are working effectively to deliver our services. Crucially, you will also manage our specialty services and set the wider strategic agenda for all health care professions.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About You&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is a unique opportunity for you to develop the role and to make a significant impact on patient care, leading the integration of services and using innovative approaches to service design and delivery. With significant experience of managing large-scale change and developing clinical teams in an acute Trust, you’ll have a strong knowledge of the integrated health and social care model; workforce planning and service modelling in addition to securing funding to support organisational initiatives. It goes without saying that your outstanding communication and negotiation skills will ensure that you can successfully implement your measures to the highest level, whilst being recognised as the inspirational leader that will enable us to exceed our patients and their families’ expectations.&lt;/p&gt;\n&lt;p&gt;At MFT, it truly is ‘All Here For You’ - a place where care comes first for both our patients and our people too.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing date: Thursday 5th November 2020 at Midnight&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;MFT is committed to promoting equality of opportunity, celebrating and valuing diversity and eliminating any form of unlawful discrimination across our workforce, ensuring our people are truly representative of the communities we serve.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameTim KeelerJob titleChief Executive, Clinical &amp; Scientific ServicesEmail addresstim.keeler@mft.nhs.ukTelephone number0161 276 6754Additional contact information&lt;/p&gt;\n&lt;p&gt;Please contact for an informal discussion:&lt;/p&gt;\n&lt;p&gt;Heather Hughes or Nicola Hamilton PAs for the CSS Senior Leadership Team on 0161 276 8038/0161 276 6754&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Manchester University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121137"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Manchester University NHS Foundation Trust, Manchester", "postalCode": "M13 9WL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4625", "longitude": "-2.22771"}}, "title": "Director of Nursing and Health Care Professions", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247378", "validThrough": "2020-11-08T23:59:59+0000"}