{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51069", "minValue": "32478", "unitText": "YEAR", "value": "£32,478 - £51,069 ST4+"}}, "datePosted": "2020-10-19T10:01:04+0100", "description": "&lt;h1&gt;Brighton and Sussex University Hospitals NHS Trust&lt;/h1&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;NO TIER 2 APPLICATIONS- THESE WILL BE REJECTED&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Paediatric Clinical Fellow ST4+ - Paediatric Critical Care (HDU)/ Children&#39;s Emergency Medicine/General Paediatrics/OOPE . &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;FROM SEPTEMBER 2020 FOR 12 MONTHS &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking to recruit an enthusiastic ST4+ level doctor to work at the Royal Alexandra Children’s Hospital (RACH) in Brighton. The post-holders will not be expected to provide cover to the neonatal unit, which is staffed separately. The successful applicants will contribute to the registrar rota, working the same shift pattern as deanery trainees with the same educational opportunities.&lt;/p&gt;\n&lt;p&gt;Brighton is a wonderful place to live and work. Close to the South Downs and just by the beach, it has a vibrant night-life and wonderful shopping and eating. The Royal Alexandra Children’s Hospital is part of the Brighton and Sussex University Hospitals NHS Trust and is located on the Brighton campus alongside the Royal Sussex County Hospital. We have the region’s only stand-alone children’s emergency department, and the paediatric service provides specialist care to children across the region. With our partner medical school, the Brighton and Sussex Medical School, we provide an active teaching and clinical support environment.&lt;/p&gt;\n&lt;p&gt;The RACH is an excellent place to work providing broad experience in all aspects of general paediatrics. We run a busy Children’s Emergency Department (CED) where GP referrals and “walk-in” children are seen by the paediatric team and Emergency Nurse Practitioners. There are medical and surgical paediatric inpatient beds on two large wards, a 10 bed High Dependency Unit, and a busy day-case unit.&lt;/p&gt;\n&lt;p&gt;The consultant of the week leads daily ward rounds, providing close supervision and teaching at the bedside. There are ample opportunities to present and discuss cases. The post-holder will have the opportunity to be involved in the management of children with complex medical conditions with consultant supervision.&lt;/p&gt;\n&lt;p&gt;Sub-speciality interests include Diabetes, Oncology, Gastroenterology, Epilepsy, HDU, Cardiology and Respiratory Medicine. We also have on–site Paediatric Surgeons, Paediatric Orthopaedic Surgeons, Paediatric ENT and Paediatric Anaesthetists, as well as CAMHS Paediatric Liaison staff, Physiotherapists, Dieticians, and other members of the Paediatric MDT. There are F1, SHO-level and middle-grade level rotas, which are EWTD compliant, with trainees working &lt; 48 hours per week. There are 2 middle-grade doctors as well as two SHOs resident out-of-hours with consultant “shop-floor” presence in CED until 10pm.&lt;/p&gt;\n&lt;p&gt;The department places great importance on teaching &amp; training for junior doctors. There is bleep free teaching every weekday morning, and lunch time sessions most days. Medical students from BSMS will be present for much of the year, providing added opportunities for doctors to be involved in teaching. You will have one of the paediatric consultants as your educational supervisor, and an individual development plan will be made to tailor your experience to your educational needs. MRCPCH exams and DCH exams are hosted by the department on alternate years, and there are excellent opportunities for those undertaking these exams to have additional clinical exam-orientated teaching.&lt;/p&gt;\n&lt;p&gt;The post is open primarily to applicants who do not require a certificate of sponsorship to take up employment in the UK. Any applications from applicants who do require a certificate of sponsorship will be considered only if no suitable UK, EEA National or those with verifiable permission to work in the UK are identified for the post.&lt;/p&gt;\n&lt;p&gt;No Agencies.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameCath BevanJob titleClinical DirectorEmail addresscatherine.bevan1@nhs.netTelephone number01273 696955Additional contact information&lt;/p&gt;\n&lt;p&gt;Interested applicants may contact:&lt;/p&gt;\n&lt;p&gt;Dr Catherine Bevan – Clinical Director – Catherine.bevan1@nhs.net&lt;/p&gt;\n&lt;p&gt;Dr M Z Rahman (Oli) – Consultant Paediatrician – mohammed.rahman35@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Brighton and Sussex University Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120968"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "RACH, Brighton", "postalCode": "BN2 5BE"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8195", "longitude": "-.118149"}}, "title": "Paediatric Clinical Fellow ST4+", "url": "https://www.jobs.nhs.uk/xi/vacancy/916231682", "validThrough": "2020-11-08T23:59:59+0000"}