{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £30,615 pro rata per annum"}}, "datePosted": "2020-10-26T13:32:13+0000", "description": "&lt;p&gt;Discharge Team Assistant Practitioner - Full time post on a fixed term contract until the end of March 2021.&lt;/p&gt;\n&lt;p&gt;Would you like to be part of The Integrated Discharge Team?&lt;/p&gt;\n&lt;p&gt;We are looking for an enthusiastic, pro-active individual to join our team. The Discharge Team will provide you with the opportunity to work within an inter-disciplinary team, completing holistic assessments and liaising with the Multi disciplinary team to coordinate safe, timely discharges. The team work collaboratively with community services and specialist services both within the hospital and in the community to ensure a patient’s needs are met within the most appropriate community environment.&lt;/p&gt;\n&lt;p&gt;The team work across UHCW and Rugby St Cross site, the post holder will be required to work across both sites to meet service demands as required.&lt;/p&gt;\n&lt;p&gt;You will attend daily board rounds and case manage multiple cases within agreed timeframes. You will need to be able to organise and prioritise your time and case load effectively. You will need excellent communication and interpersonal skills and be able to work well under pressure. This post offers excellent career opportunities and can support you to develop your competencies across the multi professions.&lt;/p&gt;\n&lt;p&gt;If you would like to be a key team player and are committed to promoting a seamless service, do not hesitate to contact us.&lt;/p&gt;\n&lt;p&gt;******&lt;/p&gt;\n&lt;p&gt;Closing Date: Please be advised that this job advert will close as soon as sufficient applications have been received. Please apply for this job as soon as you can, if interested.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameKerrie ManningJob titleIntegrated Discharge team managerEmail addresskerrie.manning@uhcw.nhs.ukTelephone number02476965572Additional contact information&lt;/p&gt;\n&lt;p&gt;Kerrie Manning - Co-ordinator, Bleep 4221, at University Hospitals Coventry and Warwickshire, NHS Trust, Walsgrave Hospital 02476 965572&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University Hospitals Coventry and Warwickshire NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120793"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "UHCW site, Coventry", "postalCode": "CV2 2DX"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4214", "longitude": "-1.44349"}}, "title": "Integrated Discharge Team Assistant Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242690", "validThrough": "2020-11-09T23:59:59+0000"}