{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737-£21,142 Per Annum"}}, "datePosted": "2020-11-02T10:39:33+0000", "description": "&lt;p&gt;We have an exciting new opportunity available for a Band 3 Civilian Dental Nurse role at Alexander Barracks, Woking, Surrey.&lt;/p&gt;\n&lt;p&gt;The successful candidate will provide clinical and administrative support for the provision of dental care in Defence Primary Healthcare (DPHC) Dental Centres. The position is a full-time post of 37.5 hours per week, and due to need for full time clinical support it is not suitable for part time or job sharing.&lt;/p&gt;\n&lt;p&gt;The successful candidates’ main duties will include but are not limited to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Ensuring surgeries are prepared appropriately for the day’s patients in accordance with current regulations.&lt;/li&gt;\n&lt;li&gt;Carrying out and recording daily maintenance, servicing and pre-use checks of dental equipment reporting defects in accordance with current equipment care policies.&lt;/li&gt;\n&lt;li&gt;Ensuring a daily test radiograph is taken and processed with all findings reported in accordance with extant policies and signed off by a clinician or trained individual.&lt;/li&gt;\n&lt;li&gt;Recording accurate dental charting for each patient as required by the Clinician, Practice Supervisor/Manager, Receptionist and patient, as appropriate.&lt;/li&gt;\n&lt;li&gt;Meeting the needs of the patients by monitoring, supporting and reassuring each individual according to their specific needs, providing appropriate advice when required. This may include recognising and interpreting behaviours, especially those associated with anxious patients and dealing with them accordingly.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Successful candidates will be entitled to a Recruitment and Retention Allowance (RRA) of £1,500 per annum.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;There is no requirement to deploy as this is met by our uniformed personnel, but you will form the continuity of care required by our patients when based at home.&lt;/p&gt;\n&lt;p&gt;The selection at sift stage will be based on your CV. At interview, you will be tested against the following Technical Skills:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;NHSC1 – Communication&lt;/li&gt;\n&lt;li&gt;NHSC5 – Quality&lt;/li&gt;\n&lt;li&gt;NHSC3 – Health, Safety &amp; Security&lt;/li&gt;\n&lt;li&gt;NHSC4 – Service Improvement&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Please ensure you demonstrate that you have the required skills, qualifications and memberships in your CV and that you have saved it using your surname then first name prior to submitting your application. You will need to provide evidence of the following:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;National Examining Board for Dental Nurses (NEBDN) Certificate or NVQ in Oral Health Care Dental Nursing Level 3.&lt;/li&gt;\n&lt;li&gt;General Dental Council (GDC) registration and evidence of Continued Professional Development. Candidates who hold the qualifications but are not yet registered with the General Dental Council (GDC) are eligible to apply for this vacancy. However, if found successful it is a requirement that you are registered with the GDC prior to starting in the post.&lt;/li&gt;\n&lt;li&gt;Immunity to Hepatitis B.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Due to COVID 19, there is now a requirement for dental clinical staff to be fit tested for a FFP3 mask, which has to be worn when managing a patient who is undergoing an aerosol generating procedure (AGP) he successful candidate will be fit tested prior to commencing employment.&lt;/p&gt;\n&lt;p&gt;Successful candidates must meet the security requirements before they can be appointed. The level of security needed is security check.&lt;/p&gt;\n&lt;p&gt;All employees joining Ministry of Defence who are new to the Civil Service will be subject to a 6-month probation period (unless otherwise advised) effective from the employment start date.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please ensure you have read all the details in the important information link prior to applying.&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/132174.png", "name": "Ministry of Defence (Defence Medical Services)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132174"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Alexander Barracks, Woking, Surrey, GU24 0QQ", "postalCode": "GU24 0QQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3037", "longitude": "-.663462"}}, "title": "Band 3 Civilian Dental Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251625", "validThrough": "2020-12-02T23:59:59+0000"}