{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "49036", "minValue": "49036", "unitText": "YEAR", "value": "£49,036"}}, "datePosted": "2020-11-05T16:58:43+0000", "description": "&lt;p&gt;Applications are invited for this post to commence as soon as possible (ideally December 2020) on a fixed term basis for 12 months.&lt;/p&gt;\n&lt;p&gt;The successful candidate should be fully trained in managing General Surgical, HPB and / or liver transplant patients. Candidates must demonstrate that they can work within a multidisciplinary team; evidence of an active research and an educational interest will be beneficial. There will be an option to develop specialist practise in hepatobiliary surgery and liver transplantation.&lt;/p&gt;\n&lt;p&gt;The post is based at the Liver Unit at the Queen Elizabeth Hospital Birmingham. The successful candidates will form part of a team of 5 Junior clinical fellows and provide out of hours cover for wards, cover theatres and out-patient clinics.&lt;/p&gt;\n&lt;p&gt;In addition, the successful candidate will have the opportunity to further develop their skills in HPB surgery and liver transplantation.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be involved in undergraduate and postgraduate teaching and will be encouraged to participate in clinical research. He/she is also expected to participate in the Liver Unit’s continuing medical education programme and multidisciplinary team meetings.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;em&gt;Please submit an online application, ensuring you attach a copy of your CV.&lt;em&gt;&lt;em&gt;&lt;br /&gt;&lt;/em&gt;&lt;/em&gt;&lt;/em&gt;&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University Hospitals Birmingham NHS Foundation Trust - Medical & Dental", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=131754"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Birmingham", "postalCode": "B15 2WB"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4498", "longitude": "-1.94214"}}, "title": "Junior Clinical Fellow in HPB and Liver Transplant Surgery", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258648", "validThrough": "2020-11-19T23:59:59+0000"}