{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "73664", "minValue": "63751", "unitText": "YEAR", "value": "£63,751 - £73,664 per annum, pro rata"}}, "datePosted": "2020-11-05T08:30:30+0000", "description": "&lt;p&gt;Please note that this post may close earlier than the indicated closing date if a sufficient number of applications are received.&lt;br /&gt;&lt;br /&gt;The Trust is committed to safeguarding and promoting the welfare of children, young people and vulnerable adults and expects all staff and volunteers to share this commitment. As part of our safe recruitment practice pre-employment checks will be undertaken before any appointment is confirmed. If you have not heard from us within a month of the closing date you should presume that you have not been shortlisted. As part of the selection process you may be required to undergo a Disclosure and Barring Service (DBS) check, however all cases of criminal record history are dealt with on a case by case basis.&lt;br /&gt;&lt;br /&gt;Birmingham and Solihull Mental Health NHS Foundation Trust is committed to equality of opportunity, and welcomes applications from all areas of the community, who meet the specific criteria of the post regardless of age, gender, disability, religion/ belief or sexual orientation.&lt;br /&gt;&lt;br /&gt;All successful applicants will be required to complete the Trust’s induction programme. The Fundamental (Statutory and Mandatory) training will be in an e-learning format. You will be required to complete training modules online (approx. 9-14 hours depending on post) in your own time prior to any unconditional offer being made.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Perinatal Mental Health Service: Maternal Mental Health Services&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Clinical Psychologist (Band 8c)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours per week: 30 hours (0.8wte) Job type: permanent&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;BSMHFT is a large and well-established provider of adult and older adult mental health services, offering comprehensive local provision to the culturally and socially diverse population of Birmingham and Solihull and a portfolio of specialist regional mental health services to communities across the West Midlands and beyond.&lt;/p&gt;\n&lt;p&gt;This is the Service Lead post for the Maternal Mental Health Service (MMHS) which is being newly established as a collaboration between BSMHFT and the Birmingham and Solihull United Maternity and Newborn Partnership (BUMP). New investment under the NHS Long Term Plan requires rapid implementation and evaluation of this innovative service development. The service sits under Perinatal Mental Health alongside the inpatient Mother and Baby Unit and expanding Community Mental Health Services, and will be embedded within the Maternity setting, covering Birmingham Women’s Hospital and University Hospitals Birmingham (Heartlands, Good Hope and Netherbrook Birth Unit Solihull). The remit is to establish effective care pathways for perinatal loss (particularly stillbirth and neonatal death) and for birth trauma and fear of childbirth (tokophobia). This includes identification of mental health problems in Maternity, provision of support and signposting and delivery of targeted evidence-based psychological interventions. Working with Maternity systems including provision of support and supervision for Maternity staff is integral to the model. The service will be coproduced with principles of diversity and inclusion embedded throughout.&lt;/p&gt;\n&lt;p&gt;As Consultant Clinical Psychologist and Service Lead, the post-holder will lead the planning, implementation, delivery and evaluation of the service. The main clinical work undertaken by the post-holder is to provide highly specialist psychological assessment and intervention for perinatal loss and trauma. The role involves management and supervision of a team of staff, including qualified and unqualified psychologists. Being allied to the wider Perinatal Service, the post holder will be part of the Perinatal Psychology Leadership Team and will receive specialist supervision from a Consultant Perinatal Clinical Psychologist. Experience of working within Perinatal Mental Health is essential as is ability to deliver evidence-based psychological interventions for trauma and loss. Service development and leadership experience is highly desirable.&lt;/p&gt;\n&lt;p&gt;You will join a friendly, inclusive and supportive Psychology Service that offers excellent opportunities for personal development, special interests and research, that is committed to providing training and supervision opportunities for its staff and that supports networking, exchange of good practice and peer support amongst Psychologists and members of other disciplines across the Trust. We have an exceptionally strong and productive tradition of R &amp; I, very well-established links with Birmingham University and other academic institutions, and enjoy excellent relationships with our clinical and managerial colleagues within the Trust. This post will also link with other developing Maternal Mental Health Services across the country.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;If you are successful at the shortlisting stage of the recruitment process we may contact you via email to advise you of the interview details. Please ensure you access your email account from which you applied regularly once the position has closed. If you have not heard from us within 3 weeks following the closing date, then please assume you have not been shortlisted.&lt;/p&gt;\n&lt;p&gt;If applicable to your role, the Trust will require you to sign up for the DBS Update Service. The subscription will cost you £13 a year but the Trust will cover your first year payment. You will be contractually obliged to maintain your subscription.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Please Note: If you have left BSMHFT on the grounds of redundancy you are not eligible to apply for a post within the Trust (including via Temporary Staffing Solutions) for a period of 12 months from the date of your employment ceasing. If you have any queries please contact the recruitment team. Exceptionally, and subject to the agreement of the CEO staff leaving with a redundancy payment of less than 3 months’ pay, may apply for trust posts, including bank employment, 6 months after their termination date. &lt;br /&gt;&lt;br /&gt;Applicat&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Birmingham and Solihull Mental Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120844"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Across BWC/UHB hospitals TBC, Birmingham", "postalCode": "B15 2SJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4485", "longitude": "-1.94283"}}, "title": "Band 8c Consultant Clinical Psychologist - The Barberry", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256925", "validThrough": "2020-11-15T23:59:59+0000"}