{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 - £19,337 £18005 to £19337pa"}}, "datePosted": "2020-11-05T15:01:26+0000", "description": "&lt;p&gt;Band 2 - Clinical Support Worker - Acute Care - Warwick Hospital&lt;/p&gt;\n&lt;p&gt;Our Vision is clear. We want to provide the best possible healthcare to our population. This means using our resources well and making sure our care is of the highest possible &lt;br /&gt;&lt;br /&gt;Come and join our team!&lt;br /&gt;&lt;br /&gt;Competent Clinical Support Workers are essential to assist us with managing the patient flow through our organization, specifically at Warwick Hospital, and onwards into the local community and other services. This is one of a number of initiatives aimed to make the patient’s journey through our services as good as it can be. &lt;br /&gt;&lt;br /&gt;Joining our organisation now as a Clinical Support Worker will be your chance to play a part in shaping our future as an excellent provider of healthcare.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;As a Clinical Support Worker you will need to be flexible and hardworking. You will also need to possess first rate communication skills as you will working with a variety of staff groups in and out of the NHS, with patients and their families and your fellow colleagues. This also means that your written communication should be clear and appropriate to those reading it.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;We pride ourselves on delivering high standards of care and you will need to demonstrate how you will ensure this through your application and as part of the interview process should your application be short-listed. &lt;br /&gt;&lt;br /&gt;You will need to be able to work flexibly working shifts.&lt;/p&gt;\n&lt;p&gt;The current hours available are for both full and part time.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;We think South Warwickshire is a great place to work, we hope you do too.&lt;/p&gt;\n&lt;p&gt;The Trust is committed to safeguarding and promoting the welfare of individuals and expects all staff to share this commitment. As part of our safe recruitment practice, it is a mandatory requirement for all newly appointed staff requiring a Disclosure and Barring Service (DBS) check to be registered with the DBS Update Service. All eligible staff recruited to the Trust are expected to maintain their annual update subscription whilst employed with the Trust as a condition of employment. The cost of the first year’s subscription to the update service will be reimbursed by the Trust as a payroll refund.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Claire Hawkins, Senior - HR Advisor - Resourcing &lt;br /&gt;01926 495321 ext 8437&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "South Warwickshire NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120990"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "South Warwickshire NHS Foundation Trust, Warwick", "postalCode": "CV34 5BW"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.29", "longitude": "-1.5832"}}, "title": "Clinical Support Worker - Acute Services - Medical and Surgical", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258228", "validThrough": "2020-11-15T23:59:59+0000"}