{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum pro rata"}}, "datePosted": "2020-10-30T11:31:50+0000", "description": "&lt;p&gt;&lt;strong&gt;A new and exciting opportunity has arisen for a secondment post to cover 8 months maternity leave for a Clinical Lead Band 6 Senior Staff Nurses in the Endoscopy department at the John Radcliffe Hospital. The JR Endoscopy department is a 6-procedure room department offering both diagnostic and therapeutic endoscopy (including ERCP, EUS and EMR) as well as supporting our inpatient service, and Paediatrics. The department has a progressive, motivated and highly experienced team who are keen to support new staff in their clinical development skills. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The suitable candidates will be experienced Endoscopy nurses who are highly motivated and enjoy developing and mentoring staff. They should be forward thinking and up to date with latest research and techniques in Endoscopy. They will be able to demonstrate clinical expertise in one or more of the advanced therapies performed in the JR Endoscopy Unit . &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; The ideal candidate will have a depth of experience in endoscopy as well as having a teaching and mentoring qualification. The successful applicant will also assist in the development of competencies in advanced therapy and maintaining the highest standard of patient care through audit, research and specialist education to patients, carers and other professionals working closely with the Consultant Clinical Lead.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; They will be required to develop both their own skills and knowledge and contribute to the development of others, whilst ensuring safe practice is embedded at all times.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; You will be able to demonstrate a real commitment to providing high quality and compassionate care. Working as part of a multi–disciplinary team you will have excellent communication skills and team- working abilities. A key role of the Senior Staff Nurse is to lead by example and be a role model for the nursing team. You will work closely with the Deputy Matron, Sister , PDN and Deputy Sister’s to ensure that the department offers high quality compassionate care to our patients. Support our staff with inspired and passionate leadership., and incorporates Trust values in all of their practice. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; Excellent career progression, development and support for the right candidate.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing Date: 06-Nov-2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Planned Interview Date: TBC&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameMichelle Spillane / Alessandro CirilloJob titleDeputy Matron/ Practice Development NurseEmail addressalessandro.cirillo@ouh.nhs.ukTelephone number01865226802Additional contact information&lt;/p&gt;\n&lt;p&gt;The Deputy Matron can also be contacted at michelle.spillane@ouh.nhs.uk&lt;/p&gt;", "employmentType": "OTHER", "hiringOrganization": {"@type": "Organization", "name": "Oxford University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120889"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "John Radcliffe, Oxford", "postalCode": "OX3 9DU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7639", "longitude": "-1.21979"}}, "title": "Endoscopy Specialist Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249962", "validThrough": "2020-11-06T23:59:59+0000"}