{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 per annum, pro rata"}}, "datePosted": "2020-11-02T14:00:21+0000", "description": "&lt;p&gt;Are you a Qualified Staff Nurse deciding where next in your nursing career? If you are passionate about providing the best possible care and would like the opportunity to empower patients and deliver complex care in their own homes, then a career in community nursing could be the one for you.&lt;/p&gt;\n&lt;p&gt;A career in community nursing&lt;/p&gt;\n&lt;p&gt;We are in the incredibly privileged position of caring for people within or close to their own homes. The job of delivering holistic care is incredibly diverse allowing you to constantly develop your clinical skills.&lt;/p&gt;\n&lt;p&gt;You&#39;ll work within one of our Integrated Neighbourhood Teams who offer seamless support and care to our patients. The teams are made up of a wide range of healthcare professionals to deliver nursing, therapy and social care provision. The focus at all times on the individual, either supporting the patient to stay at home, avoid admission or supporting our partners to facilitate hospital discharge. Our service runs 7am to 10pm every day of the year.&lt;/p&gt;\n&lt;p&gt;Taking those first steps into a community workplace is an exciting challenge which is why we&#39;ll support you each step of the way. This is built upon by our focus on clinical supervision, training and development, and access to a peer support network with other qualified nurses. We won&#39;t just stop there though, we&#39;re proud to offer structured career progression and excellent development opportunities to help you along your journey as a nurse.&lt;/p&gt;\n&lt;p&gt;Community nursing suits people who are comfortable working both independently and within a wider team. You’ll be resilient, motivated and adaptable to working in an ever-changing environment. And of course, you have a passion for providing the best possible care. Due to the nature of the role, you must be a fully licensed driver with access to a vehicle suitable for business purposes.&lt;/p&gt;\n&lt;p&gt;Why choose us?&lt;/p&gt;\n&lt;p&gt;At Leeds Community Healthcare we have a strong culture based on deeply-held values. Our focus is to deliver the highest quality care to the people of Leeds. In our most recent CQC evaluation, we were rated &quot;Good&quot;, with our Adult Services rated &quot;Outstanding&quot; for caring.&lt;/p&gt;\n&lt;p&gt;As an employee, you’ll benefit from generous annual leave, NHS discount, and our salary sacrifice or car lease schemes. Plus, if you’re relocating, we’ll support your move with an allowance up to £8000. Leeds is a fantastic city not simply for its diversity in culture and cuisine, but it’s a top destination for sport and music and is well connected by road, train and plane. Not to mention its home to multiple other NHS and healthcare organisations, including NHS England and NHS Employers. Put simply - if you want to work in healthcare, Leeds is the place to be.&lt;/p&gt;\n&lt;p&gt;Next steps: If this sounds like the right next step, click the apply button to submit your application.&lt;/p&gt;\n&lt;p&gt;If you’re interested but would like to find out more, we welcome you to join us on a ‘behind the sites’ bus tour in May where we’ll take you to three of our sites to see just how our integrated neighbourhood teams work. You’ll have the chance to meet our staff and ask any questions you might have about community nursing. To book on for free, head to lch-bus-tour.eventbrite.co.uk.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123892.jpg", "name": "(AS) Leeds Community Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123892"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Leeds", "postalCode": "LS22 6JS"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.931", "longitude": "-1.3789"}}, "title": "Qualified Community Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252302", "validThrough": "2020-12-06T23:59:59+0000"}