{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "49325", "minValue": "43712", "unitText": "YEAR", "value": "£43,712 - £49,325 pa inc 15% HACS"}}, "datePosted": "2020-10-28T10:16:52+0000", "description": "&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Band 7 &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Learning Disabilities &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Clinical or Counselling Psychologist &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are offering an exciting opportunity to join our established multidisciplinary team as a full time band 7 Clinical or Counselling psychologist (who is registered with the HCPC).&lt;/p&gt;\n&lt;p&gt;You will be absolutely passionate about the area of learning disabilities and committed to effective interdisciplinary working. The Hounslow Adult Learning Disciplinary Team (HALDHT) is based at the Heart of Hounslow Centre for Health. Flexible working is supported with reasonable request. .A determination to work closely with colleagues in the local authority and education is required.&lt;/p&gt;\n&lt;p&gt;We work in a very person-centered way and people with learning disabilities and their families are at the centre of what we do. To achieve this, we carry out joint assessments share our professional knowledge and work in partnership with our dedicated team administrators.&lt;/p&gt;\n&lt;p&gt;You will provide high quality specialist health care to adults with learning disabilities in order to optimize and improve their health outcomes and psychological wellbeing. The post holder will be expected to work with people with a range of presenting needs including complex care, autism, mental health and behaviours that challenge. You will undertake specialist/other assessments (full range psychological assessment tools) and have a sound understanding of risk assessments and management, excellent communication skills between disciplines and across organisations will be a key requirement for the post holder.&lt;/p&gt;\n&lt;p&gt;In addition, you will work with other statutory organizations, families, carers and 3rd sector partners to enable people who use our services to live as independent a life as possible within the community and to stay local. There will be opportunities to participate in service developments and to undertake clinical audits. The Trust are committed to developing its staff and have a range of learning opportunities available which are identified through the personal development process.&lt;/p&gt;\n&lt;p&gt;Hounslow is a lively and dynamic west London borough, and is one of the most ethnically and socially diverse areas of the capital. The majority of work is centered locally; however, there is some out of Borough/area work for residents that are the responsibility of Hounslow CCG.&lt;/p&gt;\n&lt;p&gt;This is a opportunity to work and learn with an established team and develop your career in the area of learning disabilities. We welcome informal conversations and enquiries relating to this opportunity.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Telephone number02086145410Additional contact information&lt;/p&gt;\n&lt;p&gt;Mandeep Ranger (Senior Clinical Psychologist on mandeep.ranger@hrch.nhs.uk he will be happy to help, Mandeep can be contacted on &lt;strong&gt;0208 6145410&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Alternatively you can talk to the team Manager Malcolm Philp on 02086145410.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122296.jpg", "name": "Hounslow and Richmond Community Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122296"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Heart of Hounslow Centre for Health 92 Bath Road Hounslow, Hounslow", "postalCode": "TW3 3EL"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4683", "longitude": "-.371733"}}, "title": "Clinical Psychologist Band 7", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246029", "validThrough": "2020-11-27T23:59:59+0000"}