{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30000", "minValue": "30000", "unitText": "YEAR", "value": "30,000"}}, "datePosted": "2020-11-02T10:57:42+0000", "description": "&lt;p&gt;&lt;strong&gt;Travel Health Advisor - Registered Nurse or Qualified Pharmacist&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Clinic based in Leeds&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Competitive salary&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Permanent – 22.5 hours per week (Monday - Friday with 1 in 3 Saturday&#39;s)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As a Travel Health Advisor, you will be delivering MASTA travel clinics; where you will be accountable for providing comprehensive travel clinic services, occupational health services, and evolving services such as Covid-19 testing. This will also include providing advice, vaccinations, travel risk assessments and related services. You will be a competent practitioner and maintain clinical competency and skills. The successful candidate will be offered full clinical training and the support required to thrive in this unique opportunity.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About MASTA&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Part of McKesson, a leading healthcare company, we strive to break boundaries, challenge the status quo and support the changing healthcare industry. We are committed to offering the best advice and healthcare to our patients, customers and colleagues. As one of our Travel Health Community Nurses, you will be able to use your passion, ambition and drive to build solutions and have experiences that positively transform the lives of our patients.&lt;/p&gt;\n&lt;p&gt;LloydsPharmacy is a community pharmacy network with over 1,500 stores nationwide. MASTA (Medical Advisory Service for Travellers Abroad) was established over 30 years ago and now operates as one of the largest network of private travel clinics in the UK.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the opportunity&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The size and scale of our business is brought to life through our partnership with McKesson – a Fortune Global 500 company and leading provider of integrated healthcare solutions. As a Travel Health Community Pharmacist or Nurse here, you’ll become a pillar of your community; providing both travel clinics across the region, as well as working within our community pharmacy network helping to deliver local services and projects, like the National Diabetes Prevention Programme, that are completely unique to us. Taking ownership of your role, you’ll become a trusted adviser to the NHS as you deliver a highly efficient end-to-end healthcare service that transforms lives. But you won’t do it alone.&lt;/p&gt;\n&lt;p&gt;Building brilliant relationships with other healthcare professionals. Developing outstanding teams. Sharing best practice with colleagues. You’ll be surrounded by people who are just as passionate about exceptional care-giving as you are. Plus, with ongoing clinical development, coaching and support, you’ll have everything you need to make a real difference in people’s lives. We also offer a competitive salary and wide-ranging benefits.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About you&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Customers and communities are at the heart of everything we do. So, first and foremost, you’ll be the kind of person who loves to provide exceptional patient consultations – approachable and an exceptional listener.&lt;/p&gt;\n&lt;p&gt;The successful applicant will be a Registered Nurse or Qualified Pharmacist and have evidence of ongoing professional development.&lt;/p&gt;\n&lt;p&gt;In return, you’ll have access to a range of career paths and training opportunities you’d expect from an industry leader.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central Advertising - Other", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130656"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Leeds", "postalCode": "LS6 4AY"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.827", "longitude": "-1.56667"}}, "title": "Travel Health Advisor - Registered Nurse or Qualified Pharmacist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251667", "validThrough": "2020-12-31T23:59:59+0000"}