{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62001", "minValue": "53168", "unitText": "YEAR", "value": "£53,168 - £62,001 per annum/pro rata"}}, "datePosted": "2020-11-03T15:31:05+0000", "description": "&lt;p&gt;&lt;strong&gt;Lead Pharmacist Clinical Services&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Division: Unplanned &amp; Integrated Care&lt;/p&gt;\n&lt;p&gt;Band: 8b&lt;/p&gt;\n&lt;p&gt;Salary: £53,168 - £62,001 per annum/pro rata&lt;/p&gt;\n&lt;p&gt;Interview Date: 23 November 2020&lt;/p&gt;\n&lt;p&gt;Contract: 12 months fixed term contract (Maternity cover) or Secondment&lt;/p&gt;\n&lt;p&gt;We are recruiting for a &lt;strong&gt;Lead Pharmacist&lt;/strong&gt; who shares our ambition and vision to deliver the Best of Care by the Best People and has the drive to take us forward, by ensuring that the Trust continues to be the first choice for patients and our staff. &lt;/p&gt;\n&lt;p&gt;The successful post holder will be someone that has great leadership qualities with previous experience managing teams.&lt;/p&gt;\n&lt;p&gt;As a Lead Pharmacist you will manage the clinical pharmacists for each speciality and allocate resources to ensure that medicines reconciliation activities are undertaken and prescriptions are clinically screened whilst discharge prescription flow is maximised.&lt;/p&gt;\n&lt;p&gt;You will provide clinical, professional and managerial support to our pharmacists and ward-based technicians. In addition, you will provide support such as trouble-shooting and liaison with Trust departments to deliver a smooth service.&lt;/p&gt;\n&lt;p&gt;In addition, you will work as a member of the pharmacy senior management team. You will contribute to achieving the objectives in the Trust&#39;s and Pharmacy department clinical strategy. And will be expected to lead on these projects which will include medicines optimisation projects, CIP projects, Staffing &amp; education, CQUIN &amp; QIPP delivery projects.&lt;/p&gt;\n&lt;p&gt;The Trust offers a number of apprenticeships and training opportunities in Leadership and Management, Business Services, Finance, Accounting, Human Resources, Clinical Support Work, Research and Innovation, Nursing Associate and Assistant Practitioner alongside our in-house comprehensive clinical pathways.&lt;/p&gt;\n&lt;p&gt;Our hope is that our education pathways will play a key role in enabling you to challenge the practices of the past and build capability for the future.&lt;/p&gt;\n&lt;p&gt;The Trust is committed to the protection of children, young people, their families and vulnerable adults accessing its services. Promoting the message that “safeguarding is everyone’s business” is vital to ensure our patients are protected and safe from abuse. To this end you must comply with Trust’s and the Kent and Medway Safeguarding Board’s policies on safeguarding children, young people and vulnerable adults.&lt;/p&gt;\n&lt;p&gt;To contribute to our exciting future and become part of our team, apply today.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Simon Wan&lt;/p&gt;\n&lt;p&gt;Deputy Chief Pharmacist&lt;/p&gt;\n&lt;p&gt;simon.wan@nhs.net&lt;/p&gt;\n&lt;p&gt;01634 830 000 ext 3289 or 07423 091 531&lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;Niksha Patel&lt;/p&gt;\n&lt;p&gt;Lead pharmacist Clinical Services&lt;/p&gt;\n&lt;p&gt;niksha.patel@nhs.net&lt;/p&gt;\n&lt;p&gt;01634 830 000 ext 3569&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121062.png", "name": "Medway NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121062"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Gillingham", "postalCode": "ME7 5NY"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3783", "longitude": ".542246"}}, "title": "Lead Pharmacist Clinical Services", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254560", "validThrough": "2020-11-16T23:59:59+0000"}