{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 to £21,142 pa"}}, "datePosted": "2020-11-05T11:51:52+0000", "description": "&lt;p&gt;Are you looking to make a real difference to patients, our community and colleagues?&lt;/p&gt;\n&lt;p&gt;Are you looking for the challenge of working in a fast paced, dynamic and adaptable Service, with a career that’s not just ‘another job’?&lt;/p&gt;\n&lt;p&gt;We are looking to recruit reliable and enthusiastic Call Takers to join our motivated, friendly and hardworking team based in Bicester, Oxfordshire to support the smooth running of our EOC department.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;The Role&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for Call Takers to work as part of our dynamic team to help support our 999 service. You will be dealing with potential life and death calls from members of the public. This could vary from someone who has fallen over, helping someone perform CPR or assisting with the birth of a baby! This is a career where no two calls are ever quite the same.&lt;/p&gt;\n&lt;p&gt;As part of the team you will be working in the ambulance control centre alongside Dispatchers, Clinicians and other NHS professionals. You will be directly involved with live emergency calls, taking vital information to help arrange the most appropriate care and support.&lt;/p&gt;\n&lt;p&gt;You will be required to demonstrate excellent communication skills with a broad range of patients, family members and other healthcare professionals. You will need to have a caring and compassionate nature and maintain composure whilst dealing with stressful and emotional situations. Having excellent keyboard skills is vital for this job role as you will need to record accurate information quickly.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Successful candidates will be required to complete an eight week fulltime training programme at commencement of post which is fully paid. This covers internal systems, NHS pathways assessments and call centre mentoring. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Still interested?&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As well as offering a great basic salary of £19,737 - £21,142 pro rata, Candidates will receive the following unsocial allowances on top:&lt;/p&gt;\n&lt;p&gt;All day Saturday (midnight to midnight) as well as any week day after 8pm and before 6am – Time plus 35%&lt;/p&gt;\n&lt;p&gt;All day Sunday and public holidays (midnight to midnight) – Time plus 69%&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are offering a variety of hours from a minimum of 16hrs per week up to 37.5. Candidates will be required to work a variety of shifts which will include nights, weekends, bank holidays and religious holidays.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will need to be over 18 to apply due to the shift patterns that are involved in this position.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;In return we can offer&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Up to 41 Days Annual leave a year depending on Previous NHS Service (including bank holiday allowance)&lt;/p&gt;\n&lt;p&gt;Training and support from our dedicated in house education team.&lt;/p&gt;\n&lt;p&gt;A nationally recognised qualification in 999 emergency call prioritisation.&lt;/p&gt;\n&lt;p&gt;Occupational Health support along with an Employee Assistance Programme.&lt;/p&gt;\n&lt;p&gt;Enrolment into the NHS Pension Scheme&lt;/p&gt;\n&lt;p&gt;NHS Discounts in over 200+ stores including Holidays, Days out, Car insurance, Restaurants and Clothing.&lt;/p&gt;\n&lt;p&gt;Progression opportunities within the EOC department and other areas within SCAS&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are currently recruiting for the following EOC Courses, Please only apply if you are available to start training on the following dates:&lt;/strong&gt;&lt;strong&gt;&lt;br /&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;11th January 2021&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;If you would like to have an informal discussion about this role, Please call 01869365000 or email Laura.Halsall@scas.nhs.uk.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122412.jpg", "name": "South Central Ambulance Service", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122412"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bicester", "postalCode": "OX26 6HR"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.8919", "longitude": "-1.14951"}}, "title": "Emergency Call Taker  - Full Time&amp;Part Time", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257522", "validThrough": "2020-11-20T23:59:59+0000"}