{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "28274", "minValue": "22811", "unitText": "YEAR", "value": "£13.57 - £16.82 Per Hour"}}, "datePosted": "2020-11-05T12:21:24+0000", "description": "&lt;p&gt;As a leading Learning Disability and Metal Health Charity, we provide healthcare and support for people with serious mental illness along a recovery pathway influenced by a psychosocial intervention framework. We assess, plan, implement and evaluate in quality driven healthcare records.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We ensure the people we support can move along a pathway towards independence at their own pace and build their coping and lifestyle skills gradually within a therapeutic environment.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are looking for nurses who share our values and are committed to driving the organisation’s purpose through the shared vision of our people.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Responsibilities include: - &lt;br /&gt; &lt;br /&gt; • To take charge of the service in the absence of the Clinical Lead and Senior Nurse Practitioner to ensure its smooth running and that standards of care are maintained &lt;br /&gt; &lt;br /&gt; • To assess, plan, implement and evaluate programmes with service users, and to ensure that support is provided in accordance with individual plans for the people we support &lt;br /&gt; &lt;br /&gt; • To establish and maintain good relationships between the people we support, relatives and staff &lt;br /&gt; &lt;br /&gt; • To ensure the delivery of an individualised treatment plan for the people we support &lt;br /&gt; &lt;br /&gt; • To deliver on medication management as per the company Policies and Procedures for Medicine Management, NMC and The Care Quality Commission &lt;br /&gt; &lt;br /&gt; • An interest in mental health rehabilitation and promoting independence would help, however, skills can be transferred across from other professional training. &lt;br /&gt; &lt;br /&gt; • You may be involved in clinical reviews with our Responsible Clinician and liaise with GPs, MDTS and families. A full Supervision/Appraisal approach will be available. Daily support and guidance is available from peers and supervisors.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Required Skills and Experience&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;- You will need to hold a current Registered Nurse, Mental Health qualification and ideally have experience of working with service users along a pathway to promote their independence and manage their own mental health. &lt;br /&gt; &lt;br /&gt; - Candidates must have a valid NMC Pin Number &lt;br /&gt; &lt;br /&gt; - Knowledge of the MHA (1983) would be an advantage. However, updated training will be given. &lt;br /&gt; &lt;br /&gt; - Work to a shift pattern over 7 days, including rotated night shifts. &lt;br /&gt; &lt;br /&gt; - Be able to delegate duties and lead a team of Support Workers on shift. &lt;br /&gt; &lt;br /&gt; - Must have excellent interpersonal skills and utilise Person Centred Approach at all times. &lt;br /&gt; &lt;br /&gt; - Be able to work within a team and be able to use initiative and best practice&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary and Benefits&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We value our people and truly believe in making a difference through the service we provide. As well as working within a great team and a great culture, you can expect to earn a competitive salary ranging from £13.57 - £16.82 per hour dependent upon experience as well as an annual holiday allowance of 33 days inclusive of bank holidays. &lt;br /&gt; &lt;br /&gt; Salary based on post qualification experience, pro rata depending on actual working hours - &lt;br /&gt; &lt;br /&gt; £13.57 per hour – Till end of preceptorship &lt;br /&gt; &lt;br /&gt; £14.65 per hour – Up to 2 years post preceptorship &lt;br /&gt; &lt;br /&gt; £16.82 per hour – 2 years or more post qualification experience &lt;br /&gt; &lt;br /&gt; We are committed to providing ongoing training and development opportunities for our staff and support newly qualified nurses through preceptorship. We also provide support with revalidation with the NMC, and ongoing professional development and career progression. &lt;br /&gt; &lt;br /&gt; You will also have an opportunity to join our pension scheme whereby AFG will match any individual contributions between 3.5% and 5% of salary. Alternative Futures also provides an employee assistance programme and a lifestyle benefit scheme which provides you and your family with real savings on day to day purchases and leisure activities. The scheme is specially designed to fit with your home and family life, and offers a wide range of discounts that are unavailable on the high street; ranging from gift vouchers, hotels, holidays, gym memberships, car insurance and much more.&lt;/p&gt;\n&lt;p&gt;Now you know what it’s like to work at AFG as a nurse, now let’s tell you about the service our nurse vacancy is at:&lt;/p&gt;\n&lt;p&gt;Fir Trees Treatment and Recovery Centre in Wigan is a specialist 14 bedded Mental Health Rehabilitation Centre set within its own grounds down a quiet road with access to local shops and free parking. Fir Trees specialises in the rehabilitation of people with enduring mental health conditions such as schizophrenia and personality disorders to develop the skills to reintegrate successfully back into their communities with the support of a strong MDT.&lt;/p&gt;\n&lt;p&gt;Fir Trees is looking for a Mental Health Nurse with the same high standards and forward-thinking skills to join their team and develop their clinical skills by using evidence based practice as a standard delivery model.&lt;/p&gt;\n&lt;p&gt;Nurses at Fir Trees must be prepared to demonstrate their ability to continually develop both personally &amp; professionally and be motivated to work towards further improving the standards of clinical care within the service. Candidates should be passionate about delivering person centred care, want to work collaboratively with the people they support and use every opportunity to inspire hope within their relationships. AFG also offer career progression within the organisation which is strongly encourage to all nurses at Fir Trees.&lt;/p&gt;\n&lt;p&gt;If you are looking at a Preceptorship, please let us know first so that we can advise you further.&lt;/p&gt;\n&lt;p&gt;(Although you will work most of your shifts at the above named service, you may be required to work at alternative services across Greater Manchester therefore all contracts state Greater Manchester as location).&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Alternative Futures Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130416"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wigan", "postalCode": "L34 1BN"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4241", "longitude": "-2.82362"}}, "title": "RMN - 37.5 Hours -Wigan", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257645", "validThrough": "2020-11-19T23:59:59+0000"}