{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "49325", "minValue": "43712", "unitText": "YEAR", "value": "£43,712 - £49,325 pa inc"}}, "datePosted": "2020-10-19T08:17:18+0100", "description": "&lt;h1&gt;Community Forensic LD/ASD Team Leader, Band 7&lt;/h1&gt;\n&lt;p&gt;We are seeking a proactive and dynamic team leader to deliver this innovative service. The successful applicant will work closely with the Clinical Lead to undertake responsibilities that include refining and delivering a model of care and operational policies and procedures. The postholder will be expected to deploy excellent communication skills to initiate and sustain good working relationships with key stakeholders and vulnerable patients from multiple clinical services and settings across a large geography.&lt;/p&gt;\n&lt;p&gt;The postholder will be expected to lead budgetary and business planning and be responsible for the operation and management of the service. They will manage a team of specialist clinicians from professional backgrounds including nursing, psychology, psychiatry, social work, speech and language therapy, occupational therapy and administration. The postholder will be offered clinical supervision and personal and professional development opportunities in a friendly and stimulating working environment.&lt;/p&gt;\n&lt;p&gt;The service will be delivered by Oxleas NHS Foundation Trust on behalf of SLP, the consortium of mental health trusts in south London: South London &amp; Maudsley Foundation Trust, Oxleas Foundation Trust and South West London &amp; St George’s Trust. This innovative service is one of a wide portfolio of SLP projects and programmes across clinical and non-clinical areas with objectives that include improving population health and avoiding out of area placements.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Peter Stevens&lt;br /&gt;&lt;br /&gt;Consultant Clinical and Forensic Psychologist and Approved Clinician / Head of Psychological Therapies | Clinical Lead, SLP Specialist Pathway | Chair, Forensic Clinical Effectiveness &lt;/p&gt;\n&lt;p&gt;peter.stevens1@nhs.net&lt;/p&gt;\n&lt;p&gt;07342 059948&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120829.png", "name": "Oxleas NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120829"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Memorial Hospital, London", "postalCode": "SE18 3RG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4689", "longitude": ".065464"}}, "title": "Community Forensic LD/ASD Team Leader", "url": "https://www.jobs.nhs.uk/xi/vacancy/916231495", "validThrough": "2020-11-09T23:59:59+0000"}