{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615"}}, "datePosted": "2020-11-06T13:46:29+0000", "description": "&lt;p&gt;We are currently recruiting Paediatric Band 5 Nurses to join our ever expanding team on Paediatric Critical Care. If you are a Band 5 Nurse with experience from a general Paediatric setting or from Critical Care (adults or children), these roles will allow you to increase your knowledge, skills and experience and receive training and development opportunities through our competency based orientation programme.&lt;/p&gt;\n&lt;p&gt;We also welcome newly qualified staff with an interest in Critical Care to join our team, who will have the added support of the trust Preceptorship and Foundation package.&lt;/p&gt;\n&lt;p&gt;The Paediatric Critical Care Unit is staffed by a multidisciplinary team of anaesthetists, paediatricians, nurses, physiotherapists, pharmacists and dieticians, and is dedicated to the care of critically ill children (Level 2 and 3) from Oxfordshire, Berkshire, Buckinghamshire and Northamptonshire.&lt;/p&gt;\n&lt;p&gt;The Paediatric Critical Care is a 16/17 bedded unit providing care for critically sick children from the age of 0 to 16 years from a variety of specialities including neurosciences and trauma. The John Radcliffe Critical Care Unit works in collaboration with Southampton to provide a joint retrieval service, SORT (Southampton Oxford Retrieval Team). This service provides expert advice to district general hospitals in stabilising critically ill children prior to be transferred to Southampton or Oxford Paediatric Critical Care units and is staffed by doctors and nurses from both units. The unit is also one for 4 national centres for Paediatric Craniofacial services.&lt;/p&gt;\n&lt;p&gt;We are a dynamic and enthusiastic team looking for individuals with the same ambition and drive to take forward new initiatives within the Paediatric Critical Care setting as part of the Nursing Team. We offer access to postgraduate courses in Critical Care. Extended roles within the team are welcomed, with opportunities to access further training. Staff are also encouraged to attend national and international conferences.&lt;/p&gt;\n&lt;p&gt;Due to social isolation measures and to protect both staff and candidates, interviews will be held via video conferencing. Details will be sent out if your application is successful.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameAlex ElsonJob titleMatronEmail addressalex.elson@ouh.nhs.ukTelephone number01865 226408&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Oxford University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120889"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "John Radcliffe Hospital, Oxford", "postalCode": "OX3 9DU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7639", "longitude": "-1.21979"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259985", "validThrough": "2020-11-20T23:59:59+0000"}