{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 pa plus HCAS"}}, "datePosted": "2020-10-29T11:46:53+0000", "description": "&lt;p&gt;&lt;strong&gt;CLINICAL PSYCHOLOGIST / COUNSELLING PSYCHOLOGIST / EDUCATIONAL PSYCHOLOGIST&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;FULL TIME BAND 8a POST IN MERTON CAMHS MENTAL HEALTH SUPPORT TEAM (CAMHS&lt;br /&gt;TRAILBLAZER TEAM)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;South West London and St George&#39;s Mental Health NHS Trust has a rich history, wellestablished community links and an international reputation. We provide a full range of&lt;br /&gt;local mental health services to the Kingston, Merton, Richmond, Sutton and Wandsworth&lt;br /&gt;London boroughs, as well as specialist forensic mental health services, including high secure&lt;br /&gt;services, at Springfield Hospital.&lt;/p&gt;\n&lt;p&gt;We take pride in providing specialist care to our service users where our Trust values; being&lt;br /&gt;consistent, compassionate, collaborative, respectful and open is at the heart of everything&lt;br /&gt;we do. When you join us, you’ll be part of something special – an innovative and rapidly&lt;br /&gt;growing organisation that is helping to redefine the Mental Health, education and social&lt;br /&gt;care landscape in the UK.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;About the team:&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;SWLSTG MH Trust is a lead provider within the South West London Trailblazer programme&lt;br /&gt;and currently runs six Mental Health Support Teams (MHST) in Merton, Sutton and&lt;br /&gt;Wandsworth. Each MHST works within a cluster of schools offering a schools based early&lt;br /&gt;intervention service, as well as supporting the implementation of a whole schools approach&lt;br /&gt;to mental health across the cluster.&lt;/p&gt;\n&lt;p&gt;The Merton MHST is an original trailblazer team, started in January 2019 and comprises of 4 qualified Education Wellbeing Practitioners (EWPs), a self-harm community nurse and the&lt;br /&gt;advertised post, which is the most senior post within the MHST. EWPs work primarily with&lt;br /&gt;parents of primary school age children and with young people referred by secondary&lt;br /&gt;schools, offering low-intensity interventions for anxiety, low mood and behaviour&lt;br /&gt;difficulties. The Mental Health Nurse provides additional clinical input around self-harm and&lt;br /&gt;emotional regulation, consultation to school staff and support within each MHST and school&lt;br /&gt;cluster, working closely with team members to provide a coordinated service. The&lt;br /&gt;postholder will offer supervision to the other team members, consultation and reflective&lt;br /&gt;practice groups for school staff and will take a lead in supporting the whole school&lt;br /&gt;approach, in addition to providing more specialist clinical interventions. It is an exciting and&lt;br /&gt;varied role with good scope for creative and innovative working within a new national&lt;br /&gt;initiative to increase mental heath input directly into schools.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;About the role:&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;The post is band 8a full time and is based within the MHST for the Merton school cluster n&lt;br /&gt;Wimbledon. As it is a schools based job, leave will be expected to be taken during the&lt;br /&gt;school holiday periods.&lt;/p&gt;\n&lt;p&gt;The MHST also offers a wide variety of parent workshops, groups and whole class&lt;br /&gt;workshops as part of the whole school approach to mental health. The clinical supervisor&lt;br /&gt;and service coordinator will take a lead in running consultation sessions, reflective practice&lt;br /&gt;groups for school staff and training for school staff and parents as well as providing direct&lt;br /&gt;mental health interventions for young people. They will also be the clinical supervisor for&lt;br /&gt;the rest of the team.&lt;/p&gt;\n&lt;p&gt;Currently the Clinical Supervisor and Service Coordinator roles across the six MHSTs&lt;br /&gt;provide a strong peer support network for each other, sharing resources and learning across&lt;br /&gt;the three boroughs. There are also strong links with the Children’s Wellbeing Practitioner&lt;br /&gt;(CWP) service across the Trust. Regular supervision will be provided by the Consultant&lt;br /&gt;Clinical Psychologist in the service.&lt;/p&gt;\n&lt;p&gt;This post will require:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Qualification as a Clinical Psychologist / Counselling Psychologist / Educational&lt;br /&gt;Psychologist and current registration with the HCPC&lt;/li&gt;\n&lt;li&gt;Strong experience of working with children, young people &amp; parents&lt;/li&gt;\n&lt;li&gt;Previous experience of giving supervision, training and teaching&lt;/li&gt;\n&lt;li&gt;Excellent experience with managing risk and safeguarding issues&lt;/li&gt;\n&lt;li&gt;Strong organisational and leadership skills&lt;/li&gt;\n&lt;li&gt;Excellent communication skills&lt;/li&gt;\n&lt;li&gt;Good understanding of CBT and parenting models in order to supervise the EWP’s work&lt;/li&gt;\n&lt;li&gt;The ability to work cohesively and collaboratively both within a small team and within the wider school cluster&lt;/li&gt;\n&lt;li&gt;The ability to use feedback, reflect and adapt accordingly&lt;/li&gt;\n&lt;li&gt;Commitment to using data and relevant measures to assess clinical outcomes&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;About the location:&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;The Merton MHST is based within Ursuline High School in Wimbledon, the lead cluster&lt;br /&gt;school, and provides input to a further 15 schools in the borough of Merton. Some travel&lt;br /&gt;between schools and base is to be expected but this can be managed by public transport,&lt;br /&gt;owning a car is not necessary&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;Benefits:&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;We offer a number of excellent staff benefits and understand the importance of a healthy&lt;br /&gt;work life balance. Some of our benefits are highlighted here:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Generous pay, pensions and leave, we offer a comprehensive pay, pensions and leave&lt;br /&gt;package which is dependent on the role and length of service&lt;/li&gt;\n&lt;li&gt;Work life balance, we support a range of flexible options, such as: part-time working,&lt;br /&gt;job sharing, term-time working, compressed hours and working from home&lt;/li&gt;\n&lt;li&gt;Career development, There are plenty of opportunities to progress your career and we support your development through a number of programmes such as mentoring,&lt;br /&gt;coaching, positive people management, collective leadership and other talent&lt;br /&gt;programmes&lt;/li&gt;\n&lt;li&gt;Subsidised car parking - You&lt;/li&gt;\n&lt;/ul&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "South West London and St Georges Mental Health NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123034"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Ursuline High School, Wimbledon", "postalCode": "SW20 8HA"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4141", "longitude": "-.222733"}}, "title": "Clinical Psychologist/Counselling Psychologist/Educational Psychologi", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248182", "validThrough": "2020-11-08T23:59:59+0000"}