{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum"}}, "datePosted": "2020-10-27T13:45:58+0000", "description": "&lt;p&gt;Applications are invited for this post to expand cardiology services at Dorset County Hospital. The trust is doubling MRI capacity and wishes to provide cardiac MRI on site as well as improving echocardiography services. The post has no general medical commitment.&lt;/p&gt;\n&lt;p&gt;The Trust expanded its cardiology services in 2017 with the addition of a new consultant and the addition of a second cardiac lab to deal with demand. The Cardiology Department at Dorset County Hospital currently delivers the services of echocardiography, transoesophageal echocardiography, 24 hour and prolonged ambulatory monitoring, exercise tolerance testing including cardio-pulmonary exercise testing. CT coronary angiography is delivered on site complying to CG95 guidance. We also have a comprehensive pacing and ICD service and implant around 300 simple pacemakers per year and 60 ICD’s per year, the majority of which are CRTD and around 20 CRTP devices. There is a technician led ICD clinic and pacing clinic along with a nurse led chest pain clinic. There are specialist nurses in chest pain and heart failure for both inpatients and outpatients and 2 full-time arrhythmia nurses. The interventional service provides daytime primary PCI service. The current PCI numbers are around 500 PCI cases per year. The 2 Catheter Labs have a comprehensive service which includes shockwave, rotablation, integrated OFDI, pressure wire and IVUS facilities.&lt;/p&gt;\n&lt;p&gt;The post holder will have been trained in cardiac imaging and an ability to implant pacemakers is desirable but not essential. The post requires a 1 in 6 commitment to a general on-call cardiology rota,&lt;/p&gt;\n&lt;p&gt;The Trust has a very good reputation for undergraduate and postgraduate teaching with links to Bournemouth University and Health Education Wessex.&lt;/p&gt;\n&lt;p&gt;Applicants must be included on the GMC’s Specialist Register in Cardiology, or within 1year of their expected date of receipt of a CCT, at the time of interview.&lt;/p&gt;\n&lt;p&gt;Dorset is one of the most beautiful and diverse counties in England. Over half of Dorset is designated as an Area of Outstanding Natural Beauty and the Jurassic Coast is the only Natural World Heritage site in England. It has nearly 100 miles of coastline, with award-winning, golden sandy beaches and the harbours of Portland and Weymouth offering a great variety of watersports, from kite surfing to paddle boarding and hosting the London 2012 Olympic and Paralympic sailing events. London is only just over two hours away, by car or by train. France, Guernsey and Jersey are all just a short hop away on the ferries from Poole, whilst Bournemouth International Airport offers flights all over the world. There are also excellent schooling opportunities in both private and state sectors.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameFraser WitherowJob titleConsultant CardiologistEmail addressfraser.witherow@dchft.nhs.ukTelephone number01305 255642Additional contact information&lt;/p&gt;\n&lt;p&gt;For an informal discussion, to arrange a visit, please contact Dr Fraser Witherow, Consultant Cardiologist Clinical Director for Cardiology on 01305 255642 and/or Dr Tim Edwards, Consultant Cardiologist on 01305 255114&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121023.jpg", "name": "Dorset County Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121023"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Dorset County Hospital, Dorchester", "postalCode": "DT1 2JY"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7135", "longitude": "-2.44712"}}, "title": "Consultant Cardiologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244787", "validThrough": "2020-12-06T23:59:59+0000"}