{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "25365", "minValue": "22987", "unitText": "YEAR", "value": "£22,987 - £25,365 pa pro rata inc HCA"}}, "datePosted": "2020-11-04T16:16:04+0000", "description": "&lt;p&gt;Band 4 - Safeguarding Administrator, Corporate Nursing&lt;/p&gt;\n&lt;p&gt;We are expanding our award winning safeguarding team and are recruiting a Band 4 Safeguarding Administrator.&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity for an enthusiastic, dynamic and highly motivated individual with experience or a keen interest in safeguarding to join our integrated, dynamic and friendly safeguarding team at West Herts Hospitals NHS Trust.&lt;/p&gt;\n&lt;p&gt;West Herts Safeguarding Team is a national award winning team with a NHS parliamentary award in 2019 for tackling Health inequalities in relation to modern day slavery and people trafficking. We also have the RCN Nurse of the Year 2019 working in the team – it is an exciting time to join the team as we continue to develop innovative safeguarding practice.&lt;/p&gt;\n&lt;p&gt;This post holder will play an important role within the safeguarding team.&lt;/p&gt;\n&lt;p&gt;The post holder will be expected to provide a comprehensive, confidential and high quality administrative service to the safeguarding team and be responsible for the smooth and effective running of the administration and safeguarding systems.&lt;/p&gt;\n&lt;p&gt;The successful post holder will need to be able to manage their own workload, have flexibility, problem solving skills, and be able to use a confidential approach with a desire to make a difference. The individual will have excellent administrative (Computer Literacy), organisational and communication skills and an ability to work on their own initiative. It is vital that the applicant is able to maintain a calm approach under pressure.&lt;/p&gt;\n&lt;p&gt;The post holder will be expected to provide non-clinical advice and guidance in relation to safeguarding queries, with all complex queries being escalated to the relevant safeguarding team member.&lt;/p&gt;\n&lt;p&gt;Interviews will take place on 2nd December 2020.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Orla Burke Clinical Nurse Specialist Safeguarding Children 01923 217294 or 07920757415 or email – o.burke@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "West Hertfordshire Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120820"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Watford", "postalCode": "WD18 0HB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6491", "longitude": "-.404449"}}, "title": "Band 4 - Safeguarding Administrator, Corporate Nursing", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256581", "validThrough": "2020-11-11T23:59:59+0000"}