{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum pro rata"}}, "datePosted": "2020-11-05T16:01:35+0000", "description": "&lt;p&gt;Calderdale and Huddersfield NHS Foundation Trust is a dynamic and successful organisation, with a strong organisational and personal development focus. With over 6000 employees and a turnover of £411 million, the Trust provides a comprehensive range of secondary care services to the people of Calderdale and Huddersfield. &lt;br /&gt;&lt;br /&gt;This is an exciting opportunity for the successful applicant to be involved in the future development of Haematology services, for which there is a high level of commitment within the Trust, and with partner organisations.&lt;br /&gt;&lt;br /&gt;The post will be based at the Huddersfield Royal Infirmary, however the post holder will be expected to work across the two hospital sites.&lt;br /&gt;&lt;br /&gt;The post holder will be undertaking inpatient and outpatient work. The post holder is encouraged to develop his/her own sub-specialty interest.&lt;br /&gt;&lt;br /&gt;Applications are encouraged from experienced consultants wishing to take up a new challenge or newly accredited consultants who will be supported through our highly regarded development programmes.&lt;br /&gt;&lt;br /&gt;This is a Full Time post providing 10 Programmed Activities (PAs), but applicants wishing to work part-time are also encouraged to apply and job plans will be adjusted accordingly, and by negotiation with appointees.&lt;br /&gt;&lt;br /&gt;There are 2 dedicated ANP&#39;s for Haematology that provides follow up clinics, telephone advice lines and supports the junior doctors and nursing staff. The department also has a Haematology specialist nurse who supports the cancer patients through their pathway.&lt;/p&gt;\n&lt;p&gt;Dr Sylvia Feyler Consultant Haematologist&lt;/p&gt;\n&lt;p&gt;Dr Kate Rothwell Consultant Haematologist&lt;/p&gt;\n&lt;p&gt;Dr Wunna Swe Consultant Haematologist&lt;/p&gt;\n&lt;p&gt;Dr Nwe Ooh Consultant Haematologist&lt;/p&gt;\n&lt;p&gt;Dr Atta Gill Consultant Haematologist&lt;/p&gt;\n&lt;p&gt;International Trainee&lt;br /&gt;Speciality Registrar&lt;br /&gt;ANP Sarah Mettrick&lt;br /&gt;Specialist Nurse Patricia Price&lt;br /&gt;Specialist Nurse Rebekah Ramsden&lt;br /&gt;&lt;br /&gt;There is a dedicated Oncology/Haematology ward based on the Huddersfield Royal Infirmary site which has 20 beds and an assessment area for ward attenders.&lt;br /&gt;&lt;br /&gt;There are two dedicated day case facilities, one on Greenlea unit at Huddersfield Royal Infirmary, that opened in October 2015. The other is in the Macmillan Unit at Calderdale Royal Hospital. The Trust has a Chemotherapy Clinical Nurse Specialist and a well-established Chemotherapy Team to support.&lt;br /&gt;&lt;br /&gt;The department has an extremely active Oncology and Haematology Clinical Trials Department.&lt;br /&gt;&lt;br /&gt;If you are interested in this post please visit the NHS Jobs website for a job description and person specification and apply on-line by inserting job reference. If you experience any difficulties please contact the Workforce and Organisational Development Department on 01484 355002.&lt;br /&gt;&lt;br /&gt;Further information about the hospital can be obtained from the NHS Jobs website.&lt;br /&gt;&lt;br /&gt;Please note that this post is subject to the Rehabilitation of Offenders Act (Exceptions Order) 1975 and as such it will be necessary for a submission for Disclosure to be made to the Disclosure and Barring Service (formerly known as CRB) to check for any previous criminal convictions. Please be aware that you will be required to cover the cost of the Disclosure and Barring Service (DBS) application through deductions from your salary at source in months 1, 2 and 3 in your new post.&lt;br /&gt;&lt;br /&gt;If you have recently completed a DBS check you may be eligible to apply for the DBS update service. Please click on the link provided for more information.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameAndrew HardyJob titleClinical DirectorTelephone number01484 342000Additional contact information&lt;/p&gt;\n&lt;p&gt;Dr Sylvia Feyler, Clinical Lead, Haematology Tel: 01484 355748&lt;/p&gt;\n&lt;p&gt;Dr Andrew Hardy, Clinical Director, Integrated Medical Specialties, Tel: 01422 357171&lt;/p&gt;\n&lt;p&gt;Dr Ashwin Verma, Divisional Director, Medicine &amp; Elderly Services, Tel: 01422 223121&lt;/p&gt;\n&lt;p&gt;Dr David Birkenhead, Medical Director, Tel: 01484 346911&lt;/p&gt;\n&lt;p&gt;Mr Owen Williams, Chief Executive, Tel: 01484 355999&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Calderdale and Huddersfield NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121129"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Calderdale and Huddersfield NHS Foundation Trust", "postalCode": "HD3 3EA"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.6555", "longitude": "-1.81634"}}, "title": "Consultant in Haematology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258481", "validThrough": "2020-12-03T23:59:59+0000"}