{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "52036", "minValue": "49036", "unitText": "YEAR", "value": "£49,036 - £52,036 per annum"}}, "datePosted": "2020-10-30T17:01:06+0000", "description": "&lt;p&gt;Applications are invited for the post of Clinical Fellow (Higher-Senior) in Infectious Diseases, at Addenbrooke’s Hospital, part of Cambridge University Hospitals NHS Foundation Trust. This post is available from 01 January 2021 for a period of 12 months.&lt;/p&gt;\n&lt;p&gt;The Infectious Diseases team takes direct care of adult inpatients with a broad range of infections including HIV, tuberculosis, infections in returning travellers and community/hospital-acquired infections. The team also undertakes a consult service within the hospital to review patients under other teams with complex infections, including those under the Transplant and Neuro-Critical Care services. The post holder will be expected to share duties to cover the service with training grade Registrars in Infectious Diseases.&lt;/p&gt;\n&lt;p&gt;The post holder will also be expected to contribute to the General Internal Medicine on-call rota. This is a commitment of 6 weeks in every 44 weeks. This will include night shifts, on-take cover and post-take ward rounds. The timetable is flexible and according to the successful candidate’s needs.&lt;/p&gt;\n&lt;p&gt;The post is available to applicants who have clinical experience and qualifications equivalent to ST3 level or above, as well as applicants who are post-CCT.&lt;/p&gt;\n&lt;p&gt;Please note that these posts do not carry Postgraduate Dean’s approval or training recognition.&lt;br /&gt;&lt;br /&gt;The applicant must have demonstrable skills in listening, reading, writing and speaking in English that enable effective communication about medical topics with patients and colleagues, as set out in the GMC’s Good Medical Practice (2013). Full Registration and a Licence to Practice with the General Medical Council at time of application is required.&lt;/p&gt;\n&lt;p&gt;Full Registration and a Licence to Practice with the General Medical Council at time of application is required.&lt;/p&gt;\n&lt;p&gt;Applications from job seekers who require Tier 2 sponsorship to work in the UK are welcome and will be considered alongside all other applications. For further information please visit the UK Visas and Immigration website.&lt;/p&gt;\n&lt;p&gt;From 6 April 2017, Tier 2 skilled worker applicants, applying for entry clearance into the UK, must present a criminal record certificate from each country they have resided continuously or cumulatively for 12 months or more in the past 10 years. Adult dependants (over 18 years old) will also be subject to this requirement.&lt;/p&gt;\n&lt;p&gt;Cambridge University Hospitals NHS Foundation Trust is an Equal Opportunities Employer.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Dr Elinor Moore, Specialty Lead for Infectious Diseases (elinor.moore@addenbrookes.nhs.uk)&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Cambridge University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121319"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Addenbrooke&#39;s Hospital, Cambridge", "postalCode": "CB2 0QQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1751", "longitude": ".141751"}}, "title": "Clinical Fellow (Higher-Senior) in Infectious Diseases", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251012", "validThrough": "2020-11-15T23:59:59+0000"}