{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51393", "minValue": "45780", "unitText": "YEAR", "value": "£45,780 - £51,393 p.a inc. HCA"}}, "datePosted": "2020-11-04T11:16:08+0000", "description": "&lt;p&gt;Evelina London Children&#39;s Healthcare is part of Guy&#39;s and St Thomas&#39; NHS Foundation Trust.&lt;/p&gt;\n&lt;p&gt;We provide comprehensive health services from before birth, throughout childhood and into adult life&lt;/p&gt;\n&lt;p&gt;Our community services care for children and families in Lambeth and Southwark. Our children&#39;s hospital not only cares for local families but also provides an extensive range of specialist services for children with rare and complex conditions from across south London, Kent, Surrey and Sussex.&lt;/p&gt;\n&lt;p&gt;We are the second largest provider of children&#39;s services in London. We provide a full range of hospital and community services for local residents.&lt;/p&gt;\n&lt;p&gt;Based in a stunning purpose-built building on the site of St Thomas&#39;, our hospital includes:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;241 beds, including 30 intensive care beds&lt;/li&gt;\n&lt;li&gt;46-cot neonatal unit&lt;/li&gt;\n&lt;li&gt;5 dedicated children&#39;s operating theatres&lt;/li&gt;\n&lt;li&gt;a full children&#39;s imaging service with MRI scanner, x-ray and ultrasound&lt;/li&gt;\n&lt;li&gt;a kidney dialysis unit&lt;/li&gt;\n&lt;li&gt;3 dedicated children&#39;s research units&lt;/li&gt;\n&lt;li&gt;an outpatients department&lt;/li&gt;\n&lt;li&gt;a hospital school.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We are part of King’s Health Partners, one of only six academic health sciences centres in the UK.&lt;/p&gt;\n&lt;p&gt;Like many in the profession, we believe that the control of infection is one of the most important 21st century health care challenges. If you prefer to be in the thick of things and to make a difference where it really counts and want to influence change and drive progress, an exciting opportunity has arisen to join the expanding woman&#39;s and children&#39;s Infection Prevention and Control Team as a band 7 Clinical Nurse Specialist. &lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;You will be a highly motivated, qualified Infection Prevention and Control nurse or a nurse with extensive clinical experience with evidence of a developed interest in Infection Prevention &amp; Control. You will be responsible within the operational scope of the Infection Prevention and Control (IPC) (both acute and community), facilitating the prevention, surveillance, investigation and control of infection within the Evelina London Children&#39;s Hospital, Women&#39;s services and community services. You will also be expected to be involved in the delivery of the IPC education programmes for all staff throughout the Trust (both community and acute). The post holder must be information technology literate (Microsoft Office, Outlook), training will be provided for our Infection Prevention and Laboratory IT systems. &lt;strong&gt;&lt;br /&gt;&lt;/strong&gt;&lt;br /&gt;The post provides support to the diverse specialties across the Evelina and Women&#39;s Services. A vital remit of the post involves providing clinical advice, as well as participating in education, surveillance, audit and research programmes. You’ll also have the opportunity to further your professional development by building specialist skills and interests and also work with the adult IPC team to further your experience and knowledge.&lt;/p&gt;\n&lt;p&gt;The job description is Guys and St Thomas’ NHS Foundation Trust generic Clinical Nurse Specialist job description. Please see the person specification. &lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;Closing date: 8th November 2020 (midnight)&lt;/p&gt;\n&lt;p&gt;Interview date: 20th November 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Shona Perkins - Deputy Director Infection Prevention and Control&lt;/p&gt;\n&lt;p&gt;Shona.perkins@gstt.nhs.uk - 07918338706&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121066.jpg", "name": "Guy's and St. Thomas' NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121066"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Evelina Children&#39;s Hospital, London", "postalCode": "SE1 7EH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4979", "longitude": "-.119645"}}, "title": "Clinical Nurse Specialist - Infection Control", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255565", "validThrough": "2020-11-08T23:59:59+0000"}