{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 - £19,337 Per Annum"}}, "datePosted": "2020-11-06T10:16:21+0000", "description": "&lt;p&gt;Do you want to make a difference to our stroke and TIA patients? &lt;br /&gt;&lt;br /&gt;Are you looking to be part of a dynamic organisation with an overall aim to deliver world class care? &lt;br /&gt;&lt;br /&gt;Do you have excellent clinical skills and a desire to develop your knowledge and skills further?&lt;br /&gt;&lt;br /&gt;If so, then this outstanding hospital would like to meet you. &lt;br /&gt;&lt;br /&gt;The stroke service at Broomfield is a dynamic high class service achieving the top classification of ‘A’ status for performance as rated by the Royal college of Physicians, SSNAP data collection 2020&lt;br /&gt;&lt;br /&gt;offer a 24/7 acute stroke service that covers the Emergency department with a team of highly skilled specialist nurses and 7/7 specialist Transient Ischaemic Attack (TIA) clinics offering fast and effective assessment and management for patients suspected of having a TIA.&lt;/p&gt;\n&lt;p&gt;Our Acute Stroke Unit is committed to delivering high quality care and this is achieved by our highly specialised multidisciplinary team.&lt;/p&gt;\n&lt;p&gt;We are looking for a passionate, caring and committed Health Care Assistant to be a part of our team.&lt;/p&gt;\n&lt;p&gt;The trust is committed to supporting and developing its’ staff so opportunities for training and other development activities will be provided. All health care professionals working within the stroke service have the opportunity to complete comprehensive stroke specific competencies that provides an in depth knowledge of evidence based stroke care. The stroke unit actively participates in Stroke research.&lt;br /&gt;Successful applicants must be: &lt;br /&gt;• Proactive and dynamic&lt;br /&gt;• Committed to personal professional development&lt;br /&gt;• Committed to providing a high standard of patient care&lt;br /&gt;• A Team Player who strives to achieve high standards in line with the National Guidelines and the Stroke Strategy.&lt;br /&gt;Applicants must be highly motivated with excellent communication skills that enjoy working in an energetic, challenging and at times demanding environment. Come and be part of the team and help us lead the way in providing high quality Stroke care to the local population.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameJudy Harper-BrightJob titleSenior SisterEmail addressjudy.harper-bright@meht.nhs.ukTelephone number01245 516085Additional contact information&lt;/p&gt;\n&lt;p&gt;Judy Harper-Bright- Senior Sister&lt;/p&gt;\n&lt;p&gt;Stroke Unit&lt;/p&gt;\n&lt;p&gt;01245 516085&lt;/p&gt;\n&lt;p&gt;or e-mail judy.harper-bright@meht.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121033.jpg", "name": "Mid and South Essex NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121033"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Broomfield, Chelmsford", "postalCode": "CM1 7ET"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7746", "longitude": ".465452"}}, "title": "Health Care Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259166", "validThrough": "2020-11-09T23:59:59+0000"}