{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 to £110,683 pa"}}, "datePosted": "2020-10-19T09:39:13+0100", "description": "&lt;p&gt;Applications are invited for the post of Consultant Radiologist with Subspecialist Interest to complement the current Radiology Team, ideally chest / cardiac imaging or general cross sectional imaging. You will join the current team of friendly and enthusiastic Radiologists to provide General Radiology Services in this busy modern Hospital which provides a wide range of clinical services to a population of 330,000.&lt;/p&gt;\n&lt;p&gt;The successful candidate must have full GMC registration with CCT and possess FRCR (or equivalent).&lt;/p&gt;\n&lt;p&gt;The Radiology Department is well equipped and provides a wide range of services. There is well established skill mix with Radiographers undertaking Plain Film Reporting, CT reporting, and Ultrasound reporting. There is full PACS/RIS desktop integration with PACS stations available throughout the Hospital. There is a 1.5 Tesla MRI Scanner, 2 Multi-Slice Spiral CT scanners including a 64 and 128 slice scanner, a dedicated Interventional Suite, 10 Ultrasound machines and 2 Gamma cameras, one of which is a SPECT/CT camera. The department is working towards supporting 7 day working throughout the trust.&lt;/p&gt;\n&lt;p&gt;Access to images out of hours is available from Consultant homes via PACS workstations. CT scans undertaken after 8pm weekdays and 6pm weekends are outsourced.&lt;/p&gt;\n&lt;p&gt;The Hospital has Associated Teaching Hospital status and is part of the Sheffield Teaching Hospitals Radiology Training Scheme and is on the Specialty Registrar rotation. There are strong links with the Sheffield University Medical School, teaching and research at all levels will be encouraged. You will be granted Honorary Lecturer status and will be able to apply for an Honorary Senior Clinical Lecturer position.&lt;/p&gt;\n&lt;p&gt;Any candidates unable to work full time will be eligible for the post; if such a person is appointed, modification of the job content will be discussed on a personal basis with the Chief Executive, Clinical Director and Medical Director.&lt;/p&gt;\n&lt;p&gt;The Trust is committed to the new revalidation process and appropriate SPA time is identified to facilitate the requirements to meet this.&lt;/p&gt;\n&lt;p&gt;Rotherham is conveniently situated with excellent motorway access, close to the Peak District and the Meadowhall Shopping Centre. There are excellent State and Private schools within the area.&lt;/p&gt;\n&lt;p&gt;For further information please contact Dr Rachel Walker, Clinical Lead in Radiology on 01709 427842, email rachel.walker29@nhs.net&lt;/p&gt;\n&lt;p&gt;or&lt;/p&gt;\n&lt;p&gt;Mrs Lisa Hickling, Interim Professional Lead for Clinical Radiology, Medical Physics and Medical Photography/Illustration&lt;/p&gt;\n&lt;p&gt;on 01709 427650, email lisa.hickling@nhs.net&lt;/p&gt;\n&lt;p&gt;Please be aware that we will need references for the past 3 years employment. Your referees must have been your supervising Consultant (for non-consultant posts) or your Medical Manager and Medical Director if already in a Consultant post (For Consultant posts), if they are to be requested via email it must be via an institutional email address.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "The Rotherham NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=131814"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Rotherham", "postalCode": "S60 2UD"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4144", "longitude": "-1.34257"}}, "title": "Consultant in Radiology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916231646", "validThrough": "2020-11-19T23:59:59+0000"}