{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum, pro rata"}}, "datePosted": "2020-11-02T10:46:02+0000", "description": "&lt;p&gt;We have an exciting opportunity for a Registered Mental Health Nurse with a proven track record in managing and improving the quality of care delivery within mental health services.&lt;/p&gt;\n&lt;p&gt;This is an excellent opportunity to broaden your skills and improve standards of care at across the services at Ardenleigh, these services include Women’s Secure Care, FCAMHS and Low Secure CAMHS. The post is for the Womens service but the successful applicant will be required to provide visible leadership across the entire site and work alongside the CAMHS inpatient Matron&lt;/p&gt;\n&lt;p&gt;You will be a dynamic, motivated and creative clinician who will lead on driving forward and sustaining meaningful changes to patient pathways, playing an important role in leading and co-ordinating the service improvement objectives of the service, taking into account the strategic aims and objectives of the area and the Trust.&lt;/p&gt;\n&lt;p&gt;The post holders will work in partnership with the Clinical Nurse Manager and other senior nursing colleagues to monitor, challenge and improve the quality of patient care within the Ardenleigh services. You will need a sound knowledge of the national legislation with regard to infection prevention, The Mental Health Act and Safeguarding Vulnerable Adults and Children with extensive knowledge in maintaining and improving clinical standards. Maintaining an oversight of staffing, budgets, environmental and estates issues and other aspects of compliance. There is also an expectation to work flexible across the shifts to support the service and an expectation to be part of the Trust wide On Call Rota.&lt;/p&gt;\n&lt;p&gt;The post holder will embrace multi-disciplinary working and work as a key member of the MDT, you will also be required to represent the service at key forums and meetings.&lt;/p&gt;\n&lt;p&gt;Our site prides itself on delivering Trauma Informed Care and you will be expected to demonstrate the values of Safety, Empowerment, Trust, Choice and Collaboration in your care delivery and leadership.&lt;/p&gt;\n&lt;p&gt;Excellent leadership, communication and organisational skills will be required for this post and you will need to be able to work effectively both on your own initiative and as part of the team. You will be a visible leader who can demonstrate resilience.&lt;/p&gt;\n&lt;p&gt;Birmingham and Solihull Mental Health Foundation Trust (BSMHFT) is one of the largest providers of secure care and offender health services in the country. As a result the Trust offers new staff an excellent experience across a variety of provision which incorporates community psychological intervention services, a community outreach team (FIRST), Liaison and Diversion service, prison health care service, together with inpatient services which provide low and medium secure services for young persons, women and men.&lt;/p&gt;\n&lt;p&gt;Alongside of working for BSMHFT the successful candidate will have the opportunity to work within the Reach Out Model of Care. Reach Out is a new care model which is a partnership between Birmingham and Solihull Mental Health NHS Foundation Trust, Midlands Partnership NHS Foundation Trust and St Andrews Health Care. BSMHFT is the lead provider in this collaboration. Our main aim in this collaboration is to ensure our service users receive care closer to their home and also to reduce the inequalities that they experience.&lt;/p&gt;\n&lt;p&gt;The Trust has also introduced Quality Improvement methodology to our services in order to ensure that we continuously improve our service provision but also we are efficient and effective. The post holder would have the opportunity to be trained in the methodology but also to participate in some quality improvement projects as well as sponsor some within their service area.&lt;/p&gt;\n&lt;p&gt;We are passionate about equality, diversity and inclusion and so welcome applications from people with a range of diverse backgrounds that would role model our approach.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameEmma WattsJob titleClinical Nurse ManagerEmail addressemma.watts6@nhs.netTelephone number0121 301 4620&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Birmingham and Solihull Mental Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120844"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Ardenleigh, Birmingham", "postalCode": "B24 9SA"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5162", "longitude": "-1.83374"}}, "title": "Band 8a Matron - Ardenleigh Womens Secure Blended Service", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251646", "validThrough": "2020-11-13T23:59:59+0000"}