{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "107668", "minValue": "79860", "unitText": "YEAR", "value": "£79,860 - £107,668 pa"}}, "datePosted": "2020-10-27T16:15:46+0000", "description": "&lt;p&gt;We are inviting applications for two Consultant Gastroenterologist posts, one replacement (following retirement) and the other a new post, working across the geographical areas covered by the Blackpool Teaching Hospitals NHS Foundation Trust. &lt;br /&gt;Blackpool Victoria Hospital is a large district hospital with attached Lancashire Specialist Cardiothoracic Centre. It provides services to a population of 330 000 people and is situated in the popular seaside resort of Blackpool on the Lancashire Coast. There are good transport links and we are within easy reach of Manchester, Liverpool and the Lake District. The surrounding area includes the affluent townships of Poulton and Lytham St Annes which are both in short commuting proximity with highly rated schools of Excellent by Ofsted, good quality dining, many picturesque locations, affordable high quality housing and offer a varied range of outdoor, cultural and social activities. Remuneration packages may be applicable to allow for relocation.&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;The appointees will join a team of 5 existing Consultant Gastroenterology colleagues and will support delivery of high quality patient care, endoscopy in our JAG accredited unit, management of outpatients as well as inpatients in the gastroenterology ward. The appointees are expected to participate in an ‘out of hours’ GI Bleed Service. There is no acute general medical on-call commitment.&lt;/p&gt;\n&lt;p&gt;The appointees are expected to have a broad background in general gastroenterology and endoscopy skills. Depending on sub-specialist expertise there are opportunities to expand current Hepatology, HPB (EUS and or ERCP), UGI or luminal services and advanced endoscopy services. Research and teaching interests through links with the University of Liverpool and Lancaster are actively supported. There is also the exiting opportunity of developing subspecialty interest with support from existing Consultant colleagues if required [including through ongoing post-CCT in-house training and mentorship from experienced Consultant colleagues).&lt;/p&gt;\n&lt;p&gt;The successful candidate will join a multi-professional team based on the Blackpool Victoria Hospital site and will also give clinical opinions at community hospitals within the Trust when requested by Consultant colleagues.&lt;br /&gt;Applicants should possess full GMC registration and be registered on the Specialist Register or within 6 months. &lt;br /&gt;The post holder will be employed by the Blackpool Teaching Hospitals NHS Foundation Trust.The endoscopy department has 5 endoscopy rooms performing diagnostic and therapeutic endoscopic procedures including EUS and ERCP. We are the administrative site for delivering bowel cancer screening as well as bowel scope for the region.&lt;/p&gt;\n&lt;p&gt;Please see Job description for detailed information.&lt;/p&gt;\n&lt;p&gt;The AAC Interview date: TBC&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDr Senthil MurugesanJob titleHead of DepartmentEmail addresssenthil.murugesan@nhs.netTelephone number01253 951639Additional contact information&lt;/p&gt;\n&lt;p&gt;Dr Senthil Murugesan&lt;br /&gt;Head of Department&lt;br /&gt;Telephone : 01253 951639&lt;br /&gt;dr.murugesan2@bfwhospitals.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Blackpool Teaching Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120954"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Blackpool Teaching Hospitals NHS Foundation Trust, Blackpool", "postalCode": "FY3 8NR"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8207", "longitude": "-3.01626"}}, "title": "Consultant in Gastroenterology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245374", "validThrough": "2020-11-17T23:59:59+0000"}