{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-10-26T10:46:42+0000", "description": "&lt;p&gt;An exciting opportunity has arisen to be part of the Dietetic services for the Mental Health Services for Older People in University Hospital Llandough (UHL). The post holder will work alongside a large multidisciplinary team working closely with the Speech and Language therspist within the swallow team.&lt;/p&gt;\n&lt;p&gt;The post holder will be a clinician demonstrating an advanced level of expertise in the management of a highly specialist clinical caseload of patients requiring complex nutritional and dietetic support using evidence based patient centred principles to assess, plan, implement and evaluate dietetic interventions.&lt;/p&gt;\n&lt;p&gt;The post holder will be part of the current mental health dietetic team and contribute to the wider development of the mental health dietetic service locally and nationally. This includes future developments around dementia care. They will act as an advocate for patients on their nutritional management through attendance of multi-disciplinary team meetings, case conferences, audits, educational meetings, specialist group meetings and quality and safety meetings.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Cardiff and Vale UHB is unique in being both a teaching Health Board as well as providing Tertiary, Specialist, General, Acute, Mental health and Community services. The Dietetic department has a clerical support team and robust IT hardware and software, actively supports professional development and clinical supervision for all staff. The department is committed to the training of pre-registration Student Dietitians and the post holder will also be required to take part in student training.&lt;br /&gt;&lt;br /&gt;The successful candidate will be able to demonstrate that they share our organisational values:&lt;br /&gt;-We care about the people we serve and the people we work with&lt;br /&gt;-We trust one another&lt;br /&gt;-We respect each other&lt;br /&gt;-We take personal responsibility&lt;br /&gt;-We treat people with kindness&lt;br /&gt;-We act with integrity&lt;br /&gt;Post holders will be expected at all times to behave in accordance with our values demonstrating commitment to the delivery of high quality services to patients.&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; Welsh and/or English speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt;Closing Date: 9th November 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Joanne JeffordJob title Dietetic Services Manager&lt;/p&gt;\n&lt;p&gt;Email address joanne.jefford@wales.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number 25250&lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;Annette McLean Mental Health Lead or&lt;/p&gt;\n&lt;p&gt;Jo Jefford, Nutrition &amp; Dietetic Manager&lt;/p&gt;\n&lt;p&gt;University Hospital Llandough&lt;/p&gt;\n&lt;p&gt;Tel - 02920 715281&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123193.jpg", "name": "Cardiff and Vale University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123193"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Llandough University Hospital, Cardiff", "postalCode": "CF64 2XX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4496", "longitude": "-3.20264"}}, "title": "MHSOP Specialist Dietitian - Dementia Lead", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242048", "validThrough": "2020-11-09T23:59:59+0000"}