{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "42712", "minValue": "36070", "unitText": "YEAR", "value": "£36,070 - £42,712 pa inc HCAS"}}, "datePosted": "2020-10-26T17:15:32+0000", "description": "&lt;p&gt;&lt;strong&gt;Advanced Theatre Practitioner - All Specialities &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Band 6&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;A really interesting and exciting opportunity has risen for Band 6 Practitioners (&lt;strong&gt;&lt;em&gt;ODPs/Nurses&lt;/em&gt;&lt;/strong&gt;) to join our friendly and dynamic theatre team within Croydon University Hospital.&lt;/p&gt;\n&lt;p&gt;In light of the recent pandemic, the department has changed the way it provides its service to the Croydon Community. The successful candidates will have an opportunity to work in the 9 Operating Theatres of the COVID-protected Croydon Elective Centre which provides a wide range of specialties such as Gynaecology, Urology, Breast, ENT, Dental, Orthopaedics, Colorectal, General, Paediatric and Vascular surgery. You will also have an opportunity to work as part of the multi-disciplinary team supporting the Emergency Surgical Centre that has 4 Operating Theatres which caters to Trauma Orthopaedics and Emergency Surgeries.&lt;/p&gt;\n&lt;p&gt;Within the department, there are 21 Recovery Spaces, a Surgical Admission unit, a 16 bedded Ambulatory Surgical Hub and a central Preoperative Assessment Service.&lt;/p&gt;\n&lt;p&gt;We are amongst the top 3 hospitals in London with our theatre elective activity and have proudly resumed over 100% pre-Covid elective activity. This has been achieved through inspiration and motivated multi-disciplinary teamwork and changing our footprint within the hospital and all our ways of working to ensure patients have their elective surgery as soon and as safely as possible.&lt;/p&gt;\n&lt;p&gt;The successful candidates will be able to demonstrate that they can manage a dedicated team to deliver highest standard of care to our patients. Strong interpersonal communication skills are essential to work collaboratively with the team.&lt;/p&gt;\n&lt;p&gt;If you are looking to further your career or, the opportunity to expand your skills in a variety of settings, then working with our amazing multidisciplinary theatre team at Croydon University Hospital is the obvious next step in your career ladder!&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What can we offer you?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Based on the trust values, we want you to be professional and be the best you can be able to provide safe and compassionate care to our patients. We promise to support you in achieving your goals through our in-house training and tertiary study at our affiliated universities.&lt;/p&gt;\n&lt;p&gt;In addition to the training and support provided on a Trust level, we also have department practice educators who will support you to be a successful member of the dynamic team. This support will be provided whilst we develop your existing skills and knowledge in each aspects of the Perioperative environment to deliver clinical best practice within the theatre environment.&lt;/p&gt;\n&lt;p&gt;We are keen to receive applicants with a strong orthopaedic and anaesthetic background.&lt;/p&gt;\n&lt;p&gt;We also have the flexibility to offer those with dual skills e.g. scrub and anaesthetics roles.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Applicants must be Registered Nurses or ODPs who hold the appropriate post basic qualification or relevant theatre experience.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Previous applicants who have applied within the last 3 months, need not apply. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interested candidates are strongly invited to email Theatre Practice Educator Efua Hagan on efuahagan@nhs.net for further discussion of the opportunities at our high achievement hospital.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing date 16th November&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview Dates: Wednesday 2nd December and Thursday 21st January&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120967.PNG", "name": "Croydon Health Services NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120967"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Croydon University Hospital, Croydon", "postalCode": "CR7 7YE"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3891", "longitude": "-.108758"}}, "title": "Advanced Theatres  Practitioner - All Specialities", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243553", "validThrough": "2020-11-16T23:59:59+0000"}