{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "107668", "minValue": "79860", "unitText": "YEAR", "value": "£79,860 to £107,668 per annum"}}, "datePosted": "2020-11-02T14:01:28+0000", "description": "&lt;p&gt;&lt;strong&gt;Our multi-award winning stroke unit is looking to appoint a Consultant Stroke Physician with an option to pursue a special interest in another medical field.&lt;/strong&gt; &lt;br /&gt;&lt;br /&gt;Combining cutting edge technology with the best quality care, our stroke unit is a fantastic place to develop your career. Our clinicians are encouraged to develop their special interests, striving for high quality care and innovative development of services, in line with local and national agendas and targets. We have won 5 national awards in 5 years. This is an excellent opportunity for a new CCT-holder to experience consultant practice in a supportive environment, and to develop or bring experience to cutting edge medicine for the future. &lt;br /&gt;&lt;br /&gt;This post is permanent and required to commence as soon as possible with a job plan consisting of 10 PAs plus 1 additional programmed activity. However there is scope for altering the job plan to suit the right applicant while meeting service needs. Potential applicants are encouraged to discuss this with the Clinical Lead: we expect consultants to work with each other, the stroke service lead and the Clinical Director to adjust their job plan in line with the needs of the service and their own areas of particular expertise. &lt;br /&gt;&lt;br /&gt;Some of the Stroke department’s recent awards include ‘Centre of excellence healthcare analysis awards 2013: ‘Best use of Business Intelligence for improved patient outcomes’, Health Service Journal Awards (2013) ‘Secondary Care Service Redesign’ and the Winner Thames Stroke Research Network 2008-09, 2009-10, 2010-11 award for highest recruitment into randomised controlled trials.&lt;br /&gt;&lt;br /&gt;You could be building your future in one of the best locations in Britain. Southend is a vibrant seaside town offering a relaxed lifestyle, with a busy local airport and rapid and frequent transport links to London, the Essex countryside and beyond.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Dr Paul Guyler on (01702 433555) Ext: 6012&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121033.jpg", "name": "Mid and South Essex NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121033"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southend University Hospital NHS Foundation Trust, Westcliff-on-Sea", "postalCode": "SS0 0RY"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5538", "longitude": ".689123"}}, "title": "Consultant Stroke Physician", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252316", "validThrough": "2020-11-30T23:59:59+0000"}