{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890-£44,503 per annum"}}, "datePosted": "2020-11-03T14:47:16+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for a senior clinical pharmacist to join the surgical team at Nottingham University Hospitals (NUH) following career progression of the previous post-holder. The post will be predominantly based at the Queens Medical Centre (QMC).&lt;br /&gt;&lt;br /&gt;NUH provides a wide range of surgical services, providing you with the opportunity to target specialist knowledge you have already gained from previous experience OR to broaden your exposure to new clinical areas. There are numerous specialities at NUH within surgery including neurology/neurosurgery, ophthalmology, trauma, vascular and spinal.&lt;/p&gt;\n&lt;p&gt;After a period developing your specialist knowledge within these given areas, there may be the opportunity to apply for enrolment to an independent prescribing course, allowing you to proactively ensure medicines optimisation and enhance patient flow within specific clinical areas. &lt;br /&gt;&lt;br /&gt;The department have a well-established training and education team and both the hospital and pharmacy department have excellent links to the University of Nottingham undergraduate teaching programmes. You will be responsible for helping support the junior pharmacist as they rotate through the surgical teams at NUH. Additionally you will be able to directly support the development of, technicians, undergraduates and training grade medics within your areas. Once established there will be the opportunity to directly line manage within the department. You will be supported by the senior clinical pharmacists within the team including the divisional lead pharmacist for surgery.&lt;/p&gt;\n&lt;p&gt;We are looking for enthusiastic and proactive clinical pharmacists with a broad base in clinical pharmacy practice, excellent communication skills and a commitment to safe and compassionate direct patient care. You will have experience supporting medical and nursing staff in the clinical environment and challenging instances of suboptimal care.&lt;/p&gt;\n&lt;p&gt;The post offers exceptional career building opportunities in one of the UK’s largest and busiest acute NHS teaching hospital Trusts. You will have the opportunity to work as part of the dynamic and friendly pharmacy team of over 300 staff across the two campuses.&lt;br /&gt;&lt;br /&gt;We would be delighted to speak to you about the posts or to arrange an informal visit.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameMike HeyJob titleDivisional Lead Pharmacist-SurgeryEmail addressmichael.hey@nuh.nhs.ukTelephone number07812268532&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122234.jpg", "name": "Nottingham University Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122234"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Queens Medical Centre, Nottingham", "postalCode": "NG7 2UH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9435", "longitude": "-1.1858"}}, "title": "Senior Clinical Pharmacist- Surgery", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254418", "validThrough": "2020-11-15T23:59:59+0000"}