{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 to £44,503 pa"}}, "datePosted": "2020-10-13T09:25:18+0100", "description": "&lt;p&gt;&lt;strong&gt;Alder Hey Children’s NHS Foundation Trust&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Sonographer&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Band 7 1WTE (37.5hrs)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity exists for you to join our dedicated Ultrasound team, working in a clinical environment delivering high quality care, working as part of a multidisciplinary team.&lt;/p&gt;\n&lt;p&gt;Alder Hey moved into our iconic hospital in the Park in October 2015, and has become the UK’s first cognitive hospital. Working with the Science and Technology Facilities we are investing in a range of new cognitive computing technologies that will transform the way services are provided – delivering genuinely personalised care for patients.&lt;/p&gt;\n&lt;p&gt;If you would like to develop your skills in Paediatric Ultrasound and are adaptable, friendly and enthusiastic, we would love to hear from you.&lt;/p&gt;\n&lt;p&gt;Alder Hey Children’s NHS Foundation Trust is a major teaching hospital of the University of Liverpool and has been approved as a supra-regional centre for cardiac surgery, epilepsy surgery and major trauma amongst others. Alder Hey is one of Europe’s busiest children’s hospitals and we care for over 270,000 young people and their families every year.&lt;/p&gt;\n&lt;p&gt;We serve not only the local population of children, but we are the tertiary referral centre for children from Merseyside, Cheshire, parts of Lancashire, Shropshire and North Wales for many sub-specialties of paediatrics.&lt;/p&gt;\n&lt;p&gt;The hospital has approximately 270 beds including day beds for surgery. The paediatric services and expertise within the hospital are considerable and include paediatric ophthalmology, cardiology, cardio-thoracic surgery, neonatology, neurology, neurosurgery, audiology, nephrology, respiratory medicine, oncology, trauma, general surgery and general medicine. The radiology department provides all imaging modalities, including nuclear medicine, CT, MRI and intervention.&lt;/p&gt;\n&lt;p&gt;Part time may be considered&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120727.jpg", "name": "Alder Hey Children's NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120727"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Liverpool", "postalCode": "L12 2AP"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4213", "longitude": "-2.8978"}}, "title": "Ultrasonographer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916223580", "validThrough": "2020-11-10T23:59:59+0000"}