{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 pro rata"}}, "datePosted": "2020-11-06T08:12:49+0000", "description": "&lt;p&gt;We’re offering an opportunity to join an organisation that really does make a difference for people, help improve health services within our area and work with inspirational and professional people. Our vision to commission and enable the delivery of high quality patient centred healthcare is being achieved through our values of compassion, honesty, inclusivity, fairness and ambition.&lt;/p&gt;\n&lt;p&gt;We commission healthcare services for a population of over 550,000 people in West Hampshire. The health services we buy are provided by hospitals in Southampton, Bournemouth, Salisbury, Basingstoke, Portsmouth, Poole, Andover and Winchester, as well as within our local community. This includes rehabilitation care, emergency care, mental health and learning disability services and care for non-life threatening illnesses and injuries. In addition, we buy primary care services which are provided by our 49 GP surgeries. We also work closely with our partners in health and care services to deliver joint priorities to transform outcomes, improve satisfaction of patients and communities, and deliver financial sustainability.&lt;/p&gt;\n&lt;p&gt;We are an ambitious organisation with big plans for the health of local people and are looking for equally ambitious people to join us.&lt;/p&gt;\n&lt;p&gt;The CCG Medicines Optimisation (MO) team already consists of pharmacists and pharmacy technicians working in GP practices across west Hampshire to improve the care of patients by optimising the use of medicines.&lt;/p&gt;\n&lt;p&gt;West Hampshire Clinical Commissioning Group are looking for full or part-time registered senior Pharmacy Technicians to work within the Medicines Optimisation Team and help the CCG and GP practices promote safe and cost effective use of medicines and deliver the QIPP plan. &lt;br /&gt; &lt;br /&gt; If you would like to make up an important part of an exceptional team that has been working with practices for many years and has a great track record of innovation, delivery and development we want to hear from you.&lt;/p&gt;\n&lt;p&gt;The key roles of the job are:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To provide technical assistance and support to the Medicines Optimisation Team, practices, care homes and WH CCG.&lt;/li&gt;\n&lt;li&gt;To support the development of safe, high quality and cost effective prescribing.&lt;/li&gt;\n&lt;li&gt;To work with practices and the Medicines Optimisation Technicians and Pharmacists to identify specific pieces of work to be undertaken.&lt;/li&gt;\n&lt;li&gt;To facilitate the implementation of rational repeat prescribing strategies within GP practices and to use expertise in the area of GP computer systems.&lt;/li&gt;\n&lt;li&gt;To provide advice and training in changes to prescribing to GP practice staff.&lt;/li&gt;\n&lt;li&gt;To support the Medicines Optimisation Team in reducing waste of medicines.&lt;/li&gt;\n&lt;li&gt;To undertake reporting and analysis of prescribing information to support medicines optimisation initiatives.&lt;/li&gt;\n&lt;li&gt;To be responsible for implementing projects in practices, localities and care homes across WHCCG.&lt;/li&gt;\n&lt;li&gt;To line-manage, act as a mentor and provide support to the Medicines Optimisation Technicians (working with the pharmacists).&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We are able to offer excellent benefits for our staff including generous leave arrangements, free car parking, NHS pension scheme, local retail discounts, flexible working opportunities, training and development and a commitment to our own staff health and wellbeing, including access to an Employee Assistance Programme.&lt;/p&gt;\n&lt;p&gt;Successful candidates will be subject to a six-month probationary period.&lt;/p&gt;\n&lt;p&gt;Contact for informal discussion: Jess Gill, Senior MO Technician, 07557 499646&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NHS West Hampshire CCG", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128558"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Eastleigh", "postalCode": "SO50 5PB"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.9674", "longitude": "-1.35105"}}, "title": "Senior Medicines Optimisation Technician", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258857", "validThrough": "2020-11-20T23:59:59+0000"}