{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 per annum"}}, "datePosted": "2020-10-30T09:16:05+0000", "description": "&lt;p&gt;&lt;strong&gt;***This job advert will close as soon as sufficient applications have been received. Please apply for this job as soon as you can, if interested***&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking to recruit a number of Band 4 qualified Nurse Associates for Community Nursing to join Birmingham Community Healthcare NHS Foundation Trust. We are offering exciting opportunities in a range of settings, in our community nursing teams. Vacancies are across the city in all localities.&lt;/p&gt;\n&lt;p&gt;We are now supporting our second cohort of trainees for this new role within the Trust. We have supported training over the last 2 years and understand the role you have been prepared to fulfil. We welcome your clinical skills, holistic thinking and ability to collaborate with the wider multi-professional team to shape care for our patients. We are looking for a Nursing Associate that has a breadth of knowledge across the fields of nursing, providing holistic and person centred care and support for people of all ages in a variety of settings. The successful candidate will work independently under the leadership of registered nurses, working within the sphere of nursing.&lt;/p&gt;\n&lt;p&gt;Our Trust is able to offer opportunities across community nursing teams. We offer Career Clinics with our senior nurses to discuss training and development. You will be able to join our Preceptorship programme within the Trust and benefit from working with our clinical educators. We can offer you an excellent support network as we are training our own Nurse Associates of the future. Our Trust also actively promotes development and we have a scheme that enables our staff to move internally to facilitate professional development&lt;/p&gt;\n&lt;p&gt;If you are considering a career outside of the hospital environment then you may opt for a community nursing team. This is a fast paced service with significant demand, we need Nursing Associates who can think independently, make decisions and bridge our Health Care Assistants and Registered Nurses. No two days will be the same, the service is unpredictable and demand is constant. You will be working independently in people’s own homes and clinic settings delivering care planned and evaluated by our Registered Nurses. You need be confident in your own decision making and ready to make a difference in this new role. You will need to be able to drive. These posts will work shifts between 8am and 6pm across 7 days to cover the needs of the service on a rostered basis, however flexible working will be considered. We are happy to consider part time or full time positions.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;IMPORTANT&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Please ensure you check your Trac account regularly as this is how we will communicate with you during the shortlisting and selection process.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Please ensure all sections of the application form are completed fully. Please particularly ensure that you provide full details of all referees including business email address, telephone contact details and postal address.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Please be aware that BCHC utilises a third party recruitment system (TRAC). When applying via NHS Jobs, your submitted application will be imported into TRAC and any correspondence will be sent via TRAC. We advise that you check your junk/spam emails.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Be Part of Our Team...&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Birmingham Community Healthcare NHS Foundation Trust (BCHC) has more than 5000 staff working across Birmingham and the West Midlands in a wide range of community nursing and specialist healthcare roles. BCHC delivers over 100 clinical services, in people&#39;s homes, health centres, clinics and inpatient facilities. We deliver a wide range of services for children, young people, parents and families as well as adults and community services, two community hospitals, services for people with learning disabilities, the internationally recognised West Midlands Rehabilitation Centre and one of Europe’s leading Dental Hospitals and School of Dentistry. We deliver all of this with a commitment to integrated, personalised care that is rooted in our local communities. We have an ambition to deliver outstanding, integrated care as one of the key NHS providers in the West Midlands.&lt;/p&gt;\n&lt;p&gt;If you want to ‘Be Part of Our Team’ and work with a Foundation Trust which is continuously striving for best care and healthy communities, we want to hear from you.&lt;/p&gt;\n&lt;p&gt;Birmingham Community Healthcare NHS Foundation Trust is committed to providing a safe working environment for all staff.&lt;/p&gt;\n&lt;p&gt;As part of the Trust’s on-going response to the management of COVID-19 secure workplaces, strict health and safety measures and infection prevention and control has been put into place. As with any healthcare setting that cares for patients, we are and remain committed to ensure that we adhere to nationally mandated infection prevention and control policies and practices, alongside the appropriate training to ensure we protect all our staff, visitors and patients and minimise/eliminate risk in line with NHS Health Governance standards. The Recruitment programmes we are undertaking are in accordance with these measures to ensure the safety of all candidates. We are committed to protecting our staff and services users from infection and encourage our staff to uptake their annual flu vaccination.&lt;/p&gt;\n&lt;p&gt;As a Trust, we offer and encourage staff to complete either a Black and Minority Ethnic (BME) risk assessments, regular COVID-19 risk assessments and/or working at home risk assessments to identify additional support measures or reasonable adjustments that may be required as appropriate. We encourage all staff to ensure they benefit from the various support measures which have been put into place which help us to support and protect our staff, visitors and patients to provide the Best Care in Healthy Communities.&lt;/p&gt;\n&lt;p&gt;These measures are within the provisions of Health and Safety and are in line with the Trust’s expectation that all staff will com&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/125654.jpg", "name": "Birmingham Community Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=125654"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Birmingham Community Healthcare Foundation Trust, Birmingham", "postalCode": "B7 4BN"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4873", "longitude": "-1.88581"}}, "title": "Band 4 Nurse Associate", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249450", "validThrough": "2020-11-13T23:59:59+0000"}