{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum + outer London HCAS"}}, "datePosted": "2020-10-28T18:00:24+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for a forward thinking and motivated occupational therapist/nurse to work within the Substance Misuse Team at North London Forensic Service (NLFS) which is part of Barnet, Enfield and Haringey Mental Health Trust. The post is based within Chase Farm hospital providing assessment, treatment and consultation for service users with a dual diagnosis. The service caters for individuals from across NLFS, and is an innovative service, run as a collaborative multi-disciplinary team with both inpatient and community services.&lt;/p&gt;\n&lt;p&gt;In addition to contributing to the intervention team and the therapy programme, the role involves working alongside multiple agencies in and outside of NLFS establishment. You will be expected to have skills in engaging service users with complex presentations and will have experience working alongside colleagues from different disciplines.&lt;/p&gt;\n&lt;p&gt;This post will be responsible for providing/supporting a dynamic graded group programme and individual therapy that is responsive to the needs of service user’s. You will need to be a visible and positive presence within the service and wider community services, and will be responsive and supportive to the needs of each person using the service.&lt;/p&gt;\n&lt;p&gt;The successful candidate would ideally start as soon as possible following interview, successful employment checks and vetting.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Dawn King&lt;/p&gt;\n&lt;p&gt;Email address: dawn.king10@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number: 02087026041&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Barnet Enfield and Haringey Mental Health Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120621"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Enfield - Substance Misuse", "postalCode": "EN2 8JL"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6663", "longitude": "-.103613"}}, "title": "Substance Misuse Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247518", "validThrough": "2020-11-11T23:59:59+0000"}