{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "40000", "minValue": "30000", "unitText": "YEAR", "value": "£30,000 - £40,000 per annum (DOE)"}}, "datePosted": "2020-09-28T16:28:01+0100", "description": "&lt;p&gt;Nuffield Health is Britain’s largest not-for-profit healthcare organisation. Join us as a Sister / Charge Nurse in our Newcastle Hospital and play your part in building a healthier nation.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Nuffield Health Newcastle Hospital&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Join our team at Newcastle upon Tyne Hospital, located in Jesmond; you will be working at one of the north easts leading private hospitals, with a Good CQC rating, we have 27 en-suite private bedrooms, 3 state-of-the-art operating theatres, a dedicated breast care unit.  We offer on-site pathology services and diagnostic imaging including CT and MRI, to help patients after surgery we have on-site physiotherapy specialists.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We have a special focus in the areas of orthopaedics, spinal surgery, ophthalmology, weight loss surgery and cosmetic treatment.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We pride ourselves on delivering patient care of the highest standard. That’s why we are looking for the very best healthcare professionals to join our team.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;In this role you will be expected to work on the multi-disciplinary surgical ward. A full induction will be offered to all staff to ensure that you feel supported and set up for success in your new role.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;At Nuffield Health, you will discover nursing as it should be. You will have more time to care and get to know the people who are your patients, as you help them through difficult times. As a Sister / Charge Nurse, you will be responsible for ensuring the highest standards of care are provided and;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Deliver high standards of quality care by assessment at all times, evaluation and implementation of patient needs&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Accepting delegated responsibilities from the Ward Manager and support in the efficient running of the ward.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Expected to be part of the Hospital’s Clinical On-Call rota.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;You will participate through mentorship in the orientation and development of junior staff.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;You will support on going education of existing staff encouraging further development of existing skills&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Have the privilege of working directly with consultants, who are experts in their field.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Use your knowledge and skills in assessment, care planning and delivery to make a valuable contribution to the patient’s experience.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Provide commitment to creating a supportive and enabling working culture on the ward, which promotes patient staff and safety.&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Person&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;To succeed as a Sister / Charge Nurse you will have;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;A wide range of nursing skills and knowledge, including care of patients pre and post operatively, following a wide range of surgical procedures. For example, Cardiac, Colorectal, Orthopaedic, Day-care, Plastics, ENT, Gynea, Urology and more.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Excellent communication skills and an enthusiastic, forward thinking approach.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;As much confidence working independently, as you do as part of a team.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Excellent leadership and ward management skills – including a commitment to role modelling good practice and developing staff members.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;You will be a qualified RGN with a valid NMC registration. A mentor qualification or equivalent is essential and a Degree would be desirable and utilised in this role.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;You will also have excellent knowledge / recent experience within a surgical setting and be able to evidence CPD, as well as having of the NMC code of conduct.&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Benefits&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We want you to be the best you can be. We promise that we will support you with training opportunities, career development options and our unique health &amp; wellbeing focused benefits package. This includes free membership across all of our Fitness &amp; Wellbeing clubs, along with free private healthcare. Not only this, but we also offer a range of lifestyle and financial wellbeing benefits.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Be your best and join us in building a healthier nation.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary - £30,000 - £40,000 per annum (dependant on experience)&lt;br /&gt;Closing date - 20/11/2020&lt;br /&gt;Location - Newcastle Upon Tyne&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Contract Type - Permanent&lt;br /&gt;Hours - 37.5 hours on a weekly basis, some shift work and weekends will be required&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Applications will be considered as they are received and interviews will be arranged accordingly. We reserve the right to close adverts early, for example, where we have received an unprecedented high volume of applications. Therefore please apply early to ensure you are considered for the post. &lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/132134.jpg", "name": "Nuffield Health", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132134"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Newcastle", "postalCode": "NE2 1JP"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.9874", "longitude": "-1.60492"}}, "title": "Sister - Charge Nurse (RGN)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916203415", "validThrough": "2020-11-20T23:59:59+0000"}