{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "38694", "minValue": "38694", "unitText": "YEAR", "value": "£38,694 per annum"}}, "datePosted": "2020-11-03T11:30:25+0000", "description": "&lt;p&gt;Ready for a unique work opportunity? Want to put your medical skills to the challenge, whilst providing humanitarian support? Looking to join a team that understands that working flexibly is the way forward?&lt;/p&gt;\n&lt;p&gt;Portsmouth Hospitals Emergency Department are ready to offer you something totally different – we are looking to recruit Clinical Fellows, working with both the Trust and sustainable development organisation Raleigh International on a voluntary expedition as a medic (subject to successful acceptance by Raleigh – please note there is separate application process for this).&lt;/p&gt;\n&lt;p&gt;Successful candidates would have an up to 3 month paid break to undertake and expedition with Raleigh International, in Costa Rica, Nepal, Tanzania or Nicaragua. The rest of their time would be spent working in the Trust’s Emergency Department as a doctor.&lt;/p&gt;\n&lt;p&gt;Alternatively you can decide on a range of other sub-specialisms to work upon including topics such as tropical medicine, sports science or anaesthetics. Providing yourself with a solid foundation to springboard your medical career.&lt;/p&gt;\n&lt;p&gt;We are proud of the diverse and varied department we have built at Portsmouth. We know that the way we work is ever evolving, and we support our staff to find the perfect pathway for them.&lt;/p&gt;\n&lt;p&gt;These roles would suit any Core Level (F3- ST3) medic with GMC registration, ready to work differently with a focus on getting it right for our patients every time. Investment in our people is what ensures we provide nothing less than clinical excellence.&lt;/p&gt;\n&lt;p&gt;This isa great time to join our team - Emergency Medicine is at the heart of the hospitals emergency care pathway and has recently been award £58 million from the Department of Health to develop and innovate the delivery of Unscheduled Care across the Trust. The department is led by a highly motivated group of Consultants who provide high quality care, support junior doctors as well as driving change.&lt;/p&gt;\n&lt;p&gt;To find out more about the opportunities on offer please email Matthew Rouse, ED Business Manager on matthew.rouse@porthosp.nhs.uk&lt;/p&gt;\n&lt;p&gt;Closing Date 18/11/2020&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120645.png", "name": "Portsmouth Hospitals University NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120645"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Portsmouth", "postalCode": "PO6 3LY"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8502", "longitude": "-1.06936"}}, "title": "Innovative Clinical Fellow (ST3 Equivalent)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253720", "validThrough": "2020-11-18T23:59:59+0000"}