{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum pro rata"}}, "datePosted": "2020-10-05T13:28:56+0100", "description": "&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Community Staff Nurse – Luton Community Services&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Band: &lt;/strong&gt;&lt;strong&gt;5&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary: &lt;/strong&gt;£24,907 - £30,615&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours: &lt;/strong&gt;&lt;strong&gt;Full Time / Part Time available (For part time posts salary will be pro rata.)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Contract Type:&lt;/strong&gt; Permanent&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Department:&lt;/strong&gt; District Nursing&lt;br /&gt; &lt;strong&gt;Base:&lt;/strong&gt; The Poynt, Luton&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are currently looking for motivated, proactive staff nurses to support the D.N teams in order to meet the health needs of patients in Luton.&lt;/p&gt;\n&lt;p&gt;CCS Luton Community Nursing has transformed its Community Nursing Services through the development of cluster working, dividing planned and unplanned care, triaging of referrals and through the introduction of a Single Point of Access (SPA).We are now entering a new phase of transformation and innovative partnerships with local Primary, Secondary and Social Care organisations. We provide a comprehensive 24 hour a day service.&lt;/p&gt;\n&lt;p&gt;This is an ideal opportunity for staff nurses to develop their skills within the community setting providing holistic care to housebound patients.&lt;/p&gt;\n&lt;p&gt;You will need to be adaptable to overcoming challenges and ensuring that the patients receive the evidence based nursing care they require and further refer onto other services that are identified to be appropriate. Supporting other colleagues and embracing service development is fundamental to the role.&lt;/p&gt;\n&lt;p&gt;Experience of working in Luton would be an advantage although full induction and training will be given in line with service need.&lt;/p&gt;\n&lt;p&gt;Luton has good transport links to the M1 and M25 and the London Luton Airport. In conjunction with Luton Borough Council, parking permits are available for staff to use in and around Luton.&lt;/p&gt;\n&lt;p&gt;Due to the nature of the role it is essential that applicants are able to travel effectively and independently on a daily basis to and from the base, clients’ homes and other venues around the geographical area whilst transporting equipment. If necessary, adjustments can be considered, in accordance with the Disability Discrimination Act.&lt;/p&gt;\n&lt;p&gt;For further information please contact Lisa Parrish Service Manager - 07880 600293&lt;/p&gt;\n&lt;p&gt;Successful applicants to posts at band 6 or above for which a DBS check is required, will be asked to pay for this as a condition of their job offer (£44 for an Enhanced Check or £27 for a Standard Check). This payment will be deducted from their first month’s salary unless a longer pay back period is agreed with the appointing manager.&lt;/p&gt;\n&lt;p&gt;This will not apply to successful applicants who are registered with the DBS Update Service and is in possession of the disclosure certificate, for whom an online status check will be undertaken.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/125234.png", "name": "Cambridgeshire Community Services NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=125234"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Poynt, Luton", "postalCode": "LU4 0LA"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.8927", "longitude": "-.487287"}}, "title": "Community Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916212900", "validThrough": "2020-11-30T23:59:59+0000"}