{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 p.a., pro rata for part time"}}, "datePosted": "2020-10-23T13:01:14+0100", "description": "&lt;p&gt;&lt;strong&gt;Liaison Psychiatry Service&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;A fantastic opportunity has arisen for highly motivated and dynamic Team Leader to join our Liaison Psychiatry Service. The post is based at Dorset County Hospital.&lt;/p&gt;\n&lt;p&gt;You will be responsible to operationally manage the Dorset Hospital Liaison Psychiatry Service, supporting the Matron in developing a service which includes individuals of all ages in line with the Core 24 model.&lt;/p&gt;\n&lt;p&gt;The service offers assessment and support of patients across the age span, referred from a variety of sources including the Emergency Department, Paediatrics and wards within the hospital. Patients seen may present with mental health problems, self-harm, a psychiatric crisis or presenting with a psychosomatic disorder as well as a variety of psychological issues relating to physical disorders.&lt;/p&gt;\n&lt;p&gt;You will have the ability to make clear autonomous decisions based on analysis of complex presenting problems and judgement of available options is essential. This will include those relating to the admission and discharge of patients.&lt;/p&gt;\n&lt;p&gt;The services strive for clinical excellence and are working towards accreditation with the Royal College Psychiatrists Psychiatric Liaison Accreditation Network.&lt;/p&gt;\n&lt;p&gt;The post is full-time of 37.5 hours a week, but this is negotiable and flexible working requests or part time hours will always be considered.&lt;/p&gt;\n&lt;p&gt;We are proud to say that you will be joining Dorset Healthcare University NHS Foundation Trust who has recently been awarded “Outstanding” by the Clinical Quality Commission.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We also offer;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;You will receive a comprehensive and structured induction programme and training&lt;/li&gt;\n&lt;li&gt;Monthly pay plus enhancements for night, weekend and bank holiday working&lt;/li&gt;\n&lt;li&gt;NHS Pension scheme&lt;/li&gt;\n&lt;li&gt;Health &amp; Wellbeing service&lt;/li&gt;\n&lt;li&gt;Holiday pay of up to 33 days, plus bank holidays pro rata, dependent on service&lt;/li&gt;\n&lt;li&gt;NHS discounts&lt;/li&gt;\n&lt;li&gt;Salary sacrifice scheme including work related learning, childcare vouchers, cars, cycles, home technology equipment and buying and selling of annual leave&lt;/li&gt;\n&lt;li&gt;Not forgetting our unique selling point – our Trust beach huts located along the famous Sandbanks coastline.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Employment in this post requires an Enhanced Disclosure and Barring Service (DBS) check. The DBS levies a charge of £40 and the Trust will recover this cost in instalments from your first 3 salary payments. This will only apply to candidates who are new to the Trust and not internal staff.&lt;/p&gt;\n&lt;p&gt;Applicants who subscribe to the DBS update service and are able to present a valid DBS certificate will not incur a charge.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please view the attached &lt;em&gt;&#39;Job Description&#39;&lt;/em&gt; and &lt;em&gt;&#39;Person Specification&#39;&lt;/em&gt; for full information on this vacancy.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Natasha Deeney, Matron - Liaison Psychiatry DCH - Email: natasha.deeney@nhs.net Telephone: 01305254693&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121022.png", "name": "Dorset HealthCare University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121022"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Dorchester", "postalCode": "DT1 2JY"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7135", "longitude": "-2.44712"}}, "title": "Team Leader Liaison Psychiatry, Band 7", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240643", "validThrough": "2020-11-08T23:59:59+0000"}