{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37179", "minValue": "37179", "unitText": "YEAR", "value": "£37,179 per annum"}}, "datePosted": "2020-10-23T09:00:13+0100", "description": "&lt;p&gt;Are you a Registered Staff Nurse from the NHS or Private care looking for a new opportunity to work in an organisation that will help to develop you to achieve your goals to become the best you can be? If so, join the team at Ann House as a Clinical Lead Nurse.&lt;/p&gt;\n&lt;p&gt;Your career within Elysium will be enjoyable and rewarding as you develop specialist skills and make a real difference for some of the most vulnerable people in society.&lt;/p&gt;\n&lt;p&gt;It’s a career that you can take pride in and enjoy. It’s what delivering great healthcare should feel like.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What you will be doing&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Are you a highly experienced Senior Registered Staff nurse RNLD or RMN looking to propel your career to the next level?  &lt;/p&gt;\n&lt;p&gt;As you work alongside the Ann House team, you will provide exceptional support and care to people (Adults 18+) with learning disability. You will be working in an environment where there is an emphasis in team work. You will provide operational leadership in the delivery of highest quality nursing services.&lt;/p&gt;\n&lt;p&gt;No two days are the same, with plenty to keep you engaged and motivated, but also a good amount of routine. &lt;/p&gt;\n&lt;p&gt;You will have access to the Elysium Wellbeing team, which is on hand to keep you feeling great; be it a chat, massage or group activities. Who doesn’t like a free massage at work?&lt;/p&gt;\n&lt;p&gt;There are also career development opportunities, with a huge range of courses that will help you grow and succeed. If you have the aspiration, capability and dedication, we can give you the support and opportunities to help you achieve your career goals.&lt;/p&gt;\n&lt;p&gt;Things that you will have:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A relevant nursing qualification and registration with several years’ post qualification experience&lt;/li&gt;\n&lt;li&gt;Maintain high profile leadership in all areas inclusive of clinical governance as they impact on the nursing department and the running of the service&lt;/li&gt;\n&lt;li&gt;Strong clinical nursing skills&lt;/li&gt;\n&lt;li&gt;Strong team-working skills&lt;/li&gt;\n&lt;li&gt;A high level of self-motivation and a flexible approach&lt;/li&gt;\n&lt;li&gt;A positive attitude and be naturally caring and compassionate&lt;/li&gt;\n&lt;li&gt;A commitment to high-quality care and to values and evidence-based practice&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The service operates 24/7. You will work shift patterns including weekends, bank holidays and nights. Standard shifts are 12 hours a day, working 3 days one week, 4 days the next.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Where you will be working&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;Location&lt;/strong&gt;: Ann Street, Kendal, Cumbria, LA9 6AA&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will be working at Ann House, a Learning Disability and Autism service which provides care and support to 16 adults who have a learning disability and/or mental health needs.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Ann House provides a specialist provision with enhanced levels of support which allows people with continuing challenging behaviour and high support needs to be cared for in the least restrictive setting possible, but within a service which is robust and structured enough to meet their ongoing needs and risks.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will be working alongside a multidisciplinary team to ensure people lead good and meaningful everyday lives, where they have choice and control, accessing mainstream services and facilities, engaging in work and training, in leisure opportunities, hobbies and areas of personal interest. Ann House encourages people to be as independent as possible with the long-term aim of people moving onto a more independent living setting.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What you will get&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Salary of £37,179 per annum &lt;/li&gt;\n&lt;li&gt;The equivalent of 33 days annual leave – plus your birthday off!&lt;/li&gt;\n&lt;li&gt;Free meals and parking&lt;/li&gt;\n&lt;li&gt;Wellbeing support and activities&lt;/li&gt;\n&lt;li&gt;Career development and training&lt;/li&gt;\n&lt;li&gt;Pension contribution&lt;/li&gt;\n&lt;li&gt;Life Assurance&lt;/li&gt;\n&lt;li&gt;Enhanced Maternity Package&lt;/li&gt;\n&lt;li&gt;Flexible working opportunities&lt;/li&gt;\n&lt;li&gt;2 week paid induction&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;There is also a range of other benefits including retail discounts and special offers, car leasing without a credit check, holiday financing and much more.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About your next employer&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will be working for an established, stable and agile company with a unique approach to the delivery of care. &lt;/p&gt;\n&lt;p&gt;Each and every employee is valued and supported, as everyone has an important role to play in the success of Elysium. It is only with the dedication, passion and hard work from staff that excellent care programs that truly benefit the service users can be delivered.&lt;/p&gt;\n&lt;p&gt;With a network of over 70 services across England and Wales, providing four services including: Mental Health, Neurological, Learning Disabilities &amp; Autism, Children &amp; Education, there is opportunity for you to grow and move with Elysium.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Elysium Healthcare", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133794"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Kendal", "postalCode": "LA9 6AA"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.3308", "longitude": "-2.73884"}}, "title": "Clinical Lead Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916239739", "validThrough": "2020-11-30T23:59:59+0000"}