{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "32146", "minValue": "26152", "unitText": "YEAR", "value": "£26,152 - £32,146 Per Annum Inc HCAS"}}, "datePosted": "2020-10-28T12:01:00+0000", "description": "&lt;p&gt;Welcome to Frimley Health NHS Foundation Trust – one of the country’s largest, most respected and welcoming NHS Trusts! Our focus on clinical excellence mean we are the perfect place to progress as a professional. Our friendly, supportive, open culture makes this a special setting to deliver great patient care so if you are a passionate, patient focused Anaesthetics Nurse or ODP looking for a role where you are supported to develop and growth your career then this is the place for you. &lt;br /&gt;&lt;br /&gt;Our Theatres department covers a wide range of specialities including robotic surgery and advanced laparoscopic surgery both in general and gynaecological surgery, and the Anaesthetic team provide a service to other areas of the Trust including ED, endoscopy, cardiology and X ray department. So, whether you are experienced practitioner or a final year student due to qualify we would love to hear from you! &lt;br /&gt;&lt;br /&gt;Using your experience and anaesthetics qualification you will be a key member of the pre-operative team ensuring that the patient receives excellence standards of care. You will be confident in supporting the Anaesthetist and preparing a range of surgical devices, communicating to the wider Theatres team and putting the patient at the heart of everything that you do. You will be driven to ensure the standards of care you deliver are effective, current and evidenced-based and enjoy working with your team to ensure the smooth running of the department. &lt;br /&gt;&lt;br /&gt;You will be supported with a comprehensive Trust induction when you join us, and for our Newly Qualified Practitioners we offer a 12 month bespoke preceptor ship programme with 14 days protected study days designed to teach and develop our practitioners to the very highest standard. We are committed to the on-going professional development for our staff and offer support from your on-boarding process through to offering in-house and university courses, and promote multiskilling into scrub, for Practitioners who wish to do so. We have a dedicated practice development team along with supportive management to assist you in growing your career.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121099.png", "name": "Frimley Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121099"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Frimley, Frimley", "postalCode": "GU16 7UJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3197", "longitude": "-.741538"}}, "title": "Anaesthetic Nurse/ ODP", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246469", "validThrough": "2020-11-11T23:59:59+0000"}