{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44780", "minValue": "37638", "unitText": "YEAR", "value": "£37,638 - £44,780 per annum inclusive"}}, "datePosted": "2020-10-28T18:15:31+0000", "description": "&lt;p&gt;&lt;strong&gt;UCLH – Band 6 Critical Care Senior Staff Nurse&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;2020 is the Year of the Nurse – so why not make it your year by kick-starting it with a career in critical care nursing at UCLH where a fantastic journey and exciting opportunities await you.&lt;/p&gt;\n&lt;p&gt;Start you leadership journey as a band 6 Senior Staff Nurse on Critical Care at UCLH. We don’t just want you to come here and work, we want you to stay here long term. So, if you are hardworking, ambitious, motivated, compassionate and really care about excellence for patients and staff, come and join our team, develop yourself, and make a real difference.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Who are we?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We have 3 critical care units on 3 sites: University College Hospital (UCH) is a general unit with 35 beds taking patients from our busy emergency department, after major surgery and from the wards, as well as tertiary referrals from across the UK and abroad. UCH at Westmoreland Street has 9 beds and takes mostly high risk, complex surgical patients. Then, from October 2020, we will be opening our new state-of-the-art cancer facility which has 10 beds primarily taking haematology patients.&lt;/p&gt;\n&lt;p&gt;A recent peer review described us as “clearly a standard setting unit with … excellence” that “other units would benefit from”. National audits show that we have some of the best outcomes in the country, and, within the Trust, the Unit gained Exemplar Ward status sooner than any other department. Our research programme and quality improvement initiatives are nationally leading, and many of our nurses have been finalists or have won awards at the Trust Excellence Awards.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Why work with us?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We recognise that our staff are our most precious resource and we are committed to you reaching your potential by offering a structured development and education pathway. We have an experienced, well-resourced practice development and education team and your development and learning will be supported by your allocated team of mentors, team leaders and line manager.&lt;/p&gt;\n&lt;p&gt;Our Band 6 pathway looks like this:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A 4 week supernumerary period (includes induction)&lt;/li&gt;\n&lt;li&gt;Progression through the nationally recognised ‘ Critical Care Steps’ Competency Framework&lt;/li&gt;\n&lt;li&gt;Rotations across all 3 CCUs&lt;/li&gt;\n&lt;li&gt;In-house leadership development course&lt;/li&gt;\n&lt;li&gt;Access to Quality Improvement training and project work&lt;/li&gt;\n&lt;li&gt;Access to completing your MSc/BSc&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Your future career&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Choosing a career in critical care nursing will open many doors for you. We will invest in your future development and this could lead you into exciting roles within critical care such as Charge Nurse, Senior Nurse, Matron, Education Team Sister or Advanced Critical Care Practitioner. We also work very closely with the Patient Emergency Response &amp; Resuscitation Team (critical care outreach) where our nurses can further develop their skills.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please make sure you are available on the following assessment day:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Assessment date: TBC&lt;br /&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Ward Sister Kylie Bunting via email at: kylie.bunting@nhs.net&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University College London Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120731"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "University College London Hospitals NHS Foundation Trust (UCLH), London", "postalCode": "NW1 2PG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5257", "longitude": "-.13737"}}, "title": "Senior Staff Nurse - Critical Care", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247530", "validThrough": "2020-11-11T23:59:59+0000"}