{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Please See Job Description"}}, "datePosted": "2020-10-23T12:50:53+0100", "description": "&lt;p&gt;&lt;strong&gt;Southern Health NHS Foundation Trust- Care Support Worker Development (CSWD) Programme&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Looking to kickstart a career with the NHS? &lt;strong&gt;Want to get paid during your placement? Want to work towards achieving a Care Certificate?&lt;/strong&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is fantastic opportunity to work at &lt;strong&gt;Southern Health NHS Foundation Trust &lt;/strong&gt;at &lt;strong&gt;Elmwood Ward, Parklands Hospital, Basingstoke.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Elmwood Ward is an 18-bed ward providing care for older people who have organic mental health needs and are unable to look after themselves or be looked after at home. Some patients have early onset dementia. The ward has its own garden and seating area for patients and visitors and there is a sensory room to help improve cognitive functioning&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Our Care Support Worker Development (CSWD) programme is your point of entry into the NHS. We offer a unique opportunity to learn on the job. You do not need any previous experience in healthcare or to have worked as a carer previously. Completing this programme will help you build and develop the key skills and gain the qualifications required to become a Care Support Worker (CSW), all whilst receiving weekly pay, paid annual leave and all the other great benefits NHS Professionals offers our bank members. Once you have successfully completed the programme you will be able to work flexibly at any of our partner Trusts.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please note thisrole is NOT suitable for:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Students.&lt;/li&gt;\n&lt;li&gt;Candidates under the age of 18 or not turning 18 before the planned classroom training week.&lt;/li&gt;\n&lt;li&gt;Candidates who have prior qualifications or clinical experience.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;What the programme involves …&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;During our programme you will learn how to help to maintain a safe care environment in the ward/department, supporting with infection control, providing care, safety and welfare for patients, visitors and other staff. You will work as part of the healthcare team, supporting registered nurses and other healthcare practitioners.&lt;/p&gt;\n&lt;p&gt;You will work part of the healthcare team, helping registered nurses and other healthcare practitioners in the work associated, typical duties will involve:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To observe report and record changes in the clients physical, mental health and behaviour&lt;/li&gt;\n&lt;li&gt;To provide care for people who use our services as planned in Multi – disciplinary Team (MDT) meetings&lt;/li&gt;\n&lt;li&gt;To be aware of and work to the principles of the Mental Health Act (MHA)&lt;/li&gt;\n&lt;li&gt;To give and receive clear messages by telephone and or personal contact&lt;/li&gt;\n&lt;li&gt;To provide the necessary physical care to people who use our services to help them complete daily living activities i.e. personal hygiene, diet and fluid intake, clothing and laundry, personal environment, elimination, maintaining rest and sleep and activity, physical observations&lt;/li&gt;\n&lt;li&gt;To act in a manner to respect the customs, individuality, values, sexuality and spiritual beliefs, activity, supporting the individual to fulfil these&lt;/li&gt;\n&lt;li&gt;To provide social activities, emotional support and stability people who use our services to ensure effective engagement whilst maintaining professional boundaries&lt;/li&gt;\n&lt;li&gt;To contribute in the assessment, planning, implementation and evaluating care&lt;/li&gt;\n&lt;li&gt;To create and maintain professional supportive relationships with all members of staff with other professionals and agencies to enhance recovery&lt;/li&gt;\n&lt;li&gt;To provide escort duties to people who use our services under the direction of the nurse in charge.&lt;/li&gt;\n&lt;li&gt;To carry out observations as per individual care plans, client needs, in line with HPT Trust Policy&lt;/li&gt;\n&lt;li&gt;To participate in where required co-facilitate in therapeutic and social engagement group work.&lt;/li&gt;\n&lt;li&gt;To undertake prescribed physical l observations as follows: blood pressure, temperature, pulse, respirations, blood sugars, urinalysis, weight and height and report results to the nurse in charge&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;What’s next? &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Attendance of Assessment Day&lt;/strong&gt; – Planned for 9th Decemer 2020 in Southampton&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Attendance of FREE classroom training&lt;/strong&gt;–&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Planned 6 day training for 11th - 16th January 2021&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Attend an Induction week: &lt;/strong&gt;37.5 hours supervised placements, paid at £8.72 – February2021 (Dependant on the completion of your pre-employment Checks)&lt;/p&gt;\n&lt;p&gt;On successful completion, you will be placed on a 6 month shift rota.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Once you have completed the programme &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Once you have completed your development period, you take a knowledge-based assessment on the Care Certificate 15 Standards, once passed, you can work as a CSW for the Trust at any of their locations, and at any of NHS Professionals partner Trusts, through the bank. Being a bank member with NHS Professionals means you will receive the following benefits:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Competitive Pay Rates&lt;/strong&gt; - work this week, get paid next week!&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;First choice of shifts&lt;/strong&gt;– Access to shifts before they are available to agency&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Flexible working to suit your lifestyle&lt;/strong&gt; – Take control of when you want to work.&lt;/li&gt;\n&lt;li&gt;Build Annual Leave with every shift you work&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Book and manage your shifts on the go&lt;/strong&gt; – Access shifts anywhere, anytime, online or through your smartphone&lt;/li&gt;\n&lt;li&gt;Stakeholder pension scheme&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Hours:&lt;/strong&gt; 30 hours per week for 6 months (earlies, lates and nights pro rata) - If needed, specify shifts or typical office hours (Depending of trust requirements)&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary: &lt;/strong&gt;Days: £8.72 Saturdays/Nights: £12.46 Sunday/Bank Hols: £16.13&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We look forward to meeting you.&lt;/strong&gt;&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "NHS Professionals - Flexible Workers", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121069"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Basingstoke", "postalCode": "RG24 9RH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2827", "longitude": "-1.11187"}}, "title": "Trainee Care Support Worker Development", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240594", "validThrough": "2020-11-29T23:59:59+0000"}