{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Dependant on experience"}}, "datePosted": "2020-11-03T08:45:52+0000", "description": "&lt;p&gt;Are you a Band 5 nurse? Why not make a great decision, come and join our fantastic team of nurses and be part of a centre of excellence with an international reputation and a commitment to developing your nursing career.&lt;/p&gt;\n&lt;p&gt;Our nurses work across all inpatient, outpatient and day care at our hospitals which are based in Chelsea, London and Sutton in Surrey. Both have easy transport links and a staff shuttle which runs from Sutton station to the Sutton hospital and an inter-site shuttle that run every day.&lt;/p&gt;\n&lt;p&gt;Here are a few reasons you should join us;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;We&#39;re outstanding again! &lt;/strong&gt;–The CQC has rated The Royal Marsden as &#39;Outstanding&#39; in four of our five domains - effective, caring, responsive and well-led.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Our quality of care&lt;/strong&gt;– we have an overall patient experience rating of 9.1/10, ranked 3rd in England &amp; the top specialist cancer trust (Care Quality Commission Adult Inpatient Survey 2018)&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Our commitment to our nurses&lt;/strong&gt;– we provide our nurses with the training, support and staffing levels that enable them to provide the best care to patients&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Our breadth of nursing roles&lt;/strong&gt;– our nurses work across all aspects of nursing, including general oncology, critical care, theatres, ambulatory care, paediatrics, haematology and private care.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Our international leadership&lt;/strong&gt;– from establishing the first worldwide Clinical Nurse Specialist roles to &lt;em&gt;The Royal Marsden Manual of Clinical Nursing Procedures&lt;/em&gt; - the go-to reference for nurses worldwide - The Royal Marsden has been at the forefront of innovation in nursing for decades.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Development Opportunities &lt;/strong&gt;– we offer a broad range of learning and development opportunities including the Critical Care Course for which 60 credits are awarded. Access to our leading education specialists at The Royal Marsden School as well as being affiliated to Kingston and St Georges London University.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Reward &amp; Benefits &lt;/strong&gt;– generous Staff Benefits and Rewards programme, such as flexible working, season ticket loan, cycle to work and car lease schemes, discounted gym membership, weekly yoga and fitness sessions, massage, osteopathy and many more.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Preceptorship Programme &lt;/strong&gt;– we offer a 12 month Preceptorship programme as we recognise the transition from student to registered practitioner can be a challenging time. We will guide you through this process to ensure you are supported, develop the confidence knowledge and skills required to excel in your new role.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We have opportunities in the following areas (please state which area you are interested in as part of your supporting statement)&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Some of our current areas with opportunities: &lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Critical Care Band 5&lt;/li&gt;\n&lt;li&gt;Theatre Opportunities Band 5&lt;/li&gt;\n&lt;li&gt;Paediatrics Band 5&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We also have other opportunities at the Trust and we ask you to state which area you would be interested in when submitting your application.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Internal Nursing Staff&lt;/strong&gt; - The internal nurse transfer process is open to all Band 5 eligible nurses employed by The Royal Marsden NHS Foundation Trust for 12 months or more. If you meet the criteria and identify a vacancy in a different area, at the same Band please email careers@rmh.nhs.uk for more information on the scheme.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Don’t delay submit your application today, click the apply button. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If you have a certain area of interest then please state this clearly on your application.&lt;br /&gt;&lt;br /&gt;For more information about nursing at The Royal Marsden NHS Trust please visit our website.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview Date : 23rd November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Helen Lavall / Claudia Ramuz, Nurse Recruitment and Retention Lead / Recruitment Specialist, Claudia.ramuz@rmh.nhs.uk, 02086613963&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "The Royal Marsden NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123033"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Royal Marsden Hospital, Sutton and Chelsea", "postalCode": "SW3 6JJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4909", "longitude": "-.172788"}}, "title": "Nursing Opportunities - Chelsea", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253178", "validThrough": "2020-11-17T23:59:59+0000"}