{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum pro rata + 5% of basic"}}, "datePosted": "2020-11-03T15:16:21+0000", "description": "&lt;p&gt;Early Intervention in Psychosis Service - PATH (Psychosis: Prevention, Assessment and Treatment in Hertfordshire)&lt;/p&gt;\n&lt;p&gt;Working in the West of Hertfordshire.&lt;/p&gt;\n&lt;p&gt;Are you a creative, reflective and flexible Mental Health Nurse, Social Worker or Occupational Therapist with a passion for working with people experiencing psychosis for the first time, committed to delivering personalised and meaningful care?&lt;/p&gt;\n&lt;p&gt;As a Band 6 Care Co-ordinator, you will be an active member of a skilled multi-disciplinary team. You will be working together with your colleagues to provide our PATH service in our Watford Team. Each Care Co-ordinator covers a designated locality – not the whole county. This means you’ll travel less and work out in the community, both in people’s homes and our local hub buildings. You’ll be passionate in the delivery of recovery based and collaborative approaches to care planning, working flexibly and creatively with people in order to achieve their individual goals.&lt;/p&gt;\n&lt;p&gt;Our ‘Caseload Mini Team’ workforce model is unique and highly supportive of collaborative working. You will work as the Leader of the Mini Team, working closely with a Band 4 &amp; 5 colleague to manage the caseload together. This role is a real opportunity to build and develop your leadership and delegation skills, as well as maximising the opportunities and support provided by working closely with colleagues, as part of a mini team.&lt;/p&gt;\n&lt;p&gt;Come and find out more about what we do and consider joining our team. We’d love you to come and work with us! HPFT has the most motivated workforce of any NHS organisation, according to the NHS staff survey results in 2017&lt;/p&gt;\n&lt;p&gt;Here’s what we’ll offer you:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;You’ll be offered a structured 12 week induction programme, giving you access to FEP specific learning and development opportunities to give you the confidence and skills to start delivering the FEP pathway to our service users&lt;/li&gt;\n&lt;li&gt;Your development is our focus and we will offer a range of ways for you to further your career. You’ll have access to personal coaching, to help you achieve your goals, coupled with 100 day conversations and a high quality supervision and appraisal programme.&lt;/li&gt;\n&lt;li&gt;You’ll want to be a leader and will be encouraged to develop your leadership skills through our offer of bespoke leadership training, high quality profession specific support and opportunities to learn the most effective supervision and personal coaching approaches.&lt;/li&gt;\n&lt;li&gt;You’ll be an important part of an innovative, creative and developing service. We are committed to a future where we use continuous quality improvement to harness your ideas for service development and make them a reality&lt;/li&gt;\n&lt;li&gt;You’ll work with a team who have highly specialist knowledge, experience and skills around FEP, where you will have access to a comprehensive internal training package to develop these skills in your first year too&lt;/li&gt;\n&lt;li&gt;Delivering the FEP Pathway is a chance to change service users lives, teaching them the skills to self-manage their illness and encouraging self-reliance and independence, as well as helping them rebuild their lives&lt;/li&gt;\n&lt;li&gt;You’ll be working with people who come with a variety of needs, at various stages of their illness and recovery&lt;/li&gt;\n&lt;li&gt;HPFT offers a wide variety of competitive employee benefits including access to a range of salary sacrifice schemes and discounts, a lease car scheme AND Excellent pension provision with up to 42 days leave per year&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameBen MahoneyJob titleService ManagerEmail addressbenjamin.mahoney@nhs.netTelephone number07908800269&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120841.png", "name": "Hertfordshire Partnership University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120841"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Colne House, 21 Upton Road Watford, HertfordshireWD18 0JP, Watford", "postalCode": "WD18 0JP"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6567", "longitude": "-.40142"}}, "title": "FEP/ EIP Care Coordinator (Social Worker/OT/Nurse)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254519", "validThrough": "2020-11-17T23:59:59+0000"}