{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-11-06T09:31:09+0000", "description": "&lt;p&gt;Are you keen to develop your Occupational Therapy skills in a supported and valued environment in our CQC Outstanding-rated Trust?&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen to join and help shape a new countywide community stroke service which has been commissioned across Coventry and Warwickshire. The new post sits within a large multidisciplinary team, including band 7, band 6s, band 5s and assistants, which provides assessment and rehabilitation within two distinct care pathways - an Early Supported Discharge pathway and a Community Stroke Team pathway. These pathways offer different intervention models to best meet the needs of stroke patients at different points in their rehabilitation. The varied role provides the opportunity to further develop your clinical skills in stroke rehabilitation and use your specialist skills to support the evolution of the service through its early days. The team will be managed operationally by an 8a Clinical and Operational Stroke lead, but professional support will be provided by the Adult Occupational Therapy Manager. You will assist with and deputise for the Stroke Clinical and Operational Lead in professional leadership, operational management, supervision and appraisals of staff within the specialty. The post holder will work with the other AHP Band 7 leads to ensure that the services meet the KPIs set out by the commissioners.&lt;/p&gt;\n&lt;p&gt;An enthusiastic and committed individual is required with experience in stroke rehabilitation. As part of the multidisciplinary team, you will need to be able to work independently within patients’ homes and have the ability to effectively prioritize and manage a demanding workload. Although based at the George Elliot Hospital, the post will require significant travel across primarily the north of the county. Team work and excellent communication skills are essential. You should be highly experienced in the application of occupational therapy assessment tools and intervention techniques relevant to this area of practice.&lt;/p&gt;\n&lt;p&gt;The service offers structured Personal Development Review (PDR) and Clinical Supervision systems, and actively promotes Continued Professional Development through in-service and other training.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;South Warwickshire NHS Foundation Trust promotes flexible working options on all appropriate positions and our managers welcome these discussions during the recruitment process.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameBridgit Vorster-GibbonsJob titlePrincipal Occupational TherapistEmail addressBridgit.vorster-gibbons2@swft.nhs.ukTelephone number01926 495321 x7724&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "South Warwickshire NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120990"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Stroke ESD &amp; CNRT G23950, Warwick", "postalCode": "CV34 6SR"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.2693", "longitude": "-1.54106"}}, "title": "Advanced Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259029", "validThrough": "2020-11-20T23:59:59+0000"}