{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 - £19,337 per annum"}}, "datePosted": "2020-10-26T15:01:44+0000", "description": "&lt;p&gt;We have an exciting opportunity for a Clinic Coordinator to join our Admin Team on our busy SACT (Chemotherapy) Suite in the Osborne Building at LRI. The postholder will be required to work between 8am and 7pm M-F on a rota basis.&lt;/p&gt;\n&lt;p&gt;We are looking for someone friendly and motivated with excellent interpersonal skills to join our busy team as a Clinic Co-ordinator. You will be work on our SACT Suite Reception Desk as well as in our busy Chemotherapy Outpatient Clinics.&lt;/p&gt;\n&lt;p&gt;The role involves liaising directly with our patients and their relatives as well as the Consultant Oncologists, other doctors, Clinical Nurse Specialists and admin staff, so experience in a customer service role along with excellent communication skills is essential in this role. Previous experience of using computer systems will also be essential as the role will involve booking patients’ treatment appointments on our Chemotherapy system and outpatient appointments via the HISS Patient System.&lt;/p&gt;\n&lt;p&gt;HISS experience would be an advantage but not essential as we will provide training for this.&lt;/p&gt;\n&lt;p&gt;This is a demanding and also rewarding role and it is essential that the successful candidate is able to work effectively as part of a team whilst prioritising and managing their workload. If you are a highly organised person, would love a challenge and like to keep busy then this is the job for you.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Devinder Dhillon - Service Manager&lt;/p&gt;\n&lt;p&gt;devinder.dhillon@uhl-tr.nhs.uk / 0116 258 5084&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120651.jpg", "name": "University Hospitals of Leicester", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120651"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Leicester", "postalCode": "LE1 5WW"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6278", "longitude": "-1.13479"}}, "title": "Clinic Co-ordinator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243039", "validThrough": "2020-11-08T23:59:59+0000"}