{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 to £44,503 pa"}}, "datePosted": "2020-11-06T12:03:53+0000", "description": "&lt;p&gt;&lt;strong&gt;Scientific Consultant&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity to work across all our directorates, staff groups and levels to support the implementation of the Organisation and Workforce Development Strategy. The aim being to promote a lifelong learning culture that encourages organisational success through Continuing Professional and Personal Development of staff at all levels.&lt;/p&gt;\n&lt;p&gt;Your role will be within the Scientific and Clinical Training Team to support the OWD (Organisational Workforce Department) management team to embed OWD strategy, policy, and procedure across the organisation. You will work as a subject expert in the scientific field, ensuring professional competence is maintained accordingly.&lt;/p&gt;\n&lt;p&gt;You will design, develop and deliver Scientific Continuing Professional and Personal Development activities to NHSBT, the wider NHS and other external customers. You will implement and maintain high quality development programmes and initiatives that meet external education and training standards and modernised approaches. Producing engaging education, training and development activities that are conducive to learning and increasing transfusion knowledge and awareness across the NHS.&lt;/p&gt;\n&lt;p&gt;This role is to support a ‘case load’ of learners and operational managers and give expert education, training and development advice/guidance in respect of professional career frameworks and core competencies, primarily for the IBMS qualifications.&lt;/p&gt;\n&lt;p&gt;You will be representing NHSBT at local and regional levels, attending relevant meetings as required and working with external partners and customers.&lt;/p&gt;\n&lt;p&gt;This advert will close at 23:59 on Sunday 15th November 2020&lt;/p&gt;\n&lt;p&gt;If you are invited to a selection day, we anticipate this will be taking place week commencing Monday 23rd November 2020.&lt;/p&gt;\n&lt;p&gt;If you have any enquiries regarding the vacancy, please contact sally.procter@nhsbt.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NHS Blood and Transplant (NHSBT)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120628"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Tooting Centre", "postalCode": "SW17 0RB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4275", "longitude": "-.175947"}}, "title": "Scientific Consultant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259573", "validThrough": "2020-11-20T23:59:59+0000"}