{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum, pro rata"}}, "datePosted": "2020-11-06T09:16:13+0000", "description": "&lt;p&gt;The cardiology team at the Norfolk &amp; Norwich Hospital NHS Foundation Trust are looking for an experienced cardiac nurse to join our cardiology specialist nurse team.&lt;/p&gt;\n&lt;p&gt;Based within the Cardiology Outpatients department, the post holder will be responsible for running a variety of nurse led clinics, including cardiac rehabilitation and pre assessment for elective cardiology procedures, predominantly at our main hospital site as well as Cromer Hospital and community venues. Clinics will be provided through telephone, video, and face to face consultations. The cardiology specialist nurses also assist with rapid access chest pain clinics as well as providing a telephone helpline service to our patients.&lt;/p&gt;\n&lt;p&gt;Although the post holder will be primarily responsible for delivery of the clinical service, they will also work in partnership with the outpatient charge nurse to ensure the effective running and management of the department.&lt;/p&gt;\n&lt;p&gt;Our modern university hospital is set just outside the vibrant city of Norwich in the beautiful county of Norfolk - the land of big skies, stunning beaches and rolling countryside – providing care to nearly a million patients each year. The care we provide puts people at the heart of our service. This means that our patients and colleagues are our highest priority. We conduct over 40,000 patient consultations within our cardiology outpatients department each year, treating a wide range of conditions from coronary heart disease to heart rhythm disturbances, congenital heart disease, heart failure and inherited cardiac conditions.&lt;/p&gt;\n&lt;p&gt;We are proud of our high quality services, which are based on integrity and respecting the wide range of people that access our care, as well as those skilled and dedicated individuals who continually demonstrate excellence in their work. Team working is vital and we are committed to the provision of care through our values of Pride, Respect, Integrity, Dedication and Excellence.&lt;/p&gt;\n&lt;p&gt;We strive for excellence and this is recognised at a national level. We are a heart attack centre and our services are both comprehensive and innovative, meeting national standards whilst exploring new ways of working. We are keen to share learning and network through local and national forums.&lt;/p&gt;\n&lt;p&gt;Our core services are currently delivered on week days, but going forward, in order to meet demand, we anticipate that some evening and weekend work will be involved.&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity for someone with significant experience of cardiac nursing wishing to provide specialist outpatient care as part of a dedicated and highly professional multi-disciplinary team.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;** full and part time hours available **&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview date:&lt;/strong&gt; 2nd December 2020&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Open for applications:&lt;/strong&gt; 6th November 2020&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Close for applications:&lt;/strong&gt; 16th November 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Nicholas Pember - Senior Charge Nurse&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Tel: &lt;/strong&gt;01603 286369&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Email: &lt;/strong&gt;nicholas.pember@nnuh.nhs.uk&lt;/p&gt;\n&lt;p&gt;OR&lt;/p&gt;\n&lt;p&gt;Juleah Vernham - Lead Nurse Cardiac Rehabilitation&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Email: &lt;/strong&gt;juleah.vernham@nnuh.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122492.jpg", "name": "Norfolk and Norwich University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122492"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Norfolk and Norwich University Hospital, Norwich", "postalCode": "NR4 7UY"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6181", "longitude": "1.22109"}}, "title": "Specialist Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258996", "validThrough": "2020-11-16T23:59:59+0000"}