{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 £24,907-£30,615"}}, "datePosted": "2020-10-27T12:16:35+0000", "description": "&lt;p&gt;We are Lincolnshire Community Health Services NHS Trust (LCHS), the primary community healthcare provider in Lincolnshire delivering community-based services aimed at supporting people to manage their own health closer to home an reducing the need for people to go into acute hospitals. We are rated ‘Outstanding’ by the Care Quality Commission and are playing an integral part in shaping future health service provision countywide alongside partner health and social care organizations.&lt;/p&gt;\n&lt;p&gt;We have an opportunity for a number of Nurses to join our dedicated teams, with flexible hours and days across Louth, Spalding and Skegness.&lt;/p&gt;\n&lt;p&gt;The successful candidates will be responsible for assessing care needs, and the planning, delivery and evaluation of nursing care using innovative research based effective practice. Good communication skills, both oral and written are also required, as well as being able to demonstrate evidence of team working.&lt;/p&gt;\n&lt;p&gt;Lincolnshire is a wonderfully diverse place to live; a thriving University City at its heart, with the rolling hills of the Wolds, the wildlife of the fens, and a 30 mile stretch of beautiful sand along our East coast. Lincolnshire boasts an affordable lifestyle, being the 13th cheapest average house prices across England and Wales. With the mix of heritage and modern developments, Lincolnshire is a great place to see exciting and fun opportunities for all members of the family.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameHR Team&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/127394.png", "name": "Lincolnshire Community Health Services NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127394"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Louth, Spalding and Skegness, Lincolnshire", "postalCode": "LN5 7JH"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.2265", "longitude": "-.524149"}}, "title": "Bank Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244431", "validThrough": "2021-01-02T23:59:59+0000"}