{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 pa"}}, "datePosted": "2020-10-29T16:00:42+0000", "description": "&lt;h2&gt;&lt;span&gt;BAND 6 MRI RADIOGRAPHER - LEEDS TEACHING HOSPITALS TRUST&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt; &lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Band 6, 7 WTE MRI Radiographer &lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Leeds MRI is undertaking a major service expansion, including 2 extra MRI scanners being installed across the city. We therefore have a fantastic opportunity for flexible, enthusiastic, motivated Radiographers to join our friendly, dedicated team in one of the largest MRI departments in the UK. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The department is based across 2 sites, St James University Hospital (SJUH) and Leeds General Infirmary (LGI). LGI is a major trauma center as well as the home of the Leeds Children’s Hospital, and SJUH a world renowned oncology and transplant center, and one of the largest teaching hospitals in Europe. The MRI departments support a range of specialties including neurosurgery, paediatrics, liver, oncology, urology, abdominal and vascular surgery. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;MRI in Leeds is a diverse and interesting department to work for, with Radiographers working closely with clinical teams to support advanced imaging, particularly in Neurosciences, Paediatrics, Oncology and Liver Imaging. The role would suit Radiographers who are keen to learn, and happy working in a busy environment with considerable responsibility placed upon individuals to make imaging decisions in often complex cases. The in-patient and on-call services are busy so a considerable amount of manual handling and out-of-hours working is required. In return you will see one of the broadest portfolios of MRI imaging in the UK and have opportunity to scan a case-mix that is both interesting and educational. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The MRI department has 4 scanners on the St James’s site - 2 x 1.5T Siemens Aera, 2 x 1.5T Siemens Sola. The Leeds General Infirmary is equipped with 1 x 1.5T Siemens Sola, 1x 3T GE intraoperative MRI suite, and will be installing a 1.5T Siemens Sola and 3T Siemens Vida in the spring. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Previous MRI experience is strongly preferable; however candidates who meet the other minimum essential criteria (qualifications) and have reasonable Radiography experience will be considered for interview, and will be supported through a training program under annex 21 of the AfC terms and conditions, for those without cross sectional experience we recommend reading the annex 21 AfC conditions before applying. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Successful candidates will be expected to join our electronic rostering system which includes flexible shifts, weekend working and a busy on-call (due to the on-call applicants must live or plan to move within an hour’s drive of the hospital). Please note car-parking at both SJUH and LGI is limited. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;For further information please contact Kath Bann/ Claire Gilbert/ Brett Crabtree: 0113 20 64689/ 011320 68468 &lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122954.jpg", "name": "Radiology", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122954"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St James University Hospital", "postalCode": "LS9 7TF"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8073", "longitude": "-1.51908"}}, "title": "Radiographer (XR06)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248965", "validThrough": "2020-11-13T23:59:59+0000"}