{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "84103", "minValue": "70794", "unitText": "YEAR", "value": "£70,794 - £84,103 pro rata"}}, "datePosted": "2020-10-12T14:30:28+0100", "description": "&lt;p&gt;Are you professional and highly motivated with a drive for delivering excellent care? Are you looking to move into an exciting and rewarding role for the Ministry of Defence?&lt;/p&gt;\n&lt;p&gt;Look no further.&lt;/p&gt;\n&lt;p&gt;Here at Beachley Barracks, we have just the role for you. In this part-time Civilian Medical Practitioner role you will be providing primary and occupational healthcare in line with GMC Standards to ensure that our objectives to optimise patient care are met, supporting Defence Primary Healthcare (DPHC) in delivering a safe and effective service. DPHC achieve this through providing primary healthcare, dentistry, rehabilitation and mental healthcare services to service personnel and, where appropriate, their dependants.&lt;/p&gt;\n&lt;p&gt;You will gain access to the additional benefits of a competitive salary, paid holiday entitlement and numerous opportunities for continuous professional development.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please note this is a part-time post of 18.5 hours per week.&lt;/strong&gt;&lt;/p&gt;\n&lt;h2&gt;Essential Criteria&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li&gt;GMC registered, with a licence to practice.&lt;/li&gt;\n&lt;li&gt;Certificate of Prescribed Equivalent Experience or Statement of Acquired Rights (now known as CCT) from the Joint Committee in Post Graduate Training in General Practice (JCPGT(GP)). To hold this certificate, you will also have to hold a Post Graduate Training Certificate in General Practice and a Certificate of General Practice Vocational Training (GPVT).&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The following experience is desirable:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To be proficient in relevant IT systems particularly those used within Defence Medical Services, subject to appropriate training being provided.&lt;/li&gt;\n&lt;li&gt;Occupational health and in particular military occupational health.&lt;/li&gt;\n&lt;li&gt;Musculoskeletal medicine.&lt;/li&gt;\n&lt;li&gt;(where appropriate) Experience of Armed Forces Medicine, relevant to the single Service environment, i.e. Underwater and Diving Medicine, Aviation Medicine.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Please read the attached Job Description for further information on the role and its requirements.&lt;/strong&gt;&lt;/p&gt;\n&lt;h2&gt;Selection process&lt;/h2&gt;\n&lt;p&gt;The selection at sift stage will be CV based.&lt;/p&gt;\n&lt;p&gt;Please ensure you demonstrate that you have the required skills, qualifications and memberships in your CV and that you have saved it using your surname then first name prior to submitting your application.&lt;/p&gt;\n&lt;p&gt;At interview, you will be tested against the following Behaviours:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Communicating and Influencing&lt;/li&gt;\n&lt;li&gt;Making Effective Decisions&lt;/li&gt;\n&lt;li&gt;Leadership&lt;/li&gt;\n&lt;li&gt;Changing and Improving&lt;/li&gt;\n&lt;li&gt;Managing a Quality Service&lt;/li&gt;\n&lt;li&gt;Delivering at Pace&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Travel to interview costs will not be reimbursed.&lt;/p&gt;\n&lt;h2&gt;Further Information&lt;/h2&gt;\n&lt;p&gt;There is no requirement to deploy as this is met by our uniformed personnel, but you will form the continuity of care required by our patients when based at home.&lt;/p&gt;\n&lt;p&gt;Please be aware that if you are found successful you will be asked to provide evidence of your immunity to Hepatitis B.&lt;/p&gt;\n&lt;p&gt;Successful candidates must meet the security requirements before they can be appointed. The level of security needed is security check.&lt;/p&gt;\n&lt;p&gt;All employees joining Ministry of Defence who are new to the Civil Service will be subject to a 6-month probation period (unless otherwise advised) effective from the employment start date.&lt;/p&gt;\n&lt;p&gt;Please note the salary will be pro-rata for this part time position.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please ensure you have read all the details in the important information link prior to applying.&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/132174.png", "name": "Ministry of Defence (Defence Medical Services)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132174"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Beachley Barracks, Chepstow, Monmouthshire. NP16 7YG", "postalCode": "NP16 7YG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6202", "longitude": "-2.65141"}}, "title": "Civilian Medical Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916222747", "validThrough": "2020-11-12T23:59:59+0000"}