{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737-£21,142"}}, "datePosted": "2020-10-23T12:41:53+0100", "description": "&lt;p&gt;&lt;strong&gt;Administrator/Co-ordinator - Technical Services&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Part time hours- 18.75&lt;/p&gt;\n&lt;p&gt;UHB is looking for enthusiastic and motivated Administrator / Co-ordinator to provide a high quality administrative service to the Melchett Rd Aseptic Production unit (MRAPU) and to work as part of the team to facilitate the smooth and efficient running of the Aseptic Production Unit.&lt;/p&gt;\n&lt;p&gt;Your role will include secretarial duties, administrative duties, Human resources duties, support to education and training needs of all staff and stock ordering duties.&lt;/p&gt;\n&lt;p&gt;You will be part of an expanding team of highly professional and dedicated staff whose aim is to provide an excellent, patient focus service.&lt;/p&gt;\n&lt;p&gt;The prime function of the unit is the preparation of cytotoxic, monoclonal antibodies and clinical trials in a safe and efficient manner according to Good Manufacturing Practice and National Standards.&lt;/p&gt;\n&lt;p&gt;Our aim is to provide our valued staff with excellent training to become skilled, highly competent and confident in their job roles. We encourage innovative working which includes the development and future proofing of our facilities to meet the growing needs of the service. We promote learning and development within our organisation.&lt;/p&gt;\n&lt;p&gt;An NVQ level 3 or equivalent in Business and Administration is essential or equivalent experience in an administrative environment. Experience of working in a pharmacy environment is desirable&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Contact Details&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you require any further information or are interested in making an application please contact Diane Campbell – Aseptic Support manager via e-mail at diane.campbell@uhb.nhs.uk or phone 01213718671&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University Hospitals Birmingham NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123452"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Birmingham", "postalCode": "B15 2TH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4533", "longitude": "-1.93628"}}, "title": "Administrator/Co-ordinator - Technical Services", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240563", "validThrough": "2020-11-06T23:59:59+0000"}