{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615"}}, "datePosted": "2020-11-06T15:16:54+0000", "description": "&lt;p&gt;Community Mental Health Nurse&lt;/p&gt;\n&lt;p&gt;Community Mental Health Nurse within Community Recovery Service (CRS) North and South Team based in Dudley, you will be part of a dynamic team, supportive and diverse multi disciplinary team. You will be responsible for managing the mental health needs of service users referred to the team, under guidance from the clinical lead and team manager. You will also be part of developing and implementing therapeutic interventions underpinned by the care programme approach, you will work from our community base facility, via phone/agile working or within the service users home.&lt;/p&gt;\n&lt;p&gt;You will be a registered mental health Nurse with the minimum of 3 months experience in assessing and formulating individual plans and outcome measures for adults with mental health problems and have a current knowledge of NHS policies and practices in mental health.&lt;/p&gt;\n&lt;p&gt;You will have an understanding of the care programme approach with an opportunity to develop your skill base in therapeutic interventions and psychotropic medication, you will have an ability to work with partner agencies and be supported by the clinical lead and CRS manager to lead and manage service users care.&lt;/p&gt;\n&lt;p&gt;The Team is committed to provide safe, sound and supportive services, you will receive regular supervision with opportunities to develop clinical and professional practice in line with service user needs and organisational values .&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameClaire RobinsonJob titleclinical leadEmail addressclaire.robinson18@nhs.netTelephone number0121 602 8862Additional contact information&lt;/p&gt;\n&lt;p&gt;Site visits are encouraged, please contact Claire Robinson to visit Halesview and Hill house site.&lt;/p&gt;\n&lt;p&gt;Norma Ellis to visit the Poplars site.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120845.png", "name": "Black Country Healthcare NHS Foundation Trust (formerly known as Black Country Partnership Foundation Trust)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120845"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Poplars, Brierley Hill", "postalCode": "B63 4SG"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4484", "longitude": "-2.06153"}}, "title": "Community Mental health Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916260341", "validThrough": "2020-11-20T23:59:59+0000"}