{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-11-04T11:01:36+0000", "description": "&lt;p&gt;Band 5 staff Nurse Chance Ward. Older adults Urgent Care&lt;/p&gt;\n&lt;p&gt;Edward Street Hospital&lt;/p&gt;\n&lt;p&gt;Edward Street&lt;/p&gt;\n&lt;p&gt;West Bromwich&lt;/p&gt;\n&lt;p&gt;West Midlands&lt;/p&gt;\n&lt;p&gt;B70 8NL&lt;/p&gt;\n&lt;p&gt;Are you a dynamic Mental Health Nurse looking for your next challenge? Are you a newly qualified nurse looking for a great start to your career? Do you want to join an established team and work in an organization that truly lives its values?&lt;/p&gt;\n&lt;p&gt;Chance ward is in the unusual position of seeking registered mental health nurses (RMN) for our older adults admission assessment ward at Edward Street Hospital West Midlands.&lt;/p&gt;\n&lt;p&gt;If you have an interest in working with older people with complex needs, using evidence-based interventions and are passionate about delivering highest quality standards of care, you will be an ideal addition to our established team&lt;/p&gt;\n&lt;p&gt;Candidates will need to be caring, compassionate and committed to delivering a quality service with good interpersonal and communication skills and the ability to maintain professional effective working relationships.&lt;/p&gt;\n&lt;p&gt;As a staff nurse the role incorporates opportunities to lead small shift teams, supervise unregistered support workers and engage with multi-discipline teams. Responsibilities include supporting senior staff in the day-to-day running of the ward, with development and coordination of person-centred care planning, care reviews and care evaluations.&lt;/p&gt;\n&lt;p&gt;Our 18 bedded admission assessment ward for older adults requires participation and contribution towards delivery of essential standards for safety and quality, continuous improvements and a passion for developing or leading on up-to-date, evidence-based practices. Our unusual model provides person centred care for patients living with dementia.&lt;/p&gt;\n&lt;p&gt;We provide a challenging but ultimately rewarding environment in which to work. Our team of consultants, doctors, psychologist RMN and RN nurses, occupational Therapists, physiotherapists and support workers deliver recovery based and outcomes focused care to our service users to support them to move along their care pathway.&lt;/p&gt;\n&lt;p&gt;With a motivated and forward-thinking vision for the ward, there is no better time to join the team. You will be working in a friendly and supportive environment, with an absolute focus on providing the very best patient care. Our focus will also be on your individual development, you will have regular clinical supervision, and we use a positive appraisal process to help plan your development and work with you to achieve your professional goals.&lt;/p&gt;\n&lt;p&gt;If a newly qualified staff nurse, you will have a preceptorship package with one of our experienced Band 6 nurses acting as your preceptor. &lt;br /&gt;&lt;br /&gt;We are looking for a motivated and passionate Staff nurse to join our team. Although this role is challenging, you will have a supervisor offering you additional support network alongside the team. &lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;From day one, you will provide a comprehensive package of care to inpatients on our ward. You will become part of a multi-disciplinary team, using your skills and experience to help define and deliver a package of care that helps these people on the road to recovery. This role is on a ward that operates on a 24/7 shift basis.&lt;/p&gt;\n&lt;p&gt;The train station is located a short bus journey from the ward. The ward is within an Older Adult Hospital specialising in the care of both functional and organic illness. The site offers parking and there are buses that run on average every 10 minutes to and from town centre.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further information, please contact Salane Thomas Ward Manager &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Tel: 0121-612-822&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Email : &lt;/strong&gt;salane.thomas@nhs.net&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Namesalane thomasJob titleward managerEmail addresssalane.thomas@nhs.netTelephone number0121 612 8220Additional contact information&lt;/p&gt;\n&lt;p&gt;Salane Thomas Ward Manager Chance Ward Edward Street hospital- 0121 -612 -8220.&lt;/p&gt;\n&lt;p&gt;E Mail salane.thomas@nhs.net&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120845.png", "name": "Black Country Healthcare NHS Foundation Trust (formerly known as Black Country Partnership Foundation Trust)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120845"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Edward Street Hospital, West Bromwich", "postalCode": "B70 8NL"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5192", "longitude": "-1.99874"}}, "title": "RMN", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255506", "validThrough": "2020-11-15T23:59:59+0000"}