{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "42712", "minValue": "36070", "unitText": "YEAR", "value": "£36,070 - £42,712 per annum inc HCAS pro rata"}}, "datePosted": "2020-10-29T11:16:53+0000", "description": "&lt;p&gt;We are looking for an enthusiastic and passionate part-time therapist to work in the Hillingdon mainstream schools team supporting children and young people with speech, language and communication needs.&lt;/p&gt;\n&lt;p&gt;Have a look on our Hillingdon Talks, Moves and Plays website to find out about our service.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What our staff say about the team:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;&quot;I recently joined the Hillingdon Mainstream Schools team and have been really impressed by the opportunities for flexible working and CPD, with many therapists developing their skills and progressing within the service. Everyone is encouraged to contribute their ideas for service development, and the team is well-managed, friendly and supportive.&quot;- Georgina , Band 7.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;&#39;Hillingdon Mainstream Schools Team is so welcoming. I have found the team very approachable as well as being open to suggestions and ideas. It is well organised which made it easier to settle into my role and the demands of the job. The focus on development and joint learning means that you can be confident that you will grow in your career.&#39; - Sarah, Band 5&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We can offer you:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A supportive, friendly team of speech and language therapy colleagues&lt;/li&gt;\n&lt;li&gt;An identified buddy who will meet with you every week at first to help you settle in and who you can ask lots of questions&lt;/li&gt;\n&lt;li&gt;Regular supervision meetings with a senior therapist every 6 weeks, along with an annual appraisal&lt;/li&gt;\n&lt;li&gt;Termly peer supervision meetings where you can discuss difficult cases, read articles together and share your experiences&lt;/li&gt;\n&lt;li&gt;A busy but manageable caseload across a range of schools&lt;/li&gt;\n&lt;li&gt;Opportunities for remote working in school using a laptop with Skype and Lync phone facilities&lt;/li&gt;\n&lt;li&gt;Regular opportunities to come back to the office where you can get informal support from the team several times a week&lt;/li&gt;\n&lt;li&gt;Opportunities to develop your clinical skills and knowledge through termly study afternoons, shadowing more experienced therapists, membership of a CEN, opportunities to invite a senior therapist for a joint consultation&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;We are proud to say that the service has:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Excellent relationships with schools - 91% of SENCO’s report that they are happy or very happy with the service&lt;/li&gt;\n&lt;li&gt;Good relationships with parents - 92.5% of parents report that they are happy or very happy with the service. A parent representative attends all of the mainstream schools meetings and parent feedback is sought for new developments&lt;/li&gt;\n&lt;li&gt;Good outcome measures with children making progress on 94% of the targets set for them each term and positive Teacher Reported Outcome Measures&lt;/li&gt;\n&lt;li&gt;Good partnerships with colleagues in the Local Authority&lt;/li&gt;\n&lt;li&gt;An annual service improvement plan in order to ensure that the service is continually evolving and developing&lt;/li&gt;\n&lt;li&gt;A strong record on completing audits and developing the service as a result of feedback&lt;/li&gt;\n&lt;li&gt;A strong track record on innovation and service development in order to provide a high quality service to children, schools and families&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Band 6 – Paediatric Speech and Language Therapist –15 hours a week / 0.4 WTE.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Note: these hours can be worked over 2 longer days or 3 shorter days.&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;You will be responsible for the assessment and therapy for children and young people with a range of SLCN needs in your schools - including DLD, speech difficulties, social communication difficulties, stammering, selective mutism etc.&lt;/li&gt;\n&lt;li&gt;You will have the opportunity to work directly with the children and young people with an LSA observing the sessions in order for school staff to carry out regular follow up work&lt;/li&gt;\n&lt;li&gt;You will write annual review reports for each child/young person&lt;/li&gt;\n&lt;li&gt;You will offer training, advice and support to school staff which may be delivered face to face or remotely&lt;/li&gt;\n&lt;li&gt;You will support parents and keep in regular touch with them via phone/video calls or meetings, as well as sending them copies of termly care plans and targets and any reports&lt;/li&gt;\n&lt;li&gt;You will jointly set and review targets/ care plans with school staff /parents&lt;/li&gt;\n&lt;li&gt;You will contribute to/lead on audits etc in order to provide evidence that the service being provided is being effective&lt;/li&gt;\n&lt;li&gt;You will contribute to/lead on service improvement projects&lt;/li&gt;\n&lt;li&gt;You will offer supervision to band 5 colleagues as needed and will provide informal support to less experienced colleagues in the office&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Interview date: 02/12/2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameWendy BottenJob titlePaediatric SLT team leader - mainstream schools teamEmail addresswendy.botten@nhs.netTelephone number01895 488 200Additional contact information&lt;/p&gt;\n&lt;p&gt;Wendy Botten, Team Leader on Email: wendy.botten@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central and North West London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120736"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wood End Centre, Hayes", "postalCode": "UB3 2PB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5176", "longitude": "-.436983"}}, "title": "Specialist Speech and Language Therapist - Mainstream Schools", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248047", "validThrough": "2020-11-22T23:59:59+0000"}