{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615"}}, "datePosted": "2020-10-23T15:14:45+0100", "description": "&lt;p&gt;&lt;strong&gt;&lt;span&gt;Our Values: We put quality first/we focus on people/we take responsibility&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Are you looking for an exciting opportunity to play a key role within a dynamic specialist rehabilitation team? &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for qualified band 5 staff nurses to work on Broadfield Ward, a provider of Specialised Neurological Rehabilitation at the Haywood Hospital within Midlands Foundation Partnership Trust (MPFT). The Haywood Hospital prides itself on the delivery of quality care to all inpatients, many with complex needs. Broadfield Ward is North Staffordshire’s provider of specialist inpatient rehabilitation, addressing impairment, injury and progressive neurological diseases. You would join the internationally renowned Rehabilitation Medicine service, working with adults with complex neurological and major trauma-related conditions. Our well-established inpatient service on Broadfield Unit is centrally commissioned and accredited nationally as a highly successful provider of multi-disciplinary, goal-driven, and person-centred rehabilitation for the region.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Do you have excellent clinical skills, good communication skills, and the passion to assist patients with life changing injuries and disabilities? If you can inspire and motivate others within the clinical team, we would like to hear from you! We are committed to the delivery of a high quality patient experience, so if you think that you have the skills and can deliver on our organisational values then come and join the team at Broadfield Ward. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;In line with government policy promoting care closer to home, we are developing the services that are delivered from our Community Hospitals. The Partnership Trust is recruiting dedicated, compassionate nursing staff to further enhance the high quality patient experience we offer in our community hospitals across North Staffordshire. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We can offer:&lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A friendly, supportive and well experienced clinical team who are passionate about rehabilitation medicine&lt;/li&gt;\n&lt;li&gt;Development of your clinical skills through supervision, training and networking opportunities across the Trust / local stroke and rehabilitation services including voluntary and statutory agencies&lt;/li&gt;\n&lt;li&gt;Clear working structure through regular supervision and appraisal with In-service training and peer supervision an essential component for continued professional development&lt;/li&gt;\n&lt;li&gt;A strong rehabilitation research culture within the Trust and local rehabilitation medicine pathway&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;span&gt;Applications are welcome from RGN qualified individuals. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;If you would like any further general information regarding the role please contact:&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Margurite O’Mara, Service Lead on &lt;strong&gt;01782 673721&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Midlands Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121040"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Stoke on trent", "postalCode": "ST16 3SR"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.8106", "longitude": "-2.10908"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241058", "validThrough": "2020-11-19T23:59:59+0000"}