{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-10-26T15:47:14+0000", "description": "&lt;p&gt;Are you qualifying soon and seeking your first post or are you looking to build on your experience?&lt;/p&gt;\n&lt;p&gt;South Warwickshire Foundation Trust can offer you the opportunity to develop your professional skills in the core areas of neurology, medical, respiratory and musculo-skeletal interventions in both acute and community hospitals.&lt;/p&gt;\n&lt;p&gt;You will be part of the team and receive support and supervision from senior staff, enabling you to develop your professional skills in a supportive environment.&lt;/p&gt;\n&lt;p&gt;The Band 5 posts are rotational and involve working in the different hospitals within South Warwickshire- Warwick, Leamington, Rugby, Stratford and Ellen Badger Hospitals as well as some GP clinics. There is also the opportunity for placements with the paediatrics team or Women and Men’s health if you have an area of special interest.&lt;/p&gt;\n&lt;p&gt;The role includes assessment and treatment of a wide variety of patients requiring physiotherapy.&lt;/p&gt;\n&lt;p&gt;There is a requirement to participate in the out of hours’ service helping to provide cover at weekends and Bank holidays. This includes overnight on call.&lt;/p&gt;\n&lt;p&gt;We are looking for a physiotherapist with a good knowledge base on which to develop and consolidate their professional skills. We also require a team player and someone who can adjust to change.&lt;/p&gt;\n&lt;p&gt;The department has a commitment to CPD. In service training and structured appraisal systems are in place.&lt;/p&gt;\n&lt;p&gt;Must be able to meet the travel requirements of the post.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;South Warwickshire NHS Foundation Trust promotes flexible working options on all appropriate positions and our managers welcome these discussions during the recruitment process.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Full time and part time hours available, one fixed term 12 months post also available.&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameLucy GwynneJob titleLead for Neuro RehabilitationEmail addressLucy.Gwynne@swft.nhs.ukTelephone number01926 495321 ext 7329&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "South Warwickshire NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120990"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Physiotherapy G23910, Warwick", "postalCode": "CV34 5BW"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.29", "longitude": "-1.5832"}}, "title": "Rotational Physiotherapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243237", "validThrough": "2020-11-09T23:59:59+0000"}