{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615"}}, "datePosted": "2020-11-05T15:46:15+0000", "description": "&lt;p&gt;&lt;span&gt;The South East Alliance Local Access Point is looking for a dynamic, enthusiastic Band 5 Clinical Triage Nurse to join our team. The Local Access Point is the main point of contact for the South East Alliance Community Nursing and Therapy Teams. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will be required to answer calls and provide clinical support, assistance and professional expertise. You will be required to offer clinical triage and support where appropriate. This may range from signposting the caller to the appropriate service, making a direct referral or offering clinical advice. You may also be expected to conduct some Community Nursing visits where patients require a response therefore experience in community nursing will be essential.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The post holder is expected to represent the Organisation in a professional and courteous manner at all times and provide advice and information using a high level of clinical understanding and professional judgement. Knowledge of community nursing services and the clinical care provided is essential. Triage is a key element in patient safety and is imperative to ensure a seamless, coordinated approach is achieved.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Shift patterns for this post consist of 7.5 hour shifts between the hours of 8am and 18.30pm. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;For further information please contact Laura Wilson- Operational Manager- South East Alliance 07814830770. &lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Midlands Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121040"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Merlin House, Etchel Road, Tamworth", "postalCode": "B78 3HF"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6272", "longitude": "-1.70838"}}, "title": "Community Triage  Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258413", "validThrough": "2020-11-30T23:59:59+0000"}