{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum"}}, "datePosted": "2020-10-30T12:46:08+0000", "description": "&lt;p&gt;Be part of our transformation journey supporting our great ward teams to deliver patient focused great care across our surgical specialties. This is a great opportunity for an experienced ward manager or clinical specialist looking for the next career step with ambitions of supporting the ward and wider multidisciplinary team to deliver excellence. Great care can change everything.&lt;/p&gt;\n&lt;p&gt;Bring your dedication and determination here, and you will benefit from the support of an experienced and enthusiastic senior leadership team who will support you to deliver your own educational and professional goals. You will manage an energised ward manager team, covering three wards with dedicated practice development support. You will be expected to support and deliver improved patient pathways within surgery, colorectal and orthopaedic services including the enhanced virtual fracture clinic service.&lt;/p&gt;\n&lt;p&gt;To carry out this challenging role you must have proven current management and leadership experience at Senior Sister / Charge Nurse level within the acute hospital setting and be able to demonstrate ability to implement effective change within an acute Trust. You will also need strong interpersonal, negotiation and decision making skills with the ability to challenge personnel and advanced nursing practice.&lt;/p&gt;\n&lt;p&gt;Will you join us on this journey?&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Benjamin Hearnden, Job title: Deputy Head of Nursing for Surgery &amp; Urology, Email address: Benjamin.Hearnden@nhs.net, Telephone number: 07815503066&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "East Kent Hospitals University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121462"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Queen Elizabeth the Queen Mother Hospital, Margate", "postalCode": "CT9 4AN"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3781", "longitude": "1.38941"}}, "title": "Matron", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250249", "validThrough": "2020-11-13T23:59:59+0000"}