{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 per annum"}}, "datePosted": "2020-11-06T13:45:58+0000", "description": "&lt;p&gt;Job Title: – &lt;strong&gt;Speech and Language Therapy&lt;/strong&gt; &lt;strong&gt;Assistant Practitioner;&lt;/strong&gt; &lt;strong&gt;Early Supported Discharge Team and Community Neuro Rehabilitation Team&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Trust Scale/Grade: &lt;strong&gt;Band 4&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Length and Type of Contract: &lt;strong&gt;Permanent&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Hours per week:&lt;strong&gt;37.5 hours/week &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Coventry and Warwickshire Partnership Trust, Rehabilitation Services &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Speech and Language Therapy Assistant Practitioner; Band 4 &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Early Supported Discharge Team (ESD) for Stroke and the Community Neuro Rehabilitation Team are community based interdisciplinary therapy teams; based at Newfield House, Coventry; supporting the discharge of patients following a diagnosis of a stroke or other neurological condition, from University Hospital Coventry and Warwickshire or repatriating patients from elsewhere.&lt;/p&gt;\n&lt;p&gt;The team consists of Physiotherapy, Occupational Therapy, Speech and Language Therapy, Dietetics, Psychology, Assistant Practitioners and Rehabilitation Technicians.&lt;/p&gt;\n&lt;p&gt;We are now looking to recruit a motivated and experienced band 4 Speech and Language Therapy Assistant Practitioner into the Team to support our growing caseloads and Speech and Language Therapists in their work with patients.&lt;/p&gt;\n&lt;p&gt;You will be an integral part of a friendly and supportive team working with people in their own homes, our out-patient clinic and gym.&lt;/p&gt;\n&lt;p&gt;This post will offer you an opportunity to consolidate and develop existing clinical skills and knowledge in neurology and/or rehabilitation. You will work closely with all the therapists within the team to support high standards of patient care and service delivery aligned to the Coventry and Warwickshire Partnership Trust Visions and Values.&lt;/p&gt;\n&lt;p&gt;The structure of the team will enable you to work closely with all members of the Interdisciplinary Team and Clinical Lead. The team has strong leadership with experienced qualified therapy staff that will support your development through Value Based Appraisal, one to one meetings, and supervision.&lt;/p&gt;\n&lt;p&gt;An inclusive team approach and excellent communication skills are essential. You will be expected to work independently and effectively within the teams to ensure safe and effective management of patients in the community. You will be able to prioritise your workload and time effectively to support an integrated approach.&lt;/p&gt;\n&lt;p&gt;This post would suit an experienced Assistant Practitioner with a Foundation Degree in Health and Social Care, or suitably qualified staff with experience in Speech and Language Therapy within Neurological settings. There is an expectation that the candidate will be committed to providing high standards of care.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Car owner/driver essential.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For more information please contact either;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Hannah Mason, Lead Speech and Language Therapist, Early Supported Discharge Team. Newfield House, Kingfield Road, Coventry, CV1 4NZ. Tel no; 0300 2000 396&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Sarah Willetts, Lead Speech and Language Therapist, Community Neuro Rehab Team. Newfield House, Kingfield Road, Coventry, CV1 4NZ. Tel no; 0300 2000 396&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Claire Quarterman, Clinical Lead, Community Neuro Rehabilitation and Early Supported Discharge Team. Newfield House, Kingfield Road, Coventry, CV1 4NZ. Tel no; 0300 2000 396&lt;/p&gt;\n&lt;p&gt;q Closing date 2 weeks&lt;/p&gt;\n&lt;p&gt;q This post will be closed once a sufficient number of applications have been received&lt;/p&gt;\n&lt;p&gt;q Interview date: TBA&lt;/p&gt;\n&lt;p&gt;COVENTRY AND WARWICKSHIRE PARTNERSHIP TRUST WILL VALUE EVERY INDIVIDUAL AND STRIVE TO REMOVE CONDITIONS WHICH PLACE PEOPLE AT A DISADVANTAGE.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Coventry and Warwickshire Partnership Trust (CWPT)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121204"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Newfield House, Kingfield Road, Coventry, CV1 4NZ, Coventry", "postalCode": "CV1 4NZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4217", "longitude": "-1.50984"}}, "title": "Speech And Language Therapy Assistant Practitioner CNRT &amp; ESD Band 4", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259966", "validThrough": "2020-11-22T23:59:59+0000"}