{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "35612", "minValue": "28588", "unitText": "YEAR", "value": "£28,588 - £35,612"}}, "datePosted": "2020-10-28T17:15:57+0000", "description": "&lt;p&gt;Public Health England provides strategic leadership and vision for protecting and improving the nation’s health. Its ambition is to lead nationally, and enable locally, a transformation in the health expectations of all people in England, regardless of where they live and the circumstance of their birth. It will achieve this through the application of research, knowledge and skills. PHE is an executive agency of the Department of Health.&lt;/p&gt;\n&lt;p&gt;It is a distinct delivery organisation with operational autonomy to advise and support government, local authorities and the NHS in a professionally independent manner.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;JOB SUMMARY&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We have four vacancy for fixed term HEO Serosurveillance Scientists at our facility at PHE Porton Down, to assist in the response of the SARS CoV2 Coronavirus outbreak in the UK.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Serosurveillance COVID-19: &lt;/strong&gt;The post holder will work within a team of scientists and technicians responsible for the Covid-19 serology testing under Pillar 4 of the Government’s testing strategy (April 2020). The candidates will support and contribute to;&lt;/p&gt;\n&lt;p&gt;(I) the operational process for receipt, management, processing and testing of blood and sera samples from many different studies. The team of scientists are responsible for delivering scientific and technical activities associated with serosurveillance of SARS-CoV2 in the UK population following the outbreak. The candidate will provide technical expertise and experience to the to the wider serology team working with other project team members, Project Team Lead and General Project Manager in support of the Rare and Imported Pathogen Laboratory.&lt;/p&gt;\n&lt;p&gt;(II) would work as a scientist in the Pillar 4 (Serology) project team providing serological expertise in a team responsible for the delivery of the scientific and technical activities within the team. The post holder will support delivery of new/improved/refined diagnostic assays for use in the team as well as training and surge capacity in support of the outbreak.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Option 3 – External&lt;/strong&gt; ‘Appointment to this post is on PHE terms and conditions of service. Only previous continuous service in the Civil Service is recognised for contractual purposes.&lt;strong&gt;&lt;br /&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Open to all external applicants (anyone) from outside the Civil Service (including by definition internal applicants).&lt;/p&gt;\n&lt;p&gt;Priority consideration for this post will be given to applicants, in line with the National Policy on the Process for Filling of Posts and the PHE Recruitment Controls.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Lisa Reynolds &amp; Cathy Rowe (cathy.rowe@phe.gov.uk)&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/127774.jpg", "name": "Public Health England", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127774"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Porton Down, Salisbury", "postalCode": "SP4 0JG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.1325", "longitude": "-1.7031"}}, "title": "Covid-19 Serology- Serosurveillance Scientist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247484", "validThrough": "2020-11-11T23:59:59+0000"}