{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "73664", "minValue": "63751", "unitText": "YEAR", "value": "£63,751 - £73,664 per annum"}}, "datePosted": "2020-10-21T15:31:05+0100", "description": "&lt;p&gt;&lt;strong&gt;Senior Strategy Advisor, Greener NHS team &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are recruiting a Senior Strategy Advisor to join NHS England and NHS Improvement’s, Greener NHS programme, which sits within the Primary Care, Community Services and Strategy Directorate.&lt;/p&gt;\n&lt;p&gt;This is an incredibly exciting time to join the Greener NHS programme following the commitment by the NHS in its multiyear plan &lt;em&gt;Delivering a ‘Net Zero’ National Health Service&lt;/em&gt; to become the world’s first carbon net zero national health system and the appointment of the NHS first Chief Sustainability Officer. This commitment and multiyear plan reflects growing evidence of the health impacts of climate change and air pollution and recognition that it is not enough for the NHS to treat the problems caused by air pollution and climate change – from asthma to heart attacks and strokes – it needs to play a part in tackling them at source. It builds on the NHS existing sustainability commitments in the NHS Long Term Plan.&lt;/p&gt;\n&lt;p&gt;This role is part of a dynamic team supporting the NHS to solve some of its toughest problems and secure a sustainable greener future. We are uniquely placed to look across the health and care system, to better understand and reduce the environmental impacts of health and care, and save thousands of lives and hospitalisations across the country.&lt;/p&gt;\n&lt;p&gt;The Greener NHS team works closely with both corporate and regional teams across NHS England and NHS Improvement, with local health systems, Trusts and other stakeholders. The postholder will lead on delivery of aspects of the Greener NHS portfolio, working with teams across organisations to reduce the environmental impact of the NHS, for example by leading on the reduction in use of single-use plastic in the NHS, or by leading on climate adaptation for the NHS.&lt;/p&gt;\n&lt;p&gt;As a Senior Strategy Advisor, we are seeking a highly motivated professional who can work collaboratively across organisational boundaries and build relationships across the health system, academia and sustainability community to deliver key pieces of work. The post holder will have highly developed strategy, policy and analytical skills, with an ability to structure problems and develop appropriate solutions. They will have the ability to think and act strategically, to set direction for the Greener NHS Programme in a complex environment and manage relationships with a wide range of senior colleagues. They will good understanding of current health and climate policy. You will have experience of developing and managing teams, providing coaching and support. You will have experience of leading complex portfolio of projects, demonstrating the ability to manage competing priorities and tight deadlines for yourself and team. You will also demonstrate an understanding of sustainability and climate change issues.&lt;/p&gt;\n&lt;p&gt;Some travel throughout England may be required.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Email addressengland.sdu@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/126694.png", "name": "NHS England and NHS Improvement", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126694"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Skipton House, London", "postalCode": "SE1 6LH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4963", "longitude": "-.100723"}}, "title": "Senior Strategy Advisor", "url": "https://www.jobs.nhs.uk/xi/vacancy/916237105", "validThrough": "2020-11-11T23:59:59+0000"}