{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37760", "minValue": "32442", "unitText": "YEAR", "value": "£32,442 - £37,760 DOE (including enhancements)"}}, "datePosted": "2020-10-27T11:57:12+0000", "description": "&lt;p&gt;Our specially built hospital and first-class facilities are home to an integrated and multidisciplinary team. We provide care across four specialist wards, including psychiatric intensive care, Specialist Female Personality Disorder Service and low security wards for women and men. In line with our focus on recovery and reintegration, our hospital is ideally located for access to local community facilities and step down settings within the Cygnet family.&lt;/p&gt;\n&lt;p&gt;We are a quality driven service constantly striving to improve the quality of care we deliver to our service users we do this by having memberships with the following quality initiatives:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;NAPICU&lt;/strong&gt; iscommitted to developing and promoting the specialty of psychiatric intensive care and low secure services.They arededicated to improving patient experience and outcome, and to promoting staff support and development. NAPICU promote research, education and practice development using quarterly meetings and annual conferences,their journal, training initiatives and thewebsite and their social media.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;AIMS &lt;/strong&gt;(Accreditation of Inpatient Mental Health Services) peer focused Quality reviews. AIMS is a national project developed to ensure best practice is being achieved in in-patient mental health PICU services. Amongst other things the AIMS peer review team assess standards of care, current facilities, standards of documentation and health records, environmental facilities, and staff training qualifications, support and supervision.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We are located within 40 minutes of &lt;strong&gt;Leeds, Halifax &lt;/strong&gt;and &lt;strong&gt;Huddersfield&lt;/strong&gt; which can all be accessed by local transport.&lt;/p&gt;\n&lt;p&gt;We are looking for a caring and compassionate, highly motivated &lt;strong&gt;Registered Mental Health Nurse or Registered Learning Disability Nurse (night shifts only) &lt;/strong&gt;to join our dynamic multi-disciplinary team.&lt;/p&gt;\n&lt;p&gt;As mentioned above, we offer a range of specialist wards and therefore, if successful, you would be able to gain experience in a variety of different services ensuring you continued to develop high quality skills and further develop your knowledge base.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We offer a 38.5 hours contract&lt;strong&gt; (night shifts only)&lt;/strong&gt; at &lt;strong&gt;Cygnet Hospital Bierley &lt;/strong&gt;and in addition to competitive pay rate there are many benefits on offer including but not limited to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;NHS and employee discount scheme&lt;/li&gt;\n&lt;li&gt;50% NMC registration renewal paid by Cygnet&lt;/li&gt;\n&lt;li&gt;Free meals on duty&lt;/li&gt;\n&lt;li&gt;Ongoing support and supervision to aid professional development&lt;/li&gt;\n&lt;li&gt;Free parking&lt;/li&gt;\n&lt;li&gt;Employee assistance programme&lt;/li&gt;\n&lt;li&gt;Contributory pension scheme&lt;/li&gt;\n&lt;li&gt;RCNi membership&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;There are career progression opportunities within &lt;strong&gt;Cygnet Hospital Bierley&lt;/strong&gt; including the possibility of progressing to Clinical Team Leader. We support all our nurses to develop and identify their career goals so that we can tailor development opportunities to their personal needs.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Within the role you will be expected to:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Produce care plans and risk assessments in collaboration with the service user and MDT&lt;/li&gt;\n&lt;li&gt;Provide individualised care to our service users ensuring that they are supported to be involved in all aspects of their care and treatment&lt;/li&gt;\n&lt;li&gt;Work closely with the ward team, MDT and management team to develop the service, complete audits, and improve quality&lt;/li&gt;\n&lt;li&gt;Attend all training and engage in CPD to further develop knowledge and skills&lt;/li&gt;\n&lt;li&gt;Administer prescribed medicines in line with company policy&lt;/li&gt;\n&lt;li&gt;Take on the role as Nurse in Charge following a robust induction and when you feel confident&lt;/li&gt;\n&lt;li&gt;Be named nurse for service users, liaise with family and friends, communicate with care co-ordinators and ensure a high quality service is delivered for all involved&lt;/li&gt;\n&lt;li&gt;Contribute to an open and supportive working culture&lt;/li&gt;\n&lt;li&gt;Be well informed of the Mental Health Act 1983 &amp; have an understanding of latest nursing practices&lt;/li&gt;\n&lt;li&gt;Focused on patient recovery to monitor, manage &amp; reduce risk&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;You will have…&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Registered Mental Health Nurse (RMN) with a current valid registration&lt;/li&gt;\n&lt;li&gt;The ability to maintain documentation, undertake audits and demonstrate integrity in your role&lt;/li&gt;\n&lt;li&gt;A good understanding of the latest nursing practices&lt;/li&gt;\n&lt;li&gt;A commitment to patient recovery and an ability to work effectively within an MDT sharing knowledge and experiences as well as gaining knowledge and experience with colleagues&lt;/li&gt;\n&lt;li&gt;Compassion, resilience and a dedication to empower and support service user independence&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Cygnet Health Care&lt;/strong&gt; has been providing a national network of high quality specialist mental health services for 30 years.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What next?&lt;/strong&gt;&lt;br /&gt;If you care about making a difference – we want to talk to you!&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If you are interested, please click the link to apply.&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/129977.png", "name": "Cygnet Health Care", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=129977"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Cygnet Hospital Bierley, Bierley Lane, Bradford", "postalCode": "BD4 6AD"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7685", "longitude": "-1.73212"}}, "title": "Night Registered Mental Health/ Learning Disability Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244347", "validThrough": "2020-11-30T23:59:59+0000"}