{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "91881", "minValue": "91881", "unitText": "YEAR", "value": "£91,881 per annum"}}, "datePosted": "2020-10-14T11:01:52+0100", "description": "&lt;p&gt;&lt;span&gt;We are looking to recruit a motivated Locum Consultant in Acute Medicine to join colleagues in a dynamic general medicine service within the Health Board in delivering and supporting the Welsh Government’s vision for NHS Wales. This new appointment will join the team of established medical consultants working across Pembrokeshire and will have support to develop/maintain a specialist interest.&lt;br /&gt;&lt;br /&gt;The successful candidate will be expected to have specialty training and relevant experience in General Medicine. You would work in the General Medical Department and in an area of specialist interest if appropriate. You will be responsible for the management of patients presenting to Withybush General Hospital with medical problems and will lead a team of junior doctors.&lt;br /&gt;&lt;br /&gt;Hywel Dda University Health Board is one of seven acute Health Boards in Wales serving a population of 384,000 and Right now we are building our Future, setting the Pace for Care. The Health Board is committed to delivering high quality general medical care and sees the provision of consistent medical care as a key strategic priority. &lt;br /&gt;&lt;br /&gt;You will enjoy excellent conditions of employment, whilst building your future in one of the best locations in the UK. Haverfordwest is a historic county town in Pembrokeshire adjacent to Pembrokeshire National Park offering a relaxed lifestyle and picturesque countryside, with blue flag beaches a short distance away. West Wales is beautiful, sharing rugged coastlines with misty mountains. Outdoor sports are easy to pursue, whilst the amenities of urban centres such as Swansea and Cardiff are not too far away. The pace of life can be fast or slow, with a diverse range of people sharing an envious work-life balance across the region, with excellent quality schools, and reasonable property prices contribute to low living costs and high quality of life. &lt;br /&gt;&lt;br /&gt;Within this role there is an opportunity for consultants with a specialist interest and additional skills to promote and develop the service in order to improve diagnosis and management.&lt;br /&gt;&lt;br /&gt;In this post you will contribute to a current on call rota at Withybush based on a 1:10 non-resident on call, which you will be expected to reside (for on call purposes) within 30 minutes of the Hospital. &lt;br /&gt;&lt;br /&gt;Full structured induction into the NHS and Department will be made available as well as a Mentoring scheme for the successful applicant, as well as a Consultant Leadership Programme for all new consultants joining the Health Board.&lt;br /&gt;&lt;br /&gt;So if you are a senior doctor wishing, looking for a change of scene, or if you think life in a rural general hospital in one of the most beautiful parts of the UK might suit you, we would like to hear from you for a non-obligation chat.&lt;br /&gt;&lt;br /&gt;Information on the Health Board is provided with a full job description of this post. The health Board operates a No Smoking Policy and promotes equal opportunities.&lt;br /&gt;&lt;br /&gt;The Health Board is fully committed to:&lt;br /&gt;• Work-life balance, job-sharing and flexibility&lt;br /&gt;• Training &amp; Education including a successful Consultant Development &amp; Mentoring scheme&lt;br /&gt;• Medical Appraisal &amp; Revalidation for over 800 doctors&lt;br /&gt;&lt;br /&gt;Please ensure that you read the person specification carefully and that you meet all the essential criteria prior to applying. We encourage pre-interview visits.&lt;br /&gt;&lt;br /&gt;Please ensure that you include the e-mail addresses of your referees in your application form to enable us to contact them.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDr Angela PuffettJob titleConsultant Geriatrician and Medical LeadEmail addressAngela.J.Puffett@wales.nhs.ukTelephone number01437 773885&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123194.gif", "name": "Hywel Dda University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123194"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Withybush General Hospital, Haverfordwest", "postalCode": "SA61 2PZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.8127", "longitude": "-4.9651"}}, "title": "Locum Consultant Acute Physician", "url": "https://www.jobs.nhs.uk/xi/vacancy/916225864", "validThrough": "2020-11-16T23:59:59+0000"}