{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 Pro rata"}}, "datePosted": "2020-10-28T14:31:25+0000", "description": "&lt;p&gt;Here at The Dudley group we have a new and exciting opportunity for a Paediatric Education Facilitator. We are looking to recruit an experienced paediatric nurse who is a motivated candidate willing to provide energy and enthusiasm to drive Paediatric service delivery forward. We are seeking an individual who shares our vision and values and who is interested in further development of Children’s Services within the trust.&lt;/p&gt;\n&lt;p&gt;The post holder will be a proactive role model who leads in the clinical environment on the provision of clinical education and assessment of competence in paediatric services. The post holder will work alongside nurses and other healthcare practitioners to ensure the provision of high quality safe and effective evidence-based care, in accordance with local, divisional and hospital policies and procedures.&lt;/p&gt;\n&lt;p&gt;They will be expected to develop and deliver training and educational programmes and optimise learning activities for practitioners. The post holder will support the ward manager in implementing education, training and the development of strategies throughout the paediatric department for all staff groups.&lt;/p&gt;\n&lt;p&gt;They will be responsible for the delivery of high-quality practice learning whilst contributing to the provision of evidenced based care, quality improvement and research through competency and skill enhancement.&lt;/p&gt;\n&lt;p&gt;The post holder will contribute to the improvement of standards of care through the development of the newly qualified workforce, participating in audit and research, teaching and supporting colleagues and the provision of effective leadership.&lt;/p&gt;\n&lt;p&gt;The overall aim of this new and exciting role will be to ensure that the workforce is fit for purpose in terms of their roles and that individual/role competencies are reviewed to provide a safe, high quality and efficient service. As directed by the Ward Manager they will ensure the delivery of mandatory training, preceptorship and continuing professional development.&lt;/p&gt;\n&lt;p&gt;For further details contact Louise Garratt, Lead Nurse Paediatrics 01384 456111 extension 3423 or louise.garrat1@nhs.net&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120847.gif", "name": "Dudley Group NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120847"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Russells Hall Hospital, Dudley", "postalCode": "DY1 2HQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5023", "longitude": "-2.11774"}}, "title": "Paediatric Education Facilitator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247000", "validThrough": "2020-11-11T23:59:59+0000"}