{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 - £19,337 pro rata"}}, "datePosted": "2020-11-02T12:01:55+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for an enthusiastic and motivated individual, to join our friendly team as a Clerical Officer in the Cardio Respiratory team at Scarborough Hospital.&lt;/p&gt;\n&lt;p&gt;The post holder will provide support to the Cardio Respiratory technicians and existing administration team, by contributing to an efficient and effective service within a very busy environment, with responsibility for receiving, maintaining and providing manual and electronic data containing sensitive and confidential information.&lt;/p&gt;\n&lt;p&gt;The role will involve handling phone calls to and from patients and colleagues , including taking messages. There will be general administration tasks, including data entry, scanning and the upkeep of records and clinic lists.&lt;/p&gt;\n&lt;p&gt;You will need to have excellent communication skills, and be effective in prioritising workloads, with a flexible and patient centred approach.&lt;/p&gt;\n&lt;p&gt;Previous/current NHS experience in a health records and/or data input environment would also be an advantage.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Please be advised that this vacancy may close prior to the closing date stated, due to the high level of applications it may attract. If you would like to apply, please submit your application promptly to avoid disappointment.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;It&#39;s not just the area that&#39;s a great draw. In addition, as a member of our team you’ll have access to one of the most generous and comprehensive pension schemes in the UK, a minimum of 27 days annual leave (on top of Bank Holidays) and an award-winning package of staff benefits (see link on the right).&lt;span&gt;&lt;br /&gt;&lt;/span&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Heather Rafferty&lt;/p&gt;\n&lt;p&gt;Job title: Operational Support Manager&lt;/p&gt;\n&lt;p&gt;Email address: heather.rafferty@york.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number: 01723 346146&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "York Teaching Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120856"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Scarborough", "postalCode": "YO12 6QL"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.2817", "longitude": "-.434723"}}, "title": "Clerical Officer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251950", "validThrough": "2020-11-16T23:59:59+0000"}