{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51393", "minValue": "45780", "unitText": "YEAR", "value": "£45,780 - £51,393 per annum plus HCA where applica"}}, "datePosted": "2020-10-26T17:45:26+0000", "description": "&lt;p&gt;&lt;span&gt;An exciting opportunity has arisen in the North Central London MDT of NEL CSU. We are looking for a highly motivated and innovative individual, with the experience, enthusiasm and ability to support the financial management and reporting for non-acute spend including mental health, continuing care, prescribing and jointly commissioned services with the Local Authority.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Key responsibilities will include providing support to the non-acute commissioning teams, including providing support to directors and budget holders for NCL CCG. The post holder will be the key finance contact for a number of assigned non-acute contracts and will be involved in both the annual contracting round and in-year contract management for the assigned contracts. This role will also provide support with the development of the team and improving reporting processes.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;However, in response to the pandemic, the CCG and CSU have adapted to the changing environment by working together to deliver finance priorities. This has been facilitated by the introduction of a matrix working structure in order to maximise resources and ensure teams work in the most effective way. This means that the post holder may be asked to work flexibly across a range of management accounting finance tasks, offering direct support to both the NCL Finance team within the CSU and/or the CCG Finance team, the CCG Directors of Finance and the NCL Chief Finance Officer.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The successful applicant will need to have a detailed knowledge and understanding of the NHS and of NHS financial processes; understand the importance of partnership working and be able to represent our customers in a professional and articulate manner.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;As well as evidenced experience within all areas of Finance you will have excellent verbal and written communication skills, be able to use your initiative and work to tight timescales.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are looking for candidates who have a strong customer focus; are adaptable and able to work across a range of service areas; have strong analytical and communication skills; are able to retain a focus on improving outcomes even in challenging situations where change needs to happen at pace.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Candidates must be comfortable working in an environment where Commissioners have indicated an intention to in-house CSU services. We view this as a positive step towards integration and will deliver a workforce fully focused on service transformation.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The post will be based at the CSU’s Central London offices near Liverpool Street and also at other NCL CCG sites, as required.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;span&gt;For further details on this role, please refer to the job description. Please pay careful attention to the essentials and desirables of the person specification when completing your supporting statement.&lt;/span&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameCharlie BoggisJob titleNon Acute Finance LeadEmail addresscharlie.boggis@nhs.netTelephone number020 3688 3386&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NEL Commissioning Support Unit", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127694"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Clifton House, London", "postalCode": "EC2A 2DU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5222", "longitude": "-.084148"}}, "title": "Non Acute Finance Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243579", "validThrough": "2020-11-09T23:59:59+0000"}