{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 per annum pro rata"}}, "datePosted": "2020-11-04T15:46:03+0000", "description": "&lt;p&gt;&lt;strong&gt;Two roles available: 1 x 37.5 hours and 1x 6 hours. To be considered please clearly state in your application which role you are applying for.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An opportunity has arisen for a Housekeeping Supervisor to become a member of the Supervisory team here at the Horton General Hospital in Banbury, managing the day-to-day housekeeping and linen service across a 7 day working week. This role, whilst not having direct patient access, supports and underpins the patient’s experience and journey on a number of levels.&lt;/p&gt;\n&lt;p&gt;The ideal candidate will live within 30 minutes of the hospital, have worked in a cleaning environment and be able to demonstrate a proven track record in supervising staff in line with local policies and procedures.&lt;/p&gt;\n&lt;p&gt;If you enjoy being busy and relish the opportunity to make a difference by providing a clean environment that meets national cleaning standards and are also able to share your skills and knowledge when it comes to both induction training and ongoing assessments of staff input and output, then this job could be for you!&lt;/p&gt;\n&lt;p&gt;You will need to be able to communicate positively with members of the public, all groups of staff and Estates and Facilities teams and be flexible in your daily approach to challenging situations. There will be times, when you will be working alongside the Housekeepers, in order to demonstrate cleaning procedures and also at times when the service is stretched. You will also have numerous opportunities to demonstrate your ability to juggle a number of tasks at once.&lt;/p&gt;\n&lt;p&gt;As part of the Housekeeping Supervisory team, you will also manage the linen and uniform service across the site, ensuring that adequate clean linen is provided to the wards and that uniforms are issued to staff in a timely manner.&lt;/p&gt;\n&lt;p&gt;The Housekeeping service also supports the nursing team with the provision of patient beverages and the meal service, hence a Food Hygiene Level 2 certificate would be advantageous.&lt;/p&gt;\n&lt;p&gt;The ability to confidently use a PC is essential as you will be carrying out regular cleaning audits, risk assessments, completing and updating COSHH data, along with the updating of cleaning schedules to meet the needs of the service.&lt;/p&gt;\n&lt;p&gt;Please ensure you read the Job Description and Personal Specification, as all applications will be scored against the required criteria.&lt;/p&gt;\n&lt;p&gt;Full training will be provided for the successful candidate.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing date: 18th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Planned interview date: tbc&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Leeann Grant, Housekeeping Manager, Leeann.Grant@ouh.nhs.uk 01295 229275 Monday - Friday between the hours of 1.00 pm - 3.00 pm.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Oxford University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120889"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Horton General Hospital, Banbury", "postalCode": "OX16 9AL"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.0535", "longitude": "-1.33665"}}, "title": "Housekeeping Supervisor", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256481", "validThrough": "2020-11-18T23:59:59+0000"}