{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44780", "minValue": "37638", "unitText": "YEAR", "value": "£37,638 - £44,780 Per annum inclusive"}}, "datePosted": "2020-10-30T17:15:27+0000", "description": "&lt;p&gt;Do you want a further your career in Paediatric Emergency Care; learning the skills and knowledge to help you look after some of London’s sickest children? Are you enthusiastic, self-motivated and looking to work within a friendly and dynamic team? If so then this is the post for you!&lt;/p&gt;\n&lt;p&gt;The Royal Free, UCLH and the Whittington Children’s Emergency Departments have recently merged to form a North Central London Hub based at the Whittington site in Archway. This merger is part of a North Central London initiative to combine Paediatric Services throughout winter as part of Covid-19 response.&lt;/p&gt;\n&lt;p&gt;We are looking for enthusiastic Band 6 Nurses to join the UCLH Paediatric ED Team initially at the NCL Hub with the hope of bringing services back to the UCLH site in the spring.&lt;/p&gt;\n&lt;p&gt;UCLH has an international reputation for research, innovation and patient-focused care. The posts are based within a highly motivated team who are committed to achieving high quality clinical outcomes for a diverse patient population. The team is supported by Clinical Practice Facilitators, two departmental Play Specialists and has strong links with the Paediatric and Adolescent Division. UCLH Emergency Department strives on team work. You will need to have strong communication and be adaptive to working in emergency situations and an eagerness to advance in Emergency Nursing practice. &lt;br /&gt;&lt;br /&gt;This is a responsible role and we will endeavour to encourage you to play an important part in strengthening our status as one London’s leading Emergency Departments. The shift pattern is internal rotation and will include working within the resuscitation room. &lt;br /&gt;&lt;br /&gt;Working within a leading academic trust you can look forward to proactive managerial support for personal and professional development including opportunities for degree and masters pathways via Southbank or City University and internal teaching opportunities.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Emily Westbrook, Charge Nurse, Paediatric ED emily.westbrook@:nhs.net or Rebecca Jarman rebecca.jarman@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University College London Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120731"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "UCLH, London", "postalCode": "NW1 2PG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5257", "longitude": "-.13737"}}, "title": "Paediatric Senior Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251044", "validThrough": "2020-11-13T23:59:59+0000"}