{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 £24,214 to £30,112 pa (part time"}}, "datePosted": "2020-10-27T09:31:21+0000", "description": "&lt;p&gt;Children’s Therapy Team South is a forward-thinking integrated team providing paediatric therapy services to children and families across Blackpool, Fylde &amp; Wyre. We currently have opportunities for two band 5 Speech and Language Therapists to join our friendly and supportive paediatric team on a full time basis 37.5 hours per week (PART TIME HOURS WILL BE CONSIDERED). These are permanent posts.&lt;/p&gt;\n&lt;p&gt;You will have opportunities to develop and maintain your paediatric therapy skills with the support of a well-established paediatric SLT team. We have a strong commitment to working collaboratively with all appropriate agencies to provide the highest standard of care to paediatric patients and their families.&lt;/p&gt;\n&lt;p&gt;You will be required to work flexibly when required to provide cover during periods of maternity leave, recruitment or long-term sickness absence.&lt;/p&gt;\n&lt;p&gt;You will offer speech and language therapy management from community clinic, and/or school locations as required. Working with children and young people with a range of speech, language and communication difficulties from 0-19. The post requires you to work with both other members of the speech and language therapy team and a range of other professionals.&lt;/p&gt;\n&lt;p&gt;The Fylde coast is a welcoming place to live, offering a mix of market town and rural locations as well as the more well-known locations of Blackpool and Lytham St. Annes. We are only 45 minutes away from Manchester and less than an hour away from the southern Lake District, with the university town of Lancaster in close proximity also.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameSarah SutcliffeJob titleTeam LeaderEmail addresss.sutcliffe@nhs.netTelephone number07833162275Additional contact information&lt;/p&gt;\n&lt;p&gt;Sarah Sutcliffe, Team Leader, on 07833162275 or Louise Rylance, Service Lead, on 07879 431817&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Blackpool Teaching Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120954"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Blackpool Teaching Hospitals, Blackpool Teaching Hospitals", "postalCode": "FY8 2EP"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7547", "longitude": "-3.0308"}}, "title": "Speech and Language Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243837", "validThrough": "2020-11-10T23:59:59+0000"}