{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 p.a plus HCAS"}}, "datePosted": "2020-11-05T16:01:31+0000", "description": "&lt;p&gt;&lt;strong&gt;Join us in helping our children and young people with complex mental health needs plant seeds and grow in confidence within our integrated CAMHS ‘Park’.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen to join our multidisciplinary teams at ‘The Park’. Our Tier 4 CAMHS wards are co-located, within the grounds of Springfield University Hospital. ‘The Park’ is open for Children and Adolescents aged 6-18 years on Corner House, our ward for Children and Adolescents with hearing difficulties.&lt;/p&gt;\n&lt;p&gt;The service is committed to promoting Deaf culture and promoting the Deaf identity of young people is integral to the delivery of care within the service. The unit is the only one of its kind in the country and is commissioned by the National Specialist Commissioning Team. We therefore play a key role in the ongoing development of National Deaf CAMHS Services along with our colleagues in other parts of the country. As A Health Care Assistant, you will work closely with the young people and play a key role in promoting a positive culture and act as a role model.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What is at The Park?:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Park provides specialised mental and physical healthcare and treatment for children and adolescents suffering with a wide range of mental health problems including services specific for Eating Disorders and children with hearing difficulties. The Park consists of three wards; Wisteria, Aquarius and Corner House and works with the attached school that provides a full range of educational services onsite. Rated as ‘Outstanding’ by OFSTED.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Corner House&lt;/strong&gt; is a 7 bedded National Child and Adolescent inpatient ward. It is a unique unit providing mental health services for children as young as 5 up to their 18th birthday. Corner House also offers up to 3 day patient places. The unit is part of the wider National Deaf CAMHS and works closely with the Deaf CAMHS community teams across the U.K.&lt;/p&gt;\n&lt;p&gt;The children/young people admitted to the ward are all deaf or hard of hearing and come from a wide range of background from all over the country. Young people come onto the ward with a range of different presentations including emotional and behaviour dysregulation and psychotic illnesses. As a large proportion of the presentation at admission is directly or indirectly related to the language deprivation or disorder the use of medication is not considered as a first choice. The limited access to language (or language difficulties) impacts on the individual’s emotional development and regulation skills. 31% of deaf children/young people present with mental health problem whilst their hearing counterpart present with a figure of 20%. Within this group, 30% of deaf children/young people have mental health difficulties that present in the form of emotional dysregulation and there is a strong co-morbidity with other presentations such as depression, anxiety, deliberate self-harm, psychosis, Autism Spectrum Disorder, somatisation, and attachment disorders, amongst others.&lt;/p&gt;\n&lt;p&gt;The ward has a strong therapeutic ethos and works as a therapeutic community working closely with the attached school. Clinicians use a range of techniques and interventions to support young people during their time on the ward advised by mentalisation based therapies and emotional focused models. The importance of family work is recognised in the service and parents/carers are actively involved in the work that we do.&lt;/p&gt;\n&lt;p&gt;We work hard to promote a bilingual and multicultural environment and support deaf culture both within and outside of the service. Owing to the nature of this highly complex group and the type of presentation clinicians are expected to deliver treatment in BSL or Sign Supported English (SSE) depending on the child/young person’s mode of communication. This is supported with the use of British Sign language (BSL) interpreters and/or deaf colleagues if the clinician is unable to sign. You will be supported in training and develop skills in BSL when you start on the ward and will be put through BSL level one and two. Support is also available for both the understanding and the application of the therapeutic work through monthly in house training days and the option to apply for relevant training.&lt;/p&gt;\n&lt;p&gt;You will be dynamic, motivated, and passionately committed to providing the highest possible quality of mental health care to Deaf young people. The post is demanding but rewarding, and you will be provided with excellent multi-disciplinary team support, supervision and learning opportunities. It is not essential that you are able to communicate using BSL initially, as you will be provided with the training opportunity to achieve BSL Level 2 within two years of your appointment.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Tatenda Chikoore, Ward Manager&lt;/p&gt;\n&lt;p&gt;Email address tatenda.chikoore@swlstg.nhs.uk&lt;/p&gt;", "employmentType": "OTHER", "hiringOrganization": {"@type": "Organization", "name": "South West London and St Georges Mental Health NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123034"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Springfield University Hospital, London", "postalCode": "SW17 7DJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.436", "longitude": "-.167638"}}, "title": "Staff Nurse (Deaf Child Inpatient Corner Hse) - Band 5", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258478", "validThrough": "2020-11-12T23:59:59+0000"}