{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "39000", "minValue": "39000", "unitText": "YEAR", "value": "up to £39,000 per annum DOE"}}, "datePosted": "2020-10-23T15:03:39+0100", "description": "&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;I help to make a difference!&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Are you collaborative, caring and compassionate?&lt;br /&gt;&lt;br /&gt;Prisons are one of the most challenging, yet rewarding places for healthcare professionals to work - if you’re looking for a role where you can develop your existing skills and learn something new every day, then this is the place to be.&lt;br /&gt;&lt;br /&gt;As a healthcare provider, we recognise the fact that prisoners are a socially excluded group with complex healthcare needs that can often be associated with poor outcomes. We believe in putting the patient first, regardless of the environment or their history.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Practice Plus Group are Health in Justice Market leader, providing healthcare services to offenders across the country. Our model of care is our Wellbeing Approach – an integrated, comprehensive approach in recognition of the fact prisoners are a socially-excluded group with healthcare needs which are complex and often associated with poor outcomes. It adopts the premise no single health/wellbeing factor can be taken in isolation of other motivational issues which might impact a person’s care.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Interested in clinical development?&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;We could give you the opportunity to develop in to a specialist role of your interest and benefit to the service i.e. ANP, BBV, sexual health, plastering, ILS/ALS (intermediate life support and advanced life support), health promotion, phlebotomy, vaccinations, suturing, wound care, RCGP, and long term condition courses.&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;What do we need from you so you can do the job?&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;You will be a registered nurse and able to demonstrate suitable experience. Your role will include:&lt;br /&gt;&lt;br /&gt;•To coordinate and manage all national screening programmes to take place within HMP Brixton to ensure proactive identification and treatment.&lt;br /&gt;•To ensure access to screening, immunisations and health promotions to all the prison population at HMP Brixton.&lt;br /&gt;•To coordinate and manage the sexual health services, including Point of Care Testing for HIV, Hep C and Hep B.&lt;br /&gt;•To undertake Chlamydia testing for all under 21s.&lt;br /&gt;•To work in collaboration with the practice nurse in ensuring that the Flu vaccination is offered and promoted to all those eligible for the programme.&lt;br /&gt;•To Coordinate and manage the TB services and ensure appropriate referrals to the GP take place.&lt;br /&gt;•To manage and lead junior staff working in primary care&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;In return for your hard work you will...&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Receive an annual salary of up to £39,000 - depending on experience. You&#39;ll also get a number of benefits including a company contributory pension scheme, 25 days annual leave plus 8 public bank holidays (pro-rata for part-time) plus CPD and re-validation support.&lt;br /&gt;&lt;br /&gt;Other benefits include cycle to work scheme plus training and clinical development opportunities.&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Next Steps&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;If you are shortlisted, you will be contacted by the Internal Recruiter for this role.&lt;br /&gt;&lt;br /&gt;The recruiter will submit your CV to the hiring manager and in turn we will arrange an interview for you to attend at HMP Brixton if the hiring managers feel that you are suitable for the job.&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;More Information&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;This is a full-time role working 37.5 hours per week.&lt;br /&gt;&lt;br /&gt;Please note that offers of employment are subject to Practice Plus Group Terms &amp; Conditions and receipt of satisfactory references, an enhanced DBS check and prison vetting.&lt;br /&gt;&lt;br /&gt;We reserve the right to close this role early once a sufficient number of applications have been received.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Practice Plus Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130136"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "London", "postalCode": "SW2 5XF"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.452", "longitude": "-.124685"}}, "title": "Public Health Lead- HMP Brixton", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241033", "validThrough": "2020-11-06T23:59:59+0000"}