{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "27941", "minValue": "25676", "unitText": "YEAR", "value": "£25,676 - £27,941 per annum inclusive of HCAS"}}, "datePosted": "2020-10-22T16:16:23+0100", "description": "&lt;p&gt;We are looking for registered Nurse Associates who enjoy fast paced environment with a great opportunities to learn and develop to join our AAU team.&lt;/p&gt;\n&lt;p&gt;The AAU works very closely with the busy Accident and Emergency department, caring for a wide variety of patients in an acute short stay environment. There is a capacity of 45 trolleys and it will have close working links with Ambulatory care&lt;/p&gt;\n&lt;p&gt;We are looking for motivated individuals who are passionate about our core Trust values, the unit will be focused upon flow and a high turnover of patients. We require a nursing team with a wide variety of experience and skills to care for the diverse patient group.&lt;/p&gt;\n&lt;p&gt;The newly formed AAU team is passionate about getting it right for patients and their families. We believe that by investing in our staff that they will deliver better care to our patients and help create and contribute to a work environment that makes it fun to come to work.&lt;/p&gt;\n&lt;p&gt;If you believe you are a passionate, driven and committed individual with experience and are looking for a new career opportunity, we would like to hear from you.&lt;/p&gt;\n&lt;p&gt;If you are internal and have been at the trust for 9 months or longer you will be eligible for the internal transfer scheme.&lt;/p&gt;\n&lt;p&gt;The Trust offers access to training and development, internal transfer scheme and staff accommodation.&lt;/p&gt;\n&lt;p&gt;If you would like to find out more about this exciting opportunity please contact:&lt;/p&gt;\n&lt;p&gt;Matrons: Kay Gilsenan - kay.gilsenan@nhs.net or Karen Kirwilliam - karen.kirwilliam@nhs.net&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120624.jpg", "name": "Royal Free London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120624"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "BH:AAU, Barnet", "postalCode": "EN5 3DJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.651", "longitude": "-.215519"}}, "title": "Band 4 Nursing Associate", "url": "https://www.jobs.nhs.uk/xi/vacancy/916239313", "validThrough": "2020-11-22T23:59:59+0000"}