{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum/pro rota"}}, "datePosted": "2020-10-30T10:31:06+0000", "description": "&lt;p&gt;&lt;strong&gt;Oxford Transplant Centre&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Transplant Immunology and Immunogenetics&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Oxford Transplant Centre currently provides kidney, pancreas, intestinal and islet cell transplant services and other surgery to support patients at the Oxford University Hospitals NHS Foundation Trust. Our pancreas transplant programme is now the most active in Europe. The unit is also part of National Organ Retrieval Service for all abdominal organs.&lt;/p&gt;\n&lt;p&gt;The ISO15189 and EFI accredited Transplant Immunology and Immunogenetics Laboratory is based within the Oxford Transplant Centre and provides a consultant-led specialist regional service. The Laboratory provides histocompatibility and immunogenetics (H&amp;I) support for transplantation of living donor kidneys, deceased donor solid organs, pancreatic islets and haematopoietic stem cells. H&amp;I services are also provided to clinicians to define disease susceptibility gene variants as an aid to patient diagnosis and treatment. The laboratory supports research and development in H&amp;I testing and in the broader field of clinical transplantation.&lt;/p&gt;\n&lt;p&gt;We are recruiting a Band 7 Clinical Scientist to support the activities of the Transplant Immunology and Immunogenetics Laboratory. The post-holder will be ideally be HCPC registered as a Clinical Scientist in H&amp;I or be close to completion of STP or the BSHI diploma.&lt;/p&gt;\n&lt;p&gt;After sufficient training, the post-holder will participate in the emergency on-call rota for the supra-regional solid organ transplantation program.&lt;/p&gt;\n&lt;p&gt;The post holder will have a relevant BSc Hons./Biomedical Sciences degree and ideally have practical post-registration experience in the field of Histocompatibility and Immunogenetics and Transplant Immunology.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Healthcare Scientist Band 7 Post (if HCPC registered)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Pre-registration scientists will be paid at Band 6 until HCPC registration is fulfilled&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing Date: 13/11/20&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For informal discussion concerning this post, please contact Dr Barnardo on &lt;/strong&gt;&lt;strong&gt;martin.barnardo@ouh.nhs.uk&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Oxford University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120889"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Churchill Hospital, Oxford", "postalCode": "OX3 7LJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7503", "longitude": "-1.21469"}}, "title": "Clinical Scientist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249746", "validThrough": "2020-11-13T23:59:59+0000"}