{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51393", "minValue": "45780", "unitText": "YEAR", "value": "£45,780 - £51,393 p.a inclusive of HCAS"}}, "datePosted": "2020-11-06T10:16:48+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for an experienced and highly skilled community Band 7 Clinical Lead Nurse to work in our rapidly expanding Perinatal Mental Health Team. The North London Partners Specialist Perinatal Mental Health Service is a community mental health service for pregnant and postnatal women with severe and complex mental illness. The aim of the team is to detect, prevent and treat perinatal mental health problems to improve the experience of pregnancy and the first year postpartum for women and their families.&lt;/p&gt;\n&lt;p&gt;Camden &amp; Islington Mental Health Foundation Trust jointly with Barnet, Enfield &amp; Haringey Mental Health Trust secured investment to develop perinatal mental health services across five boroughs in the North Central London area. The service has been running since 2017 and provides specialist perinatal mental health services across the boroughs of Camden, Islington, Barnet, Enfield and Haringey. The service delivery model moved to three sub-teams in July 2020. Sub-teams are now divided as follows;&lt;/p&gt;\n&lt;p&gt;-West Team (Barnet)&lt;/p&gt;\n&lt;p&gt;-East Team (Enfield &amp; Haringey)&lt;/p&gt;\n&lt;p&gt;-South Team (Camden &amp; Islington)&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;This post primarily will be based in the South Team, covering Camden and Islington, although depending on service needs you may have to move teams if needed. You will be REQUIRED to carry out face to face contacts either at service users home, acute &lt;/strong&gt;hospitals and other community settings.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;The North London Partners Specialist Perinatal Mental Health Service runs clinics at maternity sites, children’s centres and community centres across the boroughs as well as conducting home visits.&lt;/p&gt;\n&lt;p&gt;As a clinical lead nurse specialist will be responsible for providing a mental health service in Camden and Islington. You will join an established clinical MDT including Consultant Psychiatrists, Clinical Lead Nurses, Occupational Therapists, Clinical Psychologists, Social Worker, Family Therapist, Nursery Nurses, Peer Support Workers and Pharmacist.&lt;/p&gt;\n&lt;p&gt;The post-holder will have clinical responsibility for adult patients referred to the service but will also work closely with Child &amp; Adult Social Care within this integrated clinical service model. The North London Partners Specialist Perinatal Mental Health Service will work closely with Maternity Services, Adult Community Mental Health Teams, Liaison Psychiatry Teams, Crisis Resolution &amp; Home Treatment Teams, Adult Psychological Services, Primary Care Services, other community services and organizations.&lt;/p&gt;\n&lt;p&gt;The post holder will actively contribute to the planning, development and evaluation of perinatal mental health clinical services using advanced clinical leadership skills and knowledge to provide training and consultancy within the specialty area of perinatal mental health.&lt;/p&gt;\n&lt;p&gt;The post holder will be responsible for ensuring that the team understands and operates to the requirements of the service line operational policy and service line strategy and that safe, evidence based, effective, culturally competent care is delivered in a timely manner to service users.&lt;/p&gt;\n&lt;p&gt;A wide range of previous experience of working within hospital and community settings is essential. Experience of working in perinatal mental health services is desirable but not essential.&lt;/p&gt;\n&lt;p&gt;Use of a car is desirable but not essential.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Cherise Thompson&lt;/p&gt;\n&lt;p&gt;Job title: Service Manager&lt;/p&gt;\n&lt;p&gt;Email address: cherise.thompson@candi.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number: 07766 780 009&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Informal discussions and/or visits (for shortlisted candidates) are welcomed and can be arranged by contacting Cherise Thompson-Specialist Perinatal Mental Health Service Manager on 07766 780 009.&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121247.jpg", "name": "Camden and Islington NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121247"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St Pancras Hospital, London", "postalCode": "NW1 0PE"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5365", "longitude": "-.131478"}}, "title": "Specialist Perinatal Clinical Lead", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259183", "validThrough": "2020-11-22T23:59:59+0000"}