{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "30615", "unitText": "YEAR", "value": "£30,615 £30615.00 pa/pro rata"}}, "datePosted": "2020-10-30T11:32:06+0000", "description": "&lt;p&gt;&lt;strong&gt;An opportunity has arisen to work within an integrated hospital discharge team, within Wirral Community NHS Foundation Trust’s access and intermediate Care team &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An opportunity has arisen for a dynamic and motivated, band 5 / newly / due to qualify Social worker to join the service, which also involves a role in the multi- disciplinary team within the &lt;strong&gt;Integrated Discharge Team (IDT) based within Arrowe Park Hospital, WUTH.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for an enthusiastic and forward thinking social worker to join our busy, pro-active, integrated team based within Arrowe Park Hospital.&lt;/p&gt;\n&lt;p&gt;The role will involve working with people with a wide variety of both physical and mental health conditions as well as complex social issues. This role will involve collaborative working and taking responsibility within our experienced multi-disciplinary teams- MDTs, to ensure best possible outcomes are achieved for people using the service, their carers and families. Ideally knowledge of the discharge Pathways would be advantageous but not essential as training will be provided. To work effectively to provide person- centred care, ensure timely safe discharges for people who use the service, prevent discharge delays and working with the wider team such as Transfer to Assess, Rapid Response and Home First Team to avoid admissions to hospital and long term care.&lt;/p&gt;\n&lt;p&gt;You need to have social work experience, have an excellent understanding of current social work legislative practice. (Adult Social Care 2020-2021 winter plan Gov.uk ) There will be a need to ensure that you work in compliance of the requirements of The Care Act 2014.&lt;/p&gt;\n&lt;p&gt;Risk management, excellent communication skills and an ability to prioritise and often work at a fast pace is essential. You will need good time management skills.&lt;/p&gt;\n&lt;p&gt;This post requires applicants to be a social worker. It is also essential that the post holder is able to be effectively resilient to challenges posed by the Acute Trust (hospital) during winter pressures.&lt;/p&gt;\n&lt;p&gt;The post holder will be required to actively participate in quality improvement initiatives and to ensure that they manage their continuous professional development. There will be the opportunity for regular supervision and to attend in-service training and professional development. The team has an active social work focus group, to which membership will be offered&lt;/p&gt;\n&lt;p&gt;The service operates with extended hours 7 days per week providing cover 8am-8pm. You would be expected to work to cover service demands across the extended hours and weekends on a roster basis.&lt;/p&gt;\n&lt;p&gt;Please see the job description and personal specification for application requirements. Applicants are requested to provide the required information outlined in these documents in their application to demonstrate their suitability for the post and clear reasoning for wishing to work in your chosen team in the Integrated Discharge Team.&lt;/p&gt;\n&lt;p&gt;Current Social Work England registration with the relevant social work qualification is essential to this post. Travel is an essential part of this role and therefore access to a car for work purposes is essential. Appointment to the post will be subject to successful interview, references, DBS clearance and Occupational Health checks.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameCheryl WilliamsJob titleProfessional LeadEmail addresscheryl.williams4@nhs.netTelephone number0151 604 7226 ext 7371Additional contact information&lt;/p&gt;\n&lt;p&gt;Cheryl Williams Professional Lead on cheryl.williams4@nhs.net or Paul McLoughlin, Professional Lead on paul.mcloughlin1@nhs.net, telephone 0151 604 7226 ext 7371 / 7598.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/126754.png", "name": "Wirral Community Health and Care NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126754"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Arrowe Park Hospital, Wirral University Teaching Hospital NHS Trust, Wirral", "postalCode": "CH49 5PE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3709", "longitude": "-3.09545"}}, "title": "ASYE Social Worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249974", "validThrough": "2020-11-13T23:59:59+0000"}