{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "53459", "minValue": "47544", "unitText": "YEAR", "value": "£47,544 - £53,459"}}, "datePosted": "2020-10-30T10:30:46+0000", "description": "&lt;p&gt;The COVID-19 pandemic affects all our communities, now is the time for us to come together to truly make a difference. To increase testing for COVID-19, the Government has significantly expanded its laboratory capacity and staffing. As a result a new COVID-19 Lighthouse Testing Laboratory will be opening in Bracknell. The laboratory will be managed by Berkshire and Surrey Pathology Services, which is the first to be run by the NHS. BSPS is a large and established pathology network operating across Royal Berkshire, Royal Surrey, Frimley Health and Ashford and St Peter’s Hospitals NHS Foundation Trusts.&lt;/p&gt;\n&lt;p&gt;We are currently recruiting for Deputy Lead Scientists to help us achieve our target of running tens of thousands of tests every day.&lt;/p&gt;\n&lt;p&gt;As an experienced scientist in molecular/virology fields, the post holder is expected to use their knowledge and skills and act with a degree of autonomy in providing a COVID-19 testing service. Working in close liaison with the Clinical Lead, the post holder will be responsible for the day to day management of staff and resources within the department. The post holder will provide technical lead and expertise within the department and will assist the Lead Scientist in facilitating the organisation and management of all technical work within the specialty.&lt;/p&gt;\n&lt;p&gt;The post holder will be required to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Be responsible for the day to day operation and staff management within the department, ensuring the uninterrupted delivery of a quality specialist service, managing deficiencies of resources where necessary, under the overall direction of the Lead Scientist&lt;/li&gt;\n&lt;li&gt;Perform all appropriate technical procedures in use within the department and to take the necessary steps in dealing with all technical operational problems which arise, reporting to the Lead Scientist according to departmental practice&lt;/li&gt;\n&lt;li&gt;Record and disseminate detailed workload statistical analysis&lt;/li&gt;\n&lt;li&gt;Take overall responsibility for service performance in the area of quality control (external and internal). To play key role in ensuring compliant accreditation documentation and to ensure appropriate compliance by subordinate staff under the guidance of the Lead Scientist and in conjunction with relevant Quality staff&lt;/li&gt;\n&lt;li&gt;Perform local induction of all laboratory staff and to facilitate corporate induction in line with policies&lt;/li&gt;\n&lt;li&gt;Manage staff leave and sickness absence in line with protocols and Trust policies&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Successful candidates need to have a Biomedical Science / Medical Microbiology / Virology or equivalent academic qualification alongside significant management experience. It is desirable to be registered with the Health and Care Professions Council (HCPC) and be a member of FIBMS.&lt;/p&gt;\n&lt;p&gt;Candidates are required to have extensive relevant specialist laboratory experience, preferably molecular or virology, with the relevant knowledge of laboratory computer systems. There is a requirement for a good grasp of Health &amp; Safety issues, COSHH, ISO &amp; quality issues as well as stock management. Previous management experience is required with a proven track record of conducting staff appraisals, supervision and training.&lt;/p&gt;\n&lt;p&gt;It is essential to have the ability to communicate clearly with precise attention to detail. It is important to be able to work under own initiative and without direct supervision within responsibilities of role.&lt;/p&gt;\n&lt;p&gt;The laboratory will be operating 24 hours a day, seven days a week; therefore successful candidates need to be able to work on a shift pattern. Initially there will be three shift patters of 8 hours (6am-2pm; 2pm - 10pm; 10pm to 6am) however in the future the shifts will change to two 12 hour shifts.&lt;/p&gt;\n&lt;p&gt;In return you will be offered:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Full time employment, 37.5 hours per week&lt;/li&gt;\n&lt;li&gt;Secure environment of a fixed term contract for 12 months&lt;/li&gt;\n&lt;li&gt;Additional benefits of working with the NHS&lt;/li&gt;\n&lt;li&gt;Be part of something special – this is the first Lighthouse Lab run by the NHS&lt;/li&gt;\n&lt;li&gt;Sense of pride that you are supporting the nation and NHS in the fight against COVID&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The host employing organisation will be Royal Berkshire NHS Foundation Trust. The laboratory will be based at Bracknell Healthspace, Brants Bridge, Bracknell.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Please email lighthouse@royalberkshire.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122060.jpg", "name": "Royal Berkshire NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122060"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bracknell", "postalCode": "RG12 9BG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4138", "longitude": "-.736136"}}, "title": "Bracknell Lighthouse Lab - Deputy Lead Scientist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249731", "validThrough": "2020-11-29T23:59:59+0000"}