{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-11-03T11:16:38+0000", "description": "&lt;p&gt;We are looking for an enthusiastic, highly motivated and committed individual to join a &lt;br /&gt;well-established and supportive multi-disciplinary team on a secondment/fixed term basis.&lt;/p&gt;\n&lt;p&gt;The Lancashire Early Intervention Service (EIS) specialises in working with individuals aged 14 to 65 at risk of, or currently experiencing, first episode psychosis. Our team provides a range of specialist interventions including Cognitive Behaviour Therapy and Family Interventions within a hub and spoke model. There are three multi-disciplinary early intervention service teams covering the Lancashire footprint.&lt;/p&gt;\n&lt;p&gt;The Lancashire Early Intervention Service is based within the Children and Families Network of Lancashire &amp; South Cumbria NHS Foundation Trust. We enjoy close working links with a range of community and inpatient services for children and adults.&lt;/p&gt;\n&lt;p&gt;We place a strong emphasis on professional and clinical supervision in order to support and develop individuals as part of our commitment to maintain our focus on delivering the highest quality clinical service.&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen to be part of this team, there is one permanent post for a Registered Mental Health Nurse to join the team. The post will provide an opportunity for development for those who are interested in working within the Early Intervention Service and to gain valuable experience working within a community setting.&lt;/p&gt;\n&lt;p&gt;The post of Care Coordinator will work as part of the EIS North Lancashire Team who are currently based at The Gateway, Blackpool football stadium although there is an expectation that the successful applicant would also provide cover to the Morecambe and Lancaster area depending on service need.&lt;/p&gt;\n&lt;p&gt;The post is being offered on a Secondment/fixed term basis. &lt;strong&gt;If you are applying as a secondment please ensure that you have agreement to apply from your current line manager.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Minimum professional qualifications: &lt;/strong&gt;&lt;strong&gt;Registered Mental Health Nurse (RMN), Social Worker or Occupational Therapist&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is a unique opportunity to be involved in the development of a new service with opportunities to participate in ongoing skills development.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Dawn Parry, Team Manager on 01253 957470&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121124.png", "name": "Lancashire & South Cumbria NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121124"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Gateway Centre, Blackpool Stadium, Blackpool", "postalCode": "FY1 6EN"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8036", "longitude": "-3.04831"}}, "title": "Care Co-ordinator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253684", "validThrough": "2020-11-17T23:59:59+0000"}