{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 pa, pro-rata"}}, "datePosted": "2020-10-30T10:16:34+0000", "description": "&lt;p&gt;We are looking for two dynamic and enthusiastic Psychiatric Nurse therapists to contribute to the Eating Disorder Service for people with Anorexia Nervosa.&lt;/p&gt;\n&lt;p&gt;The DHCFT Eating Disorder Service was established in 2007, it is a small team which, up and till now, provides a specialist service to people with Anorexia Nervosa.&lt;/p&gt;\n&lt;p&gt;The existing team covers the City of Derby and the County of Derbyshire providing a high quality therapeutic service, delivering clinical interventions to clients with eating disorders and their families or carers.&lt;/p&gt;\n&lt;p&gt;The service also provides consultation and advice to a wide range of staff; working in partnership with First Steps Self help and support service to deliver high quality interventions to clients with eating disorders and their carers.&lt;/p&gt;\n&lt;p&gt;In addition, the service has close working relationship with other eating disorders services in the East Midlands region.&lt;/p&gt;\n&lt;p&gt;As a Clinical Nurse Therapist you will be asked to take a significant role in the delivery of therapeutic interventions to individuals.&lt;/p&gt;\n&lt;p&gt;In addition, you will be expected to hold a caseload of complex clients with Anorexia Nervosa some with complex physical and psychological needs, acting as care co-ordinator.&lt;/p&gt;\n&lt;p&gt;You will be part of a multi-disciplinary team and will be expected to be a good communicator and team player. You will need to be prepared to travel to see clients and be flexible to meet the demands of the job.&lt;/p&gt;\n&lt;p&gt;Currently, there is a mixture of face-to-face and video -based interventions.&lt;/p&gt;\n&lt;p&gt;You will be well supported by existing staff.&lt;/p&gt;\n&lt;p&gt;The posts are currently being funded for 12 months initially.&lt;/p&gt;\n&lt;p&gt;Further training opportunities may be available outside of the service,&lt;/p&gt;\n&lt;p&gt;You will be expected to maintain good working relationships both inside and outside the trust.&lt;/p&gt;\n&lt;p&gt;You will need to have the ability to manage clients with high levels of complexity and risk.&lt;/p&gt;\n&lt;p&gt;The current multi-professional team comprises a Service Manager, Psychiatrists, Clinical Psychologists, Nurse Therapists, Dietitians, Occupational Therapist and Administrators.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Joanna Miatt, Acting Team Manager&lt;/p&gt;\n&lt;p&gt;dhcft.eatingdisordersservice@nhs.net&lt;/p&gt;\n&lt;p&gt;01773 881467&lt;/p&gt;\n&lt;p&gt;or&lt;/p&gt;\n&lt;p&gt;Ali Robertson, Clinical Psychologist&lt;/p&gt;\n&lt;p&gt;01773 881467&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121834.jpg", "name": "Derbyshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121834"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Derbyshire Eating Disorders Service, Unity, Mill House, Belper", "postalCode": "DE56 1WN"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.024", "longitude": "-1.48577"}}, "title": "Nurse Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249671", "validThrough": "2020-11-12T23:59:59+0000"}