{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 pa pro rata"}}, "datePosted": "2020-11-04T14:36:04+0000", "description": "&lt;p&gt;An opportunity exists for a qualified Anatomical Pathology Technologist (APT) to join the Mortuary department at North Tees and Hartlepool NHS Foundation Trust. The post holder will be part of a cross site team providing a high quality, flexible, efficient and co-ordinated mortuary and bereavement support service to the Trust and Coroner’s Service&lt;/p&gt;\n&lt;p&gt;Our service, which is HTA licensed, currently cares for approximately 2000 patients a year and provides a comprehensive range of services that includes Coronal and Forensic post-mortems. We pride ourselves on delivering a high quality service which ensures the dignity, respect and care for the deceased and bereaved.&lt;/p&gt;\n&lt;p&gt;The post holder is expected to hold the L3 Diploma in Anatomical Pathology Technology awarded by The Royal Society of Public Health (or a recognised equivalent) and be trained in Mortuary APT functions. Training in Bereavement Support, is desirable.&lt;/p&gt;\n&lt;p&gt;Although the department are looking to attract a qualified candidate applications will be considered from those seeking a Trainee APT position. Such candidates would be expected to have some evidence based experience within a mortuary environment and a commitment to complete the L3 Diploma in APT would be an essential requirement of employment .&lt;/p&gt;\n&lt;p&gt;The post holder will be expected to participate fully in the service rota, including the cross site out of hours rota and cover for the Bereavement Support Service.&lt;/p&gt;\n&lt;p&gt;The post hold will be required to undertake work, on behalf of the Trust, at neighbouring organisations under a Letter of Access arrangement.&lt;/p&gt;\n&lt;p&gt;Although, not essential, it is desirable that the post holder is able to drive the transfer vehicle or is willing to do so once they reach the legal age to do so (currently 25)&lt;/p&gt;\n&lt;p&gt;The nature of the job is such that it demands high standards of integrity. You must be able to work as part of a team or alone. Physical aspects require preparation of patients for autopsy, moving patients and family viewings. It is essential that you have good interpersonal skills with the ability to show empathy and deal sensitively with bereaved families.&lt;/p&gt;\n&lt;p&gt;Core working days are currently Monday to Friday and working hours variable between 7am and 4pm. You will be required to work flexibly around the needs of the service and be on standby rota 24/7 for 1 in 4 weeks (currently) for cross site out of hours requirements.&lt;/p&gt;\n&lt;p&gt;The department has full UKAS accreditation and is licensed by HTA. CPD is actively encouraged.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameGary MillerJob titleMortuary ManagerEmail addressgary.miller4@nhs.netTelephone number01642 624325Additional contact information&lt;/p&gt;\n&lt;p&gt;Name: Gary Miller, Mortuary and Bereavement Services Manager on 01642 624325&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "North Tees and Hartlepool NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120670"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "University Hospital of North Tees, Stockton-on-Tees", "postalCode": "TS19 8PE"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.5829", "longitude": "-1.34677"}}, "title": "Anatomical Pathology Technologist (APT)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256252", "validThrough": "2020-11-14T23:59:59+0000"}