{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 £31,365 - £37,890"}}, "datePosted": "2020-10-16T11:16:39+0100", "description": "&lt;p&gt;An exciting opportunity has become available for a band 6 nurse to join our Trauma and Orthopaedic team at the Royal Oldham Hospital.&lt;/p&gt;\n&lt;p&gt;Ward T7 is a busy 47 bedded unit specialising in Trauma and Orthopaedics. The ward is managed by one ward manager and a team of nurses who work closely with other members of clinical staff including three trauma coordinators, doctors, therapists and specialist nurses. We are a dementia friendly ward and work together as a team to provide a high standard of care.&lt;/p&gt;\n&lt;p&gt;As a Nurse Practitioner you will be involved in effectively supporting and leading staff to ensure high quality care is delivered at all times. You will undertake the Nurse in charge role, coordinating, delegating and supporting the management and planning of nursing care whilst maintaining patient safety.&lt;/p&gt;\n&lt;p&gt;The successful candidate will act as a role model, demonstrating expert clinical practice and will be confident in challenging poor practice.&lt;/p&gt;\n&lt;p&gt;The successful applicant will also be required to work and manage all areas within the department and demonstrate a professional manner and clinical expertise with good communication skills in all aspects of their work.&lt;/p&gt;\n&lt;p&gt;We are seeking a Registered Nurse who is committed to patient care and experience, possessing exceptional communication skills, clinical credibility and a calm, professional persona. We are keen to hear from applicants who are willing to embrace a varied shift pattern.&lt;/p&gt;\n&lt;p&gt;As committed as you are to doing the best for your patients, we are just as committed to helping you to get the most out of your role. We will offer you the support, guidance, training and opportunities to develop so you are able to make the best contribution you can.&lt;/p&gt;\n&lt;p&gt;In line with the Trust’s Single Equality Scheme we welcome applications from everyone irrespective of ethnic origin, disability, age, gender, gender identity, sexual orientation, disability, nationality, religion, marital status, social back ground or trade union membership. However, as members of ethnicity minority groups and individuals with disabilities are currently under-represented at this level of post, we would encourage applications from members of these groups. Appointment will be based on merit alone.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Emma Butts, Lead Nurse&lt;/p&gt;\n&lt;p&gt;emma.butts@pat.nhs.uk&lt;/p&gt;\n&lt;p&gt;07970199152&lt;/p&gt;", "employmentType": "OTHER", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121091.jpg", "name": "The Pennine Acute  Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121091"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Oldham Care Organisation, Oldham", "postalCode": "OL1 2JH"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5533", "longitude": "-2.12183"}}, "title": "Sister / Charge Nurse - Trauma &amp; Orthopaedics", "url": "https://www.jobs.nhs.uk/xi/vacancy/916229855", "validThrough": "2020-11-15T23:59:59+0000"}