{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 to £24,157 per annum"}}, "datePosted": "2020-10-27T12:45:24+0000", "description": "&lt;p&gt;This post is being advertised on a full time, permanent contract with applications welcomed from psychology professionals and/or professionals with foundation degrees in health and social care or equivalent coupled with demonstrable experience in the delivery of physical and mental health care.&lt;/p&gt;\n&lt;p&gt;This post will be in the Older Adults Division based in Liaison, Boston.&lt;/p&gt;\n&lt;p&gt;The Clinical Medical Assistant will be responsible for actively participating as part of the multidisciplinary team within the ward to provide a seamless service to patients under the direction of the responsible clinician.&lt;/p&gt;\n&lt;p&gt;The aim of the Clinical Medical Assistant is to relieve the medical workforce, to increase the amount of patient facing time and thus improve recovery and reduce waiting times. The purpose of the role is to support the medical workforce in providing comprehensive, accurate and timely information to inform clinical meetings and aid decision meetings.&lt;/p&gt;\n&lt;p&gt;Key responsibilities and typical undertakings of this role will include: &lt;br /&gt;• Responsible for the initial collation of all clinically relevant individual service user information including history gathering &lt;br /&gt;• Inputting of patient notes on patient record system &lt;br /&gt;• Undertake maintenance of up to date clinical summaries for use by Responsible Clinicians within documentation &amp; reports for CPA’s, MHRT, etc &lt;br /&gt;• Ensure that all individual service user documentation is up to date and available to inform internal clinical meetings &lt;br /&gt;• Accurately record and document clinical discussions and decisions from ward rounds, internal CPA’s etc and enter into patient notes and distribute to staff as appropriate &lt;br /&gt;• Attend meetings relating to clinical activities as directed by your Line Manager, Supervisor, Senior Colleagues or Clinical Manager&lt;/p&gt;\n&lt;p&gt;This is an evolving role within LPFT therefore the successful professional will need to be enthusiastic and have the ability to adapt to the development of this role and contribute to its blending within the service area.&lt;/p&gt;\n&lt;p&gt;Applications are welcomed from those with the relevant experience to carry out this role coupled with relevant academic underpinning. You should clearly outline in your application how you are most suited to this role.&lt;/p&gt;\n&lt;p&gt;The Trust will consider current employees who wish to apply on a secondment basis, please gain permission from your current line manager prior to applying.&lt;/p&gt;\n&lt;p&gt;If you would like to discuss this role further please do not hesitate to contact Wendy Cundy, Medical HR Manager on Wendy.Cundy1@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120663.jpg", "name": "Lincolnshire Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120663"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Pilgrim Hospital, Sibsey Road, Boston", "postalCode": "PE21 9QS"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.991", "longitude": "-.009786"}}, "title": "Clinical Medical Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244561", "validThrough": "2020-11-25T23:59:59+0000"}