{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37267", "minValue": "30401", "unitText": "YEAR", "value": "Band 6 - £30,401 - £37,267 per annum"}}, "datePosted": "2020-11-02T12:45:51+0000", "description": "&lt;p&gt;&lt;strong&gt;The Horsham Assessment and Treatment Service&lt;/strong&gt; works with adults living with mental illness, supporting their recovery and the development of skills and strategies to support them to maintain their wellbeing. We have a great opportunity for a motivated band 6, who is seeking to develop their practice within the community setting. The successful candidate will have a good knowledge of working with people with severe and enduring mental health problems and be able to demonstrate clinically effective care management skills and interventions in accordance with the Care Programme Approach.&lt;/p&gt;\n&lt;p&gt;The successful applicant will be working as part of an MDT including social workers, psychologists, nurses, occupational therapists and medics. The post holder will provide specialist interventions and act in the role of Lead Practitioner for a defined caseload of clients. The work is varied and interesting and all team members are involved with the full range of best practice interventions.&lt;/p&gt;\n&lt;p&gt;This band 6 post will provide the right candidate with opportunity to develop their career. The team is a lively and friendly team where you will be offered mentorship and supervision from senior nursing colleagues, active management support and the chance to undertake training courses relevant to your professional practice. We are open to applications from Nurses, Social Workers and Occupational Therapists.&lt;/p&gt;\n&lt;p&gt;This post offers a Golden Hello, or a Relocation package up to a maximum of £2000. (pro rata applies and subject to terms and conditions. Please see attached Protocol document).&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Vicky Harfield would welcome an informal chat and visit if you wish to arrange please call 0300 304 0021.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121074.jpg", "name": "Sussex Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121074"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Horsham, Horsham", "postalCode": "RH12 1RJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.0643", "longitude": "-.324102"}}, "title": "Community Mental Health Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252104", "validThrough": "2020-11-16T23:59:59+0000"}