{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615"}}, "datePosted": "2020-11-05T17:16:10+0000", "description": "&lt;p&gt;&lt;strong&gt;About the Acute Respiratory Care Unit-&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The newly created Acute Respiratory Care Unit are looking to recruit enthusiastic registered nurses who share our values &amp; vision for the future.&lt;/p&gt;\n&lt;p&gt;The Acute Respiratory Care Unit (ARCU) has been created as a new unit which will specialise in the treatment &amp; care of patients who have both acute &amp; chronic respiratory conditions who require specialist treatment and intervention alongside acute medical patients &amp; patients requiring end of life care. This varied combination of patient groups allows nursing team to learn advanced respiratory skills such as managing patients requiring non-invasive ventilation, CPAP, blood gas interpretation, tracheostomy care &amp; managing patients with chest drains. Alongside this, you will also develop skills in managing complex general medical patients &amp; skills in patient care at the end of life.&lt;/p&gt;\n&lt;p&gt;Our team is a prime example of team working in action. We are an enthusiastic team that is passionate about providing high-quality, patient-centred care and all of our nursing, medical &amp; multi-disciplinary teams strive to support each other every day to achieve this. We have created an environment in which our staff respect &amp; support one other &amp; we have developed excellent links with our community respiratory teams, palliative care teams &amp; local hospices.&lt;/p&gt;\n&lt;p&gt;Whether you are a newly-qualified nurse, a return to practice nurse, seeking a new challenge or want to specialise in this area, we understand that starting a new role is a big step &amp; we are committed to supporting you both during this transition &amp; after. We offer all of our new colleagues an extended supernumery period &amp; an excellent induction package to allow you to develop confidence in your new role. Our leadership team &amp; ward-based educator will continue to support you in all aspects of your role from day-to-day care &amp; management of patients to providing bespoke training packages for your continuing development.&lt;/p&gt;\n&lt;p&gt;As well as being supportive of one another, our team is friendly &amp; approachable &amp; will welcome you to join our team.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Here are some examples of the excellent work our staff have recently participated in;&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;-Our team achieved SCaPE (Safe, Clean and Personal Every time) status in January 2020 following three green NAAS assessments; this was achieved through the teams consistent approach &amp; their commitment to improving quality &amp; safety for all patients groups&lt;/p&gt;\n&lt;p&gt;-The team has consistently worked together to find innovative ways to improve patient safety &amp; experience successfully reducing patient harms such as falls, pressure ulcers &amp; cardiac arrests year on year&lt;/p&gt;\n&lt;p&gt;-We were very proud to win the ‘Patient’s Choice Award’ at the Northern Care Alliance Staff Awards in November 2018 which was awarded to us for providing excellent end of life care provided to patients and the care of their relatives.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What you can expect from us-&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;-We have a flexible attitude towards shift working enabling staff to have a work-life balance&lt;/p&gt;\n&lt;p&gt;-We have developed a bespoke training package for all staff which you will be fully supported to complete within 12 months of your start date. This training package includes;&lt;/p&gt;\n&lt;p&gt;-tracheostomy management&lt;/p&gt;\n&lt;p&gt;-non-invasive ventilation&lt;/p&gt;\n&lt;p&gt;-high flow oxygen therapy&lt;/p&gt;\n&lt;p&gt;-immediate life support (Resuscitation Council accredited course)&lt;/p&gt;\n&lt;p&gt;-chest drain management&lt;/p&gt;\n&lt;p&gt;-palliative care training&lt;/p&gt;\n&lt;p&gt;This will enable you to feel confident &amp; competent to perform your duties to the highest standard possible.&lt;/p&gt;\n&lt;p&gt;-You will be fully-supported in your role by the leadership team, your colleagues &amp; the ward multi-disciplinary team in order to provide the highest-quality care for patients&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;‘Our new team member’&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for enthusiastic individuals who are keen to learn &amp; develop their skills, are a great team player &amp; are motivated to work in a fast-paced environment. Our new team member will be a professional who truly understands the need for care, consideration &amp; respect for our patients &amp; relatives.&lt;/p&gt;\n&lt;p&gt;We would welcome the opportunity to discuss with you to show you what working with our brilliant team could mean for your future career. Please contact Sister Stephanie Bradley on 0161 778 2520 for an informal conversation about this post.&lt;/p&gt;\n&lt;p&gt;Interview dates are to be arranged once applications have been submitted. We look forward to hearing from you.&lt;/p&gt;\n&lt;p&gt;In line with the Trust’s Single Equality Scheme we welcome applications from everyone irrespective of ethnic origin, disability, age, gender, gender identity, sexual orientation, disability, nationality, religion, marital status, social back ground or trade union membership. However, as members of ethnicity minority groups and individuals with disabilities are currently under-represented at this level of post, we would encourage applications from members of these groups. Appointment will be based on merit alone.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Stephanie Bradley&lt;/p&gt;\n&lt;p&gt;Job title Sister&lt;/p&gt;\n&lt;p&gt;Email address stephanie.bradley@pat.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number 0161 778 2520&lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;Nicola Rimmington&lt;/p&gt;\n&lt;p&gt;Lead Nurse&lt;/p&gt;\n&lt;p&gt;0161 778 3448&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121091.jpg", "name": "The Pennine Acute  Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121091"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Fairfield General Hospital, Bury", "postalCode": "BL9 7TD"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.6005", "longitude": "-2.25533"}}, "title": "Band 5 Staff Nurses", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258693", "validThrough": "2020-11-19T23:59:59+0000"}