{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 pa"}}, "datePosted": "2020-11-03T10:40:07+0000", "description": "&lt;h2&gt;&lt;strong&gt;Band 5 Staff Nurse - Interventional Radiology&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;If you are looking for a new nursing challenge then the exciting and ever growing speciality interventional radiology may be just for you. This role will suit you whether you have previous experience in theatre or just starting out in your nursing career and interested in a fast paced department.&lt;/p&gt;\n&lt;p&gt;We are looking for a highly motivated and enthusiastic nurse to join our extensive team. We are looking for candidates who are committed to patient centred and evidence based care of the highest standard, to work within the interventional radiology department here at Leeds Teaching Hospitals NHS Trust (LTHT).&lt;/p&gt;\n&lt;p&gt;Leeds Teaching Hospitals has one of the largest Interventional Radiology departments in the UK and is a regional, national and international centre for some of the most innovative treatments available. Working as an interventional radiology nurse in this environment involves the care of the conscious patients undergoing elective and acute, diagnostic and sometimes complex multi-organ vascular procedures such as embolisation of tumours and haemorrhage, angioplasty, stenting, nephrostomy insertion, tumour ablations, and acute urological and vascular procedures and stroke thrombectomy.&lt;/p&gt;\n&lt;p&gt;You will work cross site at Leeds General Infirmary and St. James Hospital and typical working hours of: Monday-Friday 08:00 to 17:00hrs. There is an on-call rota which you will take part in once trained covering evenings, weekends &amp; bank holidays.&lt;/p&gt;\n&lt;p&gt;The department provides the opportunity to develop and enhance skills and knowledge in areas such as ‘scrubbing’ to assist in theatre during the procedures, caring for the patient perioperative, administering IV medication and post-operative care, which includes sheath removal. The role involves working closely with the multidisciplinary team of consultants, radiographers and other health professionals.&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity for nurses wishing to develop new clinical skills and knowledge in an exciting, cutting edge speciality, through a structured mentoring and preceptorship programme that will be tailored to your learning needs and will encourage your own development within the role.&lt;/p&gt;\n&lt;p&gt;For all new starters to the Trust we have a structured Introduction to Professional Practice (IPP) induction program to prepare you for working at LTHT. We also have a 6 month preceptorship framework to support you in your new role, which incorporates further education sessions and support forums.&lt;/p&gt;\n&lt;p&gt;Come and join our team in Leeds and become part of ‘The Leeds Way’ sharing our vision and values. Our Trust is recognised for our staff engagement, great care and rated GOOD by the Care Quality Commission. Leeds Teaching Hospitals NHS Trust is one of the largest acute health providers in the UK and based in one of the fastest growing and vibrant cities in the north.&lt;/p&gt;\n&lt;p&gt;We are very interested in hearing from you, including those of you who are students expecting to graduate in the next six months.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;For all new starters to the Trust we have a structured Introduction to Professional Practice (IPP) Induction programme to prepare you for working at LTHT. We also have a 6 month preceptorship framework to support you in your new role, which incorporates further education sessions and support forums.&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;An informal visit is strongly recommended.&lt;/p&gt;\n&lt;p&gt;We look forward to seeing you.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further enquiries or to arrange an informal visit please contact Senior Charge Nurses Ian Medlicott ian.medlicott@nhs.net and Simon Gulliver sgulliver@nhs.net or Tel. 0113 392 3311 &amp; 0113 206 6841.&lt;br /&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Please be aware that due to current government guidelines your interview may take place virtually. If you are invited to interview you will be informed of this at that stage. It is important you download the correct app/software as soon as you confirm your interview slot so you can become familiar with the software and provide the required information to our Resourcing team. &lt;br /&gt;&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;&lt;em&gt;Internal nursing staff&lt;/em&gt;&lt;/strong&gt;&lt;em&gt; currently employed by Leeds Teaching Hospitals NHS Trust, who wish to work in a different area, at the same AfC Band, job description and person specification should contact their Matron and employ the internal transfer process.&lt;br /&gt;&lt;/em&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;We may share information, as appropriate, that you have provided in your application form withexternal partners or other organisations help to facilitate your recruitment process.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122273.jpg", "name": "Nursing Cohort", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122273"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Leeds General Infirmary", "postalCode": "LS1 3EX"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8015", "longitude": "-1.55175"}}, "title": "Staff Nurse (XR05)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253502", "validThrough": "2020-11-24T23:59:59+0000"}