{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 to £44,503 pa"}}, "datePosted": "2020-10-13T18:00:27+0100", "description": "&lt;p&gt;For an inspirational supervisor or manager, this is a unique opportunity. You’ll lead a team that coordinates one of our national tissue retrieval services – services capable of transplanting 90 corneas each week. With your help, we’ll safely and efficiently collect and store tissues, comply with regulations, and make the most of these valuable gifts.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Your focus will be on a deceased tissue group, such as Ocular, Cardiac or Musculoskeletal. You’ll take charge of a twelve-strong team, develop their skills, observe their performance and help them meet targets and improve standards. Naturally, you’ll also be part of rotas – and play an active role in the service.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;A BSc in a biological discipline (or equivalent) is essential. But while it would help to bring relevant NHS experience; this is a role that calls for genuine compassion and a meticulous approach. Proven leadership will count most.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Comfortable learning new systems and a natural mentor and communicator, you’ll enjoy the responsibility that comes with being the link between our retrieval teams and the National Referral Centre. It’s also important you can work irregular hours and have a clean driving licence.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;At NHS Blood and Transplant, you can be sure of a fantastic working life. The Colindale team is part of a larger UK-wide operations department. There are lots of opportunities to develop new skills and fulfil your ambitions, all within a supportive and friendly environment.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;But ultimately, the real reward is the work. Anyone in the country who needs a blood transfusion or a donation of tissue or an organ, relies on us. From recruiting both living and deceased donors to improving our expertise and processes, we’re on an exciting mission to save and improve even more lives. And that’s why we need your help.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;As this role is based in Colindale, you will receive a higher cost area supplement of 15% of your basic wage – between £3,784 and £4,822 per annum. You will also receive a generous annual leave amount of 27 days per year plus bank holidays, which will increase to 29 days after 5 years service, and 33 days after 10 years service.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The normal working hours for this role are full time, 37.5 hours per week.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This advert will close at 23:59 on Sunday 8th November 2020.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We will also be holding a ‘Virtual Coffee Morning’ on Saturday 31st of October, please see details below. For informal enquiries about the role please contact Amanda Ranson at amanda.ranson@nhsbt.nhs.uk&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Microsoft Teams meeting&lt;/strong&gt; &lt;br /&gt;&lt;br /&gt;Call in (audio only) &lt;br /&gt;+44 20 3321 5246,,217302925# United Kingdom, London &lt;br /&gt;Phone Conference ID: 217 302 925# &lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Take charge of your career and apply now.&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NHS Blood and Transplant (NHSBT)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120628"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "London", "postalCode": "NW9 5BG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5958", "longitude": "-.25616"}}, "title": "Healthcare Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916225208", "validThrough": "2020-11-08T23:59:59+0000"}