{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 per annum/pro rata"}}, "datePosted": "2020-10-15T13:38:45+0100", "description": "&lt;p&gt;Helen Specialist Nursing Team &amp; Ryegate House&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;37.5 hours per week covering a 7 day a week service&lt;/p&gt;\n&lt;p&gt;Working both days and night shifts&lt;/p&gt;\n&lt;p&gt;Full time/part time hours&lt;/p&gt;\n&lt;p&gt;Permanent/temporary/secondment positions&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Are you a clinical support worker currently looking for a challenging new experience within the area of paediatrics and looking to gain experience in the community setting then this job may appeal to you.&lt;/p&gt;\n&lt;p&gt;The Helena Specialist Nursing Team &amp; Ryegate House are looking for Band 3 clinical support workers to join their team which provides respite, continuing care and palliative care provision in a variety of settings which include the child and families own home, school and Ryegate house respite unit.&lt;/p&gt;\n&lt;p&gt;The service aims is to provide excellent clinical care and support to children and their families suffering from complex health needs. The successful candidates are expected to work across all settings with the aim of meeting their health needs to ensure they remain safe while accessing both respite and school. A driving license and access to a car is essential.&lt;/p&gt;\n&lt;p&gt;As a band 3 clinical support worker working within the service you will need enthusiasm, motivation, ability to work both within a team but also autonomously, and have a commitment to providing a high standard of clinical practice and care to our patients. As a clinical support worker within the team you will care for patients with a range of different health needs, which includes long term ventilation, tracheostomy care, seizure management and feeding via NG or gastrostomy.&lt;/p&gt;\n&lt;p&gt;As a new member to our team we offer a period of preceptorship and supervision to allow you to complete the various competences and skills required to care safely for our children out in the community.&lt;/p&gt;\n&lt;p&gt;The Team are looking for band 3 clinical support workers who maintain professionalism and who take pride in the care they give to the patients and their families, as well as being dedicated to their own personal and professional development and the development of the service.&lt;/p&gt;\n&lt;p&gt;For more information please contact Sally Bolsover, Community Lead Nurse or Amy Broadhurst, admin Co-Ordinator&lt;/p&gt;\n&lt;p&gt;sally.bolsover@nhs.net&lt;/p&gt;\n&lt;p&gt;amy.broadhurst3@nhs.net&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122992.JPG", "name": "Sheffield Children's NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122992"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Sheffield", "postalCode": "S10 2TH"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3806", "longitude": "-1.49123"}}, "title": "Senior Clinical Support Worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916228415", "validThrough": "2020-11-10T23:59:59+0000"}