{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum pro rata"}}, "datePosted": "2020-10-22T12:47:08+0100", "description": "&lt;p&gt;An opportunity has arisen to join a growing team of Radiologists to provide a comprehensive Head and Neck and/or Neuroradiology services at Sherwood Forest Hospitals (SFH) NHS Fundation Trust.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The department&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The majority of the Radiology activity in the Sherwood Hospitals is undertaken at King’s Mill Hospital, which performs approximately 133,000 examinations per year.&lt;/p&gt;\n&lt;p&gt;The Radiology Department at Newark performs 32,000 examinations per year, consisting of plain films, CT, and ultrasound examinations. A 64 slice Optima GE CT Scanner has was installed in 2015 at Newark as part of the NHS Cancer Plan to enable national cancer targets to be achieved.&lt;/p&gt;\n&lt;p&gt;Mansfield Community is a small department with a single radiographic and ultrasound room and they perform 8,000 per year. The radiologists on the Kings Mill site via PACS report these examinations.&lt;/p&gt;\n&lt;p&gt;Obstetric ultrasound is based in the Women’s and Children’s Unit.&lt;/p&gt;\n&lt;p&gt;A cardiac catheterisation suite has recently been commissioned at King’s Mill, run by the cardiologists but staffed by radiographers from the x-ray department, it has two cath labs.&lt;/p&gt;\n&lt;p&gt;Our radiology service benefits from a close working relationship with neighbouring hospital Nottingham University Hospitals (NUH) NHDS Trust who visit the department weekly and from regional MDT support.&lt;/p&gt;\n&lt;p&gt;If successful you will join a current establishment of 11 Consultants and an Associate Specialist, with expected further expansion in the foreseeable future. We also have 2 Specialty Registrars - Year 3+ on the Nottingham / Derby / Mansfield rotation, currently working with us in blocks of 6 months. Two Clinical Fellows have also joined the team, acting in a &lt;span&gt;Specialty Registrars - Year 3+ &lt;/span&gt; capacity.&lt;/p&gt;\n&lt;p&gt;Secretarial support is provided by excellent departmental secretaries, an audit clerk and due to voice recognition reporting a reduced number of typists.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This post will support the current 2 whole-time equivalent Consultant Head and Neck/Neuro Radiologists at SFH and 2 additional Consultant Neuroradiologists. If successful you will be expected to take a major role in Neuroradiology and/or Head and Neck Radiology. There is scope to bring or develop a further sub-specialty interest to complement existing expertise within the main Radiology Department.&lt;/p&gt;\n&lt;p&gt;The post is available on a full-time or part-time basis and there is flexibility around on-call participation and number of days/hours worked. There are also comprehensive homeworking arrangements with all consultants benefiting from full home reporting stations which can be utilised during weekly reporting sessions.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Eligibility&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;In oder to be eligible to apply for this role you must have:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;MBBS/ MBChB or equivalent&lt;/li&gt;\n&lt;li&gt;Full registration with the General Medical Council (GMC) with a licence to practice and on the Specialist Register / within 6 months of CCT&lt;/li&gt;\n&lt;li&gt;FRCR (or equivalent)&lt;/li&gt;\n&lt;li&gt;Experience or specialist training in Neuroradiology and/or Head and Neck radiology&lt;/li&gt;\n&lt;li&gt;Experience or training in general radiology including CT and MRI&lt;/li&gt;\n&lt;/ul&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Sherwood Forest Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120977"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "King&#39;s Mill Hospital, Sutton-In-Ashfield", "postalCode": "NG17 4JL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.1345", "longitude": "-1.23627"}}, "title": "Consultant Radiologist - Head &amp; Neck and/or Neuroradiology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916238503", "validThrough": "2020-11-11T23:59:59+0000"}