{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "42500", "minValue": "39390", "unitText": "YEAR", "value": "£39,390 - £42,500"}}, "datePosted": "2020-11-05T11:07:02+0000", "description": "&lt;p&gt;Everyone’s Turning Point is unique. It’s the moment when they realise they’ve made a small, but important, step forward. Very often, that small step is the start of something bigger. But only when the right support, advice and services are in place. That’s where you come in, working as part of our Talking Therapies service, our highly successful and innovative ‘Improving Access to Psychological Therapies’ (IAPT) delivery model.&lt;/p&gt;\n&lt;p&gt;We support people who are having difficulty in coping and who may be suffering from a common mental illness such as depression, anxiety or phobias. Our approach embeds the notion of well–being and recovery and promotes personal responsibility for lifestyle choices and self–management of mental well–being. For our clients, this has resulted in a highly accessible and user–friendly service available across a wide geographical area.&lt;/p&gt;\n&lt;p&gt;We are looking to recruit a High Intensity CBT Therapists, with a qualification in Cognitive Behavioural Therapy you’ll be a trained accredited practitioner. Alongside vast experience of working within Mental Health, you’ll have a proven ability to develop good therapeutic relationships with clients and working relationships with your colleagues. You’ll manage your own caseload working towards both service and individual targets, having an IAPT Supervision Course under your belt would be helpful too– but not essential.&lt;/p&gt;\n&lt;p&gt;If you’re inspired by the social model of mental health that works holistically according to need rather than diagnosis and would like to help us achieve our vision, we can offer a competitive remuneration package and excellent training and development opportunities.&lt;/p&gt;\n&lt;p&gt;You will be required to work on an outreach and rota basis in the community as the service operates 7 days per week.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Why Turning Point?&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;As a leading health and social care provider with more than 300 locations across England, we take real pride in the services we offer.&lt;/p&gt;\n&lt;p&gt;Across the varied regions, sectors and settings we operate within, our organisation is held together by a shared vision – and our people are connected by the same values. These include belief in potential, confidence in communication, embracing positive change and always treating each other as individuals.&lt;/p&gt;\n&lt;p&gt;We run all of our services on a not-for-profit basis; instead, we invest every penny back into our services and people. We never stop believing in change for the better, and we work constantly to improve the lives of the people we support.&lt;/p&gt;\n&lt;p&gt;Our people bring our vision to life. So, if you are enthusiastic, motivated and committed to support others to fulfilling their potential, here at Turning Point, we don&#39;t just offer you a job – we offer you a career.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;What Benefits Will I Receive?&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;Of course, we know it&#39;s not about the money. But that doesn&#39;t mean we don&#39;t reward our people for their invaluable work with a benefits package that includes:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Comprehensive opportunities to learn and develop, with silver accreditation from Investors in People&lt;/li&gt;\n&lt;li&gt;31 days’ paid holiday a year, increasing with each year of service up to 33 days. Plus the option to purchase additional holidays&lt;/li&gt;\n&lt;li&gt;Flexible benefit options including cycle to work schemes and season ticket loans&lt;/li&gt;\n&lt;li&gt;Competitive pension and life assurance schemes&lt;/li&gt;\n&lt;li&gt;Employee assistance programme and access to online health and wellbeing support&lt;/li&gt;\n&lt;li&gt;Flexible working patterns to support work-life balance&lt;/li&gt;\n&lt;li&gt;Access to a wide range of discounts, including cinema tickets, grocery and high-street shopping and gym memberships&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;If you are an experienced High Intensity Cognitive Behavioural Therapist and are looking for an exciting career opportunity we would love to hear from you!&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Turning Point", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=131034"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wakefield", "postalCode": "WF1 1HX"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.6824", "longitude": "-1.49377"}}, "title": "High Intensity CBT Therapist - Wakefield Talking Therapies", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257377", "validThrough": "2020-12-03T23:59:59+0000"}