{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum, pro rata"}}, "datePosted": "2020-10-30T14:16:24+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for an enthusiastic and self-motivated Lead Nurse to assist in further developing a service to identify and manage patients with conditions such as venous thromboembolic disease (DVT &amp; PE), cellulitis, anaemia, headache, ascites, pleural effusions that require acute input but can be managed in an Ambulatory setting.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Whilst the service is Consultant overseen the post holder will be responsible on a daily basis for the initial assessment of our patients and the planning/delivery of treatments. They will also, when required, have responsibility for the on-going management of patients working closely with other Divisions and our Primary Care Colleagues.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will need to provide strong leadership and possess excellent clinical skills including physical assessment skills. A nurse prescribing qualification is desirable. The successful applicant will be expected to function effectively under pressure without compromising standards of care and professionalism. They must have advanced clinical expertise and be willing to participate in research and audit projects. In return we will offer excellent managerial support and commitment to personal professional development.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Team working is an integral part of this Unit with all staff enabled and empowered to make a real difference for their patients.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The successful candidate will be able to demonstrate that they can manage a dedicated team to deliver nursing care of the highest standards to our patients, while working under pressure. A minimum of 5 yrs post-qualification experience with at least 18 months experience at Band 6 in an Acute setting or complimentary area is essential.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Cally Johnson&lt;/p&gt;\n&lt;p&gt;Head of Nursing&lt;/p&gt;\n&lt;p&gt;cally.johnson@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120634.jpg", "name": "East Sussex Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120634"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Eastbourne DGH, Eastbourne", "postalCode": "BN21 2UD"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.787", "longitude": ".271136"}}, "title": "Lead Nurse - Same Day Emergency Care", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250505", "validThrough": "2020-11-13T23:59:59+0000"}