{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 pro rata +London Fringe £149"}}, "datePosted": "2020-11-03T15:46:17+0000", "description": "&lt;p&gt;&lt;strong&gt;Neurology Consultant&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We have an exciting opportunity for a part-time, permanent Consultant Neurologist to join us at the Princess Alexandra Hospital. This is a new post developed to expand the existing Neurology consultant workforce. We are looking for a dynamic and enthusiastic individual with sub-specialty skills that will complement those of the existing neurologists, to work alongside and in conjunction with us in outpatients and ward consults. This is an exciting time to join the Princess Alexandra Hospital NHS Trust, with a new hospital being built, enabling the post holder to have the opportunity to shape and develop the service for the local population and have input into how the service works out of a brand new facility.&lt;/p&gt;\n&lt;p&gt;It is essential that the successful candidate has a high level of clinical experience and competence in the diagnosis and effective management of a wide range of neurological conditions, being patient centered but able to deliver care in a timely manner. The post holder will work flexibly during the week with a mutually agreed prearranged timetable. There is currently no on-call requirement in this role. The position is based at The Princess Alexandra Hospital Trust in Harlow- Essex- with outpatient sessions taking place at Harlow, St. Margaret’s Hospital in Epping or Herts &amp; Essex Hospital in Bishops Stortford. The post holder will be encouraged to develop an appropriate area of specialist interest to additionally benefit our patients. The post is linked with Addenbrooke’s Hospital to provide regular CPD opportunities and access to tertiary services.&lt;/p&gt;\n&lt;p&gt;The Neurology Department currently is a team consisting of 4 consultants, one clinical associate and specialist nurses. The successful candidate will work in partnership with the existing consultants in delivering a first class service for West Essex and E&amp;N Hertfordshire patients.&lt;/p&gt;\n&lt;p&gt;Good local schools and facilities also add to this attractive opportunity and Harlow itself is within easy reach of Cambridge, London and Stansted Airport by means of excellent rail and motorway links.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact&lt;/strong&gt;: consultant neurologist &amp; Clinical Lead Dr Jane Anderson by email at: jane.anderson24@nhs.net&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name:Jane Anderson&lt;/p&gt;\n&lt;p&gt;Job title:Consultant Neurologist &amp; Clinical Lead&lt;/p&gt;\n&lt;p&gt;Email address:jane.anderson24@nhs.net&lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;Name: Ayse Casey&lt;/p&gt;\n&lt;p&gt;Email:ayse.casey@nhs.net&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121503.PNG", "name": "The Princess Alexandra Hospital NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121503"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Princess Alexandra Hospital NHS Trust, Harlow", "postalCode": "CM20 1DR"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7708", "longitude": ".09132"}}, "title": "Neurology Consultant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254617", "validThrough": "2020-12-01T23:59:59+0000"}