{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "23500", "minValue": "23500", "unitText": "YEAR", "value": "£23,500"}}, "datePosted": "2020-11-02T11:47:17+0000", "description": "&lt;p&gt;Team Manager &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Area of work: &lt;/strong&gt;Learning Disability&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Salary: &lt;/strong&gt;GBP 23,500&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Location:&lt;/strong&gt; Station Road, Bradford &lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Contract type:&lt;/strong&gt; Permanent&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Working hours: &lt;/strong&gt;37 hours per week&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;  Job Introduction&lt;/p&gt;\n&lt;p&gt;At Turning Point, we support people across England with learning disabilities. Making a real difference to their lives, you&#39;ll motivate, manage and grow a team of support staff to enable more people to discover new possibilities in their lives.&lt;/p&gt;\n&lt;p&gt;We now have an opportunity for Team Manager at our Station Road service, supporting adults with Learning Disabilities. As the Team Manager you will have management responsibility for two new supported living houses. You will work alongside Supported Living Manager during a critical transition time. As one of our management team, you&#39;ll enjoy the scope and support to enhance your own life too, as you benefit from an exceptional level of internal and external training as well as a highly supportive management team.&lt;/p&gt;\n&lt;p&gt;Please note you must have experience in leading a team to be considered for this role.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;strong&gt;Interviews are set to take place on Wednesday 02nd December 2020&lt;/strong&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;Main Responsibilities&lt;/p&gt;\n&lt;p&gt;Building on your experience of working with people with learning disabilities, you&#39;ll set, maintain and develop standards as part of our service. As manager, your focus will always be on ensuring the delivery of consistently high quality services - all within a challenging, but very rewarding environment. In this varied Team Manager role, you&#39;ll also carry out risk assessments, implement care plans and handle some operational management.&lt;/p&gt;\n&lt;p&gt;The Ideal Candidate&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What skills and qualities do I need to have?&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;The ability to meet financial and business targets&lt;/li&gt;\n&lt;li&gt;A track record of supporting and empowering people to live more independently in their community&lt;/li&gt;\n&lt;li&gt;Flexibility is essential, and ideally, you&#39;ll also have a full driving license and access to a car&lt;/li&gt;\n&lt;li&gt;Experience of working with individuals with autism, learning disabilities and communication difficulties is essential&lt;/li&gt;\n&lt;li&gt;Experience of complex physical and health needs is essential&lt;/li&gt;\n&lt;li&gt;Knowledge and understanding of the Positive Behaviour Support process is desirable&lt;/li&gt;\n&lt;li&gt;Understanding of Makaton, objects of reference, communication passports is desirable&lt;/li&gt;\n&lt;li&gt;Willing to work towards NVQ level 4/5 qualification&lt;/li&gt;\n&lt;li&gt;You must be fully flexible as this role will involve out of hours checks supporting/coaching staff and the possible need to backfill when short of staff.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;What benefits will I receive?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Of course, we know it&#39;s not about the money. But that doesn&#39;t mean we don&#39;t reward our people for their invaluable work with a benefits package that includes:&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Comprehensive Learning and Development opportunities - we are Investors in People Silver accredited &lt;/li&gt;\n&lt;li&gt;28 days holiday, increasing with each year of service until 30 days. Plus the option to purchase additional holidays&lt;/li&gt;\n&lt;li&gt;Flexible benefit options including, bike to work schemes and season ticket loans &lt;/li&gt;\n&lt;li&gt;Competitive Pension and Life Assurance scheme&lt;/li&gt;\n&lt;li&gt;Employee Assistance Programme and access to online Health and Wellbeing support &lt;/li&gt;\n&lt;li&gt;Flexible working patterns to support work/life balance &lt;/li&gt;\n&lt;li&gt;Access to a wide range of discounts including Cinema, Groceries and Gym&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We take pride in the services that we provide. There is one vision that everyone at Turning Point shares, which is held together by our values. These include believing in potential, communicating in a confident way, embracing change and treating each other as individuals.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Running services on a not-for-profit basis, we invest every penny back into our services - and, our people. So, if you are enthusiastic, motivated and committed to support people with Learning Disabilities to live fulfilling lives - here at Turning Point, we don&#39;t just offer you a job: we offer you a career.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Turning Point", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=131034"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "BD14 6JA", "postalCode": "M1 4HN"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.48", "longitude": "-2.23939"}}, "title": "Care Team Manager - Station Road - Bradford", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251901", "validThrough": "2020-11-20T23:59:59+0000"}