{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 p.a/pro rata"}}, "datePosted": "2020-10-05T16:07:20+0100", "description": "&lt;p&gt;&lt;span&gt;An exciting opportunity has arisen for an experienced and motivated therapeutic radiographer to join our friendly on treatment review team as a Macmillan Radiotherapy Specialist Review Radiographer (0.6WTE).&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will be an integral member of a small team of 2 radiographers that provide specialist care for patients undergoing radiotherapy treatment here at Worcestershire Oncology Centre. You will be reviewing all patients undergoing radiotherapy, delivering information and support to our patients..&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will lead on the development of evidence based protocols, patient group directives for the therapy radiographers on set as well as undertaking independent prescribing yourself.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will play a key role in coordinating care pathways, liaising with other departments within and outside the Trust to ensure seamless care for our patients.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Further training for this role will be supported by the Trust. You will be expected to actively engage with Macmillan to maximize learning and development opportunities. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The radiotherapy department at Worcester is patient focused and strives to ensure that all patients are treated in a supportive and calming environment. We offer excellent facilities for patients with not only the radiographer lead review clinics, but also a Macmillan pod and RVS café within the department.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We have 3 matched Elekta Linacs undertaking a wide range of techniques including IGIMRT and DIBH. Localization is carried out on a Toshiba wide bore scanner, Raystation is used for all treatment planning. Mosaiq is our oncology management system.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;For an informal discussion or visit please contact Laura Lees (Macmillan Radiotherapy Specialist Review Radiographer) &lt;/strong&gt;Laura.Lees1@nhs.net. &lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Worcestershire Acute Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120654"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Worcestershire Royal Hospital", "postalCode": "WR5 1DD"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1912", "longitude": "-2.18114"}}, "title": "Macmillan Radiotherapy Specialist Review Radiographer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916213508", "validThrough": "2020-11-13T23:59:59+0000"}