{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "33166", "minValue": "33166", "unitText": "YEAR", "value": "£19.73"}}, "datePosted": "2020-10-23T10:55:10+0100", "description": "&lt;h1&gt;&lt;strong&gt;Make a difference!&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;&lt;strong&gt;Have you ever thought about working within the prison environment? &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Do you enjoy being part of a team in a diverse and ever-changing environment?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Then look no further…&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Practice Plus Group are Health in Justice Market leader, providing healthcare services to offenders across the country. Our model of care is our Wellbeing Approach – an integrated, comprehensive approach in recognition of the fact prisoners are a socially-excluded group with healthcare needs which are complex and often associated with poor outcomes. It adopts the premise no single health/wellbeing factor can be taken in isolation of other motivational issues which might impact a person’s care.&lt;br /&gt; &lt;br /&gt; To ensure the continued quality of care at HMP Warren Hill we’re looking for Bank Mental Health Practitioner to join our team.&lt;/p&gt;\n&lt;h1&gt;&lt;br /&gt; &lt;strong&gt;About the role...&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;You will be the Primary Care Mental Health Practitioner for the mental health team and will provide the triage and assessment for initial referrals and interventions to clients. You&#39;ll play a key role in providing a duty role for urgent referrals and support senior staff in development plans. You will hold your own caseload of patients and will contribute to the ACCT reviews and assessments when required.&lt;/p&gt;\n&lt;h1&gt;&lt;br /&gt; &lt;strong&gt;About you...&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;You will either be a Registered Mental Health Nurse/ Social Worker/ Occupational Therapist, or hold membership with BABCP/BACP/ UKCP. A real passion for developing your clinical skills in an ever changing environment is essential.&lt;br /&gt; &lt;br /&gt; If you are self-motivated and able to work autonomously as well as showing plenty of initiative when it comes to handling a wide range of situations, then this could be the right role for you!&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h1&gt;&lt;strong&gt;Further job information...&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;This is a bank role working shifts as and when required.&lt;/p&gt;\n&lt;p&gt;The pay rate is up to £19.73 per hour.&lt;/p&gt;\n&lt;p&gt;HMP Warren Hill is a category C adult male prison, located near the village of Hollesley in Suffolk (Hollesley, Woodbridge) - right near the coast and within 40 minutes&#39; drive of Ipswich.&lt;br /&gt; &lt;br /&gt; &lt;em&gt;Please note that this role is subject to Practice Plus Group Terms &amp; Conditions and offers of employment are subject to satisfactory receipt of references, enhanced DBS check and prison vetting.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;At Practice Plus Group we actively promote diversity and equal opportunities.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "Practice Plus Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130136"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Woodbridge", "postalCode": "IP12 3JW"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.0511", "longitude": "1.45136"}}, "title": "Bank Mental Health Practitioner - HMP Warren Hill", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240157", "validThrough": "2020-11-20T23:59:59+0000"}