{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "75455", "minValue": "65542", "unitText": "YEAR", "value": "£65,542 - £75,455 pa inclusive of HCAS"}}, "datePosted": "2020-10-30T12:31:14+0000", "description": "&lt;p&gt;We now have a unique platform for change, driving forward innovation, adopting clinical service changes where appropriate and providing the impetus to create new services to serve the growing and ageing population.&lt;/p&gt;\n&lt;p&gt;We have expanded our Community Services Directorate and we are recruiting a newly created post which is a Head of Professions for Community, Frailty and Older People&#39;s Services and to be a key player within the Directorate Management Team. This is an exciting opportunity for either a Senior Nurse or Allied Health Professional.&lt;/p&gt;\n&lt;p&gt;We have mobilised a new Community Services contract extending our current services across two CCG areas within the Frimley Health and Care ICS. At the same time, we are reconfiguring the Community Services Directorate as a whole to ensure aligned working across Care of Older People’s pathways and services.&lt;/p&gt;\n&lt;p&gt;We are looking for a highly motivated and dynamic individual who is able to provide clear, compassionate and inspirational leadership across professional boundaries. The post holder will need to be able to engage with multi stakeholder partners across the ICS and possess a clear voice and vision in regards to patient advocacy and all staff groups.&lt;/p&gt;\n&lt;p&gt;You will be responsible for the strategic direction, overall provision and management of both Nursing and Allied Health Professional services that sit within the Directorate, ensuring that outstanding standards of patient care are delivered and supported through the clinical governance framework.&lt;/p&gt;\n&lt;p&gt;You will need to have the ability to work collaboratively with partners, primary care networks and across health and social care boundaries to build alliances and progress service delivery in order to provide seamless care provision and therefore improve outcomes.&lt;/p&gt;\n&lt;p&gt;The post holder needs to be able to demonstrate high levels of tenacity, resilience and self motivation together with exceptional influencing and negotiation skills. The post holder&#39;s success in the role will necessitate the establishment and maintenance of strong effective working relationships at all levels of the organisation and across external boundaries.&lt;/p&gt;\n&lt;p&gt;If this is an opportunity that interests you please do not hesitate to contact us for an informal discussion&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Laura Williamson, PA to Associate Director of Community Services, Tel: 01753 806700, laura.williamson11@nhs.net&lt;/p&gt;\n&lt;p&gt;Alison Stevens, Corporate Head of Nursing, alison.stevens@nhs.net, 07867 186642&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121099.png", "name": "Frimley Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121099"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Across Community boundaries and acute sites, Frimley", "postalCode": "GU16 7UJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3197", "longitude": "-.741538"}}, "title": "Head of Professions - Community, Frailty and Older People&#39;s Services", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250166", "validThrough": "2020-11-17T23:59:59+0000"}