{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 per annum"}}, "datePosted": "2020-10-01T12:46:35+0100", "description": "&lt;p&gt;&lt;strong&gt;Walkergate Park Centre for Neurorehabilitation and Neuropsychiatry is an encompassing service for people with a disability caused by injury or disease affecting the brain, spinal cord or muscles. The centre is one of the most advanced of its kind in Europe and at the time of opening was the first in the UK.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Our team of professionals have extensive experience and expertise in the management of physical disabilities, neurobehavioral, neuropsychological and neuropsychiatric problems.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This fully comprehensive service is delivered from a state of the art premises, purpose designed for modern rehabilitation practice in the north east of England.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Walkergate Park provides high quality rehabilitation services on an inpatient, outpatient, day patient or community basis, for people who experience the following consequences of neurological disease:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;• Major physical disability affecting mobility, self-care and everyday activities&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;• Disturbance of cognition and behaviour&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Our goal is to maximise people&#39;s potential for independence. It is a goal that depends on many factors; understanding a past personality, knowing the present, foreseeing the potential future and combining the intricacies of each of these factors into a focused plan. We believe that individualised, inter-disciplinary treatment is the most productive approach to rehabilitation.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Ward 1- Neuro Behavioural &lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The service supports individuals who have sustained an acquired brain injury, who present with a range of physical, cognitive, communication and emotional problems, and who may be exhibiting challenging behaviour which prevents the individual engaging in other less specialist rehabilitation settings. We aim to provide a secure, structured and low stimulation environment that is suitable for people who require assessment and/or rehabilitation.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Ward 2 – Neuro Psychiatry&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The service supports individuals who have a neurological condition or other acquired brain injury and are presenting with neuropsychiatric difficulties of a complex nature. Typical presentations include Epilepsy, Multiple Sclerosis, Encephalitis, Traumatic Brain Injury, Stroke, Huntington’s disease and Parkinson’s disease.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We aim to provide a specialist interdisciplinary inpatient assessment, diagnosis, and treatment. The service is also a highly specialist regional unit for the care of patients with Huntington’s disease.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Wards 3 and 4&lt;/span&gt;&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We support and provide treatment to men and women aged 16 years of age and over with an acquired brain injury or other neurological disease/illness, who may be presenting with the most complex physical, cognitive and / or communication problems that would respond to a structured, interdisciplinary neurological rehabilitation programme.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Our service will provide specialist assessment and has the multidisciplinary expertise to address their rehabilitation needs. There are currently 4 programmes patients can be admitted to, dependent on their clinical presentation and need, Neuro Rehabilitation, Cognitive, Prolonged disorders of consciousness assessment and intervention, and Minimally Conscious Programme.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The service is looking to recruit enthusiastic Band 5 Nurses from all areas of the Nursing Spectrum.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If you join the Teams we are offering Excellent Support Packages that include:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;A comprehensive Induction package / structured supervision and development opportunities&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Support to complete CORSSAT (Core rehab skills self-assessment tool) within first year.&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Primary nurse role.&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Friendly, supportive nursing and therapy colleagues and a responsive management team.&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;&lt;br /&gt;&lt;/span&gt;&lt;span&gt;If you are interested or would like further discussion about the posts please contact the Clinical Nurse Managers detailed below &lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Sharon Gibson on 01912875055 &lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Pamela McIntyre 01912875028&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121049.jpg", "name": "Cumbria, Northumberland, Tyne and Wear NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121049"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Walkergate Park Hospital", "postalCode": "NE6 4QD"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.987", "longitude": "-1.5602"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916208525", "validThrough": "2021-01-01T23:59:59+0000"}