{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Competitive"}}, "datePosted": "2020-10-28T08:26:52+0000", "description": "&lt;p&gt;Staff Nurse RGN Nights&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Role:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An opportunity has arisen to appoint an enthusiastic, experienced, flexible, highly motivated Registered Nurse to join our professional team working on Night Duty at Fulwood Hall Hospital. We are looking for a dynamic individual to work fulkl time and has the enthusiasm and commitment to provide a high standard of care for our patients.&lt;/p&gt;\n&lt;p&gt;Shift patterns are from:&lt;/p&gt;\n&lt;p&gt;20:15-07:45 (night shift) including 1-hour break&lt;/p&gt;\n&lt;p&gt;The successful candidate will have excellent communication skills, a desire for professional development and demonstrate professional standards of practice to be admired. The successful candidate will also have the opportunity for career progression and additional link roles should they wish&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;In addition to strong clinical skills you will possess:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Registered Nurse, level 1 (current NMC UK registration).&lt;/li&gt;\n&lt;li&gt;Surgical experience across a wide range of specialties.&lt;/li&gt;\n&lt;li&gt;Good communication and interpersonal skills&lt;/li&gt;\n&lt;li&gt;Excellent time management&lt;/li&gt;\n&lt;li&gt;Flexibility and reliability&lt;/li&gt;\n&lt;li&gt;Proven ability to work effectively in a team environment and independently as required.&lt;/li&gt;\n&lt;li&gt;The personality to work as part of a small dedicated team&lt;/li&gt;\n&lt;li&gt;Sound written and verbal communication skills&lt;/li&gt;\n&lt;li&gt;Flexibility and adaptability to meet the changing needs of the business&lt;/li&gt;\n&lt;li&gt;The ability to work to tight deadlines&lt;/li&gt;\n&lt;li&gt;Demonstrate excellent customer service skills&lt;/li&gt;\n&lt;li&gt;Basic computer skills&lt;/li&gt;\n&lt;li&gt;Mentorship or equivalent(desirable)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;In return for your expertise, we offer the successful candidate:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Competitive rate of pay in accordance to experience and clinical skills&lt;/li&gt;\n&lt;li&gt;Enhancements for unsocial hours  50% enhancements where applicable&lt;/li&gt;\n&lt;li&gt;Uniform provided&lt;/li&gt;\n&lt;li&gt;Ramsay scholarship fund available to support the continued academic learning for staff&lt;/li&gt;\n&lt;li&gt;Weekends are a maximum of 2 per month, shared fairly between staff (taking personal requests into consideration when roster planning)&lt;/li&gt;\n&lt;li&gt;Ramsay benefits scheme and access to register for a nurses blue light card for shopping discounts&lt;/li&gt;\n&lt;li&gt;Full induction support and mentorship will be provided&lt;/li&gt;\n&lt;li&gt;33 days annual leave including bank holidays which will increase with length of service every 5 years (pro-rata for part-time staff)&lt;/li&gt;\n&lt;li&gt;Contributory Pension Scheme&lt;/li&gt;\n&lt;li&gt;Free parking and subsidised staff restaurant&lt;/li&gt;\n&lt;li&gt;Long service award (every 5 years £75 voucher, 10 years £150, continuing upwards)&lt;/li&gt;\n&lt;li&gt;Life Assurance (3 x annual salary paid to who every you choose)&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Excellent ongoing paid training and development opportunities&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;About Us:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Fulwood Hall Hospital is located near Preston, registered for 30 beds, 3 Theatres, Endoscopy Suite, Daycase Unit and full supporting Outpatient Services.  Fulwood Hall Hospital offers a wide range of surgical procedures with diagnostic and treatment facilities.&lt;/p&gt;\n&lt;p&gt;As one of the North West&#39;s leading private and NHS ‘Choose &amp; Book’ hospitals, Fulwood Hall Hospital is a leading provider of high quality healthcare, part of the Ramsay Health Care Group.  Ramsay Health Care UK is one of the leading providers of NHS and private patient services in England, with a network of over 30 acute hospitals and Treatment Centres. Ramsay is part of a global hospital group operating 116 hospitals and day surgery facilities across Australia, the United Kingdom, France and Indonesia.&lt;/p&gt;\n&lt;p&gt;For further information regarding the position please e mail Alison Christy-Ward Manager Alison.christy@ramsayhealth.co.uk&lt;/p&gt;\n&lt;p&gt;All offers of employment in respect of this appointment will be subject to receipt of a satisfactory Enhanced Disclosure Certificate from the Disclosure &amp; Barring Service.&lt;/p&gt;\n&lt;p&gt;Fulwood Hall Hospital is committed to quality, equality and opportunity for all.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Ramsay Health Care UK", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=131134"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Preston", "postalCode": "PR2 9SZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7863", "longitude": "-2.68402"}}, "title": "Staff Nurse - Ward", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245733", "validThrough": "2020-11-30T23:59:59+0000"}