{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-10-29T11:01:08+0000", "description": "&lt;p&gt;The Performance Analytical Team consists of three central analytical teams and seven regional teams. The East of England Performance Analytical Team are looking to recruit an Analyst.&lt;/p&gt;\n&lt;p&gt;As a team, we are responsible for the collection, reporting and analysis of information about NHS operational activity and performance, and our team works with Regional Directors, Directors of Performance and many other directorates across the region to bring analysis to decision making. Examples of work include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Developing performance metrics to understand how patients experience the NHS – for example analysing statistics on A&amp;E 4hr performance and considering options for any replacement. This also includes putting in processes for monitoring and identifying reasons for its variation.&lt;/li&gt;\n&lt;li&gt;Assisting with how the NHS plans for its delivery of services – enabling the annual planning round, working with regional Sustainability and Transformation Partnerships to help complete the required stages for planning. This includes producing analysis of their results to ensure that plans are cohesive and realistic.&lt;/li&gt;\n&lt;li&gt;Deep dive pieces of analysis – these are multiple and varied in their topic and method applied. Previous areas include modelling the impact of COVID on waiting times for treatments, and where to locate NHS Nightingale sites.&lt;/li&gt;\n&lt;li&gt;Projecting demand for NHS services and required capacity over the course of the year and future years. For example, how might services such as changing outpatient appointments from face to face to video affect the required capacity and what other impacts (positive and negative) might this change in service have.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;In particular the post holder will:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Demonstrate knowledge and established practice of a variety and depth of analytical techniques (including advanced Excel skills) to provide quality, timely analysis and intelligence relating to key priorities of NHS England and NHS Improvement. These priorities will include assurance and accountability, commissioning, transformation, quality and safety, finance and policy and strategy development&lt;/li&gt;\n&lt;li&gt;Be adaptable when finding analytical solutions to problems, to analyse and triangulate data in innovative ways and present findings clearly to a range of audiences. Understand the importance of maintaining quality within analysis&lt;/li&gt;\n&lt;li&gt;Be able to largely drive their own work programme, providing guidance and review of other’s work and contributing appropriately to the overall strategy&lt;/li&gt;\n&lt;li&gt;Have excellent communication skills and be able to influence people with different perspectives to get the most out of stakeholder relationships&lt;/li&gt;\n&lt;li&gt;Support teams to ensure that the portfolio of tasks/projects is planned, managed and delivered effectively, be calm under pressure and able to juggle competing priorities and tight deadlines. Effectively manage risks and interdependencies in order to deliver their own work programme and anticipate and communicate the impact on other’s work areas&lt;/li&gt;\n&lt;li&gt;Ensure accurate and open communication and co-ordination with a range of organisations and individuals, researching and drafting correspondence and papers and ensuring the management of specific tasks, lead reporting and analysis across a range of specialties, functions and projects&lt;/li&gt;\n&lt;li&gt;Be a key member of the team as well as supporting effective communication and stakeholder management, both internally and externally&lt;/li&gt;\n&lt;li&gt;Have sound knowledge of NHS data and business processes, and good technical skills in data management, business intelligence and analytics, including data modelling, data visualisation with a focus on building self-service analytics solutions which will allow business users to analyse data themselves.&lt;/li&gt;\n&lt;li&gt;Strive for personal and professional development by seeking membership of professional analytical organisations such as AphA, BCS and/or Fedip.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Steve Fern&lt;/p&gt;\n&lt;p&gt;Job title: Senior Analytical Manager&lt;/p&gt;\n&lt;p&gt;Email address steve.fern@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number: 07713 795858&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/126694.png", "name": "NHS England and NHS Improvement", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126694"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Leicester/Cambridge", "postalCode": "CB21 5XA"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1848", "longitude": ".19314"}}, "title": "Analyst", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248017", "validThrough": "2020-11-15T23:59:59+0000"}