{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24097", "unitText": "YEAR", "value": "£24,097 - £30,615"}}, "datePosted": "2020-10-22T14:43:27+0100", "description": "&lt;p&gt;At University Hospitals Birmingham we support flexible working and welcome applications from nurses seeking flexible working opportunities and family friendly working hours.&lt;/p&gt;\n&lt;p&gt;This is an exciting time to join our Team at University Hospital Birmingham Foundation Trust. The recent acute Trust merger has led to further developments within our specialty becoming an extremely exciting place to work. Our vision is patients should be as happy and healthy as possible, living self-sufficient, independent lives, able to have choice and control over what they do and what happens for them.&lt;/p&gt;\n&lt;p&gt;We expect our workforce, at all grades and professions to be highly skilled and motivated, delivering individualised care for patients at the time they need it.&lt;/p&gt;\n&lt;p&gt;We have fantastic opportunities for Staff Nurses to work within our Trauma services team at the Queen Elizabeth site wards 408,410 and 412.. We provide holistic care to all trauma patients and with the varying acuity of the ward leads to a vast development of skills and knowledge within Trauma Care.&lt;/p&gt;\n&lt;p&gt;We are looking for experienced nurses with excellent communication skills and an interest in the health care of patients with a Trauma injury. We are looking for dynamic and motivated nurses who are able to excel in a busy environment. There will be opportunities for you to rotate throughout our department in order for you to gain maximum career opportunities.&lt;/p&gt;\n&lt;p&gt;The trust has an excellent in house training facility to assist all staff to reach their career goals. Clinical Educators are on hand to assist with any queries and assistance in building up practice with skills required. This speciality takes a proactive part in helping ensure staff are able to attend training to help them develop the skills they need to ensure they provide the highest standard of care to their patients.&lt;/p&gt;\n&lt;p&gt;We welcome all applicants who are willing to learn and be part of our fantastic team. All successful applicants will have a structured and supported induction period and will be able to access ongoing training and support from within our clinical training and education team.&lt;/p&gt;\n&lt;p&gt;If you want to work within a positive and supportive team and have the opportunity to develop professionally then please don’t hesitate to contact us for more information or to arrange an informal visit.&lt;/p&gt;\n&lt;p&gt;The post holder will be required to work flexibly across days, nights and weekends.&lt;/p&gt;\n&lt;p&gt;If you would like any further information or to arrange an informal visit, please contact&lt;strong&gt; Michael Rhodes Clinical Educator- 07880 580697&lt;br /&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This advert will be reviewed regularly and shortlised candidates invited to interview.&lt;br /&gt;&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University Hospitals Birmingham NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123452"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Birmingham", "postalCode": "B15 2TH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4533", "longitude": "-1.93628"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916238962", "validThrough": "2021-03-01T23:59:59+0000"}