{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "42712", "minValue": "36070", "unitText": "YEAR", "value": "£36,070 up to £42,712 pa inc HCAS"}}, "datePosted": "2020-11-03T10:31:31+0000", "description": "&lt;p&gt;The world class centre of excellence, South West London Elective Orthopaedic Centre, is seeking a Band 6 Physiotherapist to join our dynamic team.&lt;br /&gt;&lt;br /&gt;This is a highly exciting time to join our elective orthopaedic team here at SWLEOC. Working alongside the Clinical Therapy Lead and a forward thinking team of physiotherapists and occupational therapists, you could play a pivotal role in the development and growth of a modernised approach to elective orthopaedics.&lt;/p&gt;\n&lt;p&gt;We pride ourselves in our effective interdisciplinary team work. Strong links with consultants, occupational therapy, nursing and discharge liaison team will be required to develop ties with our community partners in intermediate care, out-patient and social services teams. This is a complex area due to our interactions with many different trusts with differing styles of service provision.&lt;/p&gt;\n&lt;p&gt;Excellent problems solving and communication skills are essential. With a dynamic ‘can do’ approach, you will have the opportunity to positively participate in a forever changing and busy environment. With the aim of up-skilling staff, supervision, support and training of unqualified staff will be part of your role.&lt;/p&gt;\n&lt;p&gt;Orthopaedic experience is essential and experience of MSK, community rehab, A&amp; E or rapid response would be an asset.&lt;/p&gt;\n&lt;p&gt;Greater London weighting and weekend rates payable.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Boudine Pearce:&lt;/p&gt;\n&lt;p&gt;b.pearce@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121992.jpg", "name": "Epsom and St Helier University Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121992"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "South West London Elective Orthopaedic Centre, Epsom General Hospital, Epsom", "postalCode": "KT18 7EG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.325", "longitude": "-.273383"}}, "title": "Orthopaedic Physiotherapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253467", "validThrough": "2020-11-17T23:59:59+0000"}