{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pro rata per annum"}}, "datePosted": "2020-10-30T12:00:52+0000", "description": "&lt;p&gt;&lt;strong&gt;INTERNAL APPLICANTS ONLY&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;A Fantastic opportunity has arisen for candidates with drive and ambition to help shape the future of District Nursing.&lt;/p&gt;\n&lt;p&gt;The Trust has built its reputation as a place to enjoy job satisfaction and develop professional skills and experience. Our ‘Outstanding’ workforce value opportunities to work in a supportive culture and are encouraged to innovate, improve and learn by improving quality within their everyday work. If you want to play a role in shaping an organisation that continues to put patients and clients care first, to empower them to live well and for longer you should consider applying for a secondment opportunity (12 months) in &lt;strong&gt;Specialist Practitioner Award (District Nursing)&lt;/strong&gt; based at Greenwich University.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Are you?&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A registered nurse with 12 months Community Nursing experience&lt;/li&gt;\n&lt;li&gt;In receipt of Diploma in Higher Nursing Education or able to provide equivalent evidence of studying at Level 5/6&lt;/li&gt;\n&lt;li&gt;Active NMC Mentor, Practice Assessor or Supervisor&lt;/li&gt;\n&lt;li&gt;Able to provide evidence of professional development in your clinical area&lt;/li&gt;\n&lt;li&gt;Able to demonstrate that you are dedicated to working in partnership with the Multi-disciplinary team to promote health and well-being and integrate services.&lt;/li&gt;\n&lt;li&gt;Wanting to develop your clinical leadership skills to improve healthcare delivery for your community&lt;/li&gt;\n&lt;li&gt;Able to demonstrate your understanding of current practice and policy on issues relating to your chosen area of practice.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We are looking for Nurses who are passionate about enhancing the provision of care being delivered in the local area. With more initiatives to care for people in their own home and more services moving to the community we are able to concentrate on hospital avoidance; management of long term conditions and end of life care, working collaboratively with the patients, their families and carers to ensure the best possible health outcomes.&lt;/p&gt;\n&lt;p&gt;Following our strong response to COVID 19, a progressive reset plan has been reimagined to meet the changing demands in the community. By offering joined up care with our partners in the Primary Care Networks we are able to support our patients and their families with one multi-skilled team.&lt;/p&gt;\n&lt;p&gt;Candidates must have Support from their Line Manager / Head of Service to apply for the program.&lt;/p&gt;\n&lt;p&gt;The course commences in January 2021 at Avery Hill Campus, Greenwich University. The course is delivered as a blend of practice placements and classroom-based learning. As a student you will work under the direction of a Community Practice Teacher or specialist mentor within a defined locality agreed on appointment. You will be involved in&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Managing a clinical caseload&lt;/li&gt;\n&lt;li&gt;Leading and managing a defined community nursing team&lt;/li&gt;\n&lt;li&gt;Ensuring safe clinical practices and high standards of care are maintained&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;If you are successfully shortlisted you will invited to a joint interview with KCHFT and the University of Greenwich and will be expected to undertake interview and assessment.&lt;/p&gt;\n&lt;p&gt;This secondment opportunity is offered at Band 5.5, but matching of current salary will be considered in agreement with supporting Head of Service&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interviews are scheduled for the 19th November 2020.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details and information please contact&lt;/p&gt;\n&lt;p&gt;Sam Twyman&lt;/p&gt;\n&lt;p&gt;Specialist Practitioner District Nurse and Professional Lead Nurse for East Kent Adults&lt;/p&gt;\n&lt;p&gt;Mobile 07827663504 or via email stwyman@nhs.net&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameSam TwymanJob titleSpecialist Practitioner District Nurse and Professional Lead Nurse for East Kent AdultsEmail addressstwyman@nhs.netTelephone number07827663504Additional contact information&lt;/p&gt;\n&lt;p&gt;Sam Twyman&lt;/p&gt;\n&lt;p&gt;Specialist Practitioner District Nurse and Professional Lead Nurse for East Kent Adults&lt;/p&gt;\n&lt;p&gt;Mobile 07827663504 or via email stwyman@nhs.net&lt;/p&gt;", "employmentType": "OTHER", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120633.png", "name": "Kent Community Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120633"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "East Kent, London", "postalCode": "SE10 9BD"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4798", "longitude": "-.0083"}}, "title": "Community Specialist Practitioner (District Nurse)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250071", "validThrough": "2020-11-15T23:59:59+0000"}