{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 Per Annum Pro Rata"}}, "datePosted": "2020-11-06T15:16:26+0000", "description": "&lt;p&gt;Due to the expansion of the Hyper-Acute Stroke Service along with an increase in our acute stroke bed base we are looking to recruit additional Band 5 Registered Nurses who are dynamic, highly motivated and who have a passion to deliver high quality stroke care and patient safety.&lt;/p&gt;\n&lt;p&gt;We are looking for individuals with the enthusiasm to support current developments and expansion of the stroke service and who want to learn in a structured and supported ward environment.&lt;/p&gt;\n&lt;p&gt;You will be working closely with a highly skilled Multi-disciplinary team, who have a real passion for delivering stroke care and taking our service forward.&lt;/p&gt;\n&lt;p&gt;Dependant on your experience, you will be given a protected preceptorship period along with bespoke training and personal development plan, this will be supported by our Education Lead for the Stroke Service.&lt;/p&gt;\n&lt;p&gt;The stroke unit consists of a 16 bed HASU and 16 bed HASU step down. Along with a 25 bed Acute Stroke Unit (ASU) that provides rehabilitation by a highly skilled and motivated multidisciplinary team, for stroke patients from the Knowsley, St Helens, Halton and Warrington area. We currently see approximately 900 confirmed strokes per year and provide a 24/7 thrombolysis service for circa 150 patients a year.&lt;/p&gt;\n&lt;p&gt;Due to our collaboration with Warrington Hospital, from the 1st April 2019 we will be the single Hyper acute Stroke unit and will take ALL acute strokes from the St Helens, Knowsley, Halton and now Warrington catchment area.&lt;/p&gt;\n&lt;p&gt;Our stroke service is fully resourced; a high standard of care is provided 7/ 7 days a week by a highly motivated multidisciplinary team comprising of 8 Stroke Physicians, 8 Stroke Specialist nurses who work 24/7, stroke specific Physio and Occupational Therapy, Speech and Language therapy, along with dedicated access to othoptics, dietetics and psychology on the unit. We have a stroke specific research nurse and are proud of the high number of trials the unit is part of; we have also recently recruited into a Prevention of Stroke in Atrial Fibrillation Specialist nurse. We have a long standing relationship and collaboration with our commissioners and clinicians in Primary care who provide stroke services&lt;/p&gt;\n&lt;p&gt;The stroke service has been consistently one of the highest performing teams in the country on the Stroke Sentinel National Audit for the last 2 years and continues to improve and develop its breadth of service and innovative working practices.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;There are both full and part time vacancies available. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;An Enhanced DBS Certificate with the checking of the Children’s and Adults’ Barred Lists is required for this post.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interviews for this position will take place on Tuesday 1st December 2020.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;St Helens &amp; Knowsley Teaching Hospitals NHS Trust is the BEST acute Trusts in England for the THIRD year running!&lt;/p&gt;\n&lt;p&gt;The Trust is currently the only acute Trust in Cheshire and Merseyside, and is one of few in the entire country, to achieve the title of OUTSTANDING, rated by the Care Quality Commission.&lt;/p&gt;\n&lt;p&gt;We provide a full range of acute adult services to our local population of circa 350,000 and provide tertiary services across a much wider area in the North West, North Wales and Isle of Man. We are also a Major Trauma Unit and the Mersey Regional Burns Unit.&lt;/p&gt;\n&lt;p&gt;Our &#39;5 Star Patient Care&#39; strategy is at the heart of all that we do; supporting our vision to provide world class services for all our patients by getting it right for every patient, every time.&lt;/p&gt;\n&lt;p&gt;Our latest achievements include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Acute Trust of the Year – HSJ Awards November 2019&lt;/li&gt;\n&lt;li&gt;Trust rates Outstanding by the CQC – Inspection August 2018 and March 2019&lt;/li&gt;\n&lt;li&gt;Best in the NHS, Patient Led Assessment of the Care Environment 2017 and 2018&lt;/li&gt;\n&lt;li&gt;The Trust achieved top marks in the country for areas including; cleanliness, food, privacy and dignity, facilities for patients living with dementia and disabilities, conditions, appearance and maintenance of the hospital buildings.&lt;/li&gt;\n&lt;li&gt;Top 100 places to work in the NHS (NHS Employers and Health Service Journal)&lt;/li&gt;\n&lt;li&gt;Best acute Trust in England (NHS Staff Survey 2017,2018 and 2019)&lt;/li&gt;\n&lt;li&gt;Best Patient Experience in the NHS (CHKS Top Hospitals Awards 2015)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;In the NHS Staff Survey 2019 the Trust scored the highest marks in the following areas;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Best place to receive treatment in the NHS (for 2nd year running)&lt;/li&gt;\n&lt;li&gt;Top Acute Trust for treating its staff fairly with regards to career progression (for 3rd year running)&lt;/li&gt;\n&lt;li&gt;Quality of care (best score for 5th year running)&lt;/li&gt;\n&lt;li&gt;Staff engagement (best score for 4th year running)&lt;/li&gt;\n&lt;li&gt;Staff morale (best score for 2nd year running)&lt;/li&gt;\n&lt;li&gt;Bullying and harassment (best score for 2nd year running)&lt;/li&gt;\n&lt;li&gt;Safety culture (best score for 2nd year running)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Our staff rated our Trust as the best place to work and receive treatment. The Trust has also been recognised, for the third year running, as being the top acute Trust in the entire country for staff engagement, staff motivation, and pride in the quality of care we provide to patients.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Katie Pendlebury&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Ward Manager&lt;/p&gt;\n&lt;p&gt;0151 290 4506&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Katie Batie&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Matron&lt;/p&gt;\n&lt;p&gt;0151 430 2842&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameKatherine PendleburyJob titleWard ManagerEmail addressKatherine.pendlebury@sthk.nhs.ukTelephone number0151 290 4506Additional contact information&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Katherine.Pendlebury@sthk.nhs.uk&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; 0151 290 4506&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121089.jpg", "name": "St Helens and Knowsley Teaching Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121089"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Whiston, Whiston", "postalCode": "L35 5DR"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4201", "longitude": "-2.78641"}}, "title": "Staff Nurse -  Hyper-Acute Stroke Unit (HASU) &amp; HASU Step Down Unit", "url": "https://www.jobs.nhs.uk/xi/vacancy/916260321", "validThrough": "2020-11-20T23:59:59+0000"}