{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Dependent on experience and qualifications"}}, "datePosted": "2020-10-23T14:30:16+0100", "description": "&lt;p&gt;&lt;strong&gt;Job Title – Clinical Director – SARC &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Bases – Hope House, Gloucester &amp; The Gables, Swindon&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary – Dependent on experience and qualifications&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Contract – Fixed term to September 2022&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours per week –4 sessions per week, flexible times&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Specialty/Function: Sexual Health&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Gloucestershire Health and Care NHS Foundation Trust has teamed together with First Light to create an exciting opportunity for a doctor with experience in relevant specialities and a particular expertise or interest in the forensic and holistic care of complainants of sexual assault to provide joint clinical leadership across our two neighbouring SARC’s.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Sexual Assault Referral Centres provide critical support to victims of sexual assault in a complex environment that is both clinical and non-clinical. The post holder will be responsible for providing Clinical Leadership across our centres (2 sessions Gloucestershire Health and Care, 2 sessions First Light) by ensuring the provision and maintenance of a high quality, appropriate medical service to clients, as well as ensuring effective sexual health aftercare working in partnership with the independent forensic healthcare service who currently provide the forensic examiners, as well as primary care services and sexual health Services. The post holder will also play a key role in the development of the centres, and make a significant contribution to the strategic planning, policy formulation and to achievement of our objectives.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The job description will be adapted accordingly for the level of doctor appointed to the role.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The post is line managed by the Medical Director of Gloucestershire Health and Care through the Deputy Medical Director for Community Health Services.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For informal enquiries please contact Dr Phillip Fielding, Deputy Medical Director Community Services for Gloucestershire Health and Care NHS Foundation Trust on Phillip.Fielding@ghc.nhs.uk and Lyn Gooding, CEO for First Light on lyn.gooding@firstlight.org.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Closing date: 15th November 2020 Interview Date: TBC&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;PLEASE NOTE - this role is advertised by Gloucestershire Health and Care NHS Foundation Trust as a joint role with First Light. The successful candidate will be employed by Gloucestershire Health and Care NHS Foundation Trust and seconded to First Light for 2 sessions per week. By submitting an application you understand that your details will be shared with First Light.&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120776.png", "name": "Gloucestershire Health and Care NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120776"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Gloucester", "postalCode": "GL1 3NN"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.8664", "longitude": "-2.23104"}}, "title": "Clinical Director -SARC", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240919", "validThrough": "2020-11-15T23:59:59+0000"}