{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum (pro rata)"}}, "datePosted": "2020-11-05T16:16:13+0000", "description": "&lt;p&gt;&lt;strong&gt;Highly Specialist Clinical Psychologist: Neuropsychological Services&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Band 8a, 22.5 hours per week&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;North Nottinghamshire &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Inpatient Stroke Ward and Stroke Early Supported Discharge Team &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for a Clinical Psychologist with an interest in Clinical Neuropsychology to work within acute and community Stroke Services provided by Sherwood Forest Hospitals Foundation Trust (SFHFT) in Mansfield, Ashfield, Newark &amp; Sherwood. The post provides an excellent opportunity to work within diverse multidisciplinary teams in acute, rehabilitation and Early Supported Discharge stroke services.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will be an integral member of multidisciplinary teams providing direct and indirect clinical psychology input including teaching, supervision and consultation. Clinical work includes providing neuropsychological assessment, formulation and intervention. The role offers the opportunity to work on an inpatient ward which combines acute and rehabilitation stroke services and the Early Supported Discharge Team providing stroke rehabilitation in the community for patients and their carers focused on the achievement of agreed rehabilitation goals. Health and social care professionals will work together to provide intensive, coordinated care required by stroke patients as part of their rehabilitation. The service helps patients regain mobility, function and confidence following stroke.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Duties will include the supervision of Trainee Clinical Psychologists, Assistant Psychologists or junior Clinical Psychologists as required. You will be working alongside a Clinical Psychologist based on the stroke ward and specialist supervision will be received from the Clinical Lead for Stroke. We are linked with two local Clinical Psychology Training courses and there will be opportunities to provide teaching and placements for trainees. We strongly support continued professional development in neuropsychology and research activities related to the stroke service.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;A full UK driving licence is required for this post; however reasonable adjustments will be made for disabled individuals in line with the Equality Act 2010.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;You should hold a Doctoral Level Qualification in Clinical Psychology and be registered with the Health and Care Professions Council. It would be an advantage to have a Postdoctoral Qualification in Clinical Neuropsychology at either Diploma or MSc level, as recognised by the Division of Neuropsychology of The British Psychological Society. Experience of working within a neuropsychological setting and with multidisciplinary teams is essential. Experience of providing teaching and supervision to multidisciplinary teams would be beneficial. You should possess excellent interpersonal and time management skills, be a good communicator and able to prioritise and work well as a member of a team. A qualification in the supervision of Clinical Psychology Trainees would be welcomed, otherwise you should be prepared to undertake training related to the supervision of Clinical Psychology Trainees. Applications from suitably experienced newly qualified Clinical Psychologists are welcomed. Visits to the service can be facilitated prior to interview.&lt;/p&gt;\n&lt;p&gt;Proposed interview date is 10th December 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Dr Dawn Reeve - Consultant Clinical Neuropsychologist&lt;/p&gt;\n&lt;p&gt;Email address: dawn.reeve@nottshc.nhs.uk / Telephone number: 0115 9560879&lt;/p&gt;\n&lt;p&gt;or&lt;/p&gt;\n&lt;p&gt;Dr Posy Knights - Clinical Lead for Stroke&lt;/p&gt;\n&lt;p&gt;Email address: posy.knights@nottshc.nhs.uk / Telephone number: 0115 8835060&lt;/p&gt;\n&lt;p&gt;*The closing date given is a guide. We reserve the right to close the post early once we have received a sufficient number of applicants, so we advise you to submit your application early to prevent disappointment. &lt;/p&gt;\n&lt;p&gt;*We will be requesting references by email.  Please ensure you include email addresses and contact numbers for your referees to avoid delay in the recruitment process.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120975.jpg", "name": "Nottinghamshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120975"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Sutton in Ashfield", "postalCode": "NG17 4JL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.1345", "longitude": "-1.23627"}}, "title": "Highly Specialist Clinical Psychologist: Neuropsychological Services", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258516", "validThrough": "2020-11-25T23:59:59+0000"}