{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "107668", "minValue": "79860", "unitText": "YEAR", "value": "£79,860 - £107,668 pa"}}, "datePosted": "2020-11-05T10:25:57+0000", "description": "&lt;p&gt;We are looking for a dynamic and motivated Locum Consultant Physician in Respiratory &amp; General Medicine to join our friendly and enthusiastic team at the North Cumbria Integrated Care NHS Foundation Trust (NCIC).&lt;/p&gt;\n&lt;p&gt;An new opportunity has arisen to join our friendly, dedicated team and applications are invited for the post of Locum Consultant in Respiratory Medicine and General Medicine. This post will be based primarily at The Cumberland Infirmary, Carlisle. The post involves out-patient and in-patient duties and a regular commitment to both in-reach into the medical admissions unit and on-call for general medicine. We would particularly welcome applicants with a special interest in sleep, asthma or pleural diseases, though any specialist interest would be welcomed and supported.&lt;/p&gt;\n&lt;p&gt;Successful applicants must have full registration with the GMC.&lt;/p&gt;\n&lt;p&gt;The post holder would be coming to join a committed and experienced team.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact, Dr Matthew Lane, Clinical Director for Respiratory Services: matthew.lane@ncic.nhs.uk or tel: 01228 814142.&lt;/p&gt;\n&lt;p&gt;Relocation assistance of up to £4,000 may be available for successful applicants moving to the region.&lt;/p&gt;\n&lt;p&gt;The post currently attracts a discretionary recruitment premium of up to 10% (based on basic salary) per annum. This is pensionable, payable for up to 4 years and is reviewed by the Trust on an annual basis.&lt;/p&gt;\n&lt;p&gt;Please see full job description and personal specification for details.&lt;/p&gt;\n&lt;p&gt;Closing date: 3rd December 2020.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120898.png", "name": "North Cumbria Integrated Care NHS Foundation Trust (NCIC)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120898"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Carlisle", "postalCode": "CA2 7HY"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.8958", "longitude": "-2.9553"}}, "title": "Locum Consultant in Respiratory &amp; General Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257219", "validThrough": "2020-12-03T23:59:59+0000"}