{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 pa"}}, "datePosted": "2020-11-02T03:46:03+0000", "description": "&lt;p&gt;Cleaning Services Re-design Manager is an oppurunity to lead an exciting project&lt;/p&gt;\n&lt;p&gt;The cleaning department at the RUH ensures the whole hospital is clean for our patients, staff and visitors. This helps to reduce potential infections and is a key service in support of our clincial teams. The department is one of the largest departments wtihin the hospital and provides services 24 hours a day over 7 days.&lt;br /&gt;We are looking to review the entire cleaning service, in line with the new National Standards for Healthcare Cleanliness to ensure we are provdiing the highest level of cleanliness to our patients. The Cleaning Services Re-design Manager is a new role that has been developed to complete the re-design project. The role will provide the post holder with a chance to have an impact on how the department works, and our cleaning schedules going forward.&lt;/p&gt;\n&lt;p&gt;We are looking for someone who is skilled in problem solving and experienced in handling data using software such as Microsoft Excel.&lt;br /&gt;The role is fixed-term for 12 months, which is the expected duration of the project. The project will include working as part of the management team consulting with our staff on any proposed changes.&lt;/p&gt;\n&lt;p&gt;Experience of cleaning management is not necessary, however an abilty to understand the requirement of healthcare cleaning is essential.&lt;/p&gt;\n&lt;p&gt;For further information, or an informal conversation about the role, please contact Philip Watson, Head of Facilities on philip.watson1@nhs.net or 01225 824682&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121339.png", "name": "Royal United Hospitals Bath NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121339"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bath", "postalCode": "BA1 3NG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3917", "longitude": "-2.3912"}}, "title": "Cleaning Services Re-design Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251229", "validThrough": "2020-11-15T23:59:59+0000"}