{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "49325", "minValue": "43712", "unitText": "YEAR", "value": "£43,712 - £49,325 pa inc. HCAS pro rata"}}, "datePosted": "2020-11-03T09:00:41+0000", "description": "&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Nurse Practitioner / Emergency Care Practitioner&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;A vacancy has arisen at the North East London Waltham Forest community services &lt;br /&gt;&lt;br /&gt;Urgent Care Centre, Whipps Cross Hospital &lt;br /&gt;As an established UCC we are committed to the expansion and provision of outstanding clinical services provided within the Urgent Care Centre setting. &lt;br /&gt;We have Nurse Practitioners and Emergency care practitioners within our team. &lt;br /&gt;You will play a key role in the provision of autonomous clinical practice to a varied case load of patients. You will need to demonstrate expertise and competencies to complement our existing team.&lt;br /&gt;We provide treatment to patients of all ages presenting with a wide range of minor illness and injuries. The service also has access to community services, acute specialisms and 24 hour GP led service.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;This is an exciting initiative to further your professional development in a climate of dynamic change. &lt;br /&gt;&lt;br /&gt;• Advanced Nurse Practitioner with evidence of relevant post registration qualifications&lt;br /&gt;• Ability to support and manage all patients including assessment diagnosing, treatment and discharge&lt;br /&gt;• A&amp;E / Primary Care background &lt;br /&gt;&lt;br /&gt;The main responsibilities of the post:&lt;/p&gt;\n&lt;p&gt;To provide clinical decision making streaming patients on entry to the hospital to the suitable place of care&lt;/p&gt;\n&lt;p&gt;•To provide autonomous practise to all patients presenting with minor injury &amp; illness with proven clinical competencies&lt;/p&gt;\n&lt;p&gt;• Has the ability and skills to manage case load maintaining an accurate overview of workload and the establishment of clinical priority of patients when acting as shift leader.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;• Ability to demonstrate recent clinical management&lt;br /&gt;• Staff management skills&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;The post holder will be required to work flexibly within a 24 hour service.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Probationary Period&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This post will be subject to a probationary period. Internal applicants are exempt from the probationary period (unless you are an internal applicant currently part way through a probationary period or currently a bank member of staff).&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Assessment/Interview info&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;At NELFT we set very high standards to ensure we provide quality services. We require prospective employees to carry out an online literacy and numeracy test, equivalent to NVQ Level 2. For more information regarding our assessments, please visit our website. If you are shortlisted, invited for interview and successfully offered the post, you will be required to undertake an assessment for these skills during the pre-employment checks.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Starting with NELFT&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;NELFT place a great deal of importance on new starters being properly welcomed and inducted into the Trust. All new starters will join the Trust on the first Monday of each month and will undertake a comprehensive induction.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;High Cost Area Supplement - London&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This post also attracts payment for High Cost Area Supplement of 15% of the basic salary (with a minimum of £3,784 to a maximum of £4,822).&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameSabrina PontonJob titleOperational LeadEmail addresssabrina.ponton@nelft.nhs.ukTelephone number07412677161&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NELFT NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120606"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Urgent Care Centre, Whipps Cross Hospital, Waltham Forest", "postalCode": "E11 1NR"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5788", "longitude": ".002666"}}, "title": "Nurse Practitioner / Emergency Care Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253200", "validThrough": "2020-11-12T23:59:59+0000"}