{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum plus HCA where applica"}}, "datePosted": "2020-10-23T11:45:58+0100", "description": "&lt;p&gt;&lt;strong&gt;*** Please note that At-Risk candidates will be given priority consideration ***&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for a talented and experienced analyst to provide analytical support within our Business Intelligence Team, which supports the Performance Section of the BI team. The successful applicant will be responsible for interpreting and presenting detailed data both internally and to commissioners and providers, and will develop new reports to support performance and operating plan monitoring.&lt;/p&gt;\n&lt;p&gt;The successful applicant will have experience in an analytics role in the NHS and will be a skilled analyst, adept at identifying patterns in data, who enjoys working with Excel and has strong SQL skills. They will have a good working knowledge of NHS data definitions, structures and financial flows such as the National Tariff Payment System.&lt;/p&gt;\n&lt;p&gt;The post holder will be a proactive team player with strong communication skills, and will be able to foster strong working relationships with a wide range of stakeholders.&lt;/p&gt;\n&lt;p&gt;The post holder may be required to work at any establishment at any time throughout the duration of their contract, normally within the location of the CSU or NCL CCGs, or as set out under the terms of their contract. Travel will be required between NCL STP sites.&lt;/p&gt;\n&lt;p&gt;We reserve the right to close any vacancies when we have received sufficient applications to shortlist.&lt;/p&gt;\n&lt;p&gt;Applicants who can clearly demonstrate how they meet our role profile requirements will be shortlisted for interview. To enquire about your application or inform us of any changes in your circumstances please ensure you quote your application reference number.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameIan DearloveJob titleDH of Business IntelligenceEmail addressian.dearlove@nhs.netTelephone number0208 688 1133&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NEL Commissioning Support Unit", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127694"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Clifton House, London", "postalCode": "EC2A 2DU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5222", "longitude": "-.084148"}}, "title": "CCG Business Intelligence Specialist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240364", "validThrough": "2020-11-06T23:59:59+0000"}