{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Competitive"}}, "datePosted": "2020-10-05T16:36:55+0100", "description": "&lt;p&gt;&lt;strong&gt;Cross Sectional Radiographer Lead – MRI &amp; CT &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Competitive Salary&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Springfield Hospital&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We have an exciting opportunity has arisen to join the imaging team at Springfield Hospital as a Cross Sectional Radiographer Lead covering MRI &amp; CT. &lt;/p&gt;\n&lt;p&gt;The Radiography department covers theatres, CT, MRI and Ultrasound. You will be supported by one of the UK’s largest private health care groups who will ensure your continuous development and sponsor additional post-graduate and other learning courses.&lt;/p&gt;\n&lt;p&gt;If you are looking for your next move and want to join a friendly team with a real sense of community within the working environment, then look no further!&lt;/p&gt;\n&lt;p&gt;Join us on our exciting journey of new developments and expansion over the coming months.  Here at Springfield we provide a wide range of services including Surgery, Medicine, Oncology, Plastic and Cosmetic surgery, and Paediatrics.    We are continually introducing new technology to ensure we provide the best experience for our patients and support for our hard working teams and have just opened 2 additional purpose built theatres taking our total to 6. &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What we can offer you as a Cross Sectional Radiographer Lead – MRI &amp; CT:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Competitive salary&lt;/li&gt;\n&lt;li&gt;25 days annual leave plus the option to buy more&lt;/li&gt;\n&lt;li&gt;Contributory Pension Scheme&lt;/li&gt;\n&lt;li&gt;Access to the Ramsay Academy – genuine opportunities to grow, develop and specialise in your career&lt;/li&gt;\n&lt;li&gt;Private Healthcare&lt;/li&gt;\n&lt;li&gt;Life Assurance&lt;/li&gt;\n&lt;li&gt;Free parking and subsidised staff restaurant&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;You will need as a Cross Sectional Radiographer Lead – MRI &amp; CT:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;HCPC registered a member of the Society of Radiographers.&lt;/li&gt;\n&lt;li&gt;Experience in CT and MRI as well as X-Ray&lt;/li&gt;\n&lt;li&gt;Sound written and verbal communication skills&lt;/li&gt;\n&lt;li&gt;Proven ability to work effectively in a team environment and independently as required&lt;/li&gt;\n&lt;li&gt;Passion to deliver high quality diagnostic services&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Ramsay Healthcare UK is a high quality provider of acute private healthcare across the UK. We have a highly specialised team of dedicated staff who work within this multi- speciality setting.&lt;/p&gt;\n&lt;p&gt;Springfield Hospital opened in 1987 and is one of Essex’s leading private hospitals. It is a 64 bedded hospital all with ensuite facilities, with parent and child rooms, a 14 bed Day unit and a high dependency unit.  There are six operating theatres, a physiotherapy department and on site private GP service. The Hospital has a full range of diagnostic equipment including CT, MRI, X-ray and ultrasound.&lt;/p&gt;\n&lt;p&gt;We love people with a positive, “can do” attitude who want to make a difference in their work. &quot;Our employees are Ramsay.&quot; The skills and commitment of our employees forms the basis for our success.&lt;/p&gt;\n&lt;p&gt;“The Ramsay Way” culture recognises that people – staff and doctors – are Ramsay Health Care’s most important asset and this has been key to our ongoing success.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are committed to equality of opportunity for all.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Ramsay Health Care UK", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=131134"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Chelmsford", "postalCode": "CM1 7GU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7535", "longitude": ".484991"}}, "title": "Cross Sectional Radiographer Lead – MRI &amp; CT", "url": "https://www.jobs.nhs.uk/xi/vacancy/916213641", "validThrough": "2020-11-14T23:59:59+0000"}