{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "36500", "minValue": "36500", "unitText": "YEAR", "value": "up to £36,500 per annum DOE"}}, "datePosted": "2020-11-02T16:20:52+0000", "description": "&lt;p&gt;&lt;strong&gt;Make a difference from day one!&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt; Prisons are one of the most challenging, yet rewarding places for healthcare professionals to work - if you’re looking for a role where you can develop your existing skills and learn something new every day, then this is the place to be.&lt;br /&gt; &lt;br /&gt; HMP Bullingdon operates as a local prison holding both remanded and sentenced prisoners. It has a dedicated healthcare unit, specialising in supporting patients with complex medical requirements, mental health issues and primary care needs. Healthcare is provided 24/7, including first and second reception screening for new arrivals, triage and phlebotomy and vaccination clinics. Long term condition clinics are a core clinical activity. The roles are varied, involving assessing and treating patients and carrying out effective care in an ever changing environment; responding to both their physical and mental well-being needs including substance dependency. Our team includes GP’s, Clinical Leads, Nurses and HCA’s; emergency care is supported by our paramedic and all our clinical staff are trained to deliver intermediate life support (ILS). Pharmacy is managed by our pharmacist and supported by technicians and assistants.&lt;br /&gt; &lt;br /&gt; HMP Bullingdon is located 10 minutes from Bicester, 30 minutes from Aylesbury, Oxford and Banbury, and 40 minutes from High Wycombe.&lt;/p&gt;\n&lt;p&gt;Practice Plus Group are Health in Justice Market leader, providing healthcare services to offenders across the country. Our model of care is our Wellbeing Approach – an integrated, comprehensive approach in recognition of the fact prisoners are a socially-excluded group with healthcare needs which are complex and often associated with poor outcomes. It adopts the premise no single health/wellbeing factor can be taken in isolation of other motivational issues which might impact a person’s care.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;In return for your hard work you will...&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt; You’ll receive an annual salary up to £36,500 FTE - depending on experience + 2 year Golden Hello (£2,000 in Year 1 of service and £1,500 in Year 2 of service - conditions apply). You&#39;ll also get a number of benefits including a company contributory pension scheme, 25 days annual leave plus 8 public bank holidays plus CPD and re-validation support.&lt;/p&gt;\n&lt;p&gt;Other benefits include cycle to work scheme plus training and clinical development opportunities.&lt;/p&gt;\n&lt;p&gt;Onsite benefits at HMP Bullingdon include access to an onsite gym and free parking.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;br /&gt; &lt;br /&gt; What do we need from you so you can do the job?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt; As a Registered Nurse you’ll be an integral part of the multi-disciplinary healthcare team by bringing your top notch clinical skills and passion for care.&lt;br /&gt; &lt;br /&gt; With plenty of primary care experience, you’ll be involved with developing and leading clinics in sexual health including assessment, investigation, diagnosis, treatment; undertaking examinations and tests.&lt;br /&gt; &lt;br /&gt; If you have a passion for bringing new ideas to the table then we’re here to listen on how we can improve and continue to develop our healthcare service within the prison environment.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;br /&gt; Next steps&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt; If you are shortlisted, you will be contacted by Alex Tigwell, the Internal Recruiter for this role.&lt;br /&gt; &lt;br /&gt; Alex will submit your CV to the hiring manager and in turn will arrange an interview for you to attend if the hiring manager feels that you are suitable for the job.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;br /&gt; More information&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt; This is a full-time role will be working 37.5 hours per week Monday – Friday with no weekend or night work. The salary for this role is up to £36,500 FTE - dependent on experience.&lt;br /&gt; &lt;br /&gt; Please note that offers of employment are subject to Practice Plus Group Terms &amp; Conditions and receipt of satisfactory references, an enhanced DBS check and prison vetting.&lt;br /&gt; &lt;br /&gt; At Practice Plus Group we actively promote diversity and equal opportunities.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Practice Plus Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130136"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bicester", "postalCode": "OX25 1PZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.8526", "longitude": "-1.09436"}}, "title": "Sexual Health Nurse - HMP Bullingdon", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252821", "validThrough": "2020-11-16T23:59:59+0000"}