{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 pa pro rata"}}, "datePosted": "2020-11-03T14:46:36+0000", "description": "&lt;p&gt;Maidstone and Tunbridge Wells NHS Trust is a large acute hospital Trust in the south east of England. The trust provides a full range of general hospital services and some areas of specialist complex care to around 560,000 people living in the south of West Kent and the north of East Sussex.&lt;/p&gt;\n&lt;p&gt;The vision of the Trust is to deliver kind, compassionate and sustainable services for our community, through being improvement driven and responsive to the needs of our patients and staff. We recognise that our talented staff are our most valuable asset, and appreciate the importance of training and development to ensure that all employees can realise their full potential. The post holder will be supported by experienced clinicians through regular in-service training, supervision and other in house training.&lt;/p&gt;\n&lt;p&gt;We are currently seeking an enthusiastic and motivated Occupational Therapist to join the Therapy Assisted Discharge service (TADS) at Maidstone Hospital.&lt;/p&gt;\n&lt;p&gt;TADS is a team of occupational therapists, physiotherapists and therapy assistants that enable early discharge from hospital by providing access to therapy assessment and rehabilitation at home within 24 hours of discharge from hospital. The team is part of West Kent Home First and works in collaboration with community health, social care and voluntary agencies.&lt;/p&gt;\n&lt;p&gt;TADS operates from 8am to 6pm seven days a week. The post therefore involves joining a seven day roster with opportunity for flexible working hours and enhanced rates of pay. Relocation expenses may be payable to the successful candidate providing eligibility criteria is met. This will be discussed with short-listed candidates during their interview&lt;br /&gt;&lt;br /&gt;We are looking for someone with a commitment to multi-disciplinary working, excellent organisation and communication skills and a proactive approach to personal development. This is an ideal opportunity for an experienced Band 5 or Band 6 wishing to develop clinical skills in intermediate care within an established and supportive team.&lt;/p&gt;\n&lt;p&gt;Please note that appointment to this post will be subject to a satisfactory Disclosure &amp; Barring Service Check at &lt;strong&gt;enhanced level. (Enhanced level now includes regulated checks against vulnerable adults and children)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;We are passionate in supporting our staff to develop and have great opportunities for career progression. We take equality and diversity seriously and seek to empower all diverse groups within our trust. We seek to develop a culture where diversity in all its forms is celebrated. We are committed to ensuring that women are empowered to work at all levels of management and that working patterns are as flexible as possible giving all members of staff opportunity to flourish in using their skills for our patients. We work across our trust to enable those who consider themselves to have a disability both visible and invisible to have access to all they need to thrive in their work environment. We work with Stonewall to embed an inclusive and accepting culture for all lesbian, gay, bisexual and transgender staff. We have 78 nationalities working in our trust and we are proud of this. We are active in embracing the ethnic and cultural diversity in our trust. We work to empower people with any protected characteristic to have opportunities to work in an environment that helps them to contribute to the best of their ability, recognising and valuing the unique contributions each of us brings for best quality care and service to our patients. We are committed to supporting the delivery of the Equality Act with zero tolerance for any discrimination, harassment or victimisation of applicants and staff with these protected characteristics&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing Date: Sunday 15th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview Date: Thursday 26th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Amanda Lawrance&lt;/p&gt;\n&lt;p&gt;Clinical Lead TADS&lt;/p&gt;\n&lt;p&gt;Therapy Assisted Discharge Service (TADS)&lt;/p&gt;\n&lt;p&gt;Tel : 01892 635634 or Mobile 07738860794&lt;/p&gt;\n&lt;p&gt;amanda.lawrance2@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120635.png", "name": "Maidstone and Tunbridge Wells NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120635"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Maidstone Hospital, Maidstone", "postalCode": "ME16 9QQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2737", "longitude": ".484004"}}, "title": "Senior Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254395", "validThrough": "2020-11-15T23:59:59+0000"}