{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum pro rata"}}, "datePosted": "2020-10-26T13:31:46+0000", "description": "&lt;p&gt;An opportunity has arisen for a Band 6 post for a suitably qualified and experienced Senior Mental Health Practitioner within Gorwelion, Community Mental Health Centre, Aberystwyth, Ceredigion.&lt;/p&gt;\n&lt;p&gt;The Crisis Resolution Home Treatment Team (CRHTT) Service and the community mental health team (CMHT) have amalgamated, forming one large community mental health centre team, this is in line with the &#39;transforming mental health services&#39; initiative. The post holder will be expected to deliver intensive support / brief interventions and extended interventions for people experiencing mental health related issues.&lt;/p&gt;\n&lt;p&gt;This initiative offers alternatives to in-patient care and ensures a clear pathway through services that will prevent waiting lists, re assessments and delayed care.&lt;/p&gt;\n&lt;p&gt;The Community Mental Health Centre works collaboratively with other mental health service providers, the majority of which will be within the same building, and is committed to providing timely and appropriate care for service users and their families/ carers within the least restrictive environment and will also form part of the developing unscheduled care system.&lt;/p&gt;\n&lt;p&gt;Interested individuals will be expected to be enthusiastic, motivated, flexible to service needs, and committed to the working ethos of the transition process.&lt;/p&gt;\n&lt;p&gt;This is a progressive team who are committed to change and want to be a part of how mental health services are developing into the future.&lt;/p&gt;\n&lt;p&gt;The team operates a shift system covering 24 hours, 7 days per week. You will also be required to work as part of the unscheduled care system. The ability to travel between sites in a timely manner is an essential.&lt;/p&gt;\n&lt;p&gt;Applicants will need substantial experience working in an acute adult mental health setting and will require a sound knowledge of current issues pertaining to mental health, particularly the current issues within Hywel Dda mental health services.&lt;/p&gt;\n&lt;p&gt;Comprehensive Assessment, Risk Assessment and Management skills within the context of CTP are essential, as are excellent interpersonal and communication skills.&lt;/p&gt;\n&lt;p&gt;The ability to manage time and prioritise workload is fundamental to effective service delivery.&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; English and/or Welsh speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt;Full/ part time/ job share considered.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Liz Baggott&lt;/p&gt;\n&lt;p&gt;emma.baggott@wales.nhs.uk&lt;/p&gt;\n&lt;p&gt;or&lt;/p&gt;\n&lt;p&gt;Sarah Davies&lt;/p&gt;\n&lt;p&gt;sarah.davies@wales.nhs.uk&lt;/p&gt;\n&lt;p&gt;Please phone 01970 615448&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123194.gif", "name": "Hywel Dda University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123194"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Gorwelion, Aberystwyth", "postalCode": "SY23 1HB"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4118", "longitude": "-4.07087"}}, "title": "Senior Mental Health Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242671", "validThrough": "2020-11-15T23:59:59+0000"}