{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 pa (pro rata)"}}, "datePosted": "2020-10-07T14:00:27+0100", "description": "&lt;p&gt;Are you an experienced or newly qualified nurse with a passion for providing the best care to patients in a community setting? &lt;br /&gt; &lt;br /&gt; Do you enjoy providing hands on clinical care? &lt;br /&gt; &lt;br /&gt; Would you like to transfer the skills you have developed in a hospital setting to caring for patients in their own homes? &lt;br /&gt; &lt;br /&gt; Tired of working night shifts? &lt;br /&gt; &lt;br /&gt; If the answer is yes, then we would love to hear from you! &lt;br /&gt; &lt;br /&gt; We are looking for nurses who want to make a real difference by caring for patients in their own homes to enable early discharge from hospital and to prevent readmission.&lt;/p&gt;\n&lt;p&gt;The Community Intravenous Administration Service (CIVAS) is a citywide nursing team visiting patients across Leeds in their own homes and community clinics. &lt;br /&gt; &lt;br /&gt; CIVAS is an expanding team of nursing staff who work collaboratively and in partnership with the Leeds Teaching Hospitals NHS Trust&#39;s Outpatient Parenteral Antibiotic Therapy (OPAT) team to support the early discharge of patients and to achieve the best health outcomes through tailored antimicrobial (antibiotics and antifungals) intravenous therapies in patients own homes. The team also work with a variety of different services across Leeds Community Healthcare including the specialist cardiac team and the newly developed virtual frailty ward to reduce hospital admission. &lt;br /&gt; &lt;br /&gt; It is a proactive award winning service and you will be joining a dynamic and progressive team to ensure that CIVAS is able to grow and support more patients to be cared for at home. We are currently working with commissioners to develop new pathways and expansion of the service. &lt;br /&gt; &lt;br /&gt; No two days are the same and as part of the team you will provide holistic nursing care; complete daily assessments; administer intravenous therapies and diuretics; obtain venous blood samples; insert peripheral venous cannulas and provide care and maintenance of vascular access devices. &lt;br /&gt; &lt;br /&gt; We are looking nurses with a passion for community nursing whether this is your first community role or you have lots of experience. As a member of our team you can expect a full training and support programme with ongoing opportunities for learning and development and regular clinical supervision. You will also have the opportunity to work with the OPAT team. &lt;br /&gt; &lt;br /&gt; This opportunity is perfect for nurses who want to be part of the future of the NHS with the long term plan to provide more care in community settings whilst reducing hospital admissions. Our service is at the very heart of that vision. &lt;br /&gt; &lt;br /&gt; We operate a 7 day service from 7:15am to 9:30pm. We can offer the flexibility of part-time or full-time hours. &lt;br /&gt; &lt;br /&gt; You must be a registered nurse with excellent communication skills. You will provide one to one care in patients&#39; homes as well as clinics in hospital and community settings. You will enjoy using your initiative and providing support to colleagues within the team. &lt;br /&gt; &lt;br /&gt; As this is a community post you will work across the Leeds district. You must have a valid driving licence and access to an appropriate vehicle. &lt;br /&gt; &lt;br /&gt; We welcome applications from newly qualified nurses and experienced nurses who wish to develop their experience within a community setting.&lt;/p&gt;\n&lt;p&gt;If this job sounds like it suits you down to the ground, apply now before you forget!&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123893.jpg", "name": "(SP) Leeds Community Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123893"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Leeds", "postalCode": "LS6 1PF"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8149", "longitude": "-1.56836"}}, "title": "Specialist Community Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916216785", "validThrough": "2020-11-15T23:59:59+0000"}