{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum pro rata"}}, "datePosted": "2020-11-03T10:52:58+0000", "description": "&lt;p&gt;&lt;span&gt;&lt;span&gt;Are you a 3&lt;/span&gt;&lt;span&gt;rd&lt;/span&gt;&lt;span&gt; year student about to qualify, recently qualified, or experienced Band 5, HCPC registered radiographer? We have some exciting opportunities to join our growing Medical Imaging department at the Royal Devon &amp; Exeter Foundation Trust. Come and enjoy a great quality of life in the South West of England and be part of our innovative and compassionate team. For any students due to qualify in 2021, we also offer the opportunity to start with us as a Band 4 Assistant Practitioner whilst you await your final results and registration; allowing you to kick start your career as soon as you are ready.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Based at the Royal Devon and Exeter Hospital in central Exeter, our medical imaging team provide a broad range of imaging modality services including, X-Ray, nuclear medicine, interventional radiology, CT, MRI, and ultrasound. We also have a dedicated team of radiographers delivering imaging across 7 community locations, some of whom also rotate through the acute site. Our fully DR/PACS equipped department provides imaging services to the RD&amp;E and GPs across East Devon, we have recently invested in a fleet of 7 state of the art DR mobile X-ray machines, and have installed a 3T MRI as part of a joint venture with The University of Exeter&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Our core commitment to supporting professional development is demonstrated in our growing number of Reporting Radiographers who support Axial, Appendicular, CT Colon, Chest, and DXA reporting. We are also delighted to be delivering a rolling programme of sonographer training, now in its third year.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are proudly in our fifth year as an accredited centre under the UKAS Quality Standards for Imaging (QSI) Accreditation Scheme, and have a demonstrated commitment to continued quality improvement for patients and staff. The department opens from 8am until 8pm 7 days a week, with 24hour services for A&amp;E and ward services. We operate on a shift pattern, and successful applicants will fully participate in this. Successful candidates will be flexible, adaptable and patient focussed, aiming to deliver the highest standards of clinical care.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;As part of our team you will undertake a wide range of imaging work including A&amp;E, General Radiography, Orthopaedic out-patients, Theatre and Portables, with opportunities to rotate through Fluoroscopy, Bone Density (DXA) Scanning, Cross-sectional imaging and our Community sites. Offering a Trust-wide preceptorship period for any newly qualified staff, our department provides an ideal opportunity to develop your skills within a friendly, supportive environment.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Exeter is a vibrant, welcoming and growing Cathedral city. It has a highly rated University; good Ofsted rated schools and an abundance of family amenities. Situated in the middle of the South West Region, and with easy access to Dartmoor/Exmoor, the surrounding countryside and the coast of Devon and Cornwall boasts spectacular scenery, promoting a lively, active outdoor lifestyle. The city is well served by rail, road and air links, with good access to other towns and places of interest, and an excellent local education service.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;If you would like to discuss the opportunities available, how you can begin or continue your career with us, or to arrange an informal visit please contact; Mrs Suzanne McLaughlan (General Superintendent Radiographer) &lt;/span&gt;&lt;span&gt;Suzanne.mclaughlan@nhs.net&lt;/span&gt;&lt;span&gt; , Mr Simon Andrew (Senior Reporting Radiographer) &lt;/span&gt;&lt;span&gt;simonandrew@nhs.net&lt;/span&gt;&lt;span&gt; or Mrs Sallyanne Mitchell (Senior Reporting Radiographer) &lt;/span&gt;&lt;span&gt;sally.mitchell5@nhs.net&lt;/span&gt;&lt;span&gt; on (01392) 406268.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Our vision is to provide safe, high quality seamless services delivered with courtesy and respect. To achieve our vision we expect all our staff to uphold our Trust values. Our Trust values are: &lt;br /&gt; Honesty, Openness &amp; Integrity&lt;br /&gt; Fairness&lt;br /&gt; Inclusion &amp; Collaboration&lt;br /&gt; Respect &amp; Dignity&lt;/p&gt;\n&lt;p&gt;***Preference will be given to staff with ‘Priority’ and &#39;At Risk&#39; status including NHS At Risk staff throughout Devon.***&lt;/p&gt;\n&lt;p&gt;DUE TO THE ANTICIPATED HIGH NUMBER OF APPLICATIONS FOR THIS POST WE RESERVE THE RIGHT TO CLOSE THE VACANCY BEFORE THE CLOSING DATE.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121044.jpg", "name": "Royal Devon and Exeter NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121044"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Exeter", "postalCode": "EX2 5DW"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7167", "longitude": "-3.50669"}}, "title": "Diagnostic Radiographer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253568", "validThrough": "2020-11-20T23:59:59+0000"}