{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "per  annum"}}, "datePosted": "2020-10-13T08:16:15+0100", "description": "&lt;p&gt;&lt;strong&gt;Lead the way to support excellence in treatment, research and care at MFT.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Whatever you’re looking for in your next career move, you’ll find it all here for you in this exciting and rewarding role as our next Director of Charities at Manchester University NHS Foundation Trust.&lt;/p&gt;\n&lt;p&gt;At this exciting and challenging time in the NHS and in our health and care economy, we are seeking a visible and engaging leader to be our next Director of Charities; a rare and unique opportunity to make a real difference to the life chances of the people of Manchester, Trafford and beyond.&lt;/p&gt;\n&lt;p&gt;MFT brings together 10 hospitals over 7 sites and community services from across Manchester, Trafford &amp; beyond, where we are pooling our skills, knowledge and experience to serve our patients and users within our thriving city, surrounding communities and beyond. It also means more opportunities for you to further advance your skills, progress your career, and take your knowledge to another level.&lt;/p&gt;\n&lt;p&gt;Our charities team thrive on the unbelievable support and generosity of our donors both locally, regionally and nationally, and this has been even more evident most recently with the overwhelming aid gifted to us during the Covid-19 pandemic. This is undoubtedly testament to our reputation as an Employer of Choice notwithstanding as a Trust based on the world class care and treatment our teams provide to our patients and families here at MFT.&lt;/p&gt;\n&lt;p&gt;What makes us even greater is the passion and dedication of our Charity Team who pride themselves on creating innovative ways to inspire and encourage our donors to play their part in supporting our hospitals and services develop and transform for our patients, their families and our staff. This Director of Charites will be integral to this agenda, driving, developing and supporting the team to reach their full potential.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is a high-profile role giving you access to working with the Group Chairman and the Board, as well as a range of strategic partners, to shape the Charity’s future strategy, enabling the Trust to fulfil its Charity objectives and deliver long term and sustained growth.&lt;/p&gt;\n&lt;p&gt;An expert in all things charity related, you will lead on all Charity legislation policy ensuring we are compliant with national regulation &amp; directing the Board of Trustees of all its obligations. What’s more, you will collaborate in partnership with the Hospital / MCS/ LCO Chief Executives and senior leadership teams to deliver ambitious strategic charitable projects to enhance the treatment, research and care for patients.&lt;/p&gt;\n&lt;p&gt;It goes without saying the job will require true dedication and passion to drive funding &amp; income generation in order to help our patients and their families, inspiring a culture of strong innovation and exemplary collaboration across the Charity.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About You&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will be an emotionally intelligent, compassionate &amp; inclusive leader with a demonstrable track record of delivering income growth across multiple channels. A strategic leader and naturally impressive negotiator, you will have the ability to inspire and influence, readily gaining buy in from individuals at all levels both inside and outside MFT. With a breadth of knowledge regarding fundraising sectors including corporate, major gifts, community, events, trusts, legacy and regular giving, you will relish the opportunity at this critical yet exciting time as we continuously look at innovative ways to grow and develop. Ideally, you will have experience working at a senior level leading and managing a team. What’s more, you will be creative in thinking with impressive analytical skills and the ability to consider the wider picture including wider scenario planning. Knowledge of delivering Direct Debit campaigns and a thorough understanding of fundraising will be imperative to your success in this role.&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity for someone with the desire and passion to work in the largest, most complex and vibrant NHS Trust in England leading the way to drive our Charity forward in creative and innovative ways. At Manchester University NHS Foundation Trust our vision and aims is to ensure that our patients and their families receive the best possible care and this really is an exceptional opportunity for you to lead and be part of a team that ‘shines’ and makes a difference.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing date: Friday 6th November&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For an informal and confidential discussion or for a copy of the Candidate Recruitment Information Pack, please speak with:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hannah Wade&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Associate Partner, Healthcare&lt;/p&gt;\n&lt;p&gt;Hannah.wade@odgersberndtson.com&lt;/p&gt;\n&lt;p&gt;+ 44 (0)113 386 8542&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Manchester University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121137"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Manchester", "postalCode": "M13 9WL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4625", "longitude": "-2.22771"}}, "title": "Director of Charities", "url": "https://www.jobs.nhs.uk/xi/vacancy/916223453", "validThrough": "2020-11-06T23:59:59+0000"}