{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum"}}, "datePosted": "2020-11-04T12:02:01+0000", "description": "&lt;p&gt;&lt;strong&gt;BARTS HEALTH NHS TRUST&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Group Clinical Services&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Imaging&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;CONSULTANT in PET CT/oncoradiology and Nuclear Medicine&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;10 PA’S &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;ADVERT:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The advertised post is for a full time Nuclear Medicine, PET-CT trained radiologist/ consultant physician with an interest in PET-CT and Oncology Imaging at Barts Health NHS Trust. This is a replacement post following a vacancy and after the success of winning of the NHS England PET-CT contract. This followed public engagement for sustained integrated and reliable care pathways to develop a high quality PET-CT service to meet future needs across North Central and East London (Barts Health NHS Trust, Royal Free Hospital and University College London Hospital NHS Trust).&lt;/p&gt;\n&lt;p&gt;We are looking for a highly motivated and enthusiastic individual to join our dynamic team of four Nuclear Medicine Physicians and five dual qualified Radiologist/Nuclear Medicine Physicians. The post holder will practice in PET-CT, general nuclear medicine and oncology Imaging depending on their training specialties and interests. The post will be based at Barts Health NHS Trust.&lt;/p&gt;\n&lt;p&gt;Barts Health NHS Trust has a Regional Oncology Centre, a Hyper Acute Stroke Unit a Level 1 Trauma Centre and the Barts Heart Centre. This post is advertised to attract an individual with the capability to sustain and develop the PET services and nuclear medicine across Barts Health. They will need to work with clinicians across North East London and beyond to safeguard and develop appropriate referral flows.&lt;/p&gt;\n&lt;p&gt;You will join our dedicated team of general and oncological radiologists who currently support general imaging services as well as supporting the specialist MDT’s.&lt;/p&gt;\n&lt;p&gt;The successful candidate should be able to demonstrate excellent experience in PET CT reporting which is essential as well as general nuclear medicine or oncology Imaging. General and trauma radiology can be accommodated.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120603.jpg", "name": "Barts Health NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120603"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Clinical Support Services, London", "postalCode": "EC1A 7BE"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.517", "longitude": "-.100858"}}, "title": "Consultant in PET CT/oncoradiology and Nuclear Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255741", "validThrough": "2020-12-02T23:59:59+0000"}