{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum/ pro-rata"}}, "datePosted": "2020-11-02T14:16:25+0000", "description": "&lt;p&gt;Frailty Intervention Team (FIT) is an established and dynamic service, to support older adults living with frailty, presenting to the Emergency Department and/or Emergency Assessment Unit (EAU) at the John Radcliffe Hospital, Oxford.&lt;/p&gt;\n&lt;p&gt;FIT is a multi-disciplinary team, predominantly led by Occupational Therapists and Physiotherapists, providing early identification of frailty and rapid early therapy intervention. FIT therapists’ provide a pivotal role in supporting patient flow, therefore, are valued as a highly respected member of the multi-disciplinary team.&lt;/p&gt;\n&lt;p&gt;Deployment of sub acute pathways and services, at the earliest opportunity, is essential in avoiding admission, reducing length of stay and ultimately, applying the principles of the national Home First working model, is a core component to the service and vision.&lt;/p&gt;\n&lt;p&gt;FIT strives to perform comprehensive specialist assessment of an older person in-line with the Comprehensive Geriatric Assessment (CGA), across the Urgent Care pathway, with the aim to strike a balance between a discharge enabling therapist and a holistic therapist. The potential candidate will have the specialist knowledge to identify components of frailty syndromes that could be optimised and reversed, to prevent frailty induced deconditioning and dysfunction.&lt;/p&gt;\n&lt;p&gt;We are seeking a Senior Specialist Band 7 Occupational Therapist that can draw upon broad and specialist clinical experience in urgent and emergency care, with a specific focus on the cohort of older adults living with frailty.&lt;/p&gt;\n&lt;p&gt;The candidate will possess excellent clinical reasoning skills, with ability to demonstrate and embrace positive risk in order to enable the Home First model of care. Advanced inter-personal skills and confident management and dynamic leadership are a pre-requisite of this post.&lt;/p&gt;\n&lt;p&gt;It is essential that the successful candidate brings a passion for continued improvement in the quality of service and care given to older adults living with frailty. It is widely recognized that the current climate that faces urgent and emergency care can be challenging at times, therefore, the ability to manage a team under pressure is essential.&lt;/p&gt;\n&lt;p&gt;There will be extensive opportunities to engage in service improvement, both within the immediate FIT team and from a wider system wide perspective, namely, support in the design and implementation of a Discharge to Assess model of working, providing an acute and community interfacing pathway.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing Date: 20th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Proposed Interview Date: 3rd December 2020 (conducted via MS Teams)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameThomas JudgeJob titleAcute General Medicine Therapy ManagerEmail addressThomas.Judge@ouh.nhs.ukTelephone number07824545197&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Oxford University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120889"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "John Radcliffe Hospital, Oxfordshire", "postalCode": "OX3 9DU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7639", "longitude": "-1.21979"}}, "title": "Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252385", "validThrough": "2020-11-20T23:59:59+0000"}