{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "87754", "minValue": "75914", "unitText": "YEAR", "value": "£75,914 - £87,754 per annum"}}, "datePosted": "2020-10-15T11:30:59+0100", "description": "&lt;p&gt;Are you highly motivated, effective and innovative leader looking to make a real difference to patient and staff experience? Are you able to inspire and motivate teams?&lt;/p&gt;\n&lt;p&gt;We are seeking an inspirational and highly experienced senior midwife whose role as Director of Midwifery/Head of gynaecological and children’s nursing is key to maintaining strong professional oversight and governance. Your strategic thinking will be pivotal to the quality and safety of our service, supporting good clinical outcomes and outstanding patient and staff experience.&lt;/p&gt;\n&lt;p&gt;You will have considerable operational experience, will be able to motivate, lead and inspire the nursing and midwifery workforce, and be an excellent team member within the multi-professional clinical and the management teams.&lt;/p&gt;\n&lt;p&gt;You will assist in the development of the divisional strategies, ensuring that the professional nursing and midwifery agendas are incorporated and delivered, achieving consistency of practice, high standards of care and innovation with a strong woman and family-centred safety focus.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;You&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;You will be a key member of the senior leadership team within the Division of Women and Children’s Health, working closely with the Clinical Director and the Divisional Operations Director to provide leadership to a dedicated team of matrons, midwives, nurses and support staff, working collaboratively with the consultant teams to implement changes in practice in line with National guidance.&lt;/li&gt;\n&lt;li&gt;You will take on a lead responsibility for both the strategic planning and operational management of the service,&lt;/li&gt;\n&lt;li&gt;You will have excellent communication skills along with visible, dynamic and inspirational leadership enabling the midwifery and nursing workforce to deliver safe and high quality standards of care.&lt;/li&gt;\n&lt;li&gt;You will be a true advocate of the development of service and are required to both drive and promote continuous improvement&lt;/li&gt;\n&lt;li&gt;You will lead and support the team within the Bristol, North Somerset and South Gloucestershire (BNSSG) Local Maternity System in line with the Better Births recommendations which includes the planning and delivery of models of midwifery care, creating new ways of working with innovation to improve outcomes, support service development and quality improvement. This high-profile senior post will appeal to someone who is keen to play an influential role in shaping the future delivery of maternity health care services and further enhance the Trust’s National reputation for innovation and leadership in the areas of maternity, neonatology and gynaecology.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;About us: &lt;/strong&gt;&lt;strong&gt;Women and Children’s Health &lt;/strong&gt;The Maternity services are renowned Nationally and Internationally, having developed PROMPT and with a wide research portfolio. We are one of the first Trusts to achieve and maintain CNST level 3 and be successful in achieving full compliance with the recent NHS Resolution 10 Maternity Safety Actions. The unit works closely with interventional radiology in the management of abnormally invasive placentae (AIP) providing a 24 hour service which accepts tertiary referrals for these women. The Community Midwifery Service covers South Gloucestershire, North Bristol and North Somerset. The Gynaecology service is dynamic with a clear vision to develop and take the service into the future with increased ambulatory care, supported by our Nurse Consultant for Gynaecology. The tertiary level 3 Neonatal Unit, which is renowned for its excellent clinical outcomes, particularly for the very preterm baby, has 34 cots and offers Intensive Care, High Dependency Care and Special Care, with Transitional Care facilities on the postnatal ward.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;NBT is located in North of Bristol City centre, close to the M4/M5 junction at Almondsbury and Bristol Parkway railway station, we have excellent communication and transport links to all points North, South, East and West – the countryside and the seaside are within an easy commute.&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Our Area - &lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;The service at North Bristol Trust is based at Southmead Hospital and provides a full range of obstetric and gynaecological services for women who live in the catchment of BNSSG as well as a Regional Tertiary neonatal service for the South West of England. The maternity department is one of the largest in the country, was awarded ‘Good’ by the CQC and has more than 5500 births each year offering women the choice of 4 places of birth. These include a 15 bed Consultant led Obstetric Unit, an Alongside Midwifery Unit with 800 births per year, a Freestanding Midwifery Unit at Cossham Hospital with up to 500 births per year (which was awarded ‘Outstanding’ by the CQC) and Home Birth. It has extensive maternal medicine services with specialist endocrine, epilepsy, haematology and renal clinics and a Fetal Medicine Service.&lt;/li&gt;\n&lt;li&gt;North Bristol NHS Trust is the largest Trust in the South-West region and provides medical, surgical and maternity care for a population of appr&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;PROPOSED INTERVIEW DATE: 3RD DECEMBER, 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Mrs Helen Blanchard – Director of Nursing, North Bristol NHS Trust &lt;/span&gt;&lt;span&gt;Helen.Blanchard@nbt.nhs.uk&lt;span&gt;&lt;span&gt;&gt;&lt;/span&gt;&lt;span&gt;  &lt;/span&gt;&lt;span&gt;or 0117 414 3780 Dr Paul Mannix –&lt;/span&gt;&lt;span&gt;  &lt;/span&gt;&lt;span&gt;Clinical Director, Women’s and Children’s Services, North Bristol NHS Trust &lt;/span&gt;&lt;/span&gt;&lt;span&gt;Paul.mannix@nbt.nhs.uk&lt;span&gt;&gt; or 0117 414 6738 Mrs Karen Maxfield – Divisional Operational Director WACH North Bristol NHS Trust &lt;/span&gt;&lt;span&gt;Karen.maxfied@nbt.nhs.uk&lt;span&gt;&gt; or 0117 414 6740&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120777.jpg", "name": "North Bristol NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120777"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Southmead Hospital, Bristol", "postalCode": "BS10 5NB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4973", "longitude": "-2.59295"}}, "title": "Director of Midwifery and Head of Nursing - Band 8D", "url": "https://www.jobs.nhs.uk/xi/vacancy/916227974", "validThrough": "2020-11-15T23:59:59+0000"}