{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £37,890 pa pr"}}, "datePosted": "2020-11-02T11:46:18+0000", "description": "&lt;p&gt;&lt;strong&gt;Department of Medical Microbiology&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Biomedical Scientist &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Applications are invited from HCPC registered BMS, to join the friendly and forward thinking team of Poole Microbiology. Please refer to the respective person specification for the essential requirements.&lt;/p&gt;\n&lt;p&gt;The laboratory is well equipped and fully computerised offering a wide range of manual, automated and semi-automated tests for Bacteriology, Virology / Microbial Serology and Molecular diagnostics, processing approximately 325,000 requests a year.&lt;/p&gt;\n&lt;p&gt;Being progressive, Poole became the first laboratory in Europe to install the Bactec FX blood culture system and additionally the list of equipment includes, MALDI-TOF, Phoenix ID &amp; AAST, Bactec MGIT, iQ200 IRIS urinalyser, DS2 EIA analyser, Liaison XL, Architect, Max, GeneXpert, Smartcycler and the Viper XTR.&lt;/p&gt;\n&lt;p&gt;You will acquire a good range of experience by rotation through all such sections.&lt;/p&gt;\n&lt;p&gt;The department has UKAS accreditation (ISO 15189:2012) and is HCPC / IBMS approved for training purposes.&lt;/p&gt;\n&lt;p&gt;Further education and personal development is encouraged and supported.&lt;/p&gt;\n&lt;p&gt;The department operates shift working and an on call service. When suitably trained, participation in the microbiology on call service will be required.&lt;/p&gt;\n&lt;p&gt;The hospital is situated close to the centre of the historic town of Poole which occupies a unique position on the South Coast with easy access to the New Forest and the Dorset countryside. Poole has some of the best and safest beaches in the UK and the famous harbour is a haven for wildlife and a centre for sailing and all water sports.&lt;/p&gt;\n&lt;p&gt;Multiple staff benefits include, a staff development centre, staff support services and preferential rates with many local shops and services.&lt;/p&gt;\n&lt;p&gt;If this job requires you to have a DBS check to enable you to properly fulfil the requirements of the job, on appointment you will be required to repay the cost of obtaining a DBS check and this amount will be reclaimed from your salary.&lt;/p&gt;\n&lt;p&gt;Closing date: 16/11/2020&lt;/p&gt;\n&lt;p&gt;Proposed Interview date: week commencing 30/11/2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Andy Barber, Laboratory Manager&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;andy.barber@uhd.nhs.uk&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;0300 019 8585&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120850.PNG", "name": "Royal Bournemouth and Christchurch Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120850"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Poole, Dorset", "postalCode": "BH15 2JB"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.722", "longitude": "-1.97311"}}, "title": "Biomedical Scientist Microbiology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251890", "validThrough": "2020-11-16T23:59:59+0000"}