{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum, pro rata"}}, "datePosted": "2020-11-02T12:31:31+0000", "description": "&lt;p&gt;Calderdale &amp; Huddersfield NHS Foundation Trust is a leader in the digital health revolution. With the launch of a full Electronic Patient Record in 2017 the Trust aims to be the safest, most efficient and patient centred Trust in the NHS. The launch is part of a 10-15 year ongoing project of modernisation with future opportunities for research, development in this rapidly developing field of medicine. Through working at CHFT you can be part of this innovative area aiming to bring safer and more effective care to our patients.&lt;/p&gt;\n&lt;p&gt;Calderdale &amp; Huddersfield NHS Foundation Trust is a dynamic and successful organisation with a strong organisational and personal development focus. With over 5,500 employees and a turnover of £310 million, the Trust provides a comprehensive range of secondary care services to the people of Calderdale and Huddersfield and has an exceptional reputation for service delivery.&lt;/p&gt;\n&lt;p&gt;Here at CHFT we are holders of the Employers ERS Silver Award from the Defence Employer Recognition Scheme, which is helping actively promote SaBRE - Supporting Britain’s Reservists and Employers. This means that Calderdale and Hudderfield NHS Foundation Trust has provided its statement of intent to support all Defence personnel and welcome their application to work for us.&lt;/p&gt;\n&lt;p&gt;Within CHFT the theatre complex consists of 3 sites Calderdale Royal Hospital, Huddersfield Royal Infirmary and Day Surgery Unit at Huddersfield Royal Infirmary (currently converted to elective surgery due to covid 19). This provides the opportunity to work across various specialties incorporating anaesthetics, scrub, circulating and Pacu.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Calderdale Royal Theatres &lt;/strong&gt; 9 operating theatres providing acute and elective surgery to adults and children in the specialties of ENT, Ophthalmics, Obstetrics, Breast Surgery, Gynaecology minor and major Orthopaedic and Opthalmics. 24hour emergency obstetric cover, resus cover, acutes in Gynaecology and ENT.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Huddersfield Royal Infirmary&lt;/strong&gt; 6 operating theatres providing acute and elective surgery specialties, including Colorectal, bariatric, upper GI, urology, trauma and acute general surgery. 24hour cover for resus and emergency surgery. 7 day a week trauma surgery.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Day Surgery Unit &lt;/strong&gt;3 operating theatres providing elective surgery across all specialities. At present due to Covid 19 this area has been transformed into elective surgery unit providing elective surgery for urology, upper GI, Gynaecology and Breast surgery 5 days a week.&lt;/p&gt;\n&lt;p&gt;We are looking for highly motivated and enthusiastic nurses/operating department practitioners to join our friendly and pro-active operating theatre team. This role would be suitable for qualified nurses with an interest in theatres or qualified operating department practitioners. Experience is not essential as a competency based theatre training program is available as part of our robust Trust preceptorship program whereby we provide a 12 month graduate program which is specifically designed to aid our newly qualified nurses and ODPs with 6 paid study days per annum and then a continued development program. Our Trust works in close partnership with Huddersfield University providing post graduate learning and development opportunities. With&lt;em&gt; a practice development team committed to personal and professional development and opportunities to rotate through the specialties there is endless potential to develop and grow as a professional.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;We are a hardworking department with a strong sense of teamwork and work family with one culture of care of the forefront we treat colleagues as we treat our patients. As an individual you must be able to show that you are able to work as part of a team as well as function autonomously. You will also need to possess excellent communication skills and show the ability to exercise good clinical judgement. There is an expectation that individuals will work flexibly across the 3 sites if and when required although a base site will be allocated and your preference taken into account.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Saran Ahmed Clinical Operations Manager HRI theatres, 01484 342780 or 0775550209&lt;/p&gt;\n&lt;p&gt;Victoria Smith Clinical Operations Manager Day Surgery Unit (currently Elective surgery unit), 01484 342120 or 07795 450926&lt;/p&gt;\n&lt;p&gt;Belinda Whiteley Clinical Operations manager CRH theatres, 01422 222348 or 07387539842&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Calderdale and Huddersfield NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121129"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Huddersfield/Halifax", "postalCode": "HX3 0PW"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7053", "longitude": "-1.85728"}}, "title": "Theatre Practitioner ODP/RGN", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252063", "validThrough": "2020-11-29T23:59:59+0000"}