{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-11-02T10:32:12+0000", "description": "&lt;p&gt;A new and exciting position has arisen for a band 7 Inflammatory Bowel Disease (IBD) Clinical Nurse Specialist at Bronglais General Hospital, Aberystwyth. This is an opportunity for an experienced nurse to join the team and help shape and develop our Inflammatory Bowel Disease specialist service.&lt;/p&gt;\n&lt;p&gt;If you are looking for a promotional or development opportunity in this service this is an ideal role for you.&lt;/p&gt;\n&lt;p&gt;The successful applicant will be expected to provide comprehensive clinical skills, information, advice and support to patients with IBD, provide clinical advice and support to all members of the multidisciplinary team and undertake clinical audits in their own specialist area. They must possess excellent communication and organisational skills, be able to work autonomously and can evidence experience of working with Inflammatory Bowel Disease or other gastroenterological conditions.&lt;/p&gt;\n&lt;p&gt;Bronglais District General Hospital is situated in Aberystwyth, Ceredigion in the northern part of Mid Wales. It is one of four acute care providers within Hywel Dda University Health Board, but is 60 miles away from the next nearest acute hospital, both to the north and south. Bronglais Hospital serves a population that is proportionally transient all year round – we are close to Aberystwyth University and the younger population rely on Bronglais Hospital during term time, but in the summer months the older/frail population can significantly increase due to holiday makers in the area – in particular those who take up temporary residence in local caravan parks. Thus the profile for Bronglais Hospital changes, but we do not really have a quiet time.&lt;/p&gt;\n&lt;p&gt;The services at Bronglais Hospital enable staff to provide 24/7 emergency care backed up with appropriate medical specialities and surgical (general and trauma) support on site. Bronglais Hospital also has strong links with regional centres for expert support and advice and hosts visiting services from within Hywel Dda Health Board and wider afield.&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; English and/or Welsh speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDawn JonesJob titleHospital Head of NursingEmail addressdawn.r.jones@wales.nhs.ukTelephone number01970623131&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123194.gif", "name": "Hywel Dda University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123194"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bronglais General Hospital, Aberystwyth", "postalCode": "SY23 1ER"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4161", "longitude": "-4.07159"}}, "title": "Advanced Clinical Nurse Specialist in Inflammatory Bowel Disease", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251598", "validThrough": "2020-11-16T23:59:59+0000"}