{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "17465", "minValue": "15364", "unitText": "YEAR", "value": "£9.14 to £10.39 per hour"}}, "datePosted": "2020-09-29T10:30:58+0100", "description": "&lt;p&gt;If you are passionate about providing expert and compassionate care, join the team at Sue Ryder&#39;s Stagenhoe Neurologcal Care Centre and we&#39;ll ensure your job as Care Assistant makes you feel incredible too! With flexible working hours and an excellent personalised training programme this is a wonderful opportunity to develop your skills as a Care Assistant in the specialist field of neurological care.&lt;br /&gt;&lt;br /&gt;Stagenhoe is a Sue Ryder specialist neurological care centre based in Hertfordshire, caring for people aged 18 and over a range of neurological conditions. At Stagenhoe, we provide the care people need to optimise their health and wellbeing, maximise their independence and support their emotional and social needs.&lt;br /&gt;&lt;br /&gt;Responsibilities:&lt;br /&gt;&lt;br /&gt;• To promote choice in the delivery of care and support. Reviewing and making suggestions to enhance the individuals’ experience.&lt;br /&gt;• To ensure accurate reporting and documentation.&lt;br /&gt;• To participate in care planning implementation and review.&lt;br /&gt;• To promote the values, build morale and encourage others to perform to high standards&lt;br /&gt;&lt;br /&gt;The correct candidate will demonstrate a compassionate and caring nature alongside flexibility with excellent people skills and be a team player. Successful applicants must have recent experience in the delivery of care in a similar environment and have or be willing to gain an NVQ 2 in health and social care.&lt;br /&gt;&lt;br /&gt;Sue Ryder offer a large range of benefits and pay enhancements including:&lt;br /&gt;&lt;br /&gt;Enhancements:&lt;br /&gt;8.00 pm to 6.00 am (nights) 30%&lt;br /&gt;Friday midnight to Sunday midnight (weekends) 45%&lt;br /&gt;Public Holidays 24 hours midnight to midnight 60%&lt;br /&gt;&lt;br /&gt;Benefits:&lt;br /&gt;• 25 days holiday rising to 30 with service plus bank holidays&lt;br /&gt;• Private pension matched at 5%&lt;br /&gt;• Enhanced Maternity Benefits&lt;br /&gt;• Cash referral bonus scheme for certain roles&lt;br /&gt;• Carers leave policy&lt;br /&gt;• 24 hour employee assistance line for free advice on work, family and personal life&lt;br /&gt;• PeoplePerks - discounts with hundreds of retailers and services that can amount to an average annual saving of GBP 350&lt;br /&gt;• Staff discount of 15% on new goods at the online shop&lt;br /&gt;• Free onsite parking and good transport links&lt;br /&gt;• Susidised meals&lt;br /&gt;• Staff loans and company car loans&lt;br /&gt;• Free uniform&lt;br /&gt;• Wellbeing centre and free will writing service&lt;br /&gt;• Opportunities to progress through our development framework structure&lt;br /&gt;&lt;br /&gt;Stagenhoe Park is located 8 miles outside Hitchin in the village of St Paul&#39;s Walden. Due to its location access to your own transport is required.&lt;br /&gt;&lt;br /&gt;To learn more about joining this amazing team and becoming a Sue Ryder Care Assistant, please apply now or get in touch.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Sue Ryder", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=129979"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hitchin", "postalCode": "SG4 8BY"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.8904", "longitude": "-.27928"}}, "title": "Care Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916204018", "validThrough": "2020-11-22T23:59:59+0000"}