{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 per annum"}}, "datePosted": "2020-10-27T14:26:39+0000", "description": "&lt;p&gt;&lt;strong&gt;Job Title – Occupational Therapist – Band 5&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Base – Southgate Moorings&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary – £24,907 to £30,615 per annum&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours per week – 37.5 &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Be part of our team…&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Gloucestershire Health and Care NHS Trust provides a range of services to Gloucestershire’s population of approximately 600,000 people. Our vision is to be the service people rely on, to understand them, and to organize their care around their lives. We value colleagues and support them to develop the skills, confidence and ambition to deliver our vision.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;In everything we do, we strive to be caring, open, responsible and effective. We expect all staff to share and demonstrate these values as we work to constantly improve the quality of care we provide.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;An exciting opportunity has arisen for an individual to join our Integrated Community Teams (ICT) working within the Gloucester Integrated Community Team based in Gloucester. The ICTs consist of Community Nursing, Physiotherapy, Occupational Therapy and Reablement staff who work closely with our co-located Adult Social Care colleagues.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We work in partnership with GPs, community hospitals, mental health services and voluntary organisations to enable people to live as independently as possible at home. The ethos of the teams is a reablement, person-led approach to recovery and self-management, to ensure that we offer care close to home, thus avoiding unnecessary admissions to bed based services.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are an active player in the development of the vision of “One Gloucestershire”, entering an exciting time as we work with our partners to develop local place based models of care. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The post holder will have an opportunity to work across all areas of the ICT including, triage and urgent response of patients within our referral centre, community reablement, and long term condition management. Key duties and responsibilities will include the ability to use core rehabilitation skills, in line with professional standards, to create, review and amend patient centred goal plans, thus enabling independence. Along with a health coaching approach – this will enable people to self-care more effectively, achieving their goals and avoid unplanned hospital admissions.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;As a Band 5 occupational Therapist you will be well supported by a Band 6 Occupational Therapists, and will receive regular supervision, appraisal and CPD opportunities.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The successful candidate will be motivated, possess good organisational and personal management skills; excellent communication and interpersonal skills; demonstrate an ability to be flexible, adaptable and be a positive thinker. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please ensure when applying for this position that, in your supporting statement, you make it clear as to how you meet the person specification especially the values and behaviours expected of all colleagues (for example evidence of how you meet our Trust Core Values). This will figure largely in our short-listing criteria and the overall selection process.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If you would like to work for an Organisation that values its staff, aims to deliver the best care, offering compassion to all patients, their carers and families, and you can demonstrate this to us, we would like to hear from you!&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For information or enquires please contact Arul Kandan (Integrated Community Team Manager) on 07879848867 or arul.kandan@ghc.nhs.uk&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The qualification, training &amp; experience requirements for the role are underlined in the Job Description/Person Specification.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing date: 10th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Shortlisting date: 11th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Trust aims to recruit and retain the best possible staff who, through the application of their skills, qualification and experience, will make a positive contribution to our business of providing quality health care services. It is the Trust’s view that the costs associated with moving house in order to take up a post with us should not restrict our ability to recruit the excellent people we need, therefore we support staff to relocate with our relocation policy.&lt;/p&gt;\n&lt;p&gt;A valid UK driving licence plus the use of own transport for business purposes is essential. For qualifying staff the Trust has a Lease Car Scheme in place and also offers a popular Salary Sacrifice Car Scheme with our partner Tusker.&lt;/p&gt;\n&lt;p&gt;To ensure you fully understand how the Trust, as a Data Controller, will process and store your data please read the attached document ‘ Applicant and Staff Privacy Notice’ prior to applying for the role.&lt;/p&gt;\n&lt;p&gt;Candidates for any staff appointment shall, when making application, disclose in writing to the Trust whether they are related to any governor. Failure to disclose such a relationship may disqualify a candidate and, if appointed, may render him/her liable to dismissal.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120776.png", "name": "Gloucestershire Health and Care NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120776"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Gloucester", "postalCode": "GL1 2DB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.8634", "longitude": "-2.24939"}}, "title": "Occupational Therapist - Band 5", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244943", "validThrough": "2020-11-10T23:59:59+0000"}