{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 pa"}}, "datePosted": "2020-11-03T17:45:14+0000", "description": "&lt;p&gt;37.5 hours per week – 12-months’ fixed term contract.&lt;/p&gt;\n&lt;p&gt;Are you enthusiastic, motivated and have a keen interest in working with people accessing secondary care mental health services to empower them to make positive changes in their lives?&lt;/p&gt;\n&lt;p&gt;We are looking for a full time Employment Specialist to join our new IPS Team which provides an evidence based employment service considered as the most effective approach to supporting people with mental health difficulties to find and retain sustainable, paid employment.&lt;/p&gt;\n&lt;p&gt;The role requires you to work with clients (managing a caseload) who may have severe and enduring mental health conditions which impact on their ability to gain work. You will support, guide, coach and facilitate their needs, in a person-centered way, to help them achieve their employment goals, whilst working in partnership with clinical teams, so that employment becomes an integral part of people’s treatment and recovery.&lt;/p&gt;\n&lt;p&gt;Excellent communication and interpersonal skills together with understanding of the labour market are essential, as you will also need to develop positive relationships with local employers by providing information, support and advice, to maximise the success of the job match, and to provide in-job support to your clients.&lt;/p&gt;\n&lt;p&gt;Experience of working within services/caring for people experiencing mental ill-health in a professional, voluntary or another capacity is required. You will have attained education to a degree level or have equivalent work experience and be confident using digital technology, as there is a requirement for both client reporting and recording targets relating to IPS fidelity scores.&lt;/p&gt;\n&lt;p&gt;Professional and practice supervision from the IPS Team Leader will help you develop into this role as well as Training and extensive networking opportunities through IPS Grow (SW).&lt;/p&gt;\n&lt;p&gt;If you are inspired to join this skilled and dedicated team, we would love to hear from you.&lt;/p&gt;\n&lt;p&gt;Livewell Southwest values its staff and makes investment in their development a priority. Currently we offer the following development opportunities for staff:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A minimum of three days protected CPD for registered staff&lt;/li&gt;\n&lt;li&gt;Development pathways for unregistered staff from apprentice to bands 2, 3 and 4 and for registered staff in bands 5, 6, 7 and 8&lt;/li&gt;\n&lt;li&gt;Leadership programmes&lt;/li&gt;\n&lt;li&gt;Coaching and mentoring&lt;/li&gt;\n&lt;li&gt;Medicines Management, leg Ulcer Management and Assessment Training&lt;/li&gt;\n&lt;li&gt;Access and funding for training including Care Certificate, Assistant Practitioners Course and Scholarship Into Nurse Training&lt;/li&gt;\n&lt;li&gt;Robust Preceptorship&lt;/li&gt;\n&lt;li&gt;An induction programme tailored to your needs&lt;/li&gt;\n&lt;li&gt;Relocation package may be considered for the right candidate for certain roles&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Rewards and benefits &lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Discounts available from retailers, UK hotels and main attractions – often up to 15% savings&lt;/li&gt;\n&lt;li&gt;NHS Pension Scheme and competitive Pension Scheme with Scottish Widows and/or Government Pension scheme (conditions apply)&lt;/li&gt;\n&lt;li&gt;Lease car scheme (available after satisfactory completion of probation/conditions apply)&lt;/li&gt;\n&lt;li&gt;Cycle to work scheme (available after satisfactory completion of probation)&lt;/li&gt;\n&lt;li&gt;School holiday childcare subsidies&lt;/li&gt;\n&lt;li&gt;Multiple flexible working options&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Livewell Southwest can allow existing members of the NHS Pension Scheme to continue their membership when they join the organisation.&lt;/p&gt;\n&lt;p&gt;All Livewell Southwest staff are expected to able and willing to work across a 7 day service.&lt;/p&gt;\n&lt;p&gt;Job share(s) considered.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;WEF 01/10/2020&lt;/strong&gt; – for inpatient wardsat Tavistock and South Hams Hospitals as well as Kingfisher, Skylark, and Wembury. Please note that this post may be subject to Transfer of Undertakings (Protection of Employment) regulations (TUPE) transfer on 1 February 2021, from Livewell Southwest CIC to University Hospitals NHS Trust.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Informal enquiries to:&lt;/strong&gt; Flippa Watkeys (IPS Team Lead), on 07919 994918 or Ewa Ford (IPS Service Manager), on 07769 974808.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/127014.jpg", "name": "Livewell Southwest CIC", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127014"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Plymouth", "postalCode": "PL2 2PQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.3906", "longitude": "-4.16191"}}, "title": "Individual Placement and Support Employment Specialist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254962", "validThrough": "2020-11-18T23:59:59+0000"}