{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "107668", "minValue": "79860", "unitText": "YEAR", "value": "£79,860 - £107,668 per annum"}}, "datePosted": "2020-11-05T09:43:37+0000", "description": "&lt;p&gt;Are you a Rheumatologist looking to join a dynamic team and to take an active part in shaping future Rheumatology services in North Cumbria? Why not consider joining us in our modern hospitals on the edge of the beautiful Lake District National Park?&lt;/p&gt;\n&lt;p&gt;The post will be based at the Cumberland Infirmary, Carlisle but the post holder may be required to work at other sites within the Trust.&lt;/p&gt;\n&lt;p&gt;Applications are welcome from candidates wishing to work full or part time in Rheumatology. In the course of his/her work the job holder liaises with nursing, professional and technical, social work and administrative staff.&lt;/p&gt;\n&lt;p&gt;An educational supervisor will be assigned to provide support. Appraisal and Job Planning is carried out at regular intervals, and forwarded to the specialty lead. The programme of training for each individual doctor will be flexible depending on his/her particular needs and stage of training.&lt;/p&gt;\n&lt;p&gt;North Cumbria Integrated Care NHS Foundation Trust is committed to ensuring a safe and high quality of patient care underpinned by our Trust values. It is expected that all employees demonstrate their commitment to these in their daily activity. In addition to this you may be asked ‘Values-based interview questions at interview.&lt;/p&gt;\n&lt;p&gt;The post is subject to the Medical and Dental Staff Terms and Conditions of Service.&lt;/p&gt;\n&lt;p&gt;Please see the Job Description for more information about this post.&lt;/p&gt;\n&lt;p&gt;The post will be subject to a Disclosure and Barring Service (DBS) check.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Relocation assistance of up to £8,000 may be available for successful applicants moving to the region.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Closing date: 3rd December 2020&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120898.png", "name": "North Cumbria Integrated Care NHS Foundation Trust (NCIC)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120898"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Carlisle", "postalCode": "CA2 7HY"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.8958", "longitude": "-2.9553"}}, "title": "Consultant Rheumatologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257088", "validThrough": "2020-12-03T23:59:59+0000"}