{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892-£24,157 per annum"}}, "datePosted": "2020-10-28T17:03:33+0000", "description": "&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are a busy clinical microbiology laboratory based in a large NHS Trust. Well-equipped, with full CPA accreditation and we have training status with the Health Care Professions Council (HCPC). We have a workload in excess of 700,000 tests per annum and offer a comprehensive range of tests in bacteriology, serology and virology, including molecular. In addition the department is testing around 3600 samples per week for Molecular CoVID19 and 1000 serology specimens.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are looking for Associate Practitioners (Healthcare Science) to help us deliver accurate and timely microbiology services for patients and the staff caring for them. The post holder will rotate through the various sections of the laboratory including Bacteriology, Serology and Molecular. There will be an expectation for the successful candidate to work extended days and there may be a requirement for some overnight working in support of CoVID19 testing.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Responsibilities will include the the use of automated and semi-automated technologies, specimen processing, application of quality assurance procedures, computer data and result entry. In addition, the post holder will have a role in the training, development and supervision of other support staff.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Applicants must have a sound education including GCSE English Language and Mathematics (grades A-C) and a science subject plus two further GCSE at (grades A-C or equivalent). Furthermore, evidence of study at Level 3 in a Science subject (A-Level equivalent) is required and further training at Diploma level or equivalent is essential (e.g. Foundation Degree in Healthcare Sciences).&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will need previous clinical laboratory experience and be well organised and used to working accurately. The ability to follow documented procedures safely and be comfortable with using computers and general office software is essential.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Consideration will be given to staff who can fulfil part time hours, weekend only working or those who would like to work nights on a permanent basis.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;These post are available for either internal secondment, or on a fixed term basis until 31st March 2021.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Closing Date: 11th November 2020&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120645.png", "name": "Portsmouth Hospitals University NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120645"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Portsmouth", "postalCode": "PO6 3LY"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8502", "longitude": "-1.06936"}}, "title": "Associate Practitioner (Healthcare Science)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247461", "validThrough": "2020-11-11T23:59:59+0000"}