{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-10-30T14:17:03+0000", "description": "&lt;p&gt;&lt;span&gt;An exciting opportunity has arisen for a Radiotherapy Physics Technologist. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The post holder will provide support to treatment planning, organ at risk delineation, mould room and verification processes for the South West Wales Cancer Centre (SWWCC). Recently qualified BSc graduates, with some education in mathematics, physics, or information technology are encouraged to apply. Life science/anatomical knowledge is desirable in order to support delineation and automated pathway developments.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are seeking an enthusiastic and motivated person to join the radiotherapy physics service based in the Medical Physics &amp; Clinical Engineering department at Singleton hospital, Swansea. The department has in excess of 120 staff across four hospital sites and provides integrated scientific and technical support through nuclear medicine services, radiotherapy physics, radiation protection services, medical equipment management and rehabilitation engineering. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Radiotherapy Physics Service comprises some 32 staff and provides scientific, technical and engineering services to the SWWCC that fulfils supra-regional role-serving patients from the Swansea Bay University Health Board, and across the SW Wales regions providing in excess of 3200 new patient referrals per year from a population of approximately 975,000.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The service supports a range of state-of-the-art radiotherapy equipment that includes four Elekta linear accelerators (including SGRT and FFF capability), Philips wide-bore CT-scanner, Pinnacle treatment planning system utilising image fusion (ProSoma), atlas-based auto segmentation and adaptive techniques (Mirada), and a well-developed oncology information management system (Mosaiq, including Mosaiq Evaluate), all deployed in a Citrix environment to provide electronic access across the SW Wales region to facilitate complete remote and paperless working. The service supports a flexible approach including working from home and unsociable hours (e.g. weekends). &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Treatment plans are prepared for a number of clinical trials and clinical sites using techniques that include IMRT, VMAT and 4D options. The Cancer Centre is undergoing an equipment refresh: the third of three replacement linear accelerators is to be installed in 2021, along with a dedicated replacement CT scanner. The SWWCC also recently signed a collaboration agreement with Philips Healthcare to develop the next generation of radiotherapy workflow management software tools. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Singleton Hospital provides a highly desirable working environment, situated centrally in the sweep of Swansea Bay and bounded by the beach and Singleton Park. The Swansea area offers outstanding leisure opportunities, spectacular countryside, affordable housing and excellent transport links.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Successful shortlisted candidates must attend an interview, which may include undertaking short tests as part of our recruitment process.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; Welsh and/or English speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Douglas EtheridgeHead Radiotherapy Physics Technologist&lt;/p&gt;\n&lt;p&gt;douglas.etheridge@wales.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number 01792 205666 ext 35202&lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;OR&lt;/p&gt;\n&lt;p&gt;Joseph Flaherty, Deputy Head Radiotherapy Physics Technologist (joseph.flaherty@wales.nhs.uk).&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123207.jpg", "name": "Swansea Bay University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123207"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Singleton Hospital, Swansea", "postalCode": "SA2 8QA"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6092", "longitude": "-3.98528"}}, "title": "Radiotherapy Physics Technologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250531", "validThrough": "2020-11-15T23:59:59+0000"}