{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890-£44,503"}}, "datePosted": "2020-10-26T16:14:55+0000", "description": "&lt;p&gt;The post holder will work in accordance with agreed prioritisation from the IM&amp;T Programme Board and Health and Social Care Systems Assurance Board in the planning, implementation and successful delivery of packages of work for the development and support of systems managed by the Application Development Team.&lt;/p&gt;\n&lt;p&gt;The post holder will be an authority in systems requirements gathering, development, testing and path to live (PTL) ensuring robust documentation and procedures are in place for team members to implement. The role will ensure that clinical and care needs are adequately captured, discussed and transformed into system specifications and digital innovations for subsequent development within Application Development. Acting as the primary contact for updates, exception reporting and subsequent scheduling of this work.&lt;/p&gt;\n&lt;p&gt;The post holder will enact the agile position of Scrum master within the Application Development function, conducting agile ceremonies and removing blockers in order to ensure an agile responsive development lifecycle.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;KEY RESPONSIBILITIES&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Main duties and responsibilities&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Supporting the Head of Application Development in the implementation of the Application Development Business Plan&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;To take the lead responsibility for the successful implementation of projects and change requests undertaken by the Business Architecture and Systems Development Support Team&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Responsible for analysing and communicating capacity and demand within the Business Architecture and Systems Development Support functions, ensuring work is suitable scheduled and communicated/updated to stakeholders against agreed priorities and timeframes&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Act as a subject matter expert for the trusts main EPR (RiO) ensuring business analysis and development incorporate best practice.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Lead scoping meetings/workshops/discussions and specifications of new information system processes. To use knowledge and expertise of Trust services and clinical/care pathways to recommend and implement agreed solutions. Ensure that the process is robust, efficient and well documented.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Proactively engages with the wider organisation to identify areas for improvement and lead the necessary action to implement. Participating in relevant internal and external working groups/projects, services and initiatives to provide project, information and IM&amp;T scoping advice and expertise.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;To manage incoming development / change requests using agreed processes such as prioritisation using agreed change matrixes, sign posting to other teams / processes (such as the PMO).&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Champion the use of Agile and Lean methodologies (such as Lean Sigma 6, Virginia Mason) within the Application Development Team&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Act as the teams Scrum Master ensuring the team live agile values and principles and follows the processes and practices that the team agreed they would use.&lt;/li&gt;\n&lt;li&gt;Line management of a number of staff&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;To provide day to day management and motivation for the Business Architecture Team.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Acts as a coach and mentor for other less knowledgeable and experienced colleagues, raising the standard of professional excellence through example.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Apply the trusts Project Management methodology PRINCE2 on projects ensuring appropriate documentation is produced such as project briefs, project logs and plans.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;To document solutions, specifications, projects, technical proposals and hand over material which includes training material and support information for the continuing service support&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Plan own workload in agreement with line manager and prioritise workload as appropriate.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Communicate project/change importance, scope, targets and plan to other team members and directorates based on an in-depth understanding of all work being undertaken within teams managed&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Supporting the update/escalation of Business As Usual IM&amp;T queries and SSHIS incidents/problems. Reporting themes of recurring issues for escalation to IM&amp;T Service Development function for progression&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;To ensure that the processes and developments comply with the relevant Data Protection legislation such as GDPR or either equivalent.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Represent the Business Architecture and Systems Support Team in both technical and clinical steering groups such as the Design Authority, Technical Review Group&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Develop and maintain links with external organisations, including local health and social care partners, local and regional interest groups and national contacts&lt;/li&gt;\n&lt;/ul&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Midlands Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121040"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Stafford", "postalCode": "ST16 3SR"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.8106", "longitude": "-2.10908"}}, "title": "Business Architect Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243338", "validThrough": "2020-11-21T23:59:59+0000"}