{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44780", "minValue": "37638", "unitText": "YEAR", "value": "£37,638 - £44,780 p.a. inclusive of HCA"}}, "datePosted": "2020-10-28T10:01:53+0000", "description": "&lt;p&gt;Are you an experienced band 5 or 6 Occupational Therapist wanting to develop or consolidate your skills in an award winning Trust? Do you want to join an exciting band 6 rotational programme that covers a range of specialities across acute and community settings? &lt;br /&gt;&lt;br /&gt;We are seeking to recruit enthusiastic, driven and forward thinking Occupational Therapists to join our Band 6 Occupational Therapy rotation. &lt;br /&gt;&lt;br /&gt;This is an excellent opportunity for clinically supported development within a Trust that is clinician-led, and strives to provide the highest possible level of clinical expertise throughout its healthcare services.&lt;br /&gt;&lt;br /&gt;Driven by your enthusiasm and interest in gaining a breadth of experience at senior level within a friendly and proactive Occupational Therapy service you would provide specialist assessment and interventions across 17 different areas, including:&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;• Elective orthopaedics,&lt;br /&gt;• Older people/Medicine (OPU)&lt;br /&gt;• Oncology,&lt;br /&gt;• Specialist Therapy Assessment Team in A&amp;E &lt;br /&gt;• Lane Fox Unit (Respiratory)&lt;br /&gt;• Surgery/Vascular wards&lt;br /&gt;• Hand therapy&lt;br /&gt;• Trauma &amp; Orthopaedics&lt;br /&gt;• Stroke&lt;br /&gt;• Enhanced Rapid Response &amp; Supported Discharge &lt;br /&gt;• Guys &amp; St Thomas’ @ home service&lt;br /&gt;• The Pulross Centre (inpatient rehabilitation unit) &lt;br /&gt;• Amputee Rehabilitation Unit &lt;br /&gt;• Community Rehabilitation &amp; Falls&lt;br /&gt;&lt;br /&gt;Each rotation lasts 9 months giving you an opportunity to develop specialist clinical and non-clinical skills.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;The Occupational Therapy service has a supportive and progressive management structure with departmental objectives founded upon the principles of the clinical governance framework and trust core values. Multi-disciplinary working within the Trust is well established and Students are accepted on placement from several training schools.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;The trust is committed to continuing the professional development of its workforce. The department has structured in-service training supported by personal and professional development plans and yearly appraisals. Staff are encouraged to attend courses to continue their clinical development and participate in multi-disciplinary training programmes.&lt;br /&gt;&lt;br /&gt;At Guys &amp; St Thomas’ NHS Foundation Trust, we are committed to providing you with:&lt;br /&gt;• Professional expert advice, including access to our Professional Leads in our Community and Hospital settings&lt;br /&gt;• An annual appraisal and personal development plan (PDR)&lt;br /&gt;• Structured in-service development programs and regular supervision &lt;br /&gt;• Support to undertake research, audit and service evaluation &lt;br /&gt;• Training links to London Southbank and King’s College Universities&lt;br /&gt;• Support to develop your skills in presentation (for teaching)&lt;br /&gt;&lt;br /&gt;Our professional offer to you:&lt;br /&gt;As a Band 6 OT you will have an opportunity to:&lt;br /&gt;• Develop your discipline specific skills, e.g. assess for suitable equipment, minor home adaptations, cognitive assessment, rehabilitation and discharge planning&lt;br /&gt;• Develop your skills in complex case management of clients beyond the scope of your traditional Occupational Therapy practice&lt;br /&gt;• Develop your skills in holistic assessment, problem solving and joint working with other health and social care colleagues, GPs, hospital teams and voluntary sector agencies &lt;br /&gt;• Develop supervisory, leadership and service development skills&lt;br /&gt;• Access appropriate GSTT leadership development training courses to support career development &lt;br /&gt;• Support you to be involved in Occupational Therapy clinical meetings&lt;br /&gt;• Develop your skills in service development&lt;/p&gt;\n&lt;p&gt;For further details please contact Sarah Penfold on 020 7188 4169 or via sarah.penfold@gstt.nhs.uk or Cilene Hamp on 020 30495391 or via cilene.hamp@gstt.nhs.uk&lt;br /&gt;&lt;br /&gt;This vacancy will close on 15th November 2020 at midnight.&lt;/p&gt;\n&lt;p&gt;Interviews will be held in week commencing 25th November 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Sarah Penfold on 020 7188 4169 or via sarah.penfold@gstt.nhs.uk or Cilene Hamp on 020 30495391 or via cilene.hamp@gstt.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121066.jpg", "name": "Guy's and St. Thomas' NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121066"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "London", "postalCode": "SE1 7EH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4979", "longitude": "-.119645"}}, "title": "Senior Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245960", "validThrough": "2020-11-15T23:59:59+0000"}