{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-11-02T11:46:24+0000", "description": "&lt;p&gt;Are you a Registered Nurse, a newly qualified Nurse, or training to be a Nurse? Are you looking for an exciting and interesting role, working with a multi-disciplinary team who are committed to delivering high quality and safe patient care? If you are motivated, dedicated, passionate and looking for a new challenge to enhance your personal and professional development, then we would love to hear from you!&lt;/p&gt;\n&lt;p&gt;We are a 27 bedded, mixed Trauma Ward, specialising in hip fractures of our older patients giving a mixture of Surgery and Medicine. Our patients, admitted through A&amp;E, are frail and vulnerable and require the care of professionals who are dedicated and understanding of their complex needs. This is an ideal opportunity for someone who has a passion for providing high quality patient care.&lt;/p&gt;\n&lt;p&gt;Working alongside a unique team of Occupational Therapists, Physiotherapists and Ortho-Geriatric Consultants, we also provide rehabilitation and support to enable the patients to leave the hospital environment.&lt;/p&gt;\n&lt;p&gt;We have a strong team, with great opportunities to develop and gain excellent experience in delivering compassionate and safe care to this complex and vulnerable group of patients.&lt;/p&gt;\n&lt;p&gt;Opportunities to work alongside Fracture Clinic and Theatres make this an ideal opportunity for a nurse who is passionate at seeing their patients effectively through the patient pathway. With our links to Canterbury Christ Church University and in-house nurse development team, we are also dedicated to providing education and training to support you in your CPD.&lt;/p&gt;\n&lt;p&gt;We would love to meet you and show you around. For more information or to arrange a site visit, please contact Carol Allen, Ward Manager, on 01233 616795 or by email carolallen2@nhs.net or Angela Pearson - angela.pearson1@nhs.net&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Carol Allen&lt;/p&gt;\n&lt;p&gt;Job title: Ward Manager&lt;/p&gt;\n&lt;p&gt;Email address:carolallen2@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number: 01233616795&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "East Kent Hospitals University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121462"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "William Harvey Hospital, Ashford, Ashford, Kent", "postalCode": "TN24 0LZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.1415", "longitude": ".91624"}}, "title": "Registered Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251894", "validThrough": "2020-11-16T23:59:59+0000"}