{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pro rata per annum"}}, "datePosted": "2020-10-30T09:16:01+0000", "description": "&lt;p&gt;Are you an experienced registered mental health or learning disability nurse and are looking for a change, or a newly qualified nurse looking for an exciting opportunity to complete your preceptorship then this is the opportunity for you.&lt;/p&gt;\n&lt;p&gt;We are looking to recruit people with a genuine interest in working in mental health. Someone who is caring and self motivated someone who can remain calm in a crisis and who works well in a team. Knowledge and experience of mental illness is useful, but not essential however, good communication skills and being able to support other people are.&lt;/p&gt;\n&lt;p&gt;Our qualified Nurses within Mersey Care NHS Foundation Trust are supported to provide the highest possible care, with access to training and development, with many being offered the opportunity to support their learning with post registration training opportunities so we welcome all applicants.&lt;/p&gt;\n&lt;p&gt;It&#96;s an exciting time at Mersey Care as we continue to develop the highest quality services, supported by cutting edge innovation and research.&lt;/p&gt;\n&lt;p&gt;Acute mental health care is a fast paced, dynamic environment. This leads to the teams on our ward working closely together and developing strong, supportive bonds. The experience you gain whilst working on our wards is invaluable.&lt;/p&gt;\n&lt;p&gt;Many people think that working in mental health is something they wouldn’t have the skills for but this isn’t the case. Often being someone that has an interest in others and is able to communicate with other people are the only skills needed. People working in a variety of other areas already possess the transferable skills to succeed in this, at times, challenging yet rewarding environment&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We have vacancies at the following sites:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Clock View Hospital&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Clock View development is the first of a new generation of modern mental health inpatient facilities serving residents across Sefton and Liverpool. We have 5 units within the building, from intensive care through to older people, with single sex and mixed sex wards providing care to working age adults so there is something to interest everyone.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Broadoak Unit – Broadgreen Hospital&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Broadoak unit is a mental health inpatient facility serving residents across Liverpool and Sefton. We have 3 units within the building, a male ward, female ward and mixed ward providing care to working age adults so there is something to interest everyone.&lt;/p&gt;\n&lt;p&gt;We look forward to receiving your application to come and find your perfect fit with Mersey Care. Please state your preference in the supporting information section of your application, of which site you wish to apply for.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121087.gif", "name": "Mersey Care NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121087"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Local Service division - in patient wards, Local Division", "postalCode": "L34 1PJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4231", "longitude": "-2.8262"}}, "title": "Band 5 Staff Nurse (mental health)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249447", "validThrough": "2020-11-26T23:59:59+0000"}