{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 pa/ pro rata for part time staff"}}, "datePosted": "2020-11-02T13:45:53+0000", "description": "&lt;p&gt;&lt;strong&gt;This Vacancy &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This post provides and exciting opportunity to join an enthusiastic team within one of the largest NHS Foundation Trusts in the country. You will work as part of a team working collaboratively both within the directorate but also across the wider Trust using your skills to create, improve and support clinical information systems in use within Laboratory Medicine.&lt;/p&gt;\n&lt;p&gt;The post will allow the appointee to utilize and develop skills in programming, database development, data analysis, the support of clinical systems and training of end users.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About Us&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Sheffield Teaching Hospital Foundation Trust (STH) is one of the UK’s largest and most successful Foundation Trusts&lt;/p&gt;\n&lt;p&gt;The directorate of Laboratory Medicine employs over 530 staff across its departments of Cellular Pathology, Microbiology, Virology, Clinical Chemistry, Immunology, Haematology and Blood Transfusion. We have a number of specialised and highly specialised services and are a regional and national referral centre for a number of disciplines including Coagulation and Immunology.&lt;/p&gt;\n&lt;p&gt;The IT team ,as part of the directorate central management team for Laboratory Medicine, is responsible for providing support for the Laboratory Information Management System (LIMS). We develop and support innovative in-house solutions to support the work of the directorate, as well providing data analysis and associated tools enabling opportunities to exploit information for the further good of medicine.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Who we looking for&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will be a highly motivated individual with a background and qualifications working with Information Systems and possess an ability to take the requirements of laboratory colleagues and turn these into solutions that support the needs of the service.&lt;/p&gt;\n&lt;p&gt;You will have excellent communication and interpersonal skills and should be able to demonstrate good organizational skills as well as the ability to work systematically through problems.&lt;/p&gt;\n&lt;p&gt;Though not essential you will ideally have some experience of working in a NHS laboratory setting or working in an IT related support role within the wider NHS. An understanding of Laboratory Information Systems and other systems in use across the NHS is preferable.&lt;/p&gt;\n&lt;p&gt;Above all you will be committed to your own development and show a willingness to learn new skills and develop your own knowledge&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What you can expect from Sheffield Teaching Hospital NHS Foundation Trust&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will be working for an organisation which values and respects all of its staff and the community it serves. The Trust is a leader in the NHS and research sectors and provides excellent benefits for its staff. This includes commitments to professional development but also many policies to support employees in balancing their personal and professional lives.&lt;/p&gt;\n&lt;p&gt;Please see the attached documents to the NHS Jobs page for this vacancy which gives you more detail on why you should come and work for us.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;strong&gt;Joanne Galloway (Lab Medicine IM&amp;T Manager)&lt;/strong&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Email: joanne.galloway@nhs.net&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Tel: 07795 413681&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;David Limb (&lt;/strong&gt;&lt;strong&gt;Interim Deputy IT Manager - Lab Medicine)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Email: davidlimb@nhs.net&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121486.png", "name": "Sheffield Teaching Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121486"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Sheffield Teaching Hospitals, Sheffield", "postalCode": "S5 7AU"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4098", "longitude": "-1.45604"}}, "title": "Lab Medicine IT Specialist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252278", "validThrough": "2020-11-11T23:59:59+0000"}