{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615"}}, "datePosted": "2020-10-30T10:02:10+0000", "description": "&lt;p&gt;&lt;span&gt;An opportunity has arisen for a registered nurse with experience of older people/complex physical care needs to join the BNSSG - Continuing Health Care team on a six month fixed term contract.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This is an exciting opportunity to develop your assessment skills and gain knowledge in a new field. The Funded Nurse Assessor role will involve assessing and reviewing clients with regards to their health needs, welfare and provision of care whether in registered nursing homes. Our team is based in the heart of Bristol covering the BNSSG demographic. Due to COVID-19 we are currently working remotely but continue to deliver person centred assessments of need under the National Framework for Continuing Healthcare. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The job holder will be required to liaise with health colleagues in nursing homes to coordinate a needs based assessment and complete documentation evidencing findings in a timely manner. Therefore an ability to work collaboratively and in an organised manner is essential. As this role may involve working with clients across various areas of care, such as learning difficulties or mental health, a broad range of knowledge and experience is welcomed. Training will be tailored to your experience and the needs of the service.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Continuing Healthcare team are supportive, friendly and motivated to succeed; please give us a ring to find out more and begin your journey into something new…For further information please contact: Clara Biu or Donna Witchard on 0117 3300201&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/128174.gif", "name": "Bristol, North Somerset and South Gloucestershire CCG", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128174"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bristol", "postalCode": "BS1 3NX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.46", "longitude": "-2.59169"}}, "title": "FNC Nurse Assessor", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249618", "validThrough": "2020-11-09T23:59:59+0000"}