{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 - £19,337 Pro Rata Per Annum"}}, "datePosted": "2020-10-29T15:16:18+0000", "description": "&lt;p&gt;&lt;strong&gt;Part time hours - 2xposts 22.50 hours per week &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for Part time Higher Medical Laboratory Assistant posts within the award winning Department of Clinical Laboratory Sciences.&lt;/p&gt;\n&lt;p&gt;As a suitably trained individual you will work in a busy, modern laboratory undertaking data entry and initial processing of patient samples in support of the Biomedical Scientists. Duties also include answering requests for information by telephone and some clerical duties.&lt;/p&gt;\n&lt;p&gt;Proficiency in the use of keyboard together with good communication and team-working skills are required. Also essential is an aptitude in both numeracy and literacy together with the ability to work accurately.&lt;/p&gt;\n&lt;p&gt;Candidates will be expected to work variable shifts (including twilights, weekends and Bank Holidays) and will be expected to work on the two laboratory sites (Doncaster and Bassetlaw) in order to deliver the necessary service.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;The Doncaster &amp; Bassetlaw Teaching Hospitals NHS Foundation Trust is currently one of five Trusts involved in the South Yorkshire and Bassetlaw (SYB) Pathology Transformation Programme. The aim is to design a Pathology Service that provides all SYB patients and clinicians with equitable access to high-quality, innovative laboratory medicine solutions that will ensure the best clinical outcomes for patients. The service will also be efficient and sustainable, encourage research and development in collaboration with Academia and Industry to improve health and innovation in the region and provide rewarding jobs and career opportunities for all staff. &lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Roger Clarke - Support Staff Manager, roger.clarke2@nhs.net, (01302) 642823&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Doncaster and Bassetlaw Teaching Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120925"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Doncaster", "postalCode": "DN2 5LT"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5308", "longitude": "-1.10926"}}, "title": "Higher Medical Laboratory Assistant - HMLA", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248836", "validThrough": "2020-11-12T23:59:59+0000"}