{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 p.a."}}, "datePosted": "2020-10-26T13:56:14+0000", "description": "&lt;p&gt;&lt;span&gt;The Community Nursing Out of Hours Team in Portsmouth are looking to recruit a caring and compassionate Healthcare Support Worker to join our Out of Hours locality team to support the delivery of nursing care to patients within their own homes.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will work as part of an integrated health and social care team providing care and treatment to adults over the age of 18 years under the direction of Registered Nurses within the team. You will work with the team delivering planned and unscheduled Nursing care including Palliative and end of life care, wound care, chronic disease management and support .&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Your shift pattern will involve working a combination of working late shifts (16.00pm – 12 Midnight) and Night shifts (21.30pm – 08.30am) in order to provide seamless care in the evenings and overnight. You will work with an experienced team in conjunction with the daytime localities who you will interact with on a daily basis.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Successful applicants will have good communication and interpersonal skills and will need to be flexible and adaptable. We work very closely with our inpatient units and you will at times be asked to work with them as part of collaborative team working. You will ideally hold an NVQ 3 or willingness to commit to NVQ training if you hold a NVQ 2 or equivalent. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Our staff are our most valuable asset and we are committed to supporting and developing you in order to reach your full potential. Community experience is desirable although not essential. In return for your skills and commitment we will offer you regular supervision, internal and external training opportunities and regular contact with other professionals across the area.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;If you are interested in this post and would like more detail, please contact Clinical Matron Sally Pearce on 07826 902702 for further details.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Please note that should this post attract sufficient interest, we may choose to close at an earlier date. We strongly suggest that you apply at an early stage.&lt;strong&gt;If we have not contacted you within four weeks of the closing date of this post, please presume that you have not been selected.&lt;/strong&gt;Candidates selected for interview will be contacted within 2-3 weeks; therefore you should check your emails regularly including junk mail folders.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/126954.jpg", "name": "Solent NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126954"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Portsmouth", "postalCode": "PO3 6DW"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7992", "longitude": "-1.06174"}}, "title": "Healthcare Support Worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242780", "validThrough": "2020-11-09T23:59:59+0000"}