{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51393", "minValue": "45780", "unitText": "YEAR", "value": "£45,780 - £51,393 pa inc"}}, "datePosted": "2020-10-30T17:15:37+0000", "description": "&lt;p&gt;&lt;strong&gt;Band 7 Equality, Diversity &amp; Inclusion Manager&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Are you an experienced workforce or equality/diversity professional with a background in delivering on equality, diversity or inclusion workforce requirements in a large complex organisation?&lt;/p&gt;\n&lt;p&gt;We are seeking &lt;strong&gt;two&lt;/strong&gt; Workforce, Equality, Diversity and Inclusion Managers for &lt;strong&gt;15 months&lt;/strong&gt; to help embed and develop our EDI strategy. These are newly created role, with an opportunity to be creative and think differently.&lt;/p&gt;\n&lt;p&gt;So who are we? We are People and Organisational Development Directorate who support the Trust to meet and develop its public sector duty to promote workforce equality to enhance patient and staff experience and quality of care.&lt;/p&gt;\n&lt;p&gt;Post holders will have the opportunity to influence the workforce Equality, Diversity and Inclusion agenda. The successful candidates will demonstrate excellent skills in data analysis, presentation and communicating information to different audiences.&lt;/p&gt;\n&lt;p&gt;What do we expect? We expect that you will be proactive in working collaboratively with other departments. You will need to be confident working with detail, able to analyse data and work to deadlines. You will need to be able to present challenging subjects creatively.&lt;/p&gt;\n&lt;p&gt;We are looking to fill these vacancies as soon as possible and will consider secondments. We can consider compressed hours, agile homeworking and are very happy to discuss other flexible working options.&lt;/p&gt;\n&lt;p&gt;We encourage you to call and find out more about the role and the team, before you submit your application.&lt;/p&gt;\n&lt;p&gt;Interviews will be held on either 18 or 24 November 2020 and will be conducted virtually.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Olayinka Iwu at olayinka.iwu@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123032.jpg", "name": "Imperial College Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123032"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St Mary&#39;s Hospital, London", "postalCode": "W2 1NY"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5171", "longitude": "-.174187"}}, "title": "Band 7 Equality, Diversity &amp; Inclusion Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251049", "validThrough": "2020-11-12T23:59:59+0000"}