{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-10-26T11:30:52+0000", "description": "&lt;p&gt;Band 5 Biomedical Scientist / Trainee Biomedical Scientist&lt;/p&gt;\n&lt;p&gt;Applications are welcomed from qualified Biomedical Scientists and also Trainee Biomedical Scientists that are yet to complete the IBMS registration portfolio. If a Trainee is appointed the salary will reflect this for the time it takes for them to complete the portfolio and will be paid at a reduced rate.&lt;/p&gt;\n&lt;p&gt;The Department of Cellular Pathology is looking to appoint an enthusiastic, motivated Biomedical Scientist to support the delivery of services within our exciting University Health Board.&lt;/p&gt;\n&lt;p&gt;The Cellular Pathology Department provides a diagnostic service for the City of Cardiff and the Vale of Glamorgan and provides tertiary services including Neuropathology, Electron Microscopy and Foetal Pathology for the larger population of South east Wales and beyond. The department has close integration with University services supporting a diverse range of research and clinical trials.&lt;/p&gt;\n&lt;p&gt;The laboratory is accredited to UKAS ISO 15189:2012. The department is accredited by the HCPC to provide pre and post registration training.&lt;/p&gt;\n&lt;p&gt;Support will be provided to individuals to develop skills and knowledge of the appropriate sections of the laboratory. In return we expect a commitment to deliver against high standards within our Quality Management System.&lt;/p&gt;\n&lt;p&gt;An accredited Biomedical Sciences degree is essential. Candidiates who have not yet gained HCPC registration will be considered and will be supported to complete the IBMS registration portfolio.&lt;/p&gt;\n&lt;p&gt;Understanding of Cellular Pathology services, audit and delivery against quality management systems would be desirable, above all we are searching for someone who shares our values that:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;We care about the people we serve and the people we work with&lt;/li&gt;\n&lt;li&gt;We trust one another&lt;/li&gt;\n&lt;li&gt;We respect each other&lt;/li&gt;\n&lt;li&gt;We take personal responsibility&lt;/li&gt;\n&lt;li&gt;We treat people with kindness&lt;/li&gt;\n&lt;li&gt;We act with integrity&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Post holders will be expected at all times to behave in accordance with our values demonstrating commitment to the delivery of high quality services to patients.&lt;/p&gt;\n&lt;p&gt;If you are interested in joining a highly motivated team that strives to deliver patient focused high quality services and offers an excellent learning environment, we would like to hear from you.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Additional questions to be answered in the Supporting Information section of your application:&lt;/strong&gt;&lt;/p&gt;\n&lt;ol&gt;\n&lt;li&gt;Why is quality management important in Cellular Pathology?&lt;/li&gt;\n&lt;li&gt;What health and safety aspects need to be considered in a Cellular Pathology laboratory?&lt;/li&gt;\n&lt;/ol&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; Welsh and/or English speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt;Closing date : 9th November 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Alison Griffin Job title Senior Biomedical Scientist&lt;/p&gt;\n&lt;p&gt;Email address alison.griffin@wales.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number 02921848617&lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;Alison Griffin or Hussana Thomas 02921 848617&lt;/p&gt;\n&lt;p&gt;alison.griffin@wales.nhs.uk or hussana.khanom@wales.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123193.jpg", "name": "Cardiff and Vale University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123193"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "UHW, Cardiff", "postalCode": "CF14 4XW"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5068", "longitude": "-3.18937"}}, "title": "Biomedical Scientist / Trainee Biomedical Scientist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242206", "validThrough": "2020-11-09T23:59:59+0000"}