{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-11-02T08:16:28+0000", "description": "&lt;p&gt;&lt;strong&gt;About us&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;NHS Kernow is at an exciting time as we transform into the role of strategic commissioners as well as having just made our application with our partners for Integrated Care System status. Cornwall and Isles of Scilly ICS is a group of health and care partners who are working towards common health and care outcomes for the citizens of Cornwall and Isles of Scilly. Our people in NHS Kernow are working both strategically to improve outcomes and experiences of health and care for our population as well as working operationally with our providers. Our people and organisational development team have a key role in supporting and enabling colleagues in NHS Kernow and cross the system to develop collaborative and integrated ways of working and delivering services.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Are you looking for your next challenge where no two days are the same? Do you want to be part of a developing and supportive team? This role has a varied portfolio of work, supporting programme managers on a wide range of projects across the Health and Care System, acting independently, managing multiple projects and business tasks and prioritising work to meet deadlines.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About you&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for an enthusiastic and motivated project assistant to join the programme management office. This post will primarily be responsible for providing administrative and project management support to project managers, assisting in the preparation of reports, papers and presentations often involving complex and confidential information. You will have strong organisational skills and experience of Microsoft Excel is essential.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;COVID&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Currently colleagues at NHS Kernow are working from home to comply with government guidance in response to COVID pandemic. We are discussing new models of working with our staff engagement group Staff Voice and this includes increased flexibility and combination of office based and homeworking.&lt;/p&gt;\n&lt;p&gt;You can look forward to excellent benefits including discounts in store and online, optional pension and life assurance, flexible working options, salary sacrifice vehicles/ cycles/ child care vouchers, two days pro rata to undertake volunteering, coaching and mentoring opportunities, as well as fantastic opportunities to develop your career.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing date&lt;/strong&gt;: Sunday 22 November 2020&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview date&lt;/strong&gt;: Monday 30 November 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact: Jan Bergman, Interim PMO and Transformation Consultant jan.bergman3@nhs.net 07767 441490&lt;/p&gt;\n&lt;p&gt;If this role sounds like something you would be interested to hear more about, or to request support with the recruitment process, then please contact Jan Bergan on 07767 441490&lt;/p&gt;\n&lt;p&gt;NHS Kernow is an equal opportunities employer. This means we are committed not to discriminate against any employee or job applicant because of any protected characteristic.&lt;/p&gt;\n&lt;p&gt;We believe in a workplace which is truly equal and strive to make this the most fair and equitable workplace for all. NHS Kernow values diversity and promotes equality. We welcome applications from people who identify as lesbian, gay, bisexual and/or trans/transgender (LGBTQ+).&lt;/p&gt;\n&lt;p&gt;We are a Disability Confident employer; committed to recruiting and retaining people with disabilities. There is a guaranteed interview scheme (GIS) for candidates with disabilities who meet the minimum selection criteria; subject to volume of applicants.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/128400.jpg", "name": "Kernow Clinical Commissioning Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128400"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "NHS Kernow CCG, St Austell", "postalCode": "PL25 5AS"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.3397", "longitude": "-4.79474"}}, "title": "Project Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251300", "validThrough": "2020-11-22T23:59:59+0000"}