{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-10-27T14:46:23+0000", "description": "&lt;p&gt;&lt;strong&gt;Band 5 Clinician for Mental Health Access Hub and Home Treatment team&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;The successful applicant will be working primarily in the Warwickshire area. The post holder would be expected to participate in the night rota and undertake shifts over a 24 hour period 7 days a week. Shifts will be:&lt;/p&gt;\n&lt;p&gt;08.00-20.30 &amp; 20.00-08.30&lt;br /&gt;&lt;br /&gt;They will need to demonstrate experience of working with clients with mental health problems or experiencing mental health crisis. They will need to demonstrate strong assessment skills, be willing to take positive risks and able to plan care and interventions. They must be committed to providing home treatment as an alternative to hospital admission. &lt;br /&gt;&lt;br /&gt;The successful candidate must have excellent communication skills, demonstrate a caring, compassionate and professional attitude to the client group and have evidence of working in an acute psychiatric setting. They will also need to enjoy working in a fast paced team. They will demonstrate a sound knowledge of the acute pathway including the role of gatekeeper and early discharge.&lt;br /&gt;&lt;br /&gt;The Access Hub and the Home Treatment Team is an age independent multidisciplinary Team. We work with clients 16 plus providing a high level of care.&lt;/p&gt;\n&lt;p&gt;The Access hub is the front door to all mental health referrals into the Trust, therefore the successful clinician will be triaging and at times need to complete face to face triages and assessments for people that are in a Mental health crisis.&lt;br /&gt;&lt;br /&gt;The Service covers a large geographical area and the post holder will need to be confident about lone working and working as an autonomous clinician. They will attend the weekly clinical reviews where there is a shared multidisciplinary approach to planning care. There is a strong learning culture within the team and the successful applicant would be expected to contribute to this. &lt;br /&gt;&lt;br /&gt;If you are a dynamic caring motivated individual with acute experience preferably in a community / Inpatient / Urgent care Team setting we would like to hear from you.&lt;/p&gt;\n&lt;p&gt;You will need to have a driving license&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Please note Trust interviews are currently taking place through Microsoft Teams, this can be downloaded either through the App Store or Google Play for use on your phone/tablet. &lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Jaime Parry - Project Lead, Tel: 024 76 932800&lt;/p&gt;\n&lt;p&gt;Laura Marley - North Warwickshire Service Lead, Tel: 02476 322744&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Coventry and Warwickshire Partnership Trust (CWPT)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121204"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Avenue House, Nuneaton", "postalCode": "CV11 5HX"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.527", "longitude": "-1.4777"}}, "title": "Community Psychiatric Nurse - Band 5 (Nuneaton)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245023", "validThrough": "2020-11-10T23:59:59+0000"}