{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "49036", "minValue": "49036", "unitText": "YEAR", "value": "£49,036 per annum pro-rata"}}, "datePosted": "2020-11-04T15:01:23+0000", "description": "&lt;p&gt;Applications are invited for the post of Clinical Fellow (Higher) in General Paediatrics at Addenbrooke’s Hospital, part of Cambridge University Hospitals NHS Foundation Trust (CUH) to commence as soon as possible until 05 September 2021.&lt;/p&gt;\n&lt;p&gt;This new post will support the Service to provide and run a double 1:10 registrar rota out of hours.&lt;/p&gt;\n&lt;p&gt;In order to be considered, applicants &lt;strong&gt;must&lt;/strong&gt; have a current APLS provider certificate (or equivalent) and at least 24 months of clinical experience in Acute and General Paediatrics&lt;em&gt;, &lt;/em&gt;and MRCPCH is desirable but not essential.&lt;/p&gt;\n&lt;p&gt;You will work under the supervision of the General Paediatric Consultants. Daytime work will include looking after the General paediatric in-patients, assessment and review of medical paediatric patients in the Paediatric Emergency Department and undertaking general paediatric clinics.&lt;/p&gt;\n&lt;p&gt;There will also be the opportunity for you to work with one of the tertiary paediatric sub-speciality teams. Sub-specialties include Oncology, Neurology, Rheumatology and Emergency Medicine.&lt;/p&gt;\n&lt;p&gt;Out of hours you will take part in the Paediatric on-call rota. You will work alongside a second Registrar and a Junior Trainee (ST1-3).&lt;/p&gt;\n&lt;p&gt;Duties will include the assessment and management of children in the Paediatric Emergency Department and review and management of all paediatric patients on the wards including the sub-specialty patients.&lt;/p&gt;\n&lt;p&gt;Cambridge University Hospitals NHS Foundation Trust includes Addenbrooke’s and the Rosie Hospitals. We are one of the largest and busiest hospitals in the country with an outstanding reputation that is down to the exceptional people that work here.&lt;/p&gt;\n&lt;p&gt;Our philosophy is to keep the patient at the heart of everything we do. Every person that works for the Trust, regardless of their role, comes into contact with our patients and visitors and is expected to uphold our values of &lt;strong&gt;Together - Safe, Kind, Excellent&lt;/strong&gt; at all times.&lt;/p&gt;\n&lt;p&gt;We look for people who are willing to go the extra mile, not because they are asked to, but because they are committed to being part of a healthcare team that delivers an excellent caring service to our patients.&lt;/p&gt;\n&lt;p&gt;Please note that this post does &lt;strong&gt;not&lt;/strong&gt; carry Postgraduate Dean’s approval or training recognition. However, ample opportunities for training in the field of Acute and sub-specialty Paediatrics will be provided. You will be allocated an Educational Supervisor and will be encouraged to undertake work place based assessments.&lt;/p&gt;\n&lt;p&gt;The applicant must have demonstrable skills in listening, reading, writing and speaking in English that enable effective communication about medical topics with patients and colleagues, as set out in the GMC’s Good Medical Practice (2013). Non-UK applicants must possess the IELTS/OET exam before obtaining a GMC licence to practice.&lt;/p&gt;\n&lt;p&gt;Full Registration and a Licence to Practice with the General Medical Council at time of application is required.&lt;/p&gt;\n&lt;p&gt;Applications from job seekers who require Tier 2 sponsorship to work in the UK are welcome and will be considered alongside all other applications. For further information please visit the UK Visas and Immigration website.&lt;/p&gt;\n&lt;p&gt;From 6 April 2017, Tier 2 skilled worker applicants, applying for entry clearance into the UK, must present a criminal record certificate from each country they have resided continuously or cumulatively for 12 months or more in the past 10 years. Adult dependants (over 18 years old) will also be subject to this requirement.&lt;/p&gt;\n&lt;p&gt;Cambridge University Hospitals NHS Foundation Trust is an Equal Opportunities Employer.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;-Dr Kate Riley, Consultant Paediatrician at katharine.riley@addenbrookes.nhs.uk&lt;/p&gt;\n&lt;p&gt;-Dr Ruth Clay, Consultant Paediatrician at ruth.clay@addenbrookes.nhs.uk&lt;/p&gt;\n&lt;p&gt;-Dr Helen Bailie, Consultant Paediatrician at helen.bailie@addenbrookes.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Cambridge University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121319"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Addenbrooke&#39;s Hospital, Cambridge", "postalCode": "CB2 0QQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1751", "longitude": ".141751"}}, "title": "Clinical Fellow (Higher) in General Paediatrics", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256350", "validThrough": "2020-11-17T23:59:59+0000"}