{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "47018", "minValue": "42969", "unitText": "YEAR", "value": "£42,969 - £47,018 pro rata, per annum"}}, "datePosted": "2020-10-29T12:46:05+0000", "description": "&lt;p&gt;&lt;strong&gt;Trust Fellow in CATS (Children&#39;s Acute Transport Service)&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;2x Trust Fellows – to start from May 2021 for 6 months&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;3x Trust Fellows – to start from August 2021 for 6 months&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;1-2x Trust Fellows – to start from September 2021 for 6 months&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The Children&#39;s Acute Transport Service (CATS) stabilises &amp; transports critically ill &amp; injured children into Intensive Care facilities in North Thames. The posts are ideally suited to doctors with backgrounds in Paediatric Critical Care, Anaesthesia, or Emergency Medicine wishing to consolidate and broaden their experience of Paediatric Critical Care Medicine.&lt;/p&gt;\n&lt;p&gt;The successful applicants will be working as part of a team of 10 Specialist Registrars/Clinical Fellows and Advanced Nurse Practitioners. There may, on occasion, be the opportunity to work within other areas of the critical care directorate at GOSH. The service currently undertakes over 1200 retrievals per year with a wide range of paediatric, neonatal surgical and cardiac intensive care cases, including those referred for ECMO support.&lt;/p&gt;\n&lt;p&gt;Supernumerary flexible time is included in to allow for participation in clinical audit and to cater to the training needs of the individual. Previous experience in Transport Medicine is desirable but not essential as the post entails full training in the transport of critically ill children by road and air.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Applicants must be registered with the General Medical Council or eligible for registration.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Based in central London, GOSH offers flexible working, help with childcare and travel, excellent training and development opportunities and assistance with finding somewhere to live.&lt;/p&gt;\n&lt;p&gt;If you experience any technical difficulties applying for this post please email us at vacancy@gosh.nhs.uk.&lt;/p&gt;\n&lt;p&gt;More information about CATS is available on our website.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Interested applicants are invited to contact Dr Padmanabhan Ramnarayan, Specialty Lead at CATS, telephone 020 74305850 or email P.Ramnarayan@gosh.nhs.uk, or Dr Linda Chigaru, CATS Training and Education Lead, telephone 020 7430 5850 or email linda.chigaru@gosh.nhs.uk for further information.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121180.png", "name": "Great Ormond Street Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121180"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Great Ormond Street Hospital, London", "postalCode": "WC1N 3JH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5222", "longitude": "-.119898"}}, "title": "Trust Fellow in CATS (Children&#39;s Acute Transport Service)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248366", "validThrough": "2020-11-22T23:59:59+0000"}