{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30679", "minValue": "24910", "unitText": "YEAR", "value": "£24,910 - £30,679"}}, "datePosted": "2020-11-02T12:01:51+0000", "description": "&lt;h1&gt;&lt;strong&gt;Registered Mental Health Nurse (Older People Services)&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;&lt;strong&gt;Salary: &lt;/strong&gt;Core role salary range £24,910 - £30,679 based on full-time hours, plus enhancements. Average earnings with enhancements are expected to range from £26,107 - £34,667. Salary point will depend on qualification and experience.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours: &lt;/strong&gt;Full-time (37.5 hours per week) and part-time considered&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location:&lt;/strong&gt; Gateshead&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Welcome Bonus: &lt;/strong&gt;£1,000 payable upon successful completion of 6 month probationary period&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;h2&gt;&lt;strong&gt;About the role&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;We have a number of exciting opportunities for qualified and skilled Registered Mental Health Nurses to join our specialist teams based in Gateshead. To be successful in the role, you will be passionate about delivering person centred care, possessing good communication and interpersonal skills. Ideally, you will have recent experience caring for older people.&lt;/p&gt;\n&lt;p&gt;You will be working at one of our Older People Services, either Alderwood (based in Bensham), Briarwood (based in Blaydon) or Pinetree Lodge (based in Low Fell). These 24-hour specialist care units offer two kinds of services for older people; caring for those with dementia, and supportive rehabilitation for those who have other complex mental health problems. As a vital member of the team, you will work with service users, their families and other carers to assess client need, develop support plans and implement planned interventions. In order to provide the best care for our residents, we have highly trained staff available 24 hours a day, and our nurses are supported by dedicated Support Workers. &lt;/p&gt;\n&lt;p&gt;You will be joining Mental Health Concern, which is a leading NHS and Local Authority commissioned charity that provides a wide range of specialist mental health services, supporting people with mental health problems to live valued lives. As part of the Concern Group, we are primarily based in the North East of England and employ over 275 staff. Established for over 30 years, we are proud to be one of the largest non-statutory providers of mental health services in England.&lt;/p&gt;\n&lt;p&gt;It is our mission to improve the mental health and wellbeing of the people we serve. Our staff are key in delivering this mission, and are committed to the organisations core values which are at the heart of everything we do.&lt;/p&gt;\n&lt;p&gt;This is an excellent opportunity to join an organisation that has experienced recent growth and continues to seek new opportunities to further strengthen and build upon our excellent reputation.&lt;/p&gt;\n&lt;p&gt; &lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;h2&gt;&lt;strong&gt;About you&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;We would love to hear from you if you:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Are a registered mental health nurse&lt;/li&gt;\n&lt;li&gt;Possess good communication and interpersonal skills&lt;/li&gt;\n&lt;li&gt;Possess a genuine desire to care for older people experiencing complex mental health needs&lt;/li&gt;\n&lt;li&gt;Can appreciate that all our clients are individuals and take a person-centred approach in your work&lt;/li&gt;\n&lt;li&gt;Have experience of working with people who present behaviours that challenge&lt;/li&gt;\n&lt;li&gt;Can demonstrate an empathic attitude and can keep our values at the heart of what you do&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;h2&gt;&lt;strong&gt;How to apply&lt;/strong&gt;&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li&gt;The information pack, job description and person specification are attached. It is essential that you read this documents prior to applying to this role.&lt;/li&gt;\n&lt;li&gt;For an informal discussion regarding this position, please contact Deborah Smith (Service Manager) on 0191 477 7833 who will be happy to speak to you.&lt;/li&gt;\n&lt;li&gt;Please apply through the NHS Jobs website. Please note, all correspondence will be through the email address or phone number provided on your application form. To avoid missing our emails, please regularly check your Junk Mail folders.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing date for applications is Sunday 29th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview dates are to be confirmed&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;em&gt;This post is subject to an enhanced DBS Disclosure, which we will cover the cost of. If you have not heard from us within 6 weeks of applying, please assume you have been unsuccessful on this occasion. Concern Group reserves the right to close the vacancy early if a large volume of applications is received.&lt;strong&gt;    &lt;/strong&gt;&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Mental Health Concern", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130357"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Tyne and Wear", "postalCode": "NE21 4AN"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.9646", "longitude": "-1.71624"}}, "title": "Registered Mental Health Nurse (Older People Services)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251944", "validThrough": "2020-11-29T23:59:59+0000"}