{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Competitive"}}, "datePosted": "2020-10-13T15:47:48+0100", "description": "&lt;p&gt;Nuffield Health is Britain’s largest not-for-profit healthcare organisation. Join us as a Physiotherapist in our Cheltenham Hospital and play your part in building a healthier nation.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;To join our inpatient team on a Bank contract. Covering inpatient care including orthopaedic, gynae and general surgery.&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;The Role&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;You will see a wide range of post operative cases, playing a key role in helping our patients achieve, maintain and recover to the level of health and wellbeing that they aspire to.&lt;br /&gt;&lt;br /&gt;Covering inpatient workload. You will work within a multidisciplinary team including nurses, AHPS and consultants in order to optimise the health and recovery of our patients.&lt;br /&gt;The hospital is brilliantly placed to support and mentor the successful candidate for this role, alongside our academy training programmes. As a Physiotherapist you will;&lt;br /&gt;&lt;br /&gt;- Deliver high quality, effective clinical care.&lt;br /&gt;&lt;br /&gt;- Adhere to our values and beliefs at Nuffield Health, in which we encourage behaviour which is enterprising, passionate, independent and caring.&lt;br /&gt;&lt;br /&gt;- Deliver excellent clinical care that is evidence based, Safe, Effective, Caring, Well-led and responsive to our patient’s needs.&lt;br /&gt;&lt;br /&gt;- Ensure on-going monitoring of the standard of treatment provided&lt;br /&gt;&lt;br /&gt;- Be compliant with all professional, clinical and integrated governance standards and participate in clinical audit and other quality assurance processes&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;The Person&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;To succeed as a Physiotherapist you will;&lt;br /&gt;&lt;br /&gt;- Have a BSc in Physiotherapy or equivalent, you’ll be registered with the Health and Care Professions Council.&lt;br /&gt;&lt;br /&gt;- Demonstrate evidence of further professional training and continual professional development, reflecting your desire to develop as a practitioner.&lt;br /&gt;&lt;br /&gt;- Be a confident communicator with the ability to engage effectively with the general public and other healthcare professionals.&lt;br /&gt;&lt;br /&gt;- Be able to demonstrate excellent manual therapy skills.&lt;br /&gt;&lt;br /&gt;- Be a competent and confident IT user with strong organisation skills&lt;br /&gt;&lt;br /&gt;- Have the ability to prioritise and deal with your varied workload in an effective and timely manner.&lt;br /&gt;&lt;br /&gt;It’s equally important that you share our values. We believe in putting people first and providing personalised, holistic healthcare. That makes you part of a much wider team, working to create a healthier future for each individual client.&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;The Benefits&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;We believe in our people and to help you develop your skills and progress your career in Nuffield Health&lt;br /&gt;&lt;br /&gt;- You will be supported by your regional clinical lead&lt;br /&gt;&lt;br /&gt;- Have protected CPD time, access to a local in-service training program and training events organised by the Nuffield Health Academy including both clinical and leadership courses.&lt;br /&gt;&lt;br /&gt;- There will also been mentoring support within the department from Senior Physiotherapists and support with career development.&lt;br /&gt;&lt;br /&gt;&lt;br /&gt;As Nuffield Health continues to grow you can choose to develop your career within clinical roles or by moving into managerial positions. We support and encourage post-graduate education and have formed a partnership with Manchester Metropolitan University which will offer fantastic learning and research opportunities in the future.&lt;br /&gt;&lt;br /&gt;We want you to be the best you can be. We promise that we will support you with training opportunities, career development options and our unique health &amp; wellbeing focused benefits package. This includes free membership across all of our Fitness &amp; Wellbeing clubs, along with free private healthcare. Not only this but we also offer a range of lifestyle and financial wellbeing.&lt;br /&gt;&lt;br /&gt;We encourage flexible working and flexibility with shift patterns.&lt;br /&gt;&lt;br /&gt;Be your best and join us in building a healthier nation.&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;Location - Cheltenham Hospital&lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;Weekly Hours - Bank&lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;Contract Type - Bank&lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;Salary - Competitive / dependent on experience&lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;Closing date - 10/11/20&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Applications will be considered as they are received and interviews will be arranged accordingly. We reserve the right to close adverts early, for example, where we have received an unprecedented high volume of applications. Therefore please apply early to ensure you are considered for the post. &lt;/em&gt;&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/132134.jpg", "name": "Nuffield Health", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132134"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Cheltenham", "postalCode": "GL51 6SY"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.8919", "longitude": "-2.12975"}}, "title": "Bank Physiotherapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916224946", "validThrough": "2020-11-10T23:59:59+0000"}