{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 pa"}}, "datePosted": "2020-10-01T09:01:05+0100", "description": "&lt;h2&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Band 5 Staff Nurse/Theatre Practitioner/ODP&lt;/span&gt;&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;The trust is able to offer experience in a variety of specialties across the sites, all of which have their own specialist services. All levels of staff are friendly and welcoming and enjoy teaching staff new skills.&lt;/p&gt;\n&lt;p&gt;Heartlands is the Thoracic center for the Midlands and staff recently carried out the world’s second 3D printed custom built sternal implant with a successful outcome for the patient one month post-operatively.&lt;/p&gt;\n&lt;p&gt;In September 2015 Heartlands saw the opening of a £4.5million Vascular Hybrid Theatre. The use of modern, high tech equipment has resulted in improved procedure times for patients. The Hybrid Theatre is on of very few in the country where nurses routinely scrub for both open and endoscopic surgery rather than the traditional method of radiology scrubbing for the endoscopic part, thereby enhancing the scrub nurses skill. The Vascular Surgeons are world renowned for their complex surgery service, with patients traveling from far afield for their operations.&lt;/p&gt;\n&lt;p&gt;Heartlands has a 24/7 Emergency Theatre as well as providing a seven day Trauma service. Other specialities on site include ENT, Upper GI including Bariatric, Colorectal, Urology, Ophthalmology and Gynaecology&lt;/p&gt;\n&lt;p&gt;Solihull is a specialist Orthopaedic center and offers revision surgery for all joints. There is also a dedicated Ophthalmology theatre which offers patients cataract surgery plastics and reconstruction surgery. The first Dsaek corneal graft was also undertaken on the site. Solihull carries out a large number of day cases for Orthopaedics, Urology, Gynaecology, General Surgery, ENT and Max fax.&lt;/p&gt;\n&lt;p&gt;Good Hope has specialties in Breast Reconstruction Surgery and is a leading site for Cytoreductive Surgery for which we are one of only three in the country. Good Hope operates both elective Orthopaedic and Trauma lists as well as an Emergency Theatre. Our other specialties include Urology, including laser surgery, Gynaecology, Colorectal, Plastics, Ophthalmology and General Surgery. Good Hope built two new Laparoscopic Theatres which opened in 2013 and allowed all main theatres to be located within one unit, giving staff the opportunity to specialize in more than one area,&lt;/p&gt;\n&lt;p&gt;If you are an experienced ODP or recently qualified ODP or a keen experienced Theatre Nurse or newly qualified Nurse that has theatre experience/placement in the last 2 years, apply now.&lt;/p&gt;\n&lt;p&gt;Positions are available at Good Hope, Heartlands and Solihull sites. Staff will be based on one site, but will support the other sites depending on the needs of the service.&lt;/p&gt;\n&lt;p&gt;At University Hospitals Birmingham we support flexible working and welcome applications from nurses seeking flexible working opportunities and family friendly working hours.&lt;/p&gt;\n&lt;p&gt;For further information please contact: - Georgina Tain - 0121 42 47546&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120989.jpg", "name": "University Hospitals Birmingham (Heartlands, Good Hope, Solihull)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120989"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Birmingham", "postalCode": "B9 5SS"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4802", "longitude": "-1.82996"}}, "title": "Band 5 Staff Nurse/Theatre Practitioner/ODP", "url": "https://www.jobs.nhs.uk/xi/vacancy/916207574", "validThrough": "2020-12-31T23:59:59+0000"}