{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 per annum"}}, "datePosted": "2020-10-23T14:00:52+0100", "description": "&lt;p&gt;A key part of one of the largest specialist NHS Trusts in the country, the Principal Analytics Team has an ambitious strategy to deliver and implement fantastic analytical solutions that assist in the delivery of high quality care. We aim to become the best healthcare analytics team in the country and as such we are committed to delivering change and innovation throughout the organisation. You will play a key role in helping us to meet our aims.&lt;br /&gt;&lt;br /&gt;You’ll join an established team of Principal Analysts who have a great reputation for delivering high quality work. You’ll draw on your skills and knowledge of National Tariff and the NHS Business Rules to support your work and you’ll also be particularly knowledgeable regarding hospital activity planning, the hospital productivity and efficiency agenda, as well as key operational/clinical key performance indicators. It is also essential that you understand the impact of patient activity on income, together with relevant influencing factors. &lt;br /&gt;&lt;br /&gt;Focused, committed and organised, you’ll have sufficient relevant experience and qualifications together with a team orientated approach. Good leadership and communications skills are essential and you will be keen to make a difference at this exciting time of change for the Trust. Dedicated to your own personal and professional development, you will relish the opportunity to work at the cutting edge of healthcare and enhance your skills and experience – all with our full support.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameAlfie NelmesJob titleHead of Information ServicesEmail addressAlfie.nelmes@mft.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Manchester University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121137"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Based within Corporate Group Informatics Service with requirements to perform duties across all Trust Sites, Manchester", "postalCode": "M13 9WL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4625", "longitude": "-2.22771"}}, "title": "Principal Analyst", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240832", "validThrough": "2020-11-15T23:59:59+0000"}