{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum pro rata (plus HCAS)"}}, "datePosted": "2020-10-27T14:02:09+0000", "description": "&lt;p&gt;Redbridge Integrated Care Directorate invites applications for the post of Band 6 Occupational Therapist within the Community Recovery Service which incorporates community recovery and assertive outreach teams. The multi-disciplinary team provides secondary mental health services for clients in the London borough of Redbridge suffering from severe and enduring mental health difficulty. Occupational therapy has a key role to play within the team, taking the lead on promoting a recovery focussed culture and maintaining a strong network with other statutory and non-statutory services to enable improved social inclusion outcomes for service users.&lt;/p&gt;\n&lt;p&gt;A degree/diploma in Occupational Therapy is essential, along with registration with the HCPC confirming fitness to practice. Experience of working with clients who have mental health difficulties and an interest in this area alongside an understanding of recovery principles are also essential criteria for this position.&lt;/p&gt;\n&lt;p&gt;The post holder will work with other OT’s to provide specialist functional assessments including assessments of daily living skills using the Model of Human Occupational assessment tools to ascertain level of functional ability, related risk factors, level of support, and accommodation needs in order to implement community care plans, provide adaptive equipment and maintain a high standard of service user care. They will provide specialist recovery/vocational/social inclusion focused assessments and advice, with an emphasis on supporting clients with their employment, education and training goals.&lt;/p&gt;\n&lt;p&gt;The post holder would also be expected to lead on and deliver group programmes alongside other OT staff and to carry a generic caseload of care coordinated clients as a member of the multi-disciplinary team.&lt;/p&gt;\n&lt;p&gt;The post holder will benefit from regular professional supervision within the team. There is also an established monthly OT CPD network in the borough with opportunities to develop professionally alongside OTs from other mental health, community health and children’s health service settings. The post holder will be an active member of this group and have access to some profession specific training and development as well as mandatory and role specific CPD as provided through the team.&lt;/p&gt;\n&lt;p&gt;NELFT offers excellent opportunities for career development for occupational therapists across the range of services it operates and has well embedded systems of appraisal and professional support.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameArnold PerezJob titleClinical LeadEmail addressarnold.perez@nelft.nhs.ukTelephone number0300 300 1706Additional contact information&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NELFT NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120606"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Mellmead House, Wanstead", "postalCode": "E11 2DH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5838", "longitude": ".028749"}}, "title": "Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244858", "validThrough": "2020-11-22T23:59:59+0000"}