{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 Per annum pro rata for Part time"}}, "datePosted": "2020-11-03T10:46:44+0000", "description": "&lt;p&gt;John Ray Ward is looking for dynamic, motivated and experienced individuals who have an interest and/or passion for orthopaedic nursing to help lead our friendly orthopaedic team.&lt;/p&gt;\n&lt;p&gt;We are a 28 bedded ward with 5 &#39;day case&#39; trolley beds providing care to peri-operative patients who are undergoing both elective and trauma orthopaedic surgery. We are looking for organized, hard-working, flexible staff with excellent communication skills and a commitment to delivering high quality patient care.&lt;/p&gt;\n&lt;p&gt;Successful applicants will work within our senior team to provide a high standard of individualised care to patients, acting as a role model and supporting the Senior Sister in driving quality care provision forward&lt;/p&gt;\n&lt;p&gt;They will be required to work as part of a Multi-Disciplinary Team to assist in rehabilitating the patients with a variety of conditions from neck of femur fractures to spinal injuries to elective joint replacement surgery to ensure a smooth and effective discharge.&lt;/p&gt;\n&lt;p&gt;The MEHT orthopaedic department provides an opportunity of internal rotation between the three orthopaedic wards (trauma, elective and rehabilitation). This allows nursing staff to develop and deepen their knowledge of the orthopaedic patient.&lt;/p&gt;\n&lt;p&gt;Applicants must have at least 2 years post registration experience in an acute setting. Experience in the area of Orthopaedics is desirable, but not essential. We have a strong commitment to the personal and professional development of our staff, through support, individual appraisal, mentorship and clinical supervision. Senior Staff will also provide you with opportunities to explore your career pathways.&lt;/p&gt;\n&lt;p&gt;We also hold an annual ‘BONE’ day for all staff, a fun and educational day designed to develop team building skills, mix with colleagues from the other orthopaedic wards and celebrate the successes we have as a department.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameRebecca GhuskeJob titleSenior SisterEmail addressrebecca.ghuske2@meht.nhs.ukTelephone number01245 516298/516299Additional contact information&lt;/p&gt;\n&lt;p&gt;Rebecca Ghuske&lt;/p&gt;\n&lt;p&gt;Senior Sister&lt;/p&gt;\n&lt;p&gt;John Ray Ward&lt;/p&gt;\n&lt;p&gt;01245 516298&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121033.jpg", "name": "Mid and South Essex NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121033"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Broomfield Hospital, Chelmsford", "postalCode": "CM1 7ET"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7746", "longitude": ".465452"}}, "title": "Junior Sister - John Ray", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253537", "validThrough": "2020-11-17T23:59:59+0000"}