{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "36738", "minValue": "29888", "unitText": "YEAR", "value": "£29,888 - £36,738 per annum, inc HCA"}}, "datePosted": "2020-11-05T15:01:33+0000", "description": "&lt;p&gt;&lt;span&gt;King’s College Hospital NHS Foundation Trust part of King&#39;s Health Partners Academic Health Sciences Centre (AHSC), is one of the UK’s largest and busiest teaching hospitals with a turnover of nearly £1 billion, 1.5 million patient contacts a year and more than 12,600 staff based across 5 main sites in South East London and Kent.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Trust provides a full range of local hospital services across its different sites, and specialist services from King’s College Hospital (KCH) site in Camberwell and the Princess Royal University Hospital (PRUH) site in Bromley, Orpington Hospital, and some services at Beckenham Beacon and Queen Mary’s Sidcup.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Trust is recognised internationally for its work in liver disease and transplantation, neurosciences, cardiac, haemato-oncology, fetal medicine, stroke, major trauma, and Emergency Department.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We have three cardiovascular operating theatres. The service includes elective and emergency Cardiac, Thoracic and Vascular cases and TAVI procedures. You are expected to participate in the on call rota for emergency cardio-thoracic cases.&lt;br /&gt; &lt;br /&gt;At King’s we pride ourselves on the delivery of high standards of patient care. We are in search of practitioners who care about providing the highest standard of preoperative care to their patients and who have a genuine interest in developing their existing skills.&lt;br /&gt; &lt;br /&gt;King’s is an excellent place for you to continue to develop your existing scrub and circulating skills. We provide a supportive consolidation period for all our new starters.&lt;br /&gt; &lt;br /&gt;To be eligible for a band 5 scrub position, you must be a Registered Nurse with minimum 2 years scrub experience, preferably cardiac scrub skills.&lt;br /&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameKarissa Amor FabroJob titleClinical CoordinatorEmail addresskfabro@nhs.netTelephone number0203299937434Additional contact information&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Noryll Gimeno, Theatre Matron, 0203 299 5460, ngimeno@nhs.net&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "King's College Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120921"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Denmark Hill, London", "postalCode": "SE5 9RS"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4684", "longitude": "-.09228"}}, "title": "Theatre Practitioner/Staff Nurse - Cardiac Scrub", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258232", "validThrough": "2020-11-19T23:59:59+0000"}