{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 to £44,503 pa"}}, "datePosted": "2020-10-16T14:45:32+0100", "description": "&lt;p&gt;Forward Thinking Birmingham (FTB) is a ground-breaking mental health partnership established torevolutionize mental health care for 0-25 year olds. Integrating the expertise of Birmingham Women’s and Children’s NHS Foundation Trust (BWC) with the Priory Group, Beacon UK and The Children’s Society, a single point of access is available for GPs, schools, local authorities, children, young people, young adults and families, to a wide range of mental health support options. From flexible community and home-based support, to inpatient and urgent care, the service offers mental health support across the city.&lt;/p&gt;\n&lt;p&gt;Our vision is to be the first city where mental health problems are not a barrier to children, young people and young adults reaching their full potential and the mission is to exceed all expectations of what mental health services can achieve; resetting the bar for generations to come. To deliver this we require our workforce to have the skills, values and dedication to have a positive impact in this established and improving service.&lt;/p&gt;\n&lt;p&gt;Birmingham is a fantastic place to live and work and has been transformed over the last few years with developments such as Grand Central, the Bull Ring and Millennium Point. With more projects on the horizon such as HS2, further City regeneration and hosting the Common Wealth games in 2022, Birmingham is becoming one of the most vibrant cities in the World.&lt;/p&gt;\n&lt;p&gt;Culturally, there are a number of superb museums, art galleries, theatres and music venues. Birmingham has a strong gastronomy, as it is the only English city outside of London to have five Michelin star restaurants and is famous for it’s Balti Triangle. There are a range of lifestyle options from city apartments to suburbs with excellent housing and schools. The City also has a proud sporting history including Edgbaston cricket ground, Alexander Athletics stadium and Birmingham City and Aston Villa football clubs.&lt;/p&gt;\n&lt;p&gt;The population of Birmingham is the youngest and one of the most diverse in Europe and therefore FTB provides the very best possible experience of working with the client group. Alongside this experience we offer training and development based on both the needs of the service and the ambitions of the post holders.&lt;/p&gt;\n&lt;p&gt;Successful applicants will be employed by BWC.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120831.png", "name": "Birmingham Women's and Children's NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120831"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Birmingham", "postalCode": "B4 6NH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4852", "longitude": "-1.89446"}}, "title": "Clinical Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916230690", "validThrough": "2020-11-11T23:59:59+0000"}