{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 pro rata"}}, "datePosted": "2020-10-28T09:30:50+0000", "description": "&lt;p&gt;An exciting opportunity has arisen to recruit to a half time post (18.75 hours a week) for a Band 7 Practitioner Psychologist working as part of Brighton and Hove Specialist Community Disability Service (SCDS), an integrated Health and Social Care team. We are a friendly, forward thinking and innovative team, providing high quality support to individuals with learning disabilities. The role will be varied, but will focus on supporting adults with learning disabilities who have complex challenging behaviour, mental health needs or other issues relating to risk and vulnerability. The role will also be part of the wider team&#39;s goals to build service competency to meet the needs of adults with learning disabilities through training and consultation.&lt;/p&gt;\n&lt;p&gt;The role will play a fundamental part in the delivery of the service’s care pathways working closely with families, support services and other health and social care professionals. The post holder will carry out assessments, interventions, monitoring and evaluation of outcomes. A range of theoretical models is supported to ensure we deliver on the Transforming Care agenda for the people with the most complex of support needs. We would particularly encourage applications from psychologists who have an interest in developing their skills in systemic working and Positive Behaviour Support (PBS).&lt;/p&gt;\n&lt;p&gt;The post holder will be part of a dynamic and supportive multi-disciplinary team (including Clinical Psychologists, Behaviour Support Team and Psychotherapist) and will join an active Sussex-wide psychology group with good opportunities for peer support and CPD. The service has a strong history of valuing and developing services for this client group.&lt;/p&gt;\n&lt;p&gt;We actively encourage applications from final year trainees and those who have recently qualified, who are either seeking part-time work, or would like a split post, between Learning Disability and another Care group. We are keen to support newly qualified psychologists with their transition into their first post and additional support will be given, especially in light of the current pandemic. We have processes already in place for people to start with us prior to HCPC registration and we would work hard to support people with any outstanding requirements of their training. We offer a lot of support and flexibility to individuals in relation to remote working and the wider Covid19 landscape.&lt;/p&gt;\n&lt;p&gt;We will be open to considering remote working options for at least part of the hours.&lt;/p&gt;\n&lt;p&gt;Interviews will be held over Skype or MS Teams and are likely to be on Thursday 19th November 2020.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDr Nicky GregoryJob titleConsultant Clinical PsychologistEmail addressnicky.gregory@sussexpartnership.nhs.ukTelephone number07392 195140&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121074.jpg", "name": "Sussex Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121074"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wellington House, Brighton", "postalCode": "BN2 3AX"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8322", "longitude": "-.123457"}}, "title": "Practitioner Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245807", "validThrough": "2020-11-11T23:59:59+0000"}