{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Bank"}}, "datePosted": "2020-10-28T13:48:23+0000", "description": "&lt;p&gt;University College London Hospitals NHS Foundation Trust (UCLH), situated in the West End of London, is one of the largest NHS foundation trusts in the United Kingdom and provides first class acute and specialist services to patients both locally and from throughout the UK and abroad.&lt;/p&gt;\n&lt;p&gt;The Acute Hospital Board incorporates the specialties of Critical Care and Theatres, Outpatient and Imaging, Pathology, Emergency Services, Medicine and Therapies, Surgery, lead by the Medical Director.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;PHARMACY DEPARTMENT&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;UCLH Pharmacy provides a comprehensive array of services with the overall aim of ensuring safe, effective and economical use of medicines throughout the Trust, and supporting education, training and research. Pharmacy is closely involved in all stages of medicines use, from negotiating contracts for the purchase of medicines through to assessing the outcomes of medicines in the clinical setting, and across all stages in-between.&lt;/p&gt;\n&lt;p&gt;The UCLH Pharmacy Department has close working relationships with the local hospital pharmacy departments at the Royal Free and The Whittington Hospitals. This relationship has resulted in centralisation of some key backroom operational services such as manufacturing, repacking and education &amp; training, whilst focusing local clinical services directly towards improving patient care&lt;/p&gt;\n&lt;p&gt;JOB PURPOSE&lt;/p&gt;\n&lt;p&gt;To ensure that medicines are ordered and supplied in a correct, optimal and timely manner&lt;/p&gt;\n&lt;p&gt;To undertake duties as part of the pharmacy team&lt;/p&gt;\n&lt;p&gt;To support and complement the work of other members in the team in the interests of patients&lt;/p&gt;\n&lt;p&gt;KEY RESULT AREAS&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Dispensary&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ol&gt;\n&lt;li&gt;To dispense medicines in an accurate and timely manner for inpatients and outpatients of the trust as directed by senior technicians using the pharmacy computer system and automated dispensing devices where in place.&lt;/li&gt;\n&lt;/ol&gt;&lt;ol&gt;\n&lt;li&gt;To answer the telephones in a prompt and courteous manner&lt;/li&gt;\n&lt;/ol&gt;&lt;ol&gt;\n&lt;li&gt;To cover the Outpatient reception receiving prescriptions, checking payment exemptions and taking payment where appropriate&lt;/li&gt;\n&lt;/ol&gt;&lt;ol&gt;\n&lt;li&gt;To ensure all filing of prescriptions and other documentation is complete&lt;/li&gt;\n&lt;/ol&gt;&lt;ol&gt;\n&lt;li&gt;To ensure all work is logged into the pharmacy logging system&lt;/li&gt;\n&lt;/ol&gt;&lt;ol&gt;\n&lt;li&gt;To ensure all medicines delivered to wards are placed in sealed bags to ensure security in the transport of medicines within the hospital&lt;/li&gt;\n&lt;/ol&gt;&lt;ol&gt;\n&lt;li&gt;To print off electronic discharges&lt;/li&gt;\n&lt;/ol&gt;&lt;ol&gt;\n&lt;li&gt;To ensure that the dispensary has adequate supplies of medicine bottles, bags spoons, measures and syringes.&lt;/li&gt;\n&lt;/ol&gt;\n&lt;p&gt;&lt;strong&gt;Stock Management Duties&lt;/strong&gt;&lt;/p&gt;\n&lt;ol&gt;\n&lt;li&gt;To participate in the ward top up service and the direct distribution of IV fluids&lt;/li&gt;\n&lt;/ol&gt;&lt;ol&gt;\n&lt;li&gt;To assist with the ordering, receipt and issue of stock items to wards and departments using the pharmacy computer system&lt;/li&gt;\n&lt;/ol&gt;&lt;ol&gt;\n&lt;li&gt;To record the receipt of ward/department stock deliveries from Pharmacy Business and Distribution Centre&lt;/li&gt;\n&lt;/ol&gt;&lt;ol&gt;\n&lt;li&gt;To return stock and or disposal of returned items following departmental procedures&lt;/li&gt;\n&lt;/ol&gt;&lt;ol&gt;\n&lt;li&gt;To put away Dispensary stock drugs, according to departmental procedures of stock rotation&lt;/li&gt;\n&lt;/ol&gt;\n&lt;p&gt;To maintain stock levels in the emergency and accident and emergency cupboards&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Education and Training&lt;/strong&gt;&lt;/p&gt;\n&lt;ol&gt;\n&lt;li&gt;To participate in in-house education and training&lt;/li&gt;\n&lt;/ol&gt;&lt;ol&gt;\n&lt;li&gt;Attend appropriate study days&lt;/li&gt;\n&lt;/ol&gt;&lt;ol&gt;\n&lt;li&gt;To support the development and training of new members of staff&lt;/li&gt;\n&lt;/ol&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Other Duties&lt;/strong&gt;&lt;/p&gt;\n&lt;ol&gt;\n&lt;li&gt;To understand and follow all departmental standard operating procedures at all times&lt;/li&gt;\n&lt;/ol&gt;&lt;ol&gt;\n&lt;li&gt;To observe safe working practices at all times to minimise risk to self, other staff and visitors to the Trust&lt;/li&gt;\n&lt;/ol&gt;&lt;ol&gt;\n&lt;li&gt;To maintain high standards of cleanliness and tidiness in all working areas at all times&lt;/li&gt;\n&lt;/ol&gt;&lt;ol&gt;\n&lt;li&gt;To participate in a system of performance review&lt;/li&gt;\n&lt;/ol&gt;&lt;ol&gt;\n&lt;li&gt;To attend departmental meetings as required including the weekly departmental briefing&lt;/li&gt;\n&lt;li&gt;To participate in weekend and Bank Holiday duties pro rata&lt;/li&gt;\n&lt;/ol&gt;&lt;ol&gt;\n&lt;li&gt;To help with making deliveries from the Pharmacy department to wards and other clinical areas when necessary in a safe, secure and timely manner&lt;/li&gt;\n&lt;/ol&gt;&lt;ol&gt;\n&lt;li&gt;To prepare emergency drug boxes, replenish used/expired boxes to wards/departments and maintain appropriate records&lt;/li&gt;\n&lt;/ol&gt;&lt;ol&gt;\n&lt;li&gt;To participate in duties at any location within the Trust in order to meet service needs as required by the Head of Pharmacy&lt;/li&gt;\n&lt;/ol&gt;&lt;ol&gt;\n&lt;li&gt;To ensure equipment used in the dispensary is clean and ready for everyday use&lt;/li&gt;\n&lt;/ol&gt;&lt;ol&gt;\n&lt;li&gt;To take personal responsibility for promoting a safe environment and safe patient care by identifying areas of risk and following the Incident, Serious Incidents and Near Misses reporting policy and procedure.&lt;/li&gt;\n&lt;/ol&gt;&lt;ol&gt;\n&lt;li&gt;Participate in the late duty day rota.&lt;/li&gt;\n&lt;/ol&gt;\n&lt;ul&gt;\n&lt;li&gt;To be aware of and adhere to: UCLH Trust policies and procedures;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Section 7 and 8 of the Health and Safety at Work Act;&lt;/p&gt;\n&lt;p&gt;Data Protection Act 1984&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ol&gt;\n&lt;li&gt;Any other relevant legislation and agreed practice/policy.&lt;/li&gt;\n&lt;/ol&gt;&lt;ol&gt;\n&lt;li&gt;UCL Hospitals NHS Trust has adopted an Equality &amp; Diversity Policy and specific regard should be taken of its contents in relation to the treatment of employees or potential employees.&lt;/li&gt;\n&lt;/ol&gt;&lt;ol&gt;\n&lt;li&gt;This job description is not intended to be exhaustive and it is likely that duties may be altered from time to time in the light of changing circumstances, in discussion with the post holder.&lt;/li&gt;\n&lt;/ol&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "University College London Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120731"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "UCLH, London", "postalCode": "NW1 2BU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5249", "longitude": "-.136987"}}, "title": "Bank Distribution/Repack Pharmacy Assistant Band 2", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246840", "validThrough": "2020-11-27T23:59:59+0000"}