{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "per annum"}}, "datePosted": "2020-11-05T08:30:43+0000", "description": "&lt;p&gt;In response to the Primary Care Transformation for Mental health, Essex Partnership University Foundation Trust (EPUT), in collaboration with our local CCG and GP’s are working to create Enhanced Primary Care Team’s as part of a new approach to the delivery of Primary Care Services within South West Essex. The key principle of the team is to offer primary mental health interventions within primary care using a holistic and recovery approach whilst promoting parity of esteem for mental health service users.&lt;/p&gt;\n&lt;p&gt;There is a clear focus on prevention, early detection and intervention. This approach allows for new roles to complement the existing traditional General Practice roles in managing more patients at the point of contact. The vision is to complement and support already designed Primary Care Networks for those service users with mental health issues within primary care setting.&lt;/p&gt;\n&lt;p&gt;The Primary Care Networks have a skill mix which is designed based on a local population needs assessment and may consist of Physiotherapists, Clinical Pharmacists, Advanced Nurse Practitioners, Physicians Assistants, Community Psychiatric Nurses, Paramedics, Care Navigators and Social Prescribers.&lt;/p&gt;\n&lt;p&gt;We are seeking an enthusiastic individual whose nominal base will be Grays Hall to take on the role of Team Manager for Thurrock Primary Care Mental Health Service, working across the locality Primary Care Networks. The post holder will be responsible for providing high quality, effective leadership and management of a service which is committed to being patient focused, preventative and has recovery-based approach.&lt;/p&gt;\n&lt;p&gt;To apply you must:&lt;/p&gt;\n&lt;p&gt;- Have experience of working in or delivering community mental health services.&lt;/p&gt;\n&lt;p&gt;- Be an experienced leader, Band 7 or above.&lt;/p&gt;\n&lt;p&gt;- Be able to work independently using own initiative.&lt;/p&gt;\n&lt;p&gt;- Be able to work as part of a team.&lt;/p&gt;\n&lt;p&gt;- Be an excellent communicator (written and spoken)- Have the willingness to learn and deliver formal / informal teaching sessions.&lt;/p&gt;\n&lt;p&gt;- Have good IT skills with experience of using SystmOne.&lt;/p&gt;\n&lt;p&gt;- Have the ability to lead and manage the development of a new service.&lt;/p&gt;\n&lt;p&gt;- Have the ability to travel across the locality for service delivery.&lt;/p&gt;\n&lt;p&gt;- Meet the requirements of the person specification as outlined in the job description&lt;/p&gt;\n&lt;p&gt;The post holder will be expected to line manage and provide clinical supervision for Senior Primary Care Mental Health Nurses; supported by the Service Manager for South West Essex Community Mental Health. The role also requires you to work closely with GPs and other staff within the Primary Care Networks, Patient Participation Groups, Community Mental Health Teams, and Local Authority, other statutory and voluntary services.&lt;/p&gt;\n&lt;p&gt;If you are highly motivated and committed with a strong desire to succeed and help to continue to develop a recovery focused service then you could be the person we are looking for. In return we offer a friendly, supportive working&lt;/p&gt;\n&lt;p&gt;In return of your commitment, the Trust offers a wide range of training opportunities and career development.&lt;/p&gt;\n&lt;p&gt;EPUT are looking for motivated staff who shares our Trust values of Open, Compassionate and Empowering. In return, EPUT can offer you a range of benefits and development including;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Season Ticket Loans&lt;/li&gt;\n&lt;li&gt;NHS discounts for staff&lt;/li&gt;\n&lt;li&gt;Excellent Training facilities and opportunities&lt;/li&gt;\n&lt;li&gt;Buying and Selling annual leave scheme&lt;/li&gt;\n&lt;li&gt;The opportunity to work bank shifts and expand knowledge and experience in other areas&lt;/li&gt;\n&lt;li&gt;Salary Sacrifice schemes including lease cars and Cycle to Work&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Informal queries and visits are welcome&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameMatt AuckburallyJob titleService ManagerEmail addressmamade.auckburally@nhs.netTelephone number01702 538289&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120994.jpg", "name": "Essex Partnership University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120994"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Grays Hall, Grays", "postalCode": "RM17 5TT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4813", "longitude": ".330414"}}, "title": "Thurrock Mental Health Primary Care Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256932", "validThrough": "2020-11-23T23:59:59+0000"}