{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 p.a. / pro rata for part-time"}}, "datePosted": "2020-11-03T12:46:45+0000", "description": "&lt;p&gt;We have an exciting opportunity to join our nursing team at the Yeatman Hospital, Sherborne. The Yeatman Hospital is a busy community hospital with in-patient wards, Day Surgery Unit, Out-patient department and various community services based within our hub on site. This post is within our in-patient wards; we currently have 2 wards, Rowan and Beech. Beech ward has 15 beds which are for elderly rehabilitation, both medical &amp; surgical rehabilitation and we admit patients directly from home that require short term rehab. Rowan ward has 11 beds which currently is a dedicated Stroke rehabilitation unit (new unit commenced in August 2020) and this is a joint venture with Dorset County Hospital in Dorchester. Each ward has a palliative care bed, offering end of life care. It is a very exciting time at the Yeatman with the development of many services so we offer plenty of opportunities to develop your nursing skills.&lt;/p&gt;\n&lt;p&gt;There are various hours available from full or part time. If you are patient-centred, committed to delivering high quality care, have excellent clinical and communication skills, a &#39;can do&#39; attitude and a desire to be the best then this is the job for you. Come and join us.&lt;/p&gt;\n&lt;p&gt;Employment in this post requires an Enhanced Disclosure and Barring Service (DBS) check. The DBS levies a charge of £40 and the Trust will recover this cost in instalments from your first 3 salary payments. This will only apply to candidates who are new to the Trust and not internal staff.&lt;/p&gt;\n&lt;p&gt;Applicants who subscribe to the DBS update service and are able to present a valid DBS certificate will not incur a charge.&lt;/p&gt;\n&lt;p&gt;We would welcome applications from newly qualified nurses and we provide a very comprehensive and fully supported Preceptorship Programme for newly qualified healthcare professionals.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Recommend a friend or family member and earn cash!&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Do you have a friend or family member you would recommend to join us? Or do you know someone who wants to return to practice in the NHS? If the person you refer is appointed by the Trust and completes their probationary period you will receive £250 reward payment for the introduction! Please contact the recruitment team if you require further info!&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Barbara Ludlow Job title: Senior Sister&lt;/p&gt;\n&lt;p&gt;Email address: barbara.ludlow@nhs.net Telephone number: 01305 361546&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121022.png", "name": "Dorset HealthCare University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121022"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Sherborne, Dorset", "postalCode": "DT9 3JU"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.9497", "longitude": "-2.51984"}}, "title": "Staff Nurse, Band 5", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254040", "validThrough": "2020-11-17T23:59:59+0000"}