{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum pro rata"}}, "datePosted": "2020-10-29T17:01:40+0000", "description": "&lt;p&gt;Would you like to work in a challenging environment where no two days are the same?&lt;/p&gt;\n&lt;p&gt;if this sounds appealing, the Emergency Department is for you. We currently have permanent full time and part time vacancies.&lt;/p&gt;\n&lt;p&gt;The role entails assessing, planning, implementing and evaluating high quality care for patients of all ages in a busy environment. The department receives Medical, Surgical, Orthopaedic, ENT and Gynecological emergencies, specialty doctors are available on site. Trauma patients are brought to the department, stabilised and maybe transferred to other hospitals.&lt;/p&gt;\n&lt;p&gt;The Emergency Department is currently undergoing a service redesign as we integrate with local Urgent Care, Acute Medical Unit provision, therefore there will be opportunity for role development as we work towards a team of expert practitioners to enhance the patients journey of emergency and unscheduled care throughout the combined workforce. &lt;span&gt;The post holder will be part of a combined multi-skilled workforce working support Emergency Department, Acute Medical Unit and Same Day Emergency Care. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;The successful candidate will be required to work shifts on days and nights.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;span&gt;For Informal Enquiries Contact: Andrea Whitehouse Ward Manager 01325 743481.&lt;/span&gt;&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120665.JPG", "name": "County Durham and Darlington NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120665"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Darlington", "postalCode": "DL3 6HX"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.5318", "longitude": "-1.56468"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249195", "validThrough": "2020-11-26T23:59:59+0000"}