{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "49325", "minValue": "43712", "unitText": "YEAR", "value": "£43,712 - £49,325 (Eqv. B7)"}}, "datePosted": "2020-10-30T11:56:30+0000", "description": "&lt;h2&gt;&lt;strong&gt;Highly Specialist Physiotherapist (&lt;/strong&gt;&lt;strong&gt;Equiv. to Band 7): Neurorehabilitation&lt;/strong&gt;&lt;strong&gt;&lt;br /&gt;&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;strong&gt;Full Time: 37.5 hours per week - Permanent&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary: £43,712 - £49,325 per annum (dependent on experience and inclusive of Outer London Weighting)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for a Highly Specialist Physiotherapist to join the therapy team within our service for children with acquired brain injuries or complex medical needs. You will provide high quality, evidence based physiotherapy for children and young people with neurodisabilities. You will hold a very small caseload, which afford the time for in depth assessment, intensive therapy, family training and support and coordinated team working with an extensive MDT.&lt;/p&gt;\n&lt;p&gt;The Children’s Trust provides specialist neurorehabilitation and step down-care for children and young people from around the UK. Therapy services are integrated around children and families with the aim of promoting participation and function. Recent developments include a wide-ranging sports offer and use of technology to support therapy.&lt;/p&gt;\n&lt;p&gt;The service offers generous CPD support and a range of opportunities to be involved in research and quality improvement projects with the support of our internal Research Team. You will also have opportunities be actively involved in new and innovative service development projects. As well as providing supervision for other physiotherapists, students and technicians, you will be able to support the wider MDT including therapists and nurses and carers to enable a team around the child approach to rehabilitation.&lt;/p&gt;\n&lt;p&gt;If you would like to &lt;strong&gt;discuss the role&lt;/strong&gt; please contact the &lt;strong&gt;People Operations Team&lt;/strong&gt;, email: recruitment@thechildrenstrust.org.uk or our Head of Therapy Rehabilitation email: stuppeny@thechildrenstrust.org.uk&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing Date&lt;/strong&gt;: 15th November 2020&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview Date(s)&lt;/strong&gt;: To be confirmed.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Strictly no agencies please.&lt;/span&gt;&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Children’s Trust is the UK’s leading charity for children with acquired brain injury, providing expert rehabilitation, education, therapy and care at our national specialist centre in Tadworth, and to children and their families across the UK, via our Brain Injury Community Service.&lt;/p&gt;\n&lt;p&gt;Boasting a beautiful 24-acre site in Surrey, we are located just outside of London, close to the M25 (accessible via Junction 8, A217 to Tadworth) and easily accessible via National Rail, by way of: Clapham Junction, Sutton and Epsom.&lt;/p&gt;\n&lt;p&gt;The work we do is highly rewarding, and in addition to an attractive salary, we offer a valuable range of benefits, including: free on-site parking; subsidised cafeteria; on-site staff accommodation (subject to availability); the ability to retain your NHS pension (where applicable) or the opportunity to join an alternative scheme; and the opportunity to develop and implement your expertise in an environment that is as unusual in its beautiful historic nature, as it is unique in its state-of-the-art facilities.&lt;/p&gt;\n&lt;p&gt;The Children’s Trust is fully committed to protecting children and young people. All posts at The Children&#39;s Trust are subject to an enhanced DBS check. If you are applying to The Children&#39;s Trust, and are already registered with the DBS update service, this will speed up the recruitment process significantly. We are an equal opportunities employer, and welcome applications from all suitably qualified candidates, regardless of their race, sex, disabilities, religion/beliefs, sexual orientation, or age.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "The Children's Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128594"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Tadworth, Surrey", "postalCode": "KT20 5RU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.295", "longitude": "-.226042"}}, "title": "Highly Specialist Physiotherapist: (Equiv B7) Neurorehabilitation", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250046", "validThrough": "2020-11-15T23:59:59+0000"}