{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "120000", "minValue": "86000", "unitText": "YEAR", "value": "£86,000 - £120,000 per annum, pro rata"}}, "datePosted": "2020-10-28T15:01:30+0000", "description": "&lt;p&gt;&lt;strong&gt;General Practitioners (GP) – Community&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Salary £86k to £120k per annum for 37.5 hours per week&lt;/p&gt;\n&lt;p&gt;Part time posts available, flexible working options&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Fixed Term Winter Contracts (3 months - until 31st March 2021)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Louth, Skegness or Spalding (Johnson Community) Community Hospitals&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Are you a GP looking for a different way of working?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are Lincolnshire Community Health Services NHS Trust (LCHS), the primary community healthcare provider in Lincolnshire delivering community-based services aimed to support people to manage their own health closer to home, both in the community and in our nurse led inpatient units.&lt;/p&gt;\n&lt;p&gt;We care for thousands of patients every day, in partnership with other health and social care services, to deliver joined-up care in community settings. The intention is to provide good out of hospital care and avoid admissions into acute hospitals.&lt;/p&gt;\n&lt;p&gt;By providing community-based services aimed at preventing health problems from getting worse, we help to reduce the need for people to go into hospital.&lt;/p&gt;\n&lt;p&gt;We are looking for proactive, dedicated and dynamic individuals who can be part of a fast- moving, innovative and ambitious team, dedicated to supporting members of our communities to manage their own health at home and reduce the need to go into hospital.&lt;/p&gt;\n&lt;p&gt;We are rated ‘Outstanding’ by the Care Quality Commission (only 4 community trusts in the country who are) and are playing an integral part in shaping future health service provision countywide alongside partner health and social care organisations.&lt;/p&gt;\n&lt;p&gt;We currently are looking for outstanding, committed GPs to support our Community Hospitals services due to expansion of beds and services over this winter – we have opportunities to suit everyone and these can be discussed individually with candidates!&lt;/p&gt;\n&lt;p&gt;Just a flavour of these roles:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;We have four community hospital sites across Lincolnshire providing inpatient care. Our care pathways include Palliative care and end of life; rehabilitation (this includes stroke patients stepping down from acute care; and transitional care (which includes avoiding admission into acute hospitals, and recuperation and recovery for patients having had an acute hospital stay).&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Welland Ward and the Tulip Suite: are located in Johnson Community Hospital, Spalding and is a 32 bed unit. The four beds on the Tulip suite are dedicated to palliative and end of life care.&lt;/p&gt;\n&lt;p&gt;Archer Ward and Archer Assessment Unit: are located in Louth County Hospital, Louth and has 39 beds across two wards.&lt;/p&gt;\n&lt;p&gt;Gloucester and Scarborough Wards: are located in our Skegness Hospital, Gloucester Ward has 24 beds and Scarborough Ward has 16 beds, two of which are dedicated to palliative and end of life care.&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;You will work as part of a multidisciplinary team with our advanced clinical practitioners and trainee advanced clinical practitioners.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;In return, we can offer you:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Bespoke GP salary package of up to £120k&lt;/li&gt;\n&lt;li&gt;Supporting Professional Activity – 1 x SPA session per week pro rata&lt;/li&gt;\n&lt;li&gt;Study leave including mandatory training + 4 additional days to suit staff member pro rata&lt;/li&gt;\n&lt;li&gt;Outstanding CQC rating&lt;/li&gt;\n&lt;li&gt;Flexible working patterns&lt;/li&gt;\n&lt;li&gt;Varied, interesting and challenging work&lt;/li&gt;\n&lt;li&gt;Medical leadership structure to provide support and mentoring&lt;/li&gt;\n&lt;li&gt;Free medical indemnity cover&lt;/li&gt;\n&lt;li&gt;Dedicated career pathways&lt;/li&gt;\n&lt;li&gt;Monthly pay plus enhancements for night, weekend and bank holiday working&lt;/li&gt;\n&lt;li&gt;NHS Pension scheme&lt;/li&gt;\n&lt;li&gt;Health &amp; Wellbeing service&lt;/li&gt;\n&lt;li&gt;Holiday pay of up to 33 days, plus bank holidays pro rata, dependent on service&lt;/li&gt;\n&lt;li&gt;NHS discounts&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Not only will you have the opportunity to flourish in a successful NHS Trust, Lincolnshire offers some of the best schools in the country, affordable housing, and a world class golf course in Woodhall Spa and a great standard of living in one of the many picturesque market towns, villages or a thriving city.&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Low cost of living/house prices – Rightmove Lincolnshire&lt;/li&gt;\n&lt;li&gt;Excellent schools – Schools in Lincolnshire&lt;/li&gt;\n&lt;li&gt;City, Countryside, Coast – Visit Lincoln&lt;/li&gt;\n&lt;li&gt;Direct rail connections by LNER, East Midlands Railway and Northern Rail&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;LCHS Way&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We Listen, We Care, We Act, We Improve&lt;/p&gt;\n&lt;p&gt;We listen: we engage with everyone we work with, we are united, we are always positive&lt;/p&gt;\n&lt;p&gt;We care: everyone is valued, respected and developed, knowledge and skills are nurtured, success is celebrated&lt;/p&gt;\n&lt;p&gt;We act: clear goals and right resources, freedom coupled with accountability, emphasis on simplicity&lt;/p&gt;\n&lt;p&gt;We improve: we are creative, resourceful and innovative, integrated and collaboration is the way forward, we’re always striving to do better&lt;/p&gt;\n&lt;p&gt;....Fit for now, fit for the future.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;How to Apply?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;To view the full advert and job description which includes specific details regarding the role, or apply for any of our medical vacancies please visit our website,&lt;/p&gt;\n&lt;p&gt;If you would like to discuss further or to arrange a visit, please contact;&lt;/p&gt;\n&lt;p&gt;Dr Janine Elson, Deputy Medical Director at janine.elson@nhs.net&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/127394.png", "name": "Lincolnshire Community Health Services NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127394"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Louth, Spalding, Skegness Community Hospital. Urgent Treatment centre Skegness and OOH Spalding and Stamford, Skegness and others", "postalCode": "PE25 2BS"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.145", "longitude": ".332188"}}, "title": "General Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247095", "validThrough": "2020-11-09T23:59:59+0000"}