{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "35207", "minValue": "28691", "unitText": "YEAR", "value": "£28,691 - £35,207 Competitive Bank Rates"}}, "datePosted": "2020-10-29T16:46:12+0000", "description": "&lt;p&gt;&lt;strong&gt;HM YOI Feltham and IRC Heathrow - &lt;/strong&gt;&lt;strong&gt;Offender Care Bank &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;BANK – Paramedic – Offender Care&lt;/p&gt;\n&lt;p&gt;Looking for a new challenge and the ability to extend skills and competencies in an environment that is different from the everyday, then offender care is for you. Prisons/IRC’s are among the most challenging, yet rewarding places for healthcare professionals to work. Working alongside nurses and other healthcare professionals, a bank contract gives the flexibility to fit in with other commitments but also gives you access to training and potential new career pathways.&lt;/p&gt;\n&lt;p&gt;The role of the paramedic in the Offender care is relatively new however it has been very well received from healthcare colleagues and prison staff alike. The unique skills of our paramedics to take charge of the scene with authority has provided staff and patients with a sense of assurance and confidence in the care being given.&lt;/p&gt;\n&lt;p&gt;As an offender care paramedic you will be required to work within the prison /IRC Healthcare Centre and on the Wings within the establishments as key member of the broader primary care team. You will be delivering a wide range of services including high quality emergency care, minor injury treatment, medication administration and healthcare promotion. Treating more than just symptoms looking past how the person has ended up in their situation and providing high quality holistic patient care.&lt;/p&gt;\n&lt;p&gt;Providing for the physical and mental health needs of offenders is paramount, being able to assess patients, plan their care, administer treatment and discharge them or refer them as appropriate to a wide range of healthcare professionals on site or to external agencies. The advantage of being involved so closely in the care is that you get to follow up on the decisions made, getting the feedback, unlike just handing over to an emergency department then moving on to the next job, so enabling you to gain the knowledge that you have made a difference to their life.&lt;/p&gt;\n&lt;p&gt;While we are looking to recruit bank staff for HM YOI Feltham and IRC Heathrow by joining the CNWL Offender Care bank you would be able to work across multiple sites.&lt;/p&gt;\n&lt;p&gt;CNWL run healthcare services if the following sites&lt;/p&gt;\n&lt;p&gt;HM YOI Feltham&lt;/p&gt;\n&lt;p&gt;IRC Heathrow&lt;/p&gt;\n&lt;p&gt;HMP Highdown&lt;/p&gt;\n&lt;p&gt;HMP Downview&lt;/p&gt;\n&lt;p&gt;HMP Coldingly&lt;/p&gt;\n&lt;p&gt;HMP Send&lt;/p&gt;\n&lt;p&gt;HMP Woodhill&lt;/p&gt;\n&lt;p&gt;All appointments are subject to successful prison or IRC vetting processes. Please read below for more information regarding the IRC vetting process.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Requirements for All Staff wishing to apply for Healthcare Roles at Heathrow Immigration Removal Centre (HIRC)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Please be aware that anyone wishing to work at &lt;strong&gt;HIRC&lt;/strong&gt; is required to undergo and successfully pass the following checks prior to being offered a substantive or bank role with CNWL at the HIRC.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Immigration Centre Security Checks&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Counter Terrorism Check (CTC) – several forms need to be completed for these checks which are carried out by Cataphract on behalf of CNWL. These forms are then submitted to the Home Office who will send you a link to complete an on-line questionnaire. On completion of this, security checks are undertaken by their various teams&lt;/p&gt;\n&lt;p&gt;You must be able to confirm that you have:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;been resident in the UK for 3 years immediately prior to your application for roles Band 5 and below&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;OR&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;been resident in the UK for 5 years immediately prior to your application for roles Band 5 and above&lt;/li&gt;\n&lt;li&gt;hold a British passport, EU passport or Commonwealth passport with a Biometric Residence Permit that has no restrictions and usually has “indefinite leave to remain”&lt;/li&gt;\n&lt;li&gt;Indefinite leave to remain in the UK&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Enhanced DBS – this is required as part of the CTC checks&lt;/p&gt;\n&lt;p&gt;Please note that CNWL currently pays for the cost of these checks for substantive and bank staff&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;CTC Renewal&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Your CTC clearance will expire after 5 years, so you will be asked to provide information to renew your existent clearance by Cataphract. Again, CNWL currently pays for this for substantive and bank staff.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameAnnemarie Carter – HM YOI FelthamAdditional contact information&lt;/p&gt;\n&lt;p&gt;Annemarie Carter – HM YOI Feltham , ann-marie.carter2@nhs.net, 02088445234&lt;/p&gt;\n&lt;p&gt;Rita Lankai-Lamptey – IRC Heathrow, rita.lankai-lamptey@nhs.net,&lt;/p&gt;\n&lt;p&gt;Stella Simpson – Regional Manager – Youth Custody stellasimpson@nhs.net, 07720809443&lt;/p&gt;\n&lt;p&gt;Susan Bell – Regional Manager – IRC’s, susan.bell2@nhs.susan.bell2@nhs.net,&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "Central and North West London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120736"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "HMP Feltham/Heathrow IRC, Outer London", "postalCode": "TW13 4NP"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4417", "longitude": "-.434392"}}, "title": "Paramedic - Bank Staff (Covid-19 Response)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249149", "validThrough": "2020-11-12T23:59:59+0000"}