{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 £82,096 - £110,683"}}, "datePosted": "2020-10-09T11:01:50+0100", "description": "&lt;p&gt;&lt;span&gt;This is an exciting opportunity for an exceptional candidate to help shape the future direction of the ophthalmic services at the Oxford Eye Hospital and develop a career pathway enabling clinical, academic and teaching aspirations in a centre of excellence.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Oxford Eye Hospital works closely with the University of Oxford, currently&lt;br /&gt;the leading university in the world, thus conferring a wide range of opportunities for collaborations in research and teaching. The post holder would have the opportunity to work in a vibrant and exciting environment within a dynamic consultant team in one of the most attractive cities in the UK, and to be part of shaping a new planned state-of-the-art Oxford Eye Hospital.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are looking for an enthusiastic and highly motivated Consultant Ophthalmologist to join our established team of 19 Consultants and work in the Eye Emergency Department.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Oxford Eye Hospital provides an eye emergency service to the Oxfordshire Population and the wider Thames Valley. We expedite diagnosis and management of otherwise sight-and life threatening conditions by providing rapid access to a Consultant-led Multidisciplinary team. This post is to expand the Consultant Cover, training and supervision of Junior Doctors and Allied Health Professionals and to improve the efficiency of the &lt;br /&gt;department. The post is based at the John Radcliffe Hospital which is a neurosciences centre including neuroradiology as well as a children’s hospital, cancer centre, trauma centre. This post includes a theatre session and peripheral clinic sessions and participating in the consultant on call rota.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Applicants must be on the GMC specialist register or be within 6 months of doing so at the time of the interview. Applications from those wishing to work part-time or job share are welcomed.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;A complimentary sub-specialty interest would be welcomed.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Please note that only electronic applications can be accepted for this post.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Candidates are highly recommended to visit the department and hospital and are invited to contact Mrs. Hornby Clinical Lead and Consultant in Emergency Eye Care &amp; Primary Care Ophthalmology via email on stella.hornby@ouh.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Oxford University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120889"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Ophthalmology - Medical A68800, Oxford", "postalCode": "OX3 9DU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7639", "longitude": "-1.21979"}}, "title": "Ophthalmology Consultant specialising in Eye Emergency &amp; Primary Care", "url": "https://www.jobs.nhs.uk/xi/vacancy/916219871", "validThrough": "2020-11-08T23:59:59+0000"}