{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44780", "minValue": "37638", "unitText": "YEAR", "value": "£37,638 - £44,780 p.a. inc HCA"}}, "datePosted": "2020-11-06T09:46:06+0000", "description": "&lt;p&gt;Clinical Research Nurse – Band 6 - Infection&lt;/p&gt;\n&lt;p&gt;Our Centre for Clinical Infection and Diagnostics Research is a research facility set up as a joint initiative by Guy&#39;s and St Thomas&#39; NHS Foundation Trust and King&#39;s College London. We conduct research that improves the prevention, diagnosis and treatment of infectious diseases relevant to our local population and beyond. Our interests include the prevention of hospital acquired infections and antimicrobial resistance, particularly established threats such as MRSA and C.difficile and more recently multi-drug resistant bacteria including carbapenem-resistant organisms. A second important focus is the development and evaluation of novel diagnostics for bacterial and viral pathogens, both used in the laboratory and the wards at the point of care and clinical decision making.&lt;/p&gt;\n&lt;p&gt;The Unit wishes to recruit an individual with clinical trials experience to the post of a Clinical Research Nurse. You will play a key role in patient recruitment to research studies, and as such you will need to be a team player and to be self-directed. You will ensure that Research Governance Guidelines and Good Clinical Practice are adhered to and maintain clinical trial study documentation. You will possess excellent organisational and communication skills and enjoy working with multi-disciplinary teams and have the ability to prioritise competing workloads.&lt;/p&gt;\n&lt;p&gt;The post holder will take responsibility for the safe administration of experimental therapies, and for monitoring the expected and unexpected side effects of drugs and other treatment modalities used in these trials. Several of the trials that this post will lead on will include the need for vaccination of participants and close follow up thereafter.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameAmy DayJob titleResearch ManagerEmail addressamy.day@gstt.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121066.jpg", "name": "Guy's and St. Thomas' NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121066"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "London", "postalCode": "SE1 9RT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5046", "longitude": "-.088964"}}, "title": "Clinical Research Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259086", "validThrough": "2020-11-22T23:59:59+0000"}