{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 £24,907 - £30,615 per annum pro"}}, "datePosted": "2020-11-02T08:16:52+0000", "description": "&lt;p&gt;&lt;em&gt;BIU (Bone Infection Unit) is the only specialist unit of its kind in the UK caring for patients with bone and soft tissue infections. Many of our patients require complex major reconstructive surgery. Our patients are often transferred from hospitals all over the UK. This is a busy and fast paced unit - it is hard work but rewarding and there is great team work. No two days are the same and there is a lot to learn.&lt;br /&gt;&lt;/em&gt;&lt;em&gt;We have full or part time positions available and we can offer fixed or rotational posts to other departments.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;If you are a newly qualified nurse, you will join the Oxford University Hospital’s Foundation Programme. This is the start of your journey with our Trust and will link to a clear career pathway to continue developing your skills over the coming years. The 1st year of the programme consists of up to twelve study days aiming to follow on and develop the learning you have achieved during your training and help you apply this to potentially complex clinical situations. &lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;The NOC offers the right individual the perfect opportunity to enhance and build on existing skills achieved during undergraduate training, when taking their first steps in their nursing career. In return we can provide support, guidance and excellent professional development opportunities. You will be supported by our Practice Development Team to complete the Foundation Programme and Band 5 Development programme. You will be encouraged to complete your mentor qualification and to take on extended clinical skills. We are also developing an accredited PG Cert in Orthopaedic Practice.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameHelen EustaceEmail addressHelen.eustace@ouh.nhs.ukAdditional contact information&lt;/p&gt;\n&lt;p&gt;Admin Support for Ward Sisters: 01865 737663&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Oxford University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120889"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Nuffield Orthopaedic Centre, Oxford", "postalCode": "OX3 7HE"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7537", "longitude": "-1.21078"}}, "title": "Foundation Staff Nurse / Senior Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251316", "validThrough": "2020-11-22T23:59:59+0000"}