{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62001", "minValue": "53168", "unitText": "YEAR", "value": "£53,168 - £62,001 per annum + HCAs"}}, "datePosted": "2020-11-02T16:01:06+0000", "description": "&lt;p&gt;Partners Procurement Service (“PPS”) is a NHS shared service, hosted by Whittington Health NHS Trust and delivering procurement services to four acute trusts in North London: Moorfields Eye Hospital NHS Trust, North Middlesex University NHS Trust, Royal Free London NHS Foundation Trust and Whittington Health.&lt;/p&gt;\n&lt;p&gt;These organisations collectively employ in excess of 15,000 staff and have a non-pay spend profile of approximately £600m per annum (excluding pharmacy).&lt;/p&gt;\n&lt;p&gt;PPS has undergone a significant transformation with development of common systems and procedures and a restructuring to embrace new ways of working and ensure alignment to the national models of procurement that are emerging within the NHS.&lt;/p&gt;\n&lt;p&gt;PPS now needs to recruit a new Category Leads, responsible for a team covering &lt;span&gt;Clinical Consumables and Medical Devices&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Supporting all four trusts this is a high profile role requiring an inspirational leader, who will not only be required to develop their team but also manage a complex set of relationships with key stakeholders (including clinicians) across all four trusts to ensure maximum benefits are driven from procurement.&lt;/p&gt;\n&lt;p&gt;You will have top class communication, presentation and analytical skills with a very strong commercial and contractual background.&lt;/p&gt;\n&lt;p&gt;Specifically you will be responsible for&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Identification, development and execution of category specific procurement strategies - including close liaison with peers across the local NHS integrated care system and the national category and supply chain teams.&lt;/li&gt;\n&lt;li&gt;Creating and agreeing of actionable saving initiatives plans, ensuring stakeholder support&lt;/li&gt;\n&lt;li&gt;Driving delivery of the initiative plan, utilising a rigorous sourcing and procurement processes&lt;/li&gt;\n&lt;li&gt;Working with our operational buying, systems/catalogue and helpdesk teams to ensure all day-to-day requirements in your category area are being fulfilled&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Your detailed understanding of public sector procurement needs to be a given and a deep understanding of the category area will be required. It is unlikely you will have the necessary category experience without having worked either in the NHS or a significant private healthcare provider.&lt;/p&gt;\n&lt;p&gt;You will also have experience of working for a multi-client procurement team, either supporting separate operating divisions or different organisations.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameGary WingraveEmail addressgary.wingrave@nhs.netAdditional contact information&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121035.JPG", "name": "Whittington Health", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121035"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Whittington Hospital, London", "postalCode": "N19 5NF"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5667", "longitude": "-.138149"}}, "title": "Category Lead", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252740", "validThrough": "2020-11-16T23:59:59+0000"}