{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "60000", "minValue": "45000", "unitText": "YEAR", "value": "£45,000-£60,000 pa pro rata"}}, "datePosted": "2020-10-29T15:34:32+0000", "description": "&lt;p&gt;We have an exciting and challenging full time opportunity for an Experienced Advanced Clinical Practitioner.&lt;/p&gt;\n&lt;p&gt;This is a unique opportunity to have a portfolio role working within an established GP practice whilst also combining the role with a brand new innovative service serving the Oldham population.&lt;/p&gt;\n&lt;p&gt;Lindley Medical Practice in Oldham is a small, diverse practice based in the ICC building in the town centre operating from 8-6.30 and Saturday mornings, and the new Oldham Digital hub is a new service based within the same building, operating from 8am-8pm over 7 days a week.&lt;/p&gt;\n&lt;p&gt;Both services consult with patients both face to face and also remotely with the use of video and text software, and calls and appointments are booked by various providers including 111, ED and direct by patients as well as direct access from care homes and paramedics.&lt;/p&gt;\n&lt;p&gt;The GTD Digital Hub were recently been awarded the Emergency Department (A&amp;E) primary care streaming contact. This supports the transformational plans to improve the way people receive urgent care agenda, driven by the COVID-19 pandemic.&lt;/p&gt;\n&lt;p&gt;There has never been a more exciting time to join us at gtd healthcare, winner of the 2019 Pride of Tameside Social Enterprise Business of the Year award. The organisation aligns itself with the NHS and embraces the ethos of social enterprise, reinvesting surpluses generated back into our services.&lt;/p&gt;\n&lt;p&gt;gtd healthcare is one of the largest Primary and Urgent care providers in North West England and has a long and strong track record of more than 20 years in providing innovative healthcare services to meet demand and in line with contemporary healthcare practice. gtd healthcare is a values driven, not-for-profit provider of care to a patient population of approximately 2.7 million.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be qualified to MSc level in Advanced Clinical Practice and can be from any HCPC background. Within the role it is required that you are a competent practitioner with Primary care experience, who can apply clinical reasoning to assess, diagnose, and prescribe where appropriate. In addition, you will be able to make appropriate referrals and providing the right care and advice for patients with undifferentiated illness and be familiar with EMIS and DOCMAN.&lt;/p&gt;\n&lt;p&gt;You will support and contribute to the delivery of policy and procedures, provide leadership as required will act as a mentor and positive role model to other staff and will facilitate training and education as required.&lt;/p&gt;\n&lt;p&gt;You will be supported by the clinical leads for Primary care and Urgent care, the Head of Clinical Services and the Chief Nurse, in partnership with the Heads of Locality and Senior Operational Managers, to drive forward clinical excellence, leadership, quality, safety and high standards.&lt;/p&gt;\n&lt;p&gt;Our senior multidisciplinary clinical team of which you will be a part have dedicated leadership hours as part of their job plans to support the quality agenda, improvements and innovation and you will have access to best-in-class training and development including the gtd healthcare Academy. This is an environment where you have accountability for your career, are encouraged to work autonomously and to make a real contribution to patient care and the organisation.&lt;/p&gt;\n&lt;p&gt;We are proud that our people say that gtd healthcare is a great organisation to work for with the team being made up of committed, driven individuals who are passionate about ensuring that outstanding patient care is delivered.&lt;/p&gt;\n&lt;p&gt;Staff benefits include;&lt;/p&gt;\n&lt;p&gt;•A highly competitive salary, with enhancements for unsocial hours&lt;/p&gt;\n&lt;p&gt;• 30 days annual leave, rising to 32 days after 5 years continuous service,&lt;/p&gt;\n&lt;p&gt;• Continuity/ access to the NHS Pension Scheme,&lt;/p&gt;\n&lt;p&gt;• Access to gtd healthcare Wellbeing, which offers a wide range of staff benefits in response to staff suggestions and as a means of improving staff satisfaction.&lt;/p&gt;\n&lt;p&gt;gtd healthcare is an equal opportunities employer and welcomes applications from all. If you think this is the role for you, we look forward to hearing from you!&lt;/p&gt;\n&lt;p&gt;For further information, please contact&lt;/p&gt;\n&lt;p&gt;Naomi Mellor (Primary care Clinical lead) naomimellor@nhs.net&lt;/p&gt;\n&lt;p&gt;Lynne Barlow (digital hub Clinical lead and Non- medical prescribing lead) lynne.barlow@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/130019.png", "name": "gtd healthcare", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130019"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Oldham", "postalCode": "OL1 1NL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5438", "longitude": "-2.11687"}}, "title": "Advanced Clinical Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248892", "validThrough": "2020-11-23T23:59:59+0000"}