{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615"}}, "datePosted": "2020-10-22T13:46:40+0100", "description": "&lt;p&gt;Try something new! this is the perfect opportunity for a new challenge and to see if working in the community with Sirona is the right move for you. We are a multi-professional team of nurses, physiotherapists, Occupational Therapists, RSW and Advanced practitioners working to prevent unnecessary hospital admissions. We aim to support individuals over acute short term periods and make a huge differnce when they need it most.&lt;/p&gt;\n&lt;p&gt;Not only will you be working with individuals in their homes but you will also have the opportunity to work with our react team in our fast paced service based in southmead emergency department. We are a dynamic forward thinking service looking for a motivated and enthusiastic person to join us. This is a 1 year post to cover maternity leaveand may be the springboard you need to help you decide your future direction.&lt;/p&gt;\n&lt;p&gt;You will work in a supportive environment where we are committed to ongoing clinical development and education. You will have the opportunity to develop a broad range of skills and competencies utilised by whole multidisciplinary team.&lt;/p&gt;\n&lt;p&gt;Please do read the attached job description for further information&lt;/p&gt;\n&lt;p&gt;Or if you have questions please call&lt;/p&gt;\n&lt;p&gt;Alexandra Lewis on 0117 3773894&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/127274.jpg", "name": "Sirona care and health CIC", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127274"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Henbury, Bristol", "postalCode": "BS10 7EH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5075", "longitude": "-2.62181"}}, "title": "Rapid &amp; React Physiotherapist/Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916238751", "validThrough": "2020-11-08T23:59:59+0000"}