{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "10000", "minValue": "10000", "unitText": "YEAR", "value": "£10k/session - negotiable subject to experience"}}, "datePosted": "2020-10-30T17:51:05+0000", "description": "&lt;p&gt;&lt;strong&gt;Salaried General Practitioner -&lt;/strong&gt;&lt;strong&gt;Permanent&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary: £10k per session (negotiable subject to experience)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;DMC are a successful and trusted provider of NHS services across England and Scotland. We have grown rapidly in the past decade from a single Dulwich practice to a team of over 400 employees dedicated to giving patients the very best in care.&lt;/p&gt;\n&lt;p&gt;DMC Healthcare continue to see steady growth in the services we provide, and we have an opportunityfor a salaried General Practitioners to join the team Full Time at&lt;strong&gt;Church View Practice&lt;/strong&gt; in Rainham, Kent.&lt;/p&gt;\n&lt;p&gt;We are looking for GP’s to cover various sessions on a salaried permanent basis.&lt;/p&gt;\n&lt;p&gt;If you are a newly qualified or more experienced GP looking to further your career and professional development in General Practice, whilst improving the healthcare outcomes of local people looking for a flexible role or perhaps a portfolio role looking to work in innovative ways to enable you to focus on providing exceptional patient care. Seeking the support of a great team at your practice to help deliver a professional service.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As a GP you will provide Primary Care that includes a full range of NHS primary and urgent care services, including GP surgeries, walk-in centers and mobile medical units.&lt;/p&gt;\n&lt;p&gt;Our GP’s carry out consultations in a variety of ways: face to face, telephone and electronic platforms i.e. live web/video consultations. This helps us maximize our reach and ability to connect with our patients. Technology is important in the way we deliver our services and we are making great steps to be paperless. Thus enabling you to focus on your patients.&lt;/p&gt;\n&lt;p&gt;If you are passionate about contributing to how the DMC services develop at our practices and more widely across the business, we have an open culture that enables you to get involved in the decisions that affect our delivery.&lt;/p&gt;\n&lt;p&gt;Our approach to service delivery is advanced and we strive to look at the way we work to ensure that time with patients is maximized. That is after all why you became a GP. We will support you in your ongoing personal development and if you are interested in developing a special interest, we are open to that too.&lt;/p&gt;\n&lt;p&gt;We are open to GP’s joining us across our sites, we can be flexible on location and hours of work.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Additional Perks&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A fully covered Medical Indemnity&lt;/li&gt;\n&lt;li&gt;Substantial annual and study leave&lt;/li&gt;\n&lt;li&gt;CPD support to develop your career&lt;/li&gt;\n&lt;li&gt;Enhanced sickness cover&lt;/li&gt;\n&lt;li&gt;NHS pension included&lt;/li&gt;\n&lt;li&gt;Minimal documents to action (EZ Doc Practice)&lt;/li&gt;\n&lt;li&gt;Paid and protected time for clinical meetings and locality learning sessions&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;If you are interested in being part of a team that is focused on delivering exceptional patient care, please get in touch for an informal discussion, or a visit to talk through our current opportunities.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;As part of our employment process, you will be required to complete the appropriate level DBS check.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Equality and Diversity Statement&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The company supports the principle of Equality and Diversity in employment wholeheartedly and opposes all forms of unlawful or unfair discrimination on the grounds of age, disability, sex, gender reassignment, sexual orientation, pregnancy and maternity, race, religion or belief and marriage and civil partnerships.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Disclosure and Barring Service Check&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This post is subject to the Rehabilitation of Offenders Act (Exceptions Order) 1975 and as such it will be necessary for a submission for Disclosure to be made to the Disclosure and Barring Service (formerly known as CRB) to check for any previous criminal convictions.&lt;/p&gt;\n&lt;p&gt;This job advert may close as soon as sufficient suitable applications have been received. If interested please apply for this post as soon as possible.&lt;/p&gt;\n&lt;p&gt;Your submitted application maybe imported into our preferred Third-party recruitment system. By applying for this post you are agreeing to DMC Healthcare transferring the information within this application to its preferred applicant management system. If you are offered a job, information will also be transferred into the DMC Electronic Staff Records system.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central Advertising - Other", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130656"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Rainham, Kent", "postalCode": "ME8 8AA"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3634", "longitude": ".609996"}}, "title": "Salaried General Practitioner - Church View Practice", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251079", "validThrough": "2020-11-13T23:59:59+0000"}