{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "43772", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £43,772 p.a. (pro rata)"}}, "datePosted": "2020-10-30T14:16:37+0000", "description": "&lt;p&gt;&lt;strong&gt;Band 7 Advanced Specialist Cardiac Physiologist in Echocardiography Fixed term 12 months&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Are you ready to be invested in?&lt;/p&gt;\n&lt;p&gt;The Cardiac Diagnostic Centre at Wythenshawe Hospital is a large tertiary department with a reputation for development of its workforce. The unit currently houses both the President of the British Cardiovascular Society and the President of the British Society of Echocardiography. A place where you can develop your career, increase your clinical knowledge and learn new diagnostic techniques regardless of the grade you may hold. The Cardiac Diagnostic Department was the first UK based cardiac centre to be awarded IQIP’s accreditation, a true recognition of the investment made into the departments’ staff to ensure the services they deliver to their patients is of the highest standard.&lt;/p&gt;\n&lt;p&gt;You will be joining a dynamic and forward-looking organisation which is sited on the outskirts of Manchester City centre, with excellent links to the airport and rail network and the central hub of Manchester ensuring staff have the accessibility to travel networks.&lt;/p&gt;\n&lt;p&gt;We provide a full range of both Non-invasive and invasive cardiac diagnostic investigations you would expect from a leading tertiary/quaternary cardiac unit. Investment in scientific/physiology led services which include TTE, Physiologist TOE, Stress echocardiography, Complex Device Implant and follow up and complex 3D Electrophysiology Mapping and Physiologist led Linq Implant service are to name just a few of the opportunities you would be exposed too.&lt;/p&gt;\n&lt;p&gt;Wythenshawe Cardiac Diagnostic unit is the recognised clinical teaching provider for both undergraduate (PTP) and post graduate (STP/HSST) specialist training for Healthcare Science trainees.&lt;/p&gt;\n&lt;p&gt;We are currently looking for highly motivated, enthusiastic, communicative team player. You must be committed to continually improving your professional skills and those of the department to benefit the patients we all serve.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameKeith PearceJob titleConsultant Cardiac PhysiologistEmail addresskeith.pearce@mft.nhs.ukTelephone number0161 291 4609Additional contact information&lt;/p&gt;\n&lt;p&gt;Keith Pearce, Consultant Cardiac Physiologist 0161 291 4609&lt;/p&gt;\n&lt;p&gt;Keith.pearce@mft.nhs.uk&lt;/p&gt;\n&lt;p&gt;Andrea Arnold Principal Cardiac Physiologist 0161 291 4613&lt;/p&gt;\n&lt;p&gt;andrea.arnold@mft.nhs.uk&lt;/p&gt;\n&lt;p&gt;Janet Fallon Principal Cardiac Physiologist 0161 291 4639&lt;/p&gt;\n&lt;p&gt;janet.fallon@mft.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Manchester University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121137"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wythenshawe Hospital, Wythenshawe Manchester", "postalCode": "M23 9LT"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3888", "longitude": "-2.29319"}}, "title": "Advanced Specialist Cardiac Physiologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250514", "validThrough": "2020-11-16T23:59:59+0000"}