{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 to £44,503 pa"}}, "datePosted": "2020-10-27T11:00:25+0000", "description": "&lt;p&gt;NECS works across the UK to support health and social care customers in meeting strategic and operational challenges, to improve outcomes and increase efficiency. We deliver a diverse range of services to organisations working within health and social care across the North of England and beyond.&lt;/p&gt;\n&lt;p&gt;NECS have a diverse portfolio of digital applications and combine specialist skills and expertise with scale and resilience to achieve required results. Many of our people have extensive NHS and public sector experience and we combine core NHS values with a sharp focus on customer care and a relentless pursuit of continuous improvement. We very much see ourselves as a key partner in the future success of the healthcare system and we take our share of the responsibility for shaping effective delivery.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Main purpose of role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are seeking a determined individual to join us as a Mobile Application Developer who has an interest in building performant mobile applications on both Android and iOS platforms.  You will be responsible for architecting and building these applications with collaboration with our team of Technical architects, Developers and Testers.&lt;/p&gt;\n&lt;p&gt;As a Mobile Application Developer, you will have responsibility for requirements gathering, face-to-face meetings with business customers, managing your mobile development projects in conjunction with the existing team and ensuring that standards are kept to a high level.  You will be involved in maintaining and further enhancing an existing React Native mobile app, as well as taking a lead role in new Greenfield mobile projects, supported by the Digital Applications Development Team.  You will spend a significant portion of your time developing mobile solutions, including writing and testing code following an agile development methodology. &lt;/p&gt;\n&lt;p&gt;Applicants must be able to demonstrate an ability to plan and structure their work from concept, through specification, coding and final testing - whilst considering the real-time needs of the business. Being flexible enough to react to the rapidly changing demands of their operation is essential, therefore the ideal developer will be able to think quickly, plan carefully and be able to rapidly deploy robust, well-tested solutions.&lt;/p&gt;\n&lt;p&gt;Benefits include working remotely, access to an MSDN subscription, working with the latest Microsoft technologies and services, flexible working, generous holiday allowance and access to NHS discounts with major retailers.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Required experience:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Experience in developing with React Native for Android / iOS mobile applications&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Practical knowledge with API’s and Web Services&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Experience of working with back-end services&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Practical knowledge and experience of coding, quality standards,  test plans and version control&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Excellent written and verbal communication skills&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Implement pixel-perfect UI’s that meet project requirements&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Practical knowledge of deployment to AppStore and Google Play stores.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Proficient in English language with excellent written and verbal communication skills&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Practical knowledge of security risks and how to mitigate&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Desirable but not essential:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Experience in developing mobile apps with multiple frameworks e.g. Ionic, Xamarin etc.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Experience in UI / UX Design&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Advantages of working with NECS:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Continuous development and accreditation opportunities&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Generous holiday allowance of up to 33 days + eight days public holidays&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;NHS pension scheme&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Salary sacrifice car scheme&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;NHS discounts with major retailers.&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "North of England Commissioning Support", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128014"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "DURHAM", "postalCode": "DH1 3YG"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.764", "longitude": "-1.57002"}}, "title": "Mobile Developer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244102", "validThrough": "2020-11-10T23:59:59+0000"}