{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "40000", "minValue": "30000", "unitText": "YEAR", "value": "£30,000 to £40,000 per annum"}}, "datePosted": "2020-10-30T11:44:20+0000", "description": "&lt;p&gt;Due to internal staff progression Modality Partnership is looking to recruit to the role of Practice Manager at Black Country Family Practice within the Birmingham Division.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be responsible for managing all operational aspects ofthe medical practiceon a day-to-day basis to ensure the effective running of the site. They will also support the Clinical Practice Director to manage a multi-disciplinary team in a way that supports the delivery of resilient, high quality patient focussed care.&lt;/p&gt;\n&lt;p&gt;The Practice Managerwill support and manage the staff to get the very best out of the team to enable the Practice to achieve agreed aims and objectives.&lt;/p&gt;\n&lt;p&gt;Applicants should have experience in a relevant management role with a strong understanding of NHS systems and General Practice protocols and procedures.&lt;/p&gt;\n&lt;p&gt;A recognised Level 5 management qualification or above is desirable however relevant experience in a similar role is an important requirement for the successful candidate.&lt;/p&gt;\n&lt;p&gt;If you are a positive, confident and organised individual who adopts a flexible ‘can do’ attitude to your work coupled with a focus on delivery then this role within a fast-paced and continuously developing environment could be the one for you.&lt;/p&gt;\n&lt;p&gt;For an informal discussion about the role please contact Kate Jennings (HR Manager) via e-mail address kate.jennings1@nhs.net&lt;/p&gt;\n&lt;p&gt;Closing date for applications is Friday 13th November 2020.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Modality Birmingham", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=136174"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Tipton", "postalCode": "DY4 8PX"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5289", "longitude": "-2.07118"}}, "title": "Practice Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250002", "validThrough": "2020-11-13T23:59:59+0000"}