{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 pro rata, per annum"}}, "datePosted": "2020-11-04T15:01:05+0000", "description": "&lt;p&gt;An exciting opportunity has arisen to join the workforce Team at North Tees &amp; Hartlepool NHS Foundation Trust team as a Workforce Assistant on a permanent basis. This role will supporting our clients with their transactional recruitment and HR activities.&lt;/p&gt;\n&lt;p&gt;Hours of work will be 30 hours per week and office hours will cover 08:30 to 17:30, Monday to Friday.&lt;/p&gt;\n&lt;p&gt;We are looking for a motivated and enthusiastic individual who is able to cope under pressure in this busy department and who is able to work as part of a large team.&lt;/p&gt;\n&lt;p&gt;On a day to day basis duties will include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Provision of advice and support on our Recruitment and HR processes, to internal and external recruiting managers, line managers, applicants and employees&lt;/li&gt;\n&lt;li&gt;Following agreed processes and standard operating procedures to ensure consistent service is provided to clients in line with our Key Performance Indicators (KPI)&lt;/li&gt;\n&lt;li&gt;Utilising recruitment systems (e.g. Trac/ESR) and tools to drive efficient recruitment processes and onboarding&lt;/li&gt;\n&lt;li&gt;Provide receive and deal with sensitive and confidential information/personal staff details&lt;/li&gt;\n&lt;li&gt;Contribute to a culture of continuous improvement and service excellence by adhering to agreed procedures and making suggestions for improvements.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We want all of our staff to be able to provide great customer service whilst working to our agreed processes and Key Performance Indicators. To support this we provide a full training programme , which includes a local induction and role specific training, as well as access to ongoing development opportunities where needed&lt;/p&gt;\n&lt;p&gt;Working as part of a Large team, we encourage staff to put forward ideas to improve our service and the working environment.&lt;/p&gt;\n&lt;p&gt;It is important that we continually work to engage and support all our staff to develop themselves professionally and personally. Whilst this isn’t always easy alongside managing our service delivery priorities we are committed to pursuing this.&lt;/p&gt;\n&lt;p&gt;If this sounds like an environment you would like to work in and you think you can bring energy and enthusiasm to our team we would warmly welcome your application.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Trust reserves the right to close this advert early if sufficient number of applications are received.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Claire Ogilvie Job title: Workforce Advisor - Resourcing Team Leader&lt;/p&gt;\n&lt;p&gt;Email address: c.ogilvie3@nhs.net Telephone number: 01642 624134&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "North Tees and Hartlepool NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120670"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "University Hospital of North Tees, Stockton", "postalCode": "TS19 8PE"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.5829", "longitude": "-1.34677"}}, "title": "Workforce Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256337", "validThrough": "2020-11-07T23:59:59+0000"}