{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51393", "minValue": "45780", "unitText": "YEAR", "value": "£45,780 - £51,393"}}, "datePosted": "2020-11-04T16:16:08+0000", "description": "&lt;p&gt;We are looking to strengthen the operational management team for surgical services with the recruitment of a Service Manager within the Surgery, Neurosciences, Cancer &amp; Theatres Division at St. George’s Hospital. This role will be responsible for the Maxillofacial, Dental and Audiology specialties.&lt;/p&gt;\n&lt;p&gt;The Service Managers at St George’s are key roles within the Divisional structure and responsible for large portfolios in a complex teaching hospital environment and will be expected to deliver the strategic and operational remit, working alongside the Deputy General Manager, General Manager and medical and nursing leadership teams.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be an experienced NHS manager who is used to working in large provider organisations and has proven experience of providing strong leadership and delivering operational performance in a directorate. We are looking for an enthusiastic individual who will relish the challenges ahead and have previously managed services including staff, budget and performance measures.&lt;/p&gt;\n&lt;p&gt;This is an exciting time to join our team, and this role will be pivotal for the organisation in driving forward the sustainable change needed to improve our service to patients.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NamePauline RichardsonJob titleDeputy General ManagerEmail addresspauline.richardson@stgeorges.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "St George's University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121185"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "London", "postalCode": "SW17 0QT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4267", "longitude": "-.175721"}}, "title": "Service Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256585", "validThrough": "2020-11-11T23:59:59+0000"}