{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum (pro rata)"}}, "datePosted": "2020-10-30T10:46:58+0000", "description": "&lt;p&gt;Northampton General Hospital NHS Trust has exciting opportunities for enthusiastic and hard-working, Assistant Finance Managers to support activities within Financial Management.&lt;/p&gt;\n&lt;p&gt;A full time, plus a part time position is available. The part time role is designated as 18.75hrs per week, but there is a degree of flexibility to agree the exact number.&lt;/p&gt;\n&lt;p&gt;The post holder will report into the Finance Manager and will be responsible for a full range of management accounting tasks, across a wide range of services, assisting the Finance Manager in the general day to day duties, providing financial support to the Trust’s budget holders. The post holder will also support topical finance initiatives such as Service Line Reporting and will help to co-ordinate and monitor Cost Improvement Plans.&lt;/p&gt;\n&lt;p&gt;You will be responsible for advising senior managers on financial issues in a timely, clear and concise manner. This will include Trust wide, as well as specific area issues and will require detailed and robust financial and non-financial analysis.&lt;/p&gt;\n&lt;p&gt;You should be someone who has excellent attention to detail, runs robust processes and is happy to get involved in the service operations. Good inter personal skills are essential, as a key aspect of this post will be interacting with stakeholders from clinical and non clinical services. You should be ambitious and always seeking to improve current processes by recommending new and innovative ways of working, which increase transparency and understanding of financial information across the Trust.&lt;/p&gt;\n&lt;p&gt;The Finance department supports role development of our Assistant Finance Managers and was awarded the Future Focused Finance Level 1 accreditation in 2019. We are currently working towards our Level 2 application.&lt;/p&gt;\n&lt;p&gt;The Financial Management team has adapted to the risk Covid presents and currently operates a hybrid approach; working from home, but also providing an office facility for some days on site when required.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: John Washington Job title: Chief Management Accountant Email address: john.washington@ngh.nhs.uk Telephone number: 01604 544933&lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please direct any contact via email, due to the significant working from home during covid times.&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121063.jpg", "name": "Northampton General Hospital NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121063"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Northampton General Hospital NHS Trust, Northampton", "postalCode": "NN1 5BD"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.2371", "longitude": "-.886673"}}, "title": "Assistant Finance Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249803", "validThrough": "2020-11-15T23:59:59+0000"}