{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "18171", "minValue": "18171", "unitText": "YEAR", "value": "£10.81 per hour excluding holiday pay"}}, "datePosted": "2020-10-28T13:50:55+0000", "description": "&lt;p&gt;&lt;strong&gt;**PLEASE NOTE THIS IS TO APPLY TO JOIN NHS PROFESSIONALS’ ALLIED HEALTH PROFESSIONALS BANK**&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job Title and Grade:&lt;/strong&gt; Band 3 Pharmacy Technician&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location/Trust: &lt;/strong&gt;Buckinghamshire Healthcare - Primarily based at Wycombe Hospital with occasional travel to Stoke Mandeville in Aylesbury (approximately one day in Aylesbury every two weeks)&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Department Covered:&lt;/strong&gt; Pharmacy&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Pay Rates: &lt;/strong&gt;£10.81per hour excluding holiday pay&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Placement Ref/ID&lt;/strong&gt;: 34862&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Role: &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We’ll help with the little things.…. Join the bank today!&lt;/p&gt;\n&lt;p&gt;Would you like to be part of a team that has a real supportive and inclusive ethos and sense of community, working in a location with all the benefits of country living with the convenience of big city life?&lt;/p&gt;\n&lt;p&gt;If you answered ‘yes’ to the above, we’d love to hear from you!&lt;/p&gt;\n&lt;p&gt;We have long term placement opportunities available for Pharmacy Assistant available at Buckhinghamshire Healthcare specifically providing the following:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Support all aspects of pharmacy requirements for medicinal products within the context of a clinical trial (ordering, handling, dispensing, drug accountability, administration, storage, disposal of medicinal products)&lt;/li&gt;\n&lt;li&gt;Provide support to ensure activities within the pharmacy department are managed in accordance with the international conference of harmonisation Good Clinical Practice Guidelines (IH-GCP), good manufacturing practice (GMP), the research Governance Framework for Health &amp; Community Care (2001) and Medicines for Human Use (Clinical Trials) Regulations 2004&lt;/li&gt;\n&lt;li&gt;\n&lt;ul&gt;\n&lt;li&gt;To be responsible for monitoring the completeness of pharmacy study files including ensuring the most recent versions of documents are filed and ensuring the contact list and randomised patient list in the study folders (hard and electronic copies) are up to date&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To assist in maintaining the accuracy of a study spreadsheet, detailing which studies are open and which studies are closed.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To order and receive Clinical Trials Drugs and other required items for clinical trials in accordance with departmental and study specify Pharmacy SOP. This includes the use of IWRS/IVRS system.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To ensure that stock and the paper work received from drug delivery is correct as per departmental and study specific SOP.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To dispense dispensary based clinical trials in accordance with ICH GCP and study specific sops.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Buckinghamshire Healthcare has an enviable reputation, great supportive team with a family feel. Based in the heart of the Hospitals main site, which is set within the heart of Aylesbury and Wycombe , the post holder here will be pivotal in providing the best level of quality care to varying departments and their patient’s needs.&lt;/p&gt;\n&lt;p&gt;Excellent transport links mean their location is commutable from Hertfordshire/Buckinghamshire/Bedfordshire/Oxfordshire&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Skills/Responsibilities:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Skills/Responsibilities &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;To apply for this post, you will:&lt;/p&gt;\n&lt;p&gt;NVQ 2 qualification in Pharmacy Services or NVQ Level 2 in Progress&lt;/p&gt;\n&lt;p&gt;6 months NHS Experience&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;In return for your hard work commitment NHS Professionals (NHSP) can offer you some fantastic benefits: –&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Competitive Pay Rates &lt;/strong&gt;- work this week, get paid next week!&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;First choice of placements at over 50 NHS Trusts in England&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Dedicated consultants&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Flexible working options&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Free DBS and free training&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Build holiday allowance &lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Support when you need it – 24/7 365 days – &lt;/strong&gt;Call us anytime on 03330 144 370&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Stakeholder pension scheme&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Who are NHS Professionals?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;NHS Professionals (NHSP), owned by the Department of Health and Social Care (DHSC), works in partnership with hospital trusts to provide a bank of highly skilled temporary workers who want to work flexibly within the NHS.&lt;/p&gt;\n&lt;p&gt;Working through the NHSP bank means Trusts don’t have to rely on expensive agencies. Right now, we have over 130,000 members registered on our bank from various roles, grades and specialities, saving the NHS over &lt;strong&gt;£70 million&lt;/strong&gt; each year. This money is then reinvested back into the NHS.&lt;/p&gt;\n&lt;p&gt;Register today for various flexible working options and long-term placement opportunities.&lt;/p&gt;\n&lt;p&gt;For more information on the roles or details on how to join NHS Professionals, simply get in touch with &lt;em&gt;Phil Chafer, Recruitment Consultant on 0333 014 4370 or Philip.Chafer&lt;/em&gt;&lt;em&gt;@nhsprofessionals.nhs.uk&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;We look forward to hearing from you soon.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Disclaimer &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Please note, you will be contacted by email throughout the recruitment process, so please check your emails, including your junk/spam regularly. We regret we cannot contact everyone who is not selected for an interview, therefore if you do not hear from us within 21 days after submitting your application, please assume you have not been successful on this occasion.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "NHS Professionals - Flexible Workers", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121069"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "High Wycombe", "postalCode": "HP11 2TT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6262", "longitude": "-.7534"}}, "title": "Band 3 Pharmacy Support Worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246846", "validThrough": "2020-11-11T23:59:59+0000"}