{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 per annum"}}, "datePosted": "2020-11-06T13:31:01+0000", "description": "&lt;p&gt;&lt;strong&gt;Aneurin Bevan University Health Board&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Clinical Futures Recruitment&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Full Time (37.5 Hours across a 7 day week)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Band 3 Radiology Health Care Support worker&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Permanent post&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Base: Grange University Hospital&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Aneurin Bevan University Health Board is a multi-award winning NHS organisation with a passion for caring.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Join us our journey to pioneer new ways of working and deliver a world-class healthcare service fit for the future. Clinical Futures is Aneurin Bevans Health Board’s exciting programme of work to change the way NHS care and services are delivered across the Gwent area, centralising and promoting services in or closer to the home, along with high quality hospital services available when needed. As part of this journey, we will shortly be opening our brand new £350m, 462 bed purpose built Specialist and Critical Care Centre named “&lt;em&gt;The Grange University Hospital&lt;/em&gt;”.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Aneurin Bevan University Health Board provides an exceptional workplace where you can feel trusted and valued. Whatever your specialty or stage in your career, we have opportunities for everyone to start, grow and build their career. We offer excellent in-house training and development programmes, including opportunities to undertake courses, modules and degrees from further education providers and universities, plus a range of management development programmes are also available.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Health Board has invested heavily in high quality equipment for radiology to ensure the best possible 24/7 diagnostics for patients. The Radiology department at Grange University Hospital will have 2 Interventional rooms, one of which will be a hybrid theatre, these will be equipped with Philips Azurion C90 flex arm machines. In addition there will be 2 Canon Aquilion one Genesis system CT scanners and a Siemens Magnetom Sola MR scanner. There is also a Canon Ultimax I fluoroscopy system and 4 Philips C90 Digital diagnost rooms.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This will be an exciting opportunity for any Health care Support worker to work in a new facility with the best equipment and an opportunity to gain experience and enhance their career.&lt;/p&gt;\n&lt;p&gt;If this sounds like you, we would love to hear from you and receive your application!!&lt;/p&gt;\n&lt;p&gt;Keep up to date with &lt;strong&gt;#CaringForYouandYourFuture&lt;/strong&gt; on social media or to contact the Clinical Futures Recruitment Team, please email RecruitmentEnquiries.ABB@wales.nhs.uk.&lt;/p&gt;\n&lt;p&gt;This position involves Regulated Activity with &lt;strong&gt;children and adults&lt;/strong&gt; as defined by the Safeguarding Vulnerable Groups Act (amended by the Protection of Freedoms Act 2012) and the following checks will be undertaken following any conditional offer:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Enhanced check with barred list information, including&lt;/li&gt;\n&lt;li&gt;- an adults and children’s barred list check&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Free parking is available across all Aneurin Bevan University Health Board Sites.&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; Welsh and/or English speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt;Closing date: 12th November 2020&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Ruth Hill&lt;/p&gt;\n&lt;p&gt;Directorate Administrator, Radiology&lt;/p&gt;\n&lt;p&gt;Ruth.Hill@wales.nhs.uk&lt;/p&gt;\n&lt;p&gt;01633 656049&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123197.jpg", "name": "Aneurin Bevan University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123197"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Grange University Hospital, Cwmbran", "postalCode": "NP44 8YN"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6463", "longitude": "-2.99634"}}, "title": "Health Care Support Worker in Interventional Radiology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259919", "validThrough": "2020-11-12T23:59:59+0000"}