{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365-£37,890 per annum"}}, "datePosted": "2020-11-05T16:46:05+0000", "description": "&lt;p&gt;We are looking for a highly enthusiastic, committed and self-motivated Specialist Pharmacy Technician who wants to use their passion and competence in technology to make a difference to patient care. This is a brand new post created to ensure the provision of specialist pharmacy input in to the implementation and functioning of Electronic Prescribing and Medicines Administration (ePMA) at the Trust. As Specialist Pharmacy Technician – Digital, you will be a core member of the Medicines Management team, contributing to operational and strategic development of ePMA.&lt;/p&gt;\n&lt;p&gt;You will use your specialist experience and knowledge to contribute to new ways of working with electronic systems and processes, ensuring maximum levels of safety and quality. You will report clinical risks and issues that could be generated by the transition from paper-based to electronic prescribing whilst working closely with the Senior Clinical Pharmacist – Digital, the ePMA project implementation team, and within project governance structures.&lt;/p&gt;\n&lt;p&gt;To be considered for this exciting opportunity you will need to have excellent communication and interpersonal skills, along with proven team working abilities. You will need to be resourceful and able to make complex recommendations and decisions, whilst consistently prioritising patient safety and good practice in pharmacy. Previous experience using ePMA is a significant advantage, though we welcome applications from registered pharmacy technicians with a demonstrable passion for digital solutions to prescribing issues.&lt;/p&gt;\n&lt;p&gt;You will need post-qualification experience relevant to the post: acute hospital pharmacy and/or experience in an inpatient environment is essential. The post holder is required to participate in the pharmacy dispensary rota and may be required to work Saturdays, Sundays and Bank Holidays.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Lucy Simkins-Principal Clinical Pharmacist and Prescribing Lead&lt;/p&gt;\n&lt;p&gt;lucy.simkins@nhs.net&lt;/p&gt;\n&lt;p&gt;01273 696011 ext. 2829 or 07342 080829&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Sussex Community NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120877"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Brighton General Hospital, Brighton", "postalCode": "BN2 3EW"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8309", "longitude": "-.114138"}}, "title": "Specialist Pharmacy Technician - Digital", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258625", "validThrough": "2020-11-15T23:59:59+0000"}