{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "36134", "minValue": "29056", "unitText": "YEAR", "value": "£29,056 - £36,134 per annum inc"}}, "datePosted": "2020-10-26T14:01:14+0000", "description": "&lt;p&gt;We are excited and proud to offer opportunities to become a part of our Emergency Surgical Ambulatory Care (ESAC)/3F nursing team.&lt;/p&gt;\n&lt;p&gt;The Emergency Surgical Ambulatory Care (ESAC)/3F in Royal London Hospital is a fast paced acute surgical ward caring for patients directly referred from GPs, acute Clinics and A&amp;E within the General Surgery and other surgical specialties. This unit offers abscess and abdominal pain pathways and has 18 surgical beds that facilitate surgical admissions.&lt;/p&gt;\n&lt;p&gt;We offer you a supportive environment in which you can both enhance your clinical and management skills. We also offer training opportunities such as mentorship, in-house training, clinical simulations and preceptorship programme.&lt;/p&gt;\n&lt;p&gt;ESAC/3F provides a short stay care for patients undergoing a range of surgical procedures, including general surgery, orthopaedics, dermatology, ENT and maxillo facial surgery. Working in this highly motivated team, you will develop your sound decision making skills and become a proud member of our innovative approach to improving patient care and experience.&lt;/p&gt;\n&lt;p&gt;The team structure brings together a wide range of experience including Senior Sister, an extended nursing team including Band 6s, band 5s and healthcare support workers. As a Band 5 nurse, you will be responsible for providing the high quality, individualised and holistic patient care. This will include assessment, planning and implementation of care working within the multidisciplinary team. You will be encouraged to practice autonomously as a member of the surgical team.&lt;/p&gt;\n&lt;p&gt;We also offer a structured a programme underpinned by workplace competency assessments and activities that will guide you achieve your own personal and professional learning needs.&lt;/p&gt;\n&lt;p&gt;If you are passionate about delivering the highest standards of care to your patients, then you will enjoy the challenge of working in 3F/ESAC, where friendly and supportive environment thrives.&lt;/p&gt;\n&lt;p&gt;Whatever your future career goals, this department provides a fantastic opportunity to gain invaluable clinical experience in a large teaching Hospital.&lt;/p&gt;\n&lt;p&gt;Follow us on Twitter @SurgeryRlh to find out more about us.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Winifred Smith on 02035942241 or Winifred.Smith@bartshealth.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120603.jpg", "name": "Barts Health NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120603"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Royal London Hospital, London", "postalCode": "E1 1BB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.519", "longitude": "-.058048"}}, "title": "Surgical Admissions Unit Staff Nurse - Band 5", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242798", "validThrough": "2020-11-08T23:59:59+0000"}