{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-10-27T12:01:14+0000", "description": "&lt;p&gt;&lt;strong&gt;Welsh Student Nurses must apply via the Student Streamlining Process&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Recruiting now – Registered Nurses for our to Acute Care of the Elderly Ward (ward 1, 2, aberconwy) in Glan Clwyd Hospital –Beautiful North Wales&lt;/p&gt;\n&lt;p&gt;Come and join us – and be a part of a brand new exciting hospital development, which is creating the ideal environment for staff and our patients, improving the health of the population we serve&lt;/p&gt;\n&lt;p&gt;Whether you are newly qualified or you have been in nursing for years or even thinking of coming back to Nursing , a move to us here in North Wales will provide opportunities to either learn on the job or develop your skills further.&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity to join our dynamic team in specialist elderly care. As a hospital, we are proud to have gone through an extensive period of refurbishment with a focus on achieving dementia friendly status.&lt;/p&gt;\n&lt;p&gt;We are a friendly team and always thrive to deliver a compassionate high quality standard of care. Our top priority is the safety of our patients and their best possible care.&lt;/p&gt;\n&lt;p&gt;We also focus on having fun getting to know our patients with a full activities programme led by our amazing Dementia Care Enablers.&lt;/p&gt;\n&lt;p&gt;We value our nurses’ professional growth and we would want you to have an exciting and rewarding career. Offering a wide range of professional development.&lt;/p&gt;\n&lt;p&gt;These include dementia training, end of life care, nutrition, mobility and function, pain management, frailty and resilience. Our motivated Senior Nursing Team can provide you with a comprehensive induction program, which will give you an opportunity to shadow some of the hospital’s specialist nurses.&lt;/p&gt;\n&lt;p&gt;As you progress, we will widen your skills and knowledge through our comprehensive assessment unit (short stay frailty) and non-acute stepdown ward.&lt;/p&gt;\n&lt;p&gt;We can offer you:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Flexible working to suit you and your family, such as full time, annualised hours, part time, term time, to enable you to achieve a great work-life balance. Let us discuss!&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Opportunity to rotate into and across acute elderly medicine&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Support to progress your nursing career in a place that allows you to reach your goals inside work and out&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;A chance to be recognised for great work through our staff achievement awards&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Continued professional development opportunities through our in house practice development programme and external academic courses within universities&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;High quality, modern services in rapidly developing wards and units&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Career progression Opportunities (our main hospitals are Training hospitals)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Opportunity to rotate between two specialities to help you change direction whenever you want to&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Excellent opportunities for career progression and a clear route to advanced practice to through post -graduation qualifications&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Other benefits for you:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Free On-site parking available&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Free Bus park &amp; ride&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Free Eye Care Vouchers&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Work Place Pension&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Comprehensive Learning &amp; Development Package using our strong Links to local Universities &amp; colleges for courses&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Free DBS check,&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Free Flu vaccination&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Hepatitis B vaccination&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Occupational Health Support network&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;NHS Discounts i.e. Restaurants, retail, package holidays&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Free admission to Social Clubs – such as Betsi Runners (Clubs)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Uniform&lt;/li&gt;\n&lt;li&gt;Support networks, including trade unions, carers, chaplaincy, counselling service, NHS retirement fellowship , rainbow LGBT&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;If you wish to continue to live in England and travel to North Wales, then Glan Clwyd Hospital is in commutable distance and parking is free within our hospital site.&lt;/p&gt;\n&lt;p&gt;We can provide financial support to help you relocate to North Wales along with flexible working options to enable you to achieve a great work-life balance.&lt;/p&gt;\n&lt;p&gt;Finding extra fulfilment away from work is important too and with stunning surroundings, affordable housing, great schools and a true sense of community wherever you go, North Wales is the perfect place to start or continue your career. If you have the passion, vision and ability to make a difference and help move our services forward, we want to hear from you today!&lt;/p&gt;\n&lt;p&gt;To apply please apply on line&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; Welsh and/or English speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt;Closing Date: 10/11/20&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Ward Manager Annette Mason ward 2 Glan Clwyd Hospital 01745583910,&lt;/p&gt;\n&lt;p&gt;Matron Cathy Lloyd 01745 583910 bleep 4976, cathy.lloyd@wales.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123196.JPG", "name": "Betsi Cadwaladr University Local Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123196"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Ysbyty Glan Clwyd, Rhuddlan Road, Bodelwyddan", "postalCode": "LL18 5UJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.2718", "longitude": "-3.49635"}}, "title": "Registered Nurse - Care of The Elderly", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244381", "validThrough": "2020-11-10T23:59:59+0000"}