{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-11-04T11:16:24+0000", "description": "&lt;p&gt;&lt;strong&gt;Band 7 Practice Educator - Planned Care&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This is a fixed-term post for 6 months to cover a secondment.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Royal Berkshire NHS Foundation Trust is one of the largest general hospital foundation trusts in the country and has over 4,800 staff, over 600 beds and a great track record of achievement.&lt;/p&gt;\n&lt;p&gt;We provide acute medical and surgical services to Reading, Wokingham and West Berkshire and specialist services to a wider population across Berkshire and its borders.&lt;/p&gt;\n&lt;p&gt;A vacancy currently exists for a Band 7 Practice Educator within Planned Care for one year to cover maternity leave.&lt;/p&gt;\n&lt;p&gt;We are looking for an experienced nurse who is an enthusiastic, self-motivated individual with proven facilitation and leadership qualities to join our practice education team.&lt;/p&gt;\n&lt;p&gt;You will work across diverse, energetic and busy acute and outpatient settings to develop and deliver high standards of patient-focused, evidence-based care.&lt;/p&gt;\n&lt;p&gt;If you have excellent communication and teaching skills, experience of change management and enjoy helping staff develop their skills, knowledge and confidence you could be the person we are looking for.&lt;/p&gt;\n&lt;p&gt;We recognise that education and leadership positively influence the quality of patient care. Working in partnership with the Directors of Nursing and Matrons, you will help to develop, lead and implement the education strategy for the Trust.&lt;/p&gt;\n&lt;p&gt;You will need to be a Registered Nurse, with a mentorship/teaching qualification and clinical experience at Band 6 or 7 in an acute setting. &lt;br /&gt;&lt;br /&gt;If you are interested, have a passion for education in practice and the drive to persist and succeed in this challenging and rewarding post, then please do contact us.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Matron Julie Boxley on 0118 322 8792 or julie.boxley@royalberkshire.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122060.jpg", "name": "Royal Berkshire NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122060"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Reading", "postalCode": "RG1 5AN"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4514", "longitude": "-.958624"}}, "title": "Practice Educator - Planned Care (Fixed Term 6 Months)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255577", "validThrough": "2020-11-21T23:59:59+0000"}