{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum/pro rata"}}, "datePosted": "2020-11-05T16:16:11+0000", "description": "&lt;p&gt;This is an exciting time to join a dynamic and innovative CAMHS workforce in Wiltshire and Bath and North East Somerset by joining our Mental Health Support Teams (MHSTs). These teams have been set up as a response to the Government’s Green Paper in 2017 and deliver evidence based early interventions for children and young people (CYP), in both educational and health settings. The team consists of Educational Mental Health Practitioners (EMHPs) delivering these interventions, individually and in groups with support workers working alongside as well as working with schools to implement effective whole school approaches to mental health to improve outcomes for CYP.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;To expand our current offer to schools and colleges, and further develop these new teams, we have a number of posts available aimed to ensure robust and effective clinical supervision of the EMHPs whilst they train and when they graduate into Band 5 practitioners.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;As the MHST Clinical Lead you will also be expected to;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Provide clinical and caseload management supervision. This supervision would be to EMHP trainees undertaking the training at University of Exeter and to graduate EMHPs&lt;/li&gt;\n&lt;li&gt;&lt;/li&gt;\n&lt;li&gt;To work with the more complex cases that are not suitable for the EMHP’s and possibly more agencies involved, but the focus will remain on shorter term intervention.&lt;/li&gt;\n&lt;li&gt;&lt;/li&gt;\n&lt;li&gt;Work in a leadership capacity alongside the clinical manager supporting with the screening of referrals and other developmental roles as identified.&lt;/li&gt;\n&lt;li&gt;&lt;/li&gt;\n&lt;li&gt;Provide consultation to education colleagues and support the education setting to embed a whole school approach to wellbeing.&lt;/li&gt;\n&lt;li&gt;&lt;/li&gt;\n&lt;li&gt;To develop and deliver training as needed alongside EMHPs or Mental Health Support Workers to education colleagues.&lt;/li&gt;\n&lt;li&gt;&lt;/li&gt;\n&lt;li&gt;To support the MHST evidence effective outcomes.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The post is open to all clinical psychologists, counselling psychologists (with CBT experience) and CBT therapists (with CYP IAPT diploma in CBT).&lt;/p&gt;\n&lt;p&gt;You will be expected to undertake the Post Graduate Certificate in Supervision for Low Intensity interventions at the University of Exeter, with your own robust clinical supervision.&lt;/p&gt;\n&lt;p&gt;You will need to be an enthusiastic, dynamic, flexible and experienced clinician who can work effectively with multiple agencies, as well as providing a containing and supportive environment for EMHP trainees and graduates.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What we can offer you: &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are a caring, supportive team who work closely with our CAMHS colleagues across BSW. As a service we pride ourselves on ensuring staff wellbeing is recognised and maintained and opportunities for continued professional development.&lt;/p&gt;\n&lt;p&gt;In OHFT we are passionate about working with Participation to better enable the voice of the CYP to be heard and advocate for this in schools in relation to MH and wellbeing. In Banes and Wiltshire, the MHST are working closely with this team in the development of resources and the delivery of the WSA with the MHST.&lt;/p&gt;\n&lt;p&gt;As a service we are passionate about hearing the voice of the child or young person, we work very closely with the local CAMHS Participation Teams which we have found to be enjoyable and effective. We would like to share with you some feedback from a participation advocate.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&quot;Hi! My name&#39;s Gemma and I&#39;m a part of the Salisbury CAMHS Participation Team. I joined the participation team after being discharged from the service in 2016. I wanted to give back to the staff for all the support they gave me whilst I battled depression and anxiety, as well as help to continually improve CAMHS for current service users. &lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;The past 4 years has led to me being all round Wiltshire county doing participation activities. Some have been local such as updating the waiting room, delivering workshops to service users and running a CAMHS open afternoon in Salisbury. Others have seen me interviewing staff as far away as Melksham, speaking at a Wellbeing Conference in Devizes and being on BBC Points West in Keynsham. &lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Most recently, I&#39;ve been collaborating with Barnardo&#39;s in the set-up of the Wiltshire Early Mental Health and Counselling Support Service. I interviewed all the members of staff who make up this team including the team manager, counsellor/therapists and early mental health practitioners. Additionally, I&#39;ve been giving feedback for the on your mind website as well as being on the Mental Health Support Teams steering committee. I&#39;m very excited for future opportunities with CAMHS and hope I can keep making positive contributions to our community.&quot;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDebbie.hurry or Naomi OliverJob titleClinical Team ManagerEmail addressDebbie.hurry@oxfordhealth.nhs.uk.Telephone number07867142116Additional contact information&lt;/p&gt;\n&lt;p&gt;Naomi Oliver- Clinical Team Manager&lt;/p&gt;\n&lt;p&gt;Naomi.oliver@oxfordhealth.nhs.uk- 07584145731&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Oxford Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122233"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Melksham CAMHS / Keynsham CAMHS, Melksham/ Keynsham", "postalCode": "SN127NZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3671", "longitude": "-2.13154"}}, "title": "Clinical Team Lead/ Clinical Psychologist/Counselling Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258515", "validThrough": "2020-11-12T23:59:59+0000"}