{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pa/ pro rata for part time staff"}}, "datePosted": "2020-10-26T13:32:20+0000", "description": "&lt;p&gt;An opportunity has arisen for an enthusiastic Audiologist to join our friendly team of 11 Audiologists and 6 Audiological Assistants. We are looking for a conscientious, motivated and flexible newly qualified or experienced Audiologist. Hearing Services provides a comprehensive service to adults from the Sheffield area and beyond.&lt;/p&gt;\n&lt;p&gt;We provide support to a large ENT and Otoneurology Service in the form of specialist Vestibular Diagnostic and Rehabilitation Services, Tinnitus Therapy Services and BAHA and Middle Ear Acoustic Implants. The Department has also been accredited by IQIP’s.&lt;/p&gt;\n&lt;p&gt;You will need to be able to demonstrate competency across all clinical fields of Audiology including, diagnostic assessments of hearing loss, select and fit appropriate hearing aids, take aural impressions and reassess existing patients hearing and aid provision according to BSA protocols. The successful candidate will also hold a BSc Hons Audiology or equivalent qualification and be registerable with RCCP.&lt;/p&gt;\n&lt;p&gt;Our aim is to support Sheffield Teaching Hospitals vision:&lt;/p&gt;\n&lt;p&gt;“To be recognised as the best provider of health, clinical research and education in the UK and a strong contributor to the aspiration of Sheffield to be a vibrant and healthy city region&quot;&lt;/p&gt;\n&lt;p&gt;We actively support research projects in conjunction with Neurotology and the trust Research and Development Department. This department uses the Auditbase system.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Faye Morley (Service Manager)&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Email: Faye.morley1@nhs.net&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Tel: 01142711677&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;As part of the recruitment process at application stage, Sheffield Teaching Hospitals will assess applicants’ individual values and behaviours to ensure that these behaviours align with our PROUD values: Patient First, Respectful, Ownership, Unity and Deliver.&lt;/p&gt;\n&lt;p&gt;Our values are what help to make us different and ‘a Brilliant Place to Work’. We expect all our employees to share our values and demonstrate them in every aspect of their role.&lt;/p&gt;\n&lt;p&gt;You will be required to undertake an online values assessment at application stage and the results of this assessment will be used as part of the on-going selection process to assess your suitability for the post.&lt;/p&gt;\n&lt;p&gt;The deadline for completing the online assessment is midnight 18/11/2020.&lt;/p&gt;\n&lt;p&gt;The link to the assessment can be found below, the address can be copied and pasted into a search engine e.g. google:&lt;/p&gt;\n&lt;p&gt;login.talentqgroup.com/Login/SelfService/LULBTJNNTV&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;If you have any queries, require any assistance to complete this assessment or have already completed it within the past 12 months, please contact the Trust Recruitment Team at &lt;strong&gt;sth.centralrecruitment@nhs.net&lt;/strong&gt;&lt;strong&gt;.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt; &lt;/em&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121486.png", "name": "Sheffield Teaching Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121486"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Hallamshire Hospital, Sheffield", "postalCode": "S5 7AU"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4098", "longitude": "-1.45604"}}, "title": "Audiologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242696", "validThrough": "2020-11-08T23:59:59+0000"}