{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-10-29T10:02:21+0000", "description": "&lt;p&gt;**Integrated substance misuse and mental health services** - HMP Garth &amp; Wymott&lt;/p&gt;\n&lt;p&gt;This is an advert for 5 registered nurses RMN/RGN/RNLD to work within the integrated health service at HMP Garth and HMP Wymott. They will be expected to work across the two prisons, however will be based primarily in one service.&lt;/p&gt;\n&lt;p&gt;The prison is based in Leyland, Lancahire and is easily accessible by public transport, Wymott Prison is a Male Adult Category C establishment, and Garth prison is a Male Category B prison that has just entered the high secure estate.&lt;/p&gt;\n&lt;p&gt;Greater Manchester Mental Health are the lead provider of mental health and substance misuse services into Garth and Wymott and work closely in partnership with Bridgewater Community healthcare, who are the primary health providers into the prison.&lt;/p&gt;\n&lt;p&gt;This is an exciting and dynamic role for the post holders who will be looking to expand their knowledge in health and justice services. The post holders will hold a caseload of people who they will work with in providing a package of care into their substance misuse problems, and they will support their mental health needs. They will safely manage and contribute to the clinical element of the substance misuse team, working in collaboration with other health agencies. The post holder will be involved in multi agency working with the psychosocial team (Delphi) working together to meet the needs of the population. They will also work closely with the prison staff/ governors maintaining the close working relationship that is established with HMPPS staff.&lt;/p&gt;\n&lt;p&gt;The post holder will enjoy working within a busy, friendly and professional team, and Greater Manchester Mental Health is keen to support and develop all new members of staff with their training and development needs.&lt;/p&gt;\n&lt;p&gt;We would welcome any potential candidates to enter discussion about this role, to look around the prison and to meet the team if they wish to do so.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameGeoff HunterAdditional contact information&lt;/p&gt;\n&lt;p&gt;Geoff Hunter (Team Manager) geoff.hunter@gmmh.nhs.uk and Yasmin Beline - Yasmin.beline@gmmh.nhs.uk (Team Manager)&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121714.jpg", "name": "Greater Manchester Mental Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121714"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "HMP GARTH AND WYMOTT LEYLAND LANCASHIRE, Leyland", "postalCode": "M25 3BL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5368", "longitude": "-2.29146"}}, "title": "RMN/ RGN - Mental Health and Substance Misuse Services", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247836", "validThrough": "2020-11-12T23:59:59+0000"}