{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "34066", "minValue": "22191", "unitText": "YEAR", "value": "£22,191 - £34,066.50"}}, "datePosted": "2020-10-14T11:38:06+0100", "description": "&lt;p&gt;WE ARE LOOKING FOR TALENTED PEOPLE LIKE YOU!!&lt;/p&gt;\n&lt;p&gt;Knowing that you’re making a difference to people’s lives is rewarding in itself. But our many roles offer much more than that. As well as helping you grow and develop your talent, we want you to feel proud of where you work and what you do.&lt;/p&gt;\n&lt;p&gt;Hazelwood House is a low secure unit for men with a learning disability, including those with co-morbid personality disorders, mental illness and Autism Spectrum Disorder.&lt;/p&gt;\n&lt;p&gt;It is a well-established service in the Midlands that works with patients with intellectual disabilities to reduce their risk, build and consolidate core skills relapse prevention strategies, focusing on the application in real world settings and develop skills for supported or independent living in the community.&lt;/p&gt;\n&lt;p&gt;Job Advert Role Description&lt;/p&gt;\n&lt;p&gt;As a Staff Nurse you will be central to providing high quality care within a secure forensic setting working alongside patients whom have a diagnosis of Personality Disorder, Mental Illness and/or Learning Disability. Within your role you will assist and support staff in the management of the ward to ensure safe and effective management of patients and staff.&lt;/p&gt;\n&lt;p&gt;In return for your expertise and hard work, we offer a wide range of benefits including:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Competitive salary&lt;/li&gt;\n&lt;li&gt;25 days’ annual leave plus 8 bank holidays increasing to 30 days plus bank holidays with length of service&lt;/li&gt;\n&lt;li&gt;Extra Service Annual leave awards&lt;/li&gt;\n&lt;li&gt;Career development – progress across the Staff Nurse grading is via a distinct career path&lt;/li&gt;\n&lt;li&gt;Life assurance&lt;/li&gt;\n&lt;li&gt;Private medical insurance&lt;/li&gt;\n&lt;li&gt;Personal health insurance&lt;/li&gt;\n&lt;li&gt;An employee assistance programme&lt;/li&gt;\n&lt;li&gt;Free meals/refreshments when on duty&lt;/li&gt;\n&lt;li&gt;Free car parking&lt;/li&gt;\n&lt;li&gt;Private Dental Cover&lt;/li&gt;\n&lt;li&gt;Flexible Benefits Packages&lt;/li&gt;\n&lt;li&gt;NMC Payment in full&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Division DBS info&lt;/p&gt;\n&lt;p&gt;No agencies please&lt;/p&gt;\n&lt;p&gt;If you forward any CV’s to the Priory Group and you are not on the Priory Group PSL and have not been asked to work on the above role we will accept the CV as a gift.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About us&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;From education to hospitals, care homes and secure facilities, the Priory Group of Companies offers individually tailored, multidisciplinary treatment programmes for those with complex educational needs or requiring acute, long-term and respite mental healthcare.&lt;/p&gt;\n&lt;p&gt;The integrated strength of each service provides a seamless transition for the individual as they progress between higher and lower dependency care and across services. This unique approach ensures that every individual has the opportunity to achieve the best possible outcomes and quality of life with the Priory Group.&lt;/p&gt;\n&lt;p&gt;As 85% of our services are publicly funded and delivered in partnership with commissioners, our teams work with commissioning bodies across the country to provide transparent pricing models and evidence-based care programmes.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Disclosure&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;All roles will be subject to a successful disclosure at an appropriate level from the Disclosure and Barring Service (DBS), Access NI or Disclosure Scotland. We are an equal opportunities employer.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Priory Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133434"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Heath, Chesterfield", "postalCode": "S44 5QS"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.193", "longitude": "-1.34267"}}, "title": "Registered Nurse (RMN/RNLD)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916226019", "validThrough": "2020-11-13T23:59:59+0000"}