{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110667", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,667 per annum"}}, "datePosted": "2020-10-21T10:46:31+0100", "description": "&lt;p&gt;&lt;strong&gt;Consultant in Respiratory&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity based at Queens Hospital and King George Hospital. The post is for a substantive Respiratory consultant. Applications are invited for 5 Consultant posts in Respiratory Medicine at Barking, Havering &amp; Redbridge Hospitals NHS Trust (1 replacement post and 4 new posts). This is an exciting opportunity for enthusiastic Respiratory consultants with a range of interests to join our diverse and rapidly evolving department. The successful applicants to this post will work alongside 8 existing consultant colleagues to provide core respiratory services and to further develop our sub‐specialty services.&lt;/p&gt;\n&lt;p&gt;The trust is developing the Same Day Emergency Care &lt;strong&gt;(SDEC) &lt;/strong&gt;model to improve quality, effectiveness, and productivity across same‐day emergency care and acute frailty care service provision. SDEC is a relatively new care model that has many parallels with evolution of the elective day case model. It aims to minimise and remove delays in the patient pathway, allowing services to process emergency patients within the same day asm an alternative to hospital admission. SDEC activity refers to the investigation, care and treatment of patients for whom admission to hospital would have been the default option in the absence of an SDEC service.&lt;/p&gt;\n&lt;p&gt;To provide Respiratory input for the SDEC service and to cater to the increasing workload of the department, particularly in light of the ongoing COVID‐19 pandemic, the trust is planning to significantly expand the Respiratory consultant workforce. This would also enable the development of a new consultant led 12‐ bedded Acute Care Respiratory Unit (ARCU), for the provision of dedicated non‐invasive ventilation (NIV) on the Respiratory wards.&lt;/p&gt;\n&lt;p&gt;The respiratory department is an active and forward‐looking team currently composed of eight consultants, six Respiratory specialist registrars, and a team of core medical trainees, foundation trainees and trust grade doctors. Respiratory services are provided at both Queens and King George Hospital sites. These 5 posts will join our existing team of consultant respiratory physicians to deliver a 7 day a week specialist respiratoryservice for inpatients at Queen’s Hospital. All respiratory in‐patients are located on a 60 bedded respiratory unit at Queens Hospital. There are 30 beds each on 2 Respiratory wards, with capacity for up to 6 NIV patientson each ward. . There is a respiratory function laboratory on both sites. Bronchoscopy services are provided at both hospital sites, while EBUS and Sleep Apnoea services are located at King George Hospital. Respiratory outpatients clinics are run across both sites.&lt;/p&gt;\n&lt;p&gt;The respiratory team will provide a consultant delivered Specialist Respiratory on‐call service on a 1 in 12 rota including a 7 day respiratory in‐reach into SDEC. The post holders will also deliver out‐patient respiratory clinics and bronchoscopy as part of their job plan. The team is supplemented by dynamic specialist nurses whohelp to deliver care for patients with TB, lung cancer, COPD, asthma, ILD, pleural disease, NIV and Sleep disordered breathing. The team also supports the local community respiratory services linking with community based respiratory nurses, matrons and physiotherapists&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Post 1 (Consultant with a special interest in Lung Cancer):&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Post 2 (Consultant with a special interest in Asthma):&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Post 3 (Consultant with a special interest in COPD and integrated care)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Post 4 (Consultant with a special interest in TB)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Post 5 (Consultant with a special interest in Lung Infections and Bronchiectasis&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Barking, Havering and Redbridge University Hospitals Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120782"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Respiratory Medical Staff, Romford", "postalCode": "RM7 0AG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5686", "longitude": ".178941"}}, "title": "Consultant in Respiratory", "url": "https://www.jobs.nhs.uk/xi/vacancy/916235977", "validThrough": "2020-11-19T23:59:59+0000"}