{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 Per Annum, Pro Rata"}}, "datePosted": "2020-10-30T17:30:27+0000", "description": "&lt;p&gt;Are you responsive, flexible and committed to making a real difference to the experience and outcome of the bereaved family? Can you provide continuity of support, expert advice and a caring approach?&lt;/p&gt;\n&lt;p&gt;An opportunity has arisen for lead midwife for bereavement services. Working 30 hours the post holder will be responsible for ensuring a coordinated approach to providing responsive, compassionate and caring bereavement care and support to women and their families. This includes coordinating a comprehensive support system, providing a high level of care designed to address the complex issues surrounding pregnancy loss and to meet the special needs of those suffering bereavement due to miscarriage, stillbirth, termination of pregnancy for fetal abnormality or neonatal death.&lt;/p&gt;\n&lt;p&gt;The post holder will work collaboratively with other specialist teams, consultants in obstetrics gynaecology including early pregnancy and neonatal care. It also includes maintaining close working relationships with the local maternity systems, external agencies including the Registrar of Births and Deaths, the Coroner, Primary Care team, Hospital Chaplaincy and Mortuary staff.&lt;/p&gt;\n&lt;p&gt;Part of this role will be to comply with the requirements of the current perinatal surveillance data collection schemes MBBRACE-UK and CDOP and the review process i.e. PMRT, HSIB, ensuring that accurate data, reports and documents are completed and forwarded in a timely manner.&lt;/p&gt;\n&lt;p&gt;The post holder will also be responsible for raising awareness and to educate health professionals in relation to all aspects of care, acting as a positive role model and providing professional knowledge and leadership to all members of the multi-disciplinary team within the maternity services.&lt;/p&gt;\n&lt;p&gt;Are you ready for a challenge and want to make a positive difference? Then this role may be for you. If you feel passionate about providing a coordinated approach and offering a caring and seamless bereavement service, this is an ideal opportunity for you to come and join the welcoming and friendly maternity service team at Lancashire Teaching Hospitals&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameJoanne LambertJob titleMatron for Complex Midwiery CareEmail addressjoanne.lambert@lthtr.nhs.ukTelephone number01772 528327&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Lancashire Teaching Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121125"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Preston Hospital, Preston", "postalCode": "PR2 9HD"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7924", "longitude": "-2.70555"}}, "title": "Lead Midwife for Bereavement", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251061", "validThrough": "2020-11-08T23:59:59+0000"}