{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "112845", "minValue": "84258", "unitText": "YEAR", "value": "£84,258 - £112,845 pa inclusive (Pro-rata if LTFT)"}}, "datePosted": "2020-10-28T13:46:25+0000", "description": "&lt;p&gt;North Middlesex University Hospital is a busy District General Hospital based in Edmonton, North London. We have a busy paediatrics service that also offers multiple sub-speciality in patient and out patient care. We have a dedicate paediatric emergency department that currently sees almost 50,000 children a year. We would be keen to appoint a substantive consultant to cover paediatrics/neonates along with interests in Haematology-Oncology. The successful candidate will also take on the role of Deputy Lead for the Paediatric Haem-Onc&lt;/p&gt;\n&lt;p&gt;We have a reputation for excellent training, motivated junior doctors and consistently high quality nursing and allied health professionals. We are compliant with the London Quality standards. We work within a multi-ethnic population with a high index of deprivation. This is both a challenging and a fascinating hospital to work in. We have a reputation as a close knit and friendly team.&lt;/p&gt;\n&lt;p&gt;We want to appoint dynamic and enthusiastic consultant. We are looking for an individual who will be passionate about the quality of care they provide.&lt;/p&gt;\n&lt;p&gt;For further information please contact Dr. Dhruv Rastogi (Clinicial Director) on 020 8887 3807 or d.rastogi@nhs.net or Dr Justin Daniels (Divisional Director) on 020 8887 2945, Justin.daniels@nhs.net.&lt;/p&gt;\n&lt;p&gt;The Trust is an Equal Opportunities Employer. We provide a smoke free work environment. Due to the nature of this post, an enhanced Disclosure &amp; Barring Service search will be conducted on the successful applicant.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDr Emma DevereuxJob titleClinical Director - PaediatricsEmail addressemma.devereux@nhs.netTelephone number020 8887 3807Additional contact information&lt;/p&gt;\n&lt;p&gt;We encourage informal visits and telephone conversations prior to applying for the roles.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120622.jpg", "name": "North Middlesex University Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120622"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "North Middlesex University Hospital NHS Trust, London", "postalCode": "N18 1QX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6135", "longitude": "-.07424"}}, "title": "Consultant Paediatrician", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246818", "validThrough": "2020-11-25T23:59:59+0000"}