{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19337", "minValue": "18005", "unitText": "YEAR", "value": "£18,005 to £19,337 pa"}}, "datePosted": "2020-11-03T11:00:22+0000", "description": "&lt;h1&gt;Healthcare Assistant - Helena Ward (Neurology), Band 2&lt;/h1&gt;\n&lt;p&gt;&lt;strong&gt;Hello my name is Rosie Lloyd and I am the Ward Manager for Helena Ward at the RUH.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Helena Ward is a 17 bedded Neurology Ward with a well-established Multidisciplinary Team comprising of Nurses, Healthcare Assistants, Medical Staff and Therapists. We have a strong Multidisciplinary focus and work together to deliver high standards of care to patients with Neurological conditions. Our patient group is varied and we care for patients from the age of 18 years upwards. Patients may have long term neurological conditions, traumatic injuries or sudden onset of acute neurological problems.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are looking to recruit a substantive Band 2 Healthcare Assistant into our friendly and hardworking team.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are looking for enthusiastic candidates who demonstrate commitment and compassion to their patients and who strive for excellence. We will offer support and development to successful candidates from an experienced team of senior nursing staff as well as our senior multidisciplinary team colleagues. We will provide successful candidates with a robust orientation programme including Corporate Induction, a period of working in a supernumerary capacity and review of training needs. A designated Junior Sister will work with you and support your objectives for development in line with the RUH appraisal process.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Applicants should have expereince working within healthcare settings either within hospital or within the community. We welcome applications from Healthcare Assistants with a passion for Neurology and delivering safe and effective care to patients.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For more information please do not hesitate to contact me.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Rosie Lloyd 01225 821787/01225 821811&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121339.png", "name": "Royal United Hospitals Bath NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121339"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bath", "postalCode": "BA1 3NG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3917", "longitude": "-2.3912"}}, "title": "Healthcare Assistant - Helena Ward (Neurology), Band 2", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253582", "validThrough": "2020-11-17T23:59:59+0000"}