{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Competitive, Very Senior Manager Salary"}}, "datePosted": "2020-10-22T12:46:19+0100", "description": "&lt;p&gt;&lt;strong&gt;About the team:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will lead a team of 12 staff to deliver exceptional corporate governance, working with the trust Chair and non-Executive Directors and with trust governors to ensure meaningful engagement and local accountability for the organisation. The role will be key in driving value through engagement, building and maintaining dynamic relationships across the Trust and with external partners.&lt;/p&gt;\n&lt;p&gt;The team’s portfolio includes trust secretary functions; responsibility for the trust’s corporate governance framework; management and development of the Board and its committees, Council of Governors and the Executive Leadership Team; and, leadership of the Executive Office and Committee secretariat functions.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the role:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Director of Corporate Affairs is a non-voting member of the Trust Board. The role will contribute to corporate decision making and the strategic development of the Trust alongside the wider Executive team.&lt;/p&gt;\n&lt;p&gt;The post holder will act as principal adviser to the Chief Executive, Chair, board of Directors and Council of Governors on all issues relating to corporate governance, and must be able to keep pace with rapidly changing environments, particularly in light of the Covid-19 pandemic and how the Trust is re-shaping its services to meet the needs of its population and to deliver excellent care. Immersed in the strategic and operational priorities and programmes of work across the Trust, the Director of Corporate Affairs has a critical role in formulating and overseeing effective structures to deliver the Trust’s vision within relevant legal, statutory and regulatory frameworks.&lt;/p&gt;\n&lt;p&gt;If you have any queries about any aspect of the appointment process, need additional information or wish to have an informal and confidential discussion, our Chief of Staff to the CEO, Kate Lillywhite will be pleased to talk to you.&lt;/p&gt;\n&lt;p&gt;Closing date 15th November 2020 (midnight)&lt;/p&gt;\n&lt;p&gt;Interview and stakeholder panel will table place week commencing 30th November 2020&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Benefits&lt;/strong&gt;:&lt;/p&gt;\n&lt;p&gt;We are committed to ensuring our staff get the most out of their benefits package and understand the importance of a healthy work life balance. There is an extensive range of excellent benefits for you and your family. We want you to feel like you are part of a close knit team at SLaM. It’s important to us that you valued and appreciated and that are why we have a comprehensive benefits package on offer&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Some of our benefits are highlighted here:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Generous pay, pensions and leave, &lt;/strong&gt;we offer a comprehensive pay, pensions and leave package which is dependent on the role and length of service.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Work life balance, &lt;/strong&gt;flexible working and support a range of flexible options, such as: part-time working and job sharing.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Career development, &lt;/strong&gt;There are plenty of opportunities to progress your career and we support your development through a number of programmes such as mentoring, coaching, positive people management, collective leadership and other talent programmes&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Car lease, &lt;/strong&gt;our staff benefits from competitive deals to lease cars&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Accommodation, &lt;/strong&gt;our staff benefits from keyworker housing available which is available on selected sites&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;NHS discounts, &lt;/strong&gt;with discounts up to 10% from a variety of well-known retail brands though Health Service Discounts website.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Other benefits include:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Counselling services&lt;/li&gt;\n&lt;li&gt;Wellbeing events&lt;/li&gt;\n&lt;li&gt;Long service awards&lt;/li&gt;\n&lt;li&gt;Cycle to work scheme&lt;/li&gt;\n&lt;li&gt;Season ticket loan&lt;/li&gt;\n&lt;li&gt;Childcare vouchers&lt;/li&gt;\n&lt;li&gt;Staff restaurants&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We look forward to receiving your application.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Kate Lillywhite&lt;/p&gt;\n&lt;p&gt;Chief of Staff to the CEO&lt;/p&gt;\n&lt;p&gt;kate.lillywhite@slam.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123472.png", "name": "South London and Maudsley NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123472"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Maudsley Hospital, London", "postalCode": "SE5 8AZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4687", "longitude": "-.091415"}}, "title": "Director of Corporate Affairs", "url": "https://www.jobs.nhs.uk/xi/vacancy/916238472", "validThrough": "2020-11-15T23:59:59+0000"}