{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "60000", "minValue": "60000", "unitText": "YEAR", "value": "up to £60,000 - FTE - DOE"}}, "datePosted": "2020-11-05T12:20:16+0000", "description": "&lt;h1&gt;Break into prison Healthcare!&lt;/h1&gt;\n&lt;p&gt;&lt;strong&gt;Are you looking for a new challenge in an environment where no two days are the same?&lt;/strong&gt;&lt;br /&gt; &lt;br /&gt; &lt;strong&gt;Are you looking to work for a company that offers support and development opportunities? If so, then this could be the role for you!&lt;/strong&gt;&lt;br /&gt; &lt;br /&gt; Practice Plus Group is looking for a Clinical Psychologist to join our multi-disciplined team at HMP Guys Marsh.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h1&gt;What will you be doing?...&lt;/h1&gt;\n&lt;p&gt;You will be required to work with the lead psychiatrist and senior psychologists within Practice Plus Group to identify appropriate group interventions and develop the necessary materials for other professionals to be able to deliver these programmes. You will also be asked to provide support to professionals delivering these groups and where necessary modify them based on feedback.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h1&gt;What we need from you to do the job? ..&lt;/h1&gt;\n&lt;p&gt;You will have experience of working in primary and secondary care settings including clinical experience with a full range if mental disorders. You will be able to independently provide specialist psychological assessments of patients referred to the team based, upon the appropriate use, interpretation and integration of complex psychological data from a variety of sources including psychological and neuropsychological tests, self-report measures, rating scales, direct and indirect structured observations and semi-structured interviews with clients, family members and others involved in the client’s care.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h1&gt;What will you be doing?..&lt;/h1&gt;\n&lt;p&gt;You will be providing consultation, support and supervision to integrated mental health staff in the delivery of psychological interventions, both individual and group-based. You will be required to contribute to the development of audit, service evaluation and research profile and be responsible for implementing a range of psychological interventions for individuals and groups, within and across teams employed individually and in synthesis, adjusting and refining psychological formulations drawing upon different explanatory models and maintaining a number of provisional hypotheses.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h1&gt;Benefits and Salary...&lt;/h1&gt;\n&lt;p&gt;The salary range for this role is up to £60,000 per annum - Full Time Equivalent -dependent on experience. This is a Part -time position covering 15 hours per week with flexible hours to suit the right applicant.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We offer a variety of benefits including:&lt;/strong&gt;&lt;br /&gt; &lt;br /&gt; • Training and development opportunities&lt;br /&gt; • Company contributory pension scheme&lt;br /&gt; • 25 days annual leave plus 8 bank holidays&lt;br /&gt; • Staff well-being&lt;br /&gt; • Access to bank hours&lt;br /&gt; • CPD and re-validation support&lt;br /&gt; • Cycle to work scheme as well as online retail discounts and other onsite benefits&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;h1&gt;What we need from you to do the job?&lt;/h1&gt;\n&lt;p&gt;You will have a degree in Psychology and be looking to develop your current skills in a unique and ever changing environment. You will have a passion for learning and development, as well as having the initiative to bring new ideas and opinions on how to improve the healthcare services.&lt;br /&gt; &lt;br /&gt; &lt;em&gt;&lt;strong&gt;Please note that we reserve the right to close this role early than stated if a sufficient number of suitable applications have been received.&lt;/strong&gt;&lt;/em&gt;&lt;br /&gt; &lt;br /&gt; &lt;em&gt;&lt;strong&gt;Please note that offers of employment are subject to Practice Plus Group Terms &amp; Conditions and receipt of satisfactory references, enhanced DBS check and prison vetting.&lt;/strong&gt;&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Practice Plus Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130136"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Shaftesbury", "postalCode": "SP7 0AH"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.9847", "longitude": "-2.22129"}}, "title": "Clinical Psychologist - HMP Guys Marsh", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257642", "validThrough": "2020-11-26T23:59:59+0000"}