{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890"}}, "datePosted": "2020-10-27T09:06:00+0000", "description": "&lt;p&gt;&lt;span&gt;Forensic Social Work Practitioner &lt;br /&gt; Band 6/7 1.0 wte (37.5 hours) &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;span&gt; We have a rare and exciting opportunity to offer a developmental Forensic Social Worker role at our Adult Mental Health Low Secure service. Ideally you will be a practising AMHP looking to develop into a highly skilled and specialised Band 7 Advanced Forensic Social Worker within our very supportive social work team. We are looking for a long term commitment from the right applicant who will want to consolidate their experience working in mental health, and develop their skills in Forensic practice and risk management.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;span&gt; The Forensic Directorate operates across two sites; Medium Secure services in Stafford and Low Secure services on Clee Unit at the new Redwoods Centre in Shrewsbury. The service offers acute admission and treatment and a comprehensive rehabilitation program to men with mental health problems who have a history of offending. In addition we have a Low Secure LD ward in Stafford. All units operate with a strong emphasis on the Recovery model of care.&lt;br /&gt; &lt;br /&gt; The post holder will be based at the Clee Unit Low Secure Unit at the Redwoods hospital site in Shrewsbury. The post holder will carry a case load of forensic in-patients within the service, and also have some community patients. The post holder will ideally have some experience of acting as a Social Supervisor within Section 41 of the 1983 Mental Health Act.&lt;br /&gt; &lt;br /&gt; Applicants must hold Social Work England registration and ideally have AMHP status, or be willing and eligible to train. There is an expectation that they will contribute to the local AMHP Rota. In return we can offer an excellent package of training, education and development opportunities into a Band 7 Advanced Forensic Social Worker Role.&lt;br /&gt; &lt;br /&gt; &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Although based predominantly at the Clee Unit in Shrewsbury, the post holder may occasionally be required to attend the Hatherton Centre in Stafford&lt;br /&gt; &lt;br /&gt; We are an equal opportunities employer and welcome applications from all sections of the Community.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;span&gt; The post is offered as permanent position and is an ideal opportunity to develop expertise in Forensic Social Work, within a very supportive Team environment.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;For an informal discussion, to arrange a visit, or for further information please contact Ian Pachner, Head of Forensic Social Work, on 07891 872 275 or Angela Marck Advanced Forensic Social worker on 01743 210079&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Midlands Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121040"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Shrewsbury", "postalCode": "SY3 8DS"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.7076", "longitude": "-2.79477"}}, "title": "Developmental Forensic Social Worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243777", "validThrough": "2020-11-16T23:59:59+0000"}