{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "33166", "minValue": "33166", "unitText": "YEAR", "value": "£19.73 per hour"}}, "datePosted": "2020-11-06T09:15:24+0000", "description": "&lt;h1&gt;&lt;strong&gt;Break in to prison healthcare!&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;&lt;strong&gt;Have you ever thought about working within the prison environment?&lt;br /&gt; &lt;br /&gt; Are you looking for a new nursing challenge?&lt;/strong&gt;&lt;/p&gt;\n&lt;h1&gt;&lt;br /&gt; Then look no further…&lt;/h1&gt;\n&lt;p&gt;HMP Wayland is a Category C male training prison, located near the village of Griston. The site is built up of 13 residential units and has a full healthcare unit. Practice Plus Group provides a dedicated healthcare service specialising in supporting patients with complex medical requirements, mental health issues and primary care needs.&lt;/p&gt;\n&lt;p&gt;Our model of care is our Wellbeing Approach – an integrated, comprehensive approach in recognition of the fact prisoners are a socially-excluded group with healthcare needs which are complex and often associated with poor outcomes. It adopts the premise no single health/wellbeing factor can be taken in isolation of other motivational issues which might impact a person’s care.&lt;br /&gt; &lt;br /&gt; To ensure the continued quality of care at HMP Wayland, we’re looking for Bank Primary Care Nurses to join our team.&lt;/p&gt;\n&lt;h1&gt;&lt;br /&gt; &lt;strong&gt;About the role...&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;Nursing in prison is never dull or predictable. On any given day the skills you use may be similar to those you need working in health promotion or A&amp;E, alternatively you may be supporting people to manage their mental health or substance misuse. It’s this variety that keeps things fresh and stimulating. Every day will bring new challenges and new experiences. But at the same time, you’ll have all the support you need to deliver the best care possible.&lt;br /&gt; &lt;br /&gt; The role will be an experience like no other, requiring a diverse and mixed nursing skills and background. One minute you could be delivering a nurse led clinic and the next you are attending an emergency response.&lt;br /&gt; &lt;br /&gt; You can expect to be involved in everything from clinical triage, suturing, wound care and fracture clinics to the evaluation and development of patient care and standards. You’ll carry out nurse-led clinics, reviewing patient histories, undertaking relevant examinations and tests, organising any necessary treatment and referring patients to other healthcare professionals when you need to.&lt;/p&gt;\n&lt;h1&gt;&lt;br /&gt; &lt;strong&gt;About you...&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;You will be a qualified Registered Nurse (Adult) with a real passion for developing your clinical skills in an environment that is ever changing.&lt;br /&gt; &lt;br /&gt; If you are self-motivated and able to work autonomously as well as showing plenty of initiative when it comes to handling a wide range of situations, then this could be the right role for you!&lt;/p&gt;\n&lt;h1&gt; &lt;/h1&gt;\n&lt;h1&gt;&lt;strong&gt;Further job information...&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;This is a bank role working shifts as and when required. The pay rate is up to £19.73 per hour.&lt;br /&gt; &lt;br /&gt; &lt;em&gt;Please note that this role is subject to Practice Plus Group Terms &amp; Conditions and offers of employment are subject to satisfactory receipt of references, enhanced DBS check and prison vetting.&lt;/em&gt;&lt;em&gt;&lt;br /&gt; &lt;br /&gt; &lt;em&gt;&lt;strong&gt;At Practice Plus Group, we actively promote diversity and equal opportunities.&lt;/strong&gt;&lt;/em&gt;&lt;/em&gt;&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "Practice Plus Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130136"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Thetford", "postalCode": "IP25 6RL"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5534", "longitude": ".861554"}}, "title": "Bank Primary Care Nurse - HMP Wayland", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258977", "validThrough": "2020-11-20T23:59:59+0000"}