{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503"}}, "datePosted": "2020-10-30T09:45:13+0000", "description": "&lt;p&gt;An exciting opportunity to act up into the Band 7 Complex Case / Inpatient Manager post at HMP Durham. This is a 1 year acting up period, which is a great opportunity for existing band 6 nurses to gain experience into a Band 7 role.&lt;/p&gt;\n&lt;p&gt;The post holder will: 1. Support the Head of Transformation in operationally leading the provision of high quality clinical health care services within HMP Durham ensuring a consistent and co-ordinated approach to the delivery of quality evidence-based practice. 2. Be responsible for monitoring daily performance of the nursing team and service delivery against key performance indicators at HMP Durham, this includes working towards the HJIPs (Performance indicators). 3. Work with subcontractors, partners and team leaders to ensure the provision of high quality patient care and the efficient use of resources, maintaining visibility and accessibility to patients and staff. 4. Support the Head of Service in maintaining the Care Quality Commission standards and audits against the 5. KLOE . To represent the Head of Service in local meetings with the Prison and other interested parties&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/126014.jpg", "name": "Spectrum Community Health", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126014"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Durham", "postalCode": "DH1 3HU"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.7734", "longitude": "-1.56696"}}, "title": "Complex Case/Inpatient Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916249524", "validThrough": "2020-11-13T23:59:59+0000"}