{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pa"}}, "datePosted": "2020-11-05T15:31:27+0000", "description": "&lt;p&gt;As a result of our on-going response to the Covid-19 pandemic we are keen to hear from Registered Mental Health and Learning Disability Nurses to join our new Responsive Workforce Team. This is a new and exciting initiative we have developed to help to support our Trust during the current pandemic, and to help support winter pressures in our services.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Opportunity and Offer &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;These are excellent opportunities for Registered Mental Health and Learning Disability Nurses who enjoy the flexibility of variable work patterns, but who would also enjoy some assurance around regular work patterns (operational requirements dependent) during these uncertain times. This provides an exciting opportunity to contribute to the safe and sustained running of our services, and to work as part of a team that will be well supported with supervision and training.&lt;/p&gt;\n&lt;p&gt;These roles are available on a &lt;strong&gt;fixed term contract basis&lt;/strong&gt; until the end of March 2021.&lt;/p&gt;\n&lt;p&gt;In recompense for staff in the Responsive Workforce Team committing to this high degree of flexibility in terms of deployment, variable work patterns, and the different service areas you may work in, you will be paid an additional (taxable) allowance of &lt;strong&gt;£500 per month &lt;/strong&gt;(subject to complying with the terms and conditions under your contract of employment).&lt;/p&gt;\n&lt;p&gt;Please note that we are not able to extend this offer to existing substantive LYPFT staff as this responsive workforce has been developed as an additional support to existing staffing numbers and overall operational delivery. Similarly we are unable to extend this offer to newly qualified preceptees.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Responsive Workforce; the expectation: &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Individuals interested in the Responsive Workforce team will be required to work &lt;strong&gt;a minimum of 30 hours per week,&lt;/strong&gt; and will be allocated shifts in a range of clinical areas across our services. In some cases this will mean working normal patterns of day &amp; night shifts, individuals must therefore be able to work across all areas, and must be &lt;strong&gt;flexible in relation to shift patterns and travel&lt;/strong&gt;.&lt;/p&gt;\n&lt;p&gt;Subject to operational requirements you will ideally work for a fixed period of time in the same ward / team although you may be required to move at short notice in cases of significant staffing shortages.&lt;/p&gt;\n&lt;p&gt;Where you work and the shifts you work will be determined by the needs of our services, and the expectation is that anyone in this new Responsive Workforce team will be willing and able to do this.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Please contact Ian Hoyles or Lewis Omatseone on 0113 8559900 (option 1)&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122192.jpg", "name": "Leeds and York Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122192"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Leeds", "postalCode": "LS15 8ZB"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7968", "longitude": "-1.4265"}}, "title": "Staff Nurse – Responsive Workforce (Additional Allowance of £500 pcm)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258347", "validThrough": "2020-11-19T23:59:59+0000"}