{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62001", "minValue": "53168", "unitText": "YEAR", "value": "£53,168 - £62,001 per annum"}}, "datePosted": "2020-10-30T14:16:50+0000", "description": "&lt;p&gt;The post will be for a fixed term 12 month period due to the current post holder taking up an alternative fixed term post.&lt;/p&gt;\n&lt;p&gt;If you are a Hywel Dda Health Board employee this post will only be offered on a secondment basis and you will need to have gained your line managers approval for the secondment prior to going to interview.&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for a Service Delivery Manager within our Unscheduled Care directorate at Bronglais General Hospital, Aberystwyth. The post holder will be responsible for the management of Gastroenterology and Neurology Services across Hywel Dda University Health Board as well as service delivery within the Unscheduled Care Directorate of Bronglais General Hospital. This provides a fantastic opportunity to ensure delivery of safe &amp; sustainable patient care.&lt;/p&gt;\n&lt;p&gt;The post holder will report directly to the Hospital General Manager and will have full delegated managerial responsibility for medical &amp; emergency care specialties within the directorate. This will include aspects of patient flow as well as the delivery of relevant performance targets. Responsibility for delegated budgets will also be assumed with a requirement to support the General Manager to deliver the agreed financial forecast at the end of the year.&lt;/p&gt;\n&lt;p&gt;The successful applicant will have proven leadership qualities and will serve as a role model and guide to other staff across services. This post holder will work with others to shape service delivery for the future of our population and will be an influential in the transformation of clinical services going forward.&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; English and/or Welsh speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt;Interviews to be held 13th November 2020.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameHazel DaviesJob titleYsbyty Rheolwr Cyffredinol/Hospital General ManagerEmail addresshazel.davies@wales.nhs.ukTelephone number01970 635922&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123194.gif", "name": "Hywel Dda University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123194"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bronglais General Hospital, Aberystwyth", "postalCode": "SY23 1ER"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4161", "longitude": "-4.07159"}}, "title": "Service Delivery Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250522", "validThrough": "2020-11-08T23:59:59+0000"}