{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 pa"}}, "datePosted": "2020-11-05T15:15:59+0000", "description": "&lt;p&gt;&lt;strong&gt;We are looking for a highly motivated Community Assistant Practitioner to join our community nursing team based in Fakenham and Holt covering Fakenham, Wells, Holt and Sheringham GP surgeries.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Working in the picturesque North Norfolk area our patch our patch covers a wide area in and around the beautiful Norfolk coast and encompasses beautiful rural coastal villages such as Blakeney, Cley and Burnham Overy-Staith rich in history, culture and wildlife.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This is an ideal opportunity for career progression and experience within a community setting. The trust has recently achieved outstanding from CQC and we are proud to say we are the first community trust to have achieved this accolade. This is a testament to the forward progressive nature of the trust and our commitment to delivering high quality care in sometimes challenging environments.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are looking for a highly motivated Community Assistant Practitioner to join our community nursing team, covering the service seven days a week. This role is key to the on-going development of the locality. You will eventually be working in an autonomous capacity seeing a group delegated patients in their own homes. Current experience working in a community setting would be beneficial but is not essential.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Your role will be key to integrated working within the community team which consists of community nurses, community matrons, therapists, other assistant practitioners, health care assistants and phlebotomists. You must demonstrate that you can undertake appropriate assessment of patients in their own home, manage care plans and deliver treatment within a multidisciplinary team. This is an exciting opportunity to enhance your skills with the support of experienced therapy and nursing staff.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;IT skills will be essential within this role. Training in IT systems for this role will be undertaken as part of a comprehensive induction programme. You will be working in a team setting and would be expected to feedback any concerns to senior members of the team and be an effective team player.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If this post excites you, and you are looking to improve your quality of life working in rural Norfolk as part of this developing role we look forward to your application. If you wish to discuss any aspects please contact Carré Varley, Clinical Operations Manager on 07717 542922.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n ", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Norfolk Community Health and Care NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120940"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Kelling Hospital/Fakenham Medical Practice, Holt/Fakenham", "postalCode": "NR25 6QA"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9145", "longitude": "1.11606"}}, "title": "Community Assistant Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258284", "validThrough": "2020-11-27T23:59:59+0000"}