{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Dependant upon experience"}}, "datePosted": "2020-10-27T10:46:01+0000", "description": "&lt;p&gt;&lt;span&gt;&lt;span&gt;An exciting opportunity has arisen for highly motivated Specialty Doctor in Obstetrics and Gynaecology -to join our team at Calderdale and Huddersfield NHS Foundation Trust for a fixed term period of one year. This would be an excellent opportunity for a somebody looking to join the trust to gain experience as a newly appointed Specialty Doctor or an existing Specialty Doctor looking for a new challenge. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;The post holder must have a minimum of four years medical experience with at least 2 years within Obstetrics and Gynaecology. The post will provide excellent experience in a District General Hospital setting for doctors who wish to pursue a career in this area of specialism.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;This role would suit somebody with previous NHS experience, somebody who is looking to develop a career through the CESR pathway to become a largely independent practitioner. &lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;The role could be an excellent opportunity for clinicians who wish to progress their career via CESR to Consultant level within the UK.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Calderdale and Huddersfield NHS Foundation Trust are proud providers of acute hospital services, where we value our staff and recognise that they are our greatest asset. With a fantastic leadership team, headed by Owen Williams, our CEO who has just made it to the top 100 BAME Leaders list CHFT is at the forefront of Digital Health utilising a number of electronic solutions to improve patient care. The CQC rated us as Good in June 2018. In their report they confirmed that; “Staff were caring and provided compassionate care. Patients were treated with dignity and respect and their privacy was respected. Patients spoke positively about the care they received”.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;If you want to join a supportive and friendly team providing compassionate care then come and join us to help us achieve ‘outstanding’ in the next CQC inspection. We are nestled in the heart of the stunning Pennine hills; the area which inspired the works of the Bronte sisters. We’re conveniently located close to Manchester, and surrounded by breath taking scenery, places to visit and things to do. With an affordable housing market and fantastic schools CHFT is perfect for family life as well as professional development. If you want to talk about opportunities please contact us at &lt;/span&gt;medicalhr@cht.nhs.uk&lt;span&gt; and we will put you in touch with the relevant people that can tell you more about the role and how you can fit into the team. If you require any further information you can call the Medical HR team on 01484 355029.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Applicant must have the following:&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;span&gt;&lt;span&gt;GMC Registration&lt;/span&gt;&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;&lt;span&gt;Teaching/Training Experience&lt;/span&gt;&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;&lt;span&gt;Completed Research&lt;/span&gt;&lt;/span&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameGill HarriesJob titleDeputy Director of OperationsEmail addressGill.Harries@cht.nhs.ukTelephone number01422 224338&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Calderdale and Huddersfield NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121129"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Calderdale and Huddersfield NHS Foundation Trust", "postalCode": "HD3 3EB"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.6557", "longitude": "-1.82159"}}, "title": "Speciality Doctor - Obstetrics and Gynaecology", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244073", "validThrough": "2020-11-10T23:59:59+0000"}