{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "28000", "minValue": "28000", "unitText": "YEAR", "value": "£28,000"}}, "datePosted": "2020-11-04T13:56:08+0000", "description": "&lt;p&gt;Partnering Health Limited are an established and expanding healthcare organisation responsible for providing a variety of urgent and primary health care services across Hampshire.&lt;/p&gt;\n&lt;p&gt;We are pleased to announce an exciting opportunity for the role of &lt;strong&gt;Deputy Service Manager, &lt;/strong&gt;to join our Healthcare Centre in Guildhall Walk, Portsmouth on a fixed term contract until July 2021.&lt;/p&gt;\n&lt;p&gt;Guildhall Walk Healthcare Centre is an NHS GP surgery situated close to the city centre and surrounded by the University of Portsmouth Campus. The multi-disciplinary team provide registered patients from the Portsmouth community with treatment and advice for their daily healthcare needs. They constantly seek to provide an exceptional standard of quality healthcare to their patients.&lt;/p&gt;\n&lt;p&gt;As a &lt;strong&gt;Deputy Service Manager&lt;/strong&gt; at Partnering Health Limited (PHL), your role is to be accountable for supporting the successful delivery of the APMS contract for Guildhall Walk Primary Care Service working alongside the Service Manager, Clinical Manager and Clinical Lead. This post would ideally suit someone already working within this role or similar, as primary care leadership experience is crucial to this role or could lend itself to someone looking to progress their management career within Primary Care.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Deputy Service Manager Duties &amp; Responsibilities:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Leadership:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Oversee the non-clinical staff, supporting them to deliver against their objectives and goals&lt;/li&gt;\n&lt;li&gt;Support the delivery of the Quality Outcomes Framework as part of the AMPS contract&lt;/li&gt;\n&lt;li&gt;Support the delivery of LCS, LIS, CQUINN standards, through the prioritisation and management of daily workloads and focus areas&lt;/li&gt;\n&lt;li&gt;Deputise in the Managers absence&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Operations Management&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Oversee and/or develop and manage an effective appointment system&lt;/li&gt;\n&lt;li&gt;In conjunction with the Service Manager, convene meetings, prepare agendas and ensure distribution of minutes as necessary.&lt;/li&gt;\n&lt;li&gt;Support the upkeep of appropriate rosters to ensure that the service is adequately staffed at all time&lt;/li&gt;\n&lt;li&gt;Maintain strong links to the remote clinical workflow and administration team&lt;/li&gt;\n&lt;li&gt;Work with the central HR and Recruitment teams to support recruitment and retention of staff within your service&lt;/li&gt;\n&lt;li&gt;Support the development and delivery of staff induction and training, ensuring that all staff are adequately trained to fulfil their role&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Deputy Service Manager Skills and Experience:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Experience within Primary Care or similar in a leadership capacity&lt;/li&gt;\n&lt;li&gt;Recognised Management qualification or equivalent experience&lt;/li&gt;\n&lt;li&gt;Demonstrable experience of people management&lt;/li&gt;\n&lt;li&gt;Experience of performance management&lt;/li&gt;\n&lt;li&gt;Understanding of clinical governance, health &amp; safety and risk management&lt;/li&gt;\n&lt;li&gt;Knowledge of CQC compliance requirements&lt;/li&gt;\n&lt;li&gt;Quality focused with innovative approach, the ability to solve problems and implement action plans.&lt;/li&gt;\n&lt;/ul&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/135074.jpg", "name": "Partnering Health", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=135074"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Portsmouth", "postalCode": "PO8 8DL"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8939", "longitude": "-1.01816"}}, "title": "Deputy Service Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256093", "validThrough": "2020-11-18T23:59:59+0000"}