{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "3365700", "minValue": "3365700", "unitText": "YEAR", "value": "£33,65700 - depending on experience"}}, "datePosted": "2020-10-16T12:49:35+0100", "description": "&lt;p&gt;Beverley House is a 24-bedded rehabilitation hospital for women over the age of 18, situated in the heart of the community in Birmingham.&lt;/p&gt;\n&lt;p&gt;Patients admitted to Beverley House may be informal or detained under the Mental Health Act with a primary diagnosis of mental illness and personality disorder with complex needs.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen at Beverley House, for an enthusiatic individual to join our team.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; The post holder will work as a member of the nursing team, meeting the health, well being and mental health care needs of our patients under the indirect and direct guidance and supervision of the Charge Nurse / Ward Manager.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Providing leadership and support for support staff and act as a champion for residents’ safety and dignity.  Maintaining skills and knowledge and ensure that care is delivered according to latest guidelines and best practice evidence available.&lt;/p&gt;\n&lt;p&gt;Ensuring the ongoing safety of service users, residents, staff and visitors through systematic assessment, monitoring and reviewing processes.  Ensuring that clear and accurate records and communication systems relating to clinical and care delivery are maintained and effectively used and acting as a role model for good clinical and care governance practice.&lt;/p&gt;\n&lt;p&gt;Taking charge of the unit regularly and in the absence of the management team, accepting responsibility for the smooth and effective running of the unit&lt;/p&gt;\n&lt;p&gt;Helping to maintain the security of the building and its environment.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Beverley House prides itself on all our nurses delivering care, compassion and empathy.&lt;/p&gt;\n&lt;p&gt;The post holder will provide an efficient and professional service ensuring the best possible standards of care at all times complying with all statutory requirements and following Priory policies and procedures.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Skills&lt;/p&gt;\n&lt;p&gt;A relevant nursing qualification and registration&lt;/p&gt;\n&lt;p&gt;Excellent team working skills, a high level of self-motivation and a flexible approach - our units operate 24 hours 7 days a week, and our nursing staff work shift patterns including weekends, bank holidays and nights&lt;/p&gt;\n&lt;p&gt;A commitment to patient-centred care and to values-based and evidence-based practice&lt;/p&gt;\n&lt;p&gt;The drive to continually push your own personal learning and development&lt;/p&gt;\n&lt;p&gt;Be recovery focused.&lt;/p&gt;\n&lt;p&gt;Be conversant with CPA (Care Programme Approach).&lt;/p&gt;\n&lt;p&gt;Being able to effectively manage the ward resources of a shift/daily basis&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Benefits&lt;/p&gt;\n&lt;p&gt;Free meals&lt;/p&gt;\n&lt;p&gt;Free parking&lt;/p&gt;\n&lt;p&gt;Investment in CPD&lt;/p&gt;\n&lt;p&gt;Clinical supervision&lt;/p&gt;\n&lt;p&gt;Monthly staff appreciation days and much more.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Priory Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133434"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "BIRMINGHAM", "postalCode": "B17 8LL"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4753", "longitude": "-1.96082"}}, "title": "SENIOR NURSE - RMN", "url": "https://www.jobs.nhs.uk/xi/vacancy/916230267", "validThrough": "2020-11-27T23:59:59+0000"}