{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 pa"}}, "datePosted": "2020-11-02T16:16:51+0000", "description": "&lt;p&gt;Leeds and York NHS Partnership Trust is an ambitious Trust providing Mental Health and Learning Disabilities services across Leeds and York. With our core values of Integrity, Simplicity and Care, the quality of the service we provide is at the heart of our Person Centred Care commitment.&lt;/p&gt;\n&lt;p&gt;We currently have two exciting opportunities for Consultant Psychiatrists to join our thriving low secure forensic service based in York. The successful candidates will join a multi-disciplinary team and will be responsible for providing leadership to either the 12 bed male or female ward. Part of the Trust’s wider Forensic Service, the service has recently attracted new funding and plays a key role in the Humber, Coast and Vale sustainability and transformation partnership (STP). This provides an exciting opportunity to undertake a leadership role within the STP to shape the future of forensic services in York.&lt;/p&gt;\n&lt;p&gt;You’ll be part of our highly-regarded medical directorate and there are exciting opportunities to get involved in teaching, research, leadership and quality improvement.&lt;/p&gt;\n&lt;p&gt;We are currently working with the IHI and have undergone extensive improvement in this service that has significantly improved the staffing and morale&lt;/p&gt;\n&lt;p&gt;Previous training or experience in a forensic services would be beneficial, training and support is available to enable a psychiatrist with general training to develop into the role and anyone with an active interest in this area is encouraged to apply.&lt;/p&gt;\n&lt;p&gt;York is designated the “best place to live in Britain” according to The Sunday Times’ 2018 guide and in addition to our very attractive professional training and development package, a relocation package and first year enhancement may be offered to the right candidate.&lt;/p&gt;\n&lt;p&gt;Applications from candidates wishing to work flexibly are welcome.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please specify if you are applying for Westerdale or Bluebell in the supporting information section of your application.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;**Please note any correspondence following application will be sent via trac.jobs &amp; the Trust&#39;s Resourcing Team**&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Jonathan King on 01133056443.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122192.jpg", "name": "Leeds and York Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122192"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "York", "postalCode": "YO30 5RA"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.9776", "longitude": "-1.11445"}}, "title": "Consultant Forensic Psychiatrist (Westerdale or Bluebell)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252809", "validThrough": "2020-11-27T23:59:59+0000"}