{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615"}}, "datePosted": "2020-10-21T15:44:32+0100", "description": "&lt;p&gt;&lt;strong&gt;Do you see the news about people who have committed offences and think “send them to prison” if the answer is yes then this definitely is not the job for you! &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;However if you think “I wonder what happen to that person for this to have happened” or “ what could help this person not to commit further offences” then this could be the job you are looking for. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are excitedly looking for nurses to join our expanding team who want to be part of a team who is passionate about supporting people to address their needs and divert them away from criminal behaviour. Whilst helping other agencies understand how or why these individuals have found themselves making the decisions that they have.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are a partnership (Midlands Partnership Foundation Trust and North Staffordshire Combined Healthcare Trust) service covering the whole of Staffordshire, providing an all ages service across the county.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If you are thinking that you don’t have the experience with this cohort or that you are not sure if it’s for you please do not hesitate to contact us for a chat, you may be just what we are looking for!&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Staffordshire Liaison and Diversion Team are looking for a Learning Disability Nurse / Registered Mental Health Nurse who is interested in working within the Liaison and Diversion outreach Team, predominantly for children and young people up to the age of 18. This is a unique post to develop a wide range of knowledge and experience, and develop professional autonomy.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The role is varied and stimulating. Applicants would be primarily engaging Children and Young People at the earliest opportunity within the criminal justice system, offering physical and mental health assessments, alongside offering support across the all age outreach service.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Liaison &amp; Diversion (youth pathway) operates through three inter-related stages followed by onward referral:&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;&lt;strong&gt;Identification&lt;/strong&gt;: criminal justice agencies, such as police will refer children and young people to the service that have offended at a low level.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;&lt;strong&gt;Screening&lt;/strong&gt;: L&amp;D practitioners carry out screening to identify a need. Children will be referred on for further assessment, treatment or further support.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;&lt;strong&gt;Assessment&lt;/strong&gt;: L&amp;D services can also complete or refer for further assessment, including specialist assessment.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;&lt;strong&gt;Referral: &lt;/strong&gt;Children needing further support and treatment will be referred into appropriate services.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The all age outreach service, provides support in addressing unmet vulnerabilities within community settings.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The role is fast paced and challenging and requires the team to provide care to People who are living in the community. The people which you would be working with can be very complex, having both emotional/mental health and unmet physical health needs and other vulnerabilities.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This post is a rare opportunity which would encourage nurses to work supporting People and their families, alongside the Youth Offending Service, probation and the Police.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Midlands Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121040"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Stoke-on-Trent", "postalCode": "ST1 2BN"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.0273", "longitude": "-2.17062"}}, "title": "Liaison &amp; Diversion Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916237121", "validThrough": "2020-11-09T23:59:59+0000"}