{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Hourly Paid"}}, "datePosted": "2020-11-02T13:01:31+0000", "description": "&lt;p&gt;We are looking for bank nurses to work in our Emergency Department.&lt;br /&gt;&lt;br /&gt;You must be a qualified nurse with 6 months post qualification experience preferable in an acute setting. &lt;br /&gt;&lt;br /&gt;You must have completed a certificate in Critical care and be able to provide evidence of this.&lt;br /&gt;&lt;br /&gt;Please see person specification for details of required experience and qualifications.&lt;br /&gt;&lt;br /&gt;Our Emergency Department sees over 90,000 patients a year, and has an integrated Paediatric Emergency Department and an Urgent Care Centre. In addition to this, we are in the unique position of having a consultant led care of the Elderly Team who assess older patients for appropriate admission or organise enhanced social care support in the community. &lt;br /&gt;&lt;br /&gt;The Urgent Care Centre within our Emergency Department has our ENPs working with the GPs to deliver an efficient and responsive service. The department has an active research programme with a number of nursing staff within the department undertaking research projects. &lt;br /&gt;&lt;br /&gt;World class services&lt;br /&gt;&lt;br /&gt;The Royal Free London NHS Trust is an internationally renowned teaching hospital, rated as excellent by the Care Quality Commission.&lt;br /&gt;&lt;br /&gt;We offer an exceptionally wide range of local and specialist services, including accident and emergency, maternity, general surgery and critical care, services for cancer, infectious diseases and blood disorders. A regional centre for kidney and liver diseases and a major centre for liver and kidney transplants, we are also the vascular and haemophilia hub for north London and one of two heart attack centres in the area. We also provide a national centre of excellence for facial re-animation surgery and ear and breast reconstruction; the only centre in the UK specialising in amyloidosis; the country’s largest myeloma clinic; a European centre of excellence for neuroendocrine tumours; and one of six nationally designated units for patients with lysosomal storage disorders. We were Dr Foster’s large trust of the year in 2010.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Temporary Staffing&lt;/p&gt;\n&lt;p&gt;Email address: rf.tsrecruitment@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number: 02077940500&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120624.jpg", "name": "Royal Free London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120624"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Free, Hampstead and Barnet General Hospital, London", "postalCode": "NW3 2QG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5532", "longitude": "-.165298"}}, "title": "Bank A&amp;E Nurse Band 5", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252145", "validThrough": "2020-11-08T23:59:59+0000"}