{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum pro rata"}}, "datePosted": "2020-10-30T16:30:51+0000", "description": "&lt;p&gt;We are recruiting a Business Support Manager (1 year FTC), reporting to the Deputy Director of Workforce. This post is for a period of one year to support the Workforce directorate through their ongoing improvement journey.&lt;/p&gt;\n&lt;p&gt;We are looking to recruit a highly enthusiastic, well organised, compassionate and well-motivated individual to work with the Workforce Directorate senior management team. Our ideal candidate will have extensive knowledge of HR practice and policies, be well-versed in the latest employment legislations, and be able to apply this knowledge to support/lead the Workforce Directorate projects, propose strategic papers to the Board and committees, attend key meetings and take forward actions for the directorates.&lt;/p&gt;\n&lt;p&gt;The successful candidate will work autonomously to ensure that the directorate senior leadership team has appropriate business support in place, along with sufficient HR systems and processes to enable the Workforce Directorate to meet all relevant operational performance standards. You will be responsible for fostering excellent communication and working relationships amongst the workforce directorate, operational teams, corporate services, and information teams, and will be a key Workforce representative for operational matters across the Trust.&lt;/p&gt;\n&lt;p&gt;The Business Support Manager will be required to work extremely closely alongside the Director and Deputy Director of Workforce to support on a range of duties. The role will be responsible for planning, supporting, coordinating and facilitating progress of defined programs of work on behalf of the Workforce Senior Leadership team.&lt;/p&gt;\n&lt;p&gt;This is an exciting new opportunity to make a valuable contribution and support a busy HR team. If you have the necessary attributes and skills, we welcome your application.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Megan Graziano&lt;/p&gt;\n&lt;p&gt;Recruitment Coordinator&lt;/p&gt;\n&lt;p&gt;megan.graziano@eastamb.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120792.jpg", "name": "East of England  Ambulance Service Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120792"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Melbourn", "postalCode": "SG8 6NA"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.0766", "longitude": ".014437"}}, "title": "HR Business Support Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250946", "validThrough": "2020-11-15T23:59:59+0000"}