{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19500", "minValue": "19500", "unitText": "YEAR", "value": "£19,500"}}, "datePosted": "2020-11-03T10:20:07+0000", "description": "&lt;p&gt;&lt;em&gt;Here at Omnes Healthcare we believe in innovation; we believe in listening to everyone; we believe in providing quality service; and we believe our employees will help us achieve our mission. We are looking for individuals who share these values to join our growing organisation.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are seeking a Team Leader to join the Omnes Healthcare Family; become part of a company that makes a difference.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Salary:£19,500 per annum&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Hours: 40 per week&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Location: Remote and apx 4 days onsite per month in London and Southend&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;em&gt;We have fully COVID compliant infection control policies in place&lt;/em&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Who we are:&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Omnes Healthcare are a trusted partner in delivering primary and secondary NHS care services. Our quality services cover a wide range of specialities, including General Practice, and our aim is to provide accessible and patient-focused care by working collaboratively and embracing new ways of working, including the application of innovative technology.&lt;/p&gt;\n&lt;p&gt;We are dedicated to achieving better outcomes for our patients, whilst supporting the NHS and saving our commissioners money.&lt;/p&gt;\n&lt;p&gt;Our staff are rewarded by becoming an integral part of delivering excellent patient care, working within a growing company and our attractive employee benefits, including remote working and your birthday off! Join an expanding organisation and take advantage of a brand-new employer in your area!&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What is the purpose of the position?&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;As a Team Leader, you will be working closely with our Contract Leads and Deputy Director of our Healthcare Operations Centre. You will be responsible for a team of Patient Healthcare Advisors. This is a great opportunity to gain valuable leadership experience.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;What are the key responsibilities?&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Jointly responsible for the management of incoming referrals, appointment booking, clinic occupancy, discharge of patients/ letters back to GPs (and GDPs), hub relationship management, and any urgent matters arising.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;What do you need to join the Omnes Healthcare Family?&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Leadership and magement experience&lt;/li&gt;\n&lt;li&gt;Clear thinking and have an analytical approach&lt;/li&gt;\n&lt;li&gt;Able to work as part of a team, to promote a good team spirit and to be sensitive and assertive as appropriate&lt;/li&gt;\n&lt;li&gt;Experience in a client facing/customer service position&lt;/li&gt;\n&lt;li&gt;Be motivated and able to work independently&lt;/li&gt;\n&lt;li&gt;Ability to lead a team remotely&lt;/li&gt;\n&lt;li&gt;Ability to work remotely with suitable broadband connection&lt;/li&gt;\n&lt;li&gt;Ability to attend our Head Office at London Bridge (Southend Onwards from Dec 2020) and | or GP and Secondary Care Practices as required to attend training sessions, participate in engagement activities and other duties when required.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;What Omnes Healthcare will offer you in return?&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A great place to work and the opportunity to make a difference&lt;/li&gt;\n&lt;li&gt;25 days holiday plus bank holidays&lt;/li&gt;\n&lt;li&gt;An extra day off to celebrate your birthday&lt;/li&gt;\n&lt;li&gt;NHS Discount&lt;/li&gt;\n&lt;li&gt;Remote working capabilities&lt;/li&gt;\n&lt;li&gt;And other fantastic benefits&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;em&gt;Apply today if you would like to make a difference.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Please be aware that all communications about this vacancy will be received to you via email. Always check your mailbox and junk mail folders and provide a UK mobile number if available.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/134554.png", "name": "Omnes Healthcare Limited", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=134554"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Remote | London &amp; Southend", "postalCode": "SS2 6DF"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5435", "longitude": ".70868"}}, "title": "Team Leader", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253432", "validThrough": "2020-11-10T23:59:59+0000"}