{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 per annum pro rata"}}, "datePosted": "2020-10-27T16:45:21+0000", "description": "&lt;p&gt;&lt;span&gt;&lt;span&gt;If you&#39;ve been spending the whole day looking for that perfect opportunity, your search is over.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;strong&gt;Post 1&lt;/strong&gt; - Speech and Language Therapist (SLT) Band 6, 2.0 wte Fixed Term Contract (FTC) 11 months within both the Mainstream Traded offer and Mainstream Community Clinic and Schools offer. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We currently have a 2.0 wte vacancy at Band 6 within the Leeds Children&#39;s Speech and Language Therapy Service to work as part of the traded offer in addition to working within the mainstream community clinics and schools across Leeds. &lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;You will provide assessment, diagnosis and intervention for children with Speech, Language and Communication Needs (SLCN).&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;You will work within a patch based team comprising of other Speech &amp; Language therapists, Specialist Speech &amp; Language Therapists and Speech and Language Therapy Assistants.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;You will be responsible for the delivery of episodes of care that include assessment, interventions and ongoing support for children, families and practitioners.&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;span&gt;The Children&#39;s Speech and Language Therapy Traded Service describes the opportunity for settings to enhance or &#39;trade&#39; in order to increase the amount of support that they have in settings. This is over and above the NHS mainstream service. The NHS Speech and Language Therapy service allows for children to be offered support and prioritised according to their individual need. This may include a re-assessment, a package of direct 1:1 intervention, group sessions, or specific advice and recommendations for parents and/or school staff to carry out. Appointments for assessment and/or intervention can be offered in school or clinic settings. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;For queries please contact Hana Haziem (CSLT Service Manager) on 07903879477. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;&lt;strong&gt;Post 2&lt;/strong&gt; - Speech and Language Therapist (SLT) Band 6: 2 x 1.0wte positions Fixed term 6 months &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;About the role &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We have the unique opportunity for 2 whole time equivalent B6 Speech &amp; Language Therapists to work as part of the Clinical Placement Expansion Programme. This programme will help support SLT student placements within the Leeds Children&#39;s Speech and Language therapy Service. This is in partnership with Leeds Beckett University. &lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;You will work as part of the mainstream settings and Community Clinics offer across Leeds.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;You will provide assessment, diagnosis and intervention for children with Speech, Language and Communication Needs (SLCN) and will be part of a city wide service.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;You will work as part of the clinical triage team and support SLT students to provide support and advice for families with children SLCN.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;You will help support a rolling programme of SLT students every half term. This will include supporting the SLT students with observations, participation in sessions and also reflection/ feedback.&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;span&gt;The Clinical Placement Expansion Programme is an expansion fund provided by Health Education England (HEE) and supported by NHS England/Improvement (NHSE/I) to deliver sustainable placement growth in the NHS workforce, in line with the ambitions of the Long-term Plan, throughout the academic year 2020/2021. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Please be aware that due to COVID19 we are currently operating mainly a digital (video and telephone consultations) offer to our children and families with a small proportion of face to face appointments.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Queries about this role to please be directed to Nicola Waddington (CSLT Clinical Advisor) - nwaddington@nhs.net or telephone 07736473610 &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;About Children&#39;s Speech and Language Therapy in Leeds &lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;If you are a new graduate you will be supported within our well established mentoring programme to complete the RCSLT competencies. There is a strong management/peer support structure including access to regular clinical and safeguarding supervision and a wide range of opportunities for CPD (Continuing Professional Development). You will have access to a high level of support from other Highly Specialist SLT colleagues, Clinical Leads and the Children&#39;s Speech &amp; Language therapy leadership team. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are a hardworking, forward thinking and supportive service. For further information please visit our website- leedscommunityhealthcare.nhs.uk/cslt.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;As an employee of Leeds Community Healthcare NHS Trust, you will be part of a dedicated and passionate team who truly believe in providing high quality care to all. In addition to an exciting and rewarding career, you will also receive a full induction and supervision programme, continued commitment to professional development, a supportive environment to develop your clinical skills, and much more.&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Leeds Children&#39;s Speech &amp; Language Therapy- Building Communication Skills for Life&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;About you &lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Are you looking to develop your knowledge, experience and skills as a Band 6 Speech and Language Therapist? &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Do you enjoy being part of a dynamic and innovative team? &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Are you passionate and eager to provide the best and effective service to the children and families in Leeds?&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;If you said yes to the above then please read on! &lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;You will be registered with both HCPC and RCSLT.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;You will be expected to work and liaise with others such as parents/carers, education-based staff and other professional colleagues.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;We currently require staff to work a minimum of 0.6wte across the week to ensure clinical capacity within the service alongside completion of statutory/mandatory training, ongoing CPD etc.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;You will provide assessment, diagnosis and intervention for children with SLCN across community and mainstream settings. You will have extensive experience of working with a paediatric caseload across a number of settings.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Please be aware that due to COVID19 we are currently operating mainly a digital (video and telephone consultations) offer to our children and families with a small proportion of face to face appointment.&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;span&gt;If you couldn&#39;t resist picturing yourself in this role, you know what to do - click that apply button!&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122058.jpg", "name": "(CS) Leeds Community Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122058"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "City wide", "postalCode": "LS6 1PF"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8149", "longitude": "-1.56836"}}, "title": "Specialist Speech and Language Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245460", "validThrough": "2020-11-16T23:59:59+0000"}