{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pa"}}, "datePosted": "2020-10-29T16:01:05+0000", "description": "&lt;p&gt;&lt;strong&gt;The Bristol Heart Institute is internationally renowned as a centre of excellence. Come and join our exceptional team in the world-class, state of the art Cardiology Department.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is an exciting and often intense place to work, with patients from all across the region brought in by helicopter or ambulance to our &lt;strong&gt;24 hour&lt;/strong&gt; primary angioplasty service&lt;/p&gt;\n&lt;p&gt;We are dynamic and innovative: Our trans-catheter aortic valve implantation (TAVI) service is expanding and we are embracing the Trust’s status as a Digital Exemplar, using the latest technology to enhance patient care. We lead the way in the delivery of complex angioplasty, receiving referrals from across the South West.&lt;/p&gt;\n&lt;p&gt;There is plenty to learn even for the most experienced cardiology nurse. Working alongside a dedicated multi-disciplinary team, we are passionate about education, and teaching is part of our daily routine here. We participate in conferences across Europe and host one here in Bristol, sharing practice and clinical expertise. We have negotiated extended supernumerary time allow new staff to develop the necessary skills for the role.&lt;/p&gt;\n&lt;p&gt;If you have an interest or have experience in &lt;strong&gt;interventional cardiology&lt;/strong&gt; then we would be keen to hear from you. Motivation and enthusiasm are essential and you will need to demonstrate excellent communication skills.&lt;/p&gt;\n&lt;p&gt;Here is an outline of the duties of a nurse in Cath Labs:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To &lt;strong&gt;prepare&lt;/strong&gt; patients for procedures ensuring appropriate investigations are done and accurately recorded.&lt;/li&gt;\n&lt;li&gt;To &lt;strong&gt;assess&lt;/strong&gt; patients’ individual needs, planning care within the framework of medical care, implementing and evaluating nursing care for all patients undergoing interventional cardiology investigations and procedures.&lt;/li&gt;\n&lt;li&gt;To carry out &lt;strong&gt;nursing procedures&lt;/strong&gt; and interventions as required, in accordance with local policies, and in consultation with other members of the Catheter Lab team.&lt;/li&gt;\n&lt;li&gt;To administer &lt;strong&gt;sedation&lt;/strong&gt; within the Cardiac Cath Lab in line with the our local Sedation Policy&lt;/li&gt;\n&lt;li&gt;To &lt;strong&gt;scrub&lt;/strong&gt; and assist the Cardiologists with Angiography and angioplasty procedures&lt;/li&gt;\n&lt;li&gt;To &lt;strong&gt;scrub&lt;/strong&gt; and assist the congenital cardiologists for complex Adult Congenital Heart Disease procedures&lt;/li&gt;\n&lt;li&gt;To &lt;strong&gt;recover&lt;/strong&gt; patients who have had procedures within the Cardiac Cath Lab before escorting and handing over the patients to the ward&lt;/li&gt;\n&lt;li&gt;To provide nursing &lt;strong&gt;support&lt;/strong&gt; for Trans-oesophageal Echocardiograms&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;This is a full-time position working a combination of early, late and day shifts with a progression towards an on-call commitment. This role includes scrubbing and circulating in the catheter laboratory and managing pre and post procedural care in the day case and recovery areas.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Rachel Bohin - Sister&lt;/p&gt;\n&lt;p&gt;Rachel.bohin@uhbw.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number 0117 342 6649&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120778.png", "name": "University Hospitals Bristol and Weston NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120778"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bristol Heart Institute, Bristol", "postalCode": "BS2 8HW"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4594", "longitude": "-2.59606"}}, "title": "Cardiology Catheter Lab Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248993", "validThrough": "2020-11-11T23:59:59+0000"}