{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 per annum"}}, "datePosted": "2020-10-29T11:17:41+0000", "description": "&lt;p&gt;&lt;strong&gt;The Role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We have an exciting opportunity for a highly motivated, enthusiastic Generic Therapy Assistant (B3) to join our Community Therapy Team which is part of the wider Neighbourhood Care Team in Whitby.&lt;/p&gt;\n&lt;p&gt;The Therapy Team is based at Whitby Hospital delivering both Occupational Therapy and Physiotherapy to the inpatient unit and out into the community in a wide range of settings. This post will entail working as part of this multidisciplinary team assisting with therapy programs for patients on the hospital inpatient unit. Home visits and community work will also be involved.&lt;/p&gt;\n&lt;p&gt;This assistant role crosses both Physiotherapy and Occupational Therapy and is a great opportunity to contribute to the rehabilitation of patients, helping them regain independence after illness or trauma. The successful applicant will develop the ability to work autonomously within the delegated tasks and will become a key player in our team.&lt;/p&gt;\n&lt;p&gt;They will join the assistant team which consists of two Assistant Practitioners and an experienced Generic Therapy Assistant. They will receive support from them and from the registered professional staff.&lt;/p&gt;\n&lt;p&gt;Contact Mark Jenkins Lead Occupational therapist or Louise Lockley Lead Physiotherapist for more information or to arrange a visit. Tel 01947 899239&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Background information&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Our patients often have complex needs, and although predominantly older, we cover all adults from 18 years upwards. These posts are challenging and skillful roles delivering essential therapy to often isolated populations who have limited access to other therapy services.&lt;/p&gt;\n&lt;p&gt;We work closely with District Nurses and GPs, as well as the acute hospitals and provide a Fast Response service aimed at avoiding unnecessary admission to hospitals.&lt;/p&gt;\n&lt;p&gt;Our hospital is currently undergoing exciting new refurbishment and redevelopment.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Whitby is a great location and a thriving coastal town, well known for its unique cultural events and set on the edge of the beautiful North Yorkshire Moors. With its own blue flag beaches and cliff walks there are plenty of opportunities for outdoor adventures and a fascinating history and culture to explore.&lt;/p&gt;\n&lt;p&gt;Our base, Whitby Hospital, has strong support from the local community and is currently undergoing a major redevelopment presenting exciting opportunities to be part of a service in a modern fit for purpose building.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Why work for us?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Humber Teaching NHS Foundation Trust provides a broad range of community and inpatient mental health services, community services (including therapies), learning disability services, healthy lifestyle support and addiction services to approximately 600,000 people. The Trust has been rated Good by the Care Quality Commission. The Trust is also proud to be HSJ Award winners of Provider of the Year 2019.&lt;/p&gt;\n&lt;p&gt;We employ approximately 2,700 staff across more than 70 sites at locations throughout Hull, the East Riding of Yorkshire, Whitby and Scarborough. We deliver Mental Health Services, Specialist Services for Children, Forensic Services, Community and Learning Disability Services, as well as having eight GP Practices across the locality.&lt;/p&gt;\n&lt;p&gt;Humber Teaching NHS Foundation Trust - a multi-specialty health and social care teaching provider. We aim to be a leading provider of integrated health services, recognised for the care compassion and commitment of our staff and known as a great employer and a valued partner.&lt;/p&gt;\n&lt;p&gt;The Trust works closely with our academic partners, including Hull York Medical School (HYMS) and Hull University, nurturing and developing a workforce of doctors, nurses and other health and social care professionals of the future.&lt;/p&gt;\n&lt;p&gt;At Humber we believe our people are our greatest asset and therefore we are committed to developing, growing and rewarding our workforce. As an employee at Humber you will benefit from pay in line with Agenda for Change, NHS pension, training and development, annual appraisal, generous annual leave entitlement and flexible working options to enable you to achieve a healthy work/life balance.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Humber Teaching NHS Foundation Trust serves the rural populations of Hull, the East Riding of Yorkshire and North Yorkshire. Within North Yorkshire, Scarborough, Ryedale and Whitby areas boast a wide array of diverse property from coastal cottages to riverside apartments, with access to excellent schools and further and higher education providers. There is beautiful scenery across the locality, including picturesque seaside towns, Market towns, woodland areas, moorland and world heritage sites including castles, and Abbeys. Local events include food festivals, Gothic weekends, Victorian weekends, cycling events, Armed Forces and Lifeboat weekends.&lt;/p&gt;\n&lt;p&gt;The region has transport connections with train services from Scarborough and Malton to York, Leeds, and London, and from Whitby to Teesside, and easily commutable for driving, for example York to Whitby within an hour’s drive.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameLouise LockleyJob titleAdvanced physiotherapistEmail addressl.lockley@nhs.netTelephone number01947 899239Additional contact information&lt;/p&gt;\n&lt;p&gt;Claire Gallon and Claire Nicholson, Specialist Occupational Therapists 01947 899239&lt;/p&gt;\n&lt;p&gt;c.gallon@nhs.net&lt;/p&gt;\n&lt;p&gt;claire.nicholson5@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120910.png", "name": "Humber Teaching NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120910"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Whitby Hospital, Whitby", "postalCode": "YO211DP"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.484", "longitude": "-.61731"}}, "title": "Generic Therapy Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248078", "validThrough": "2020-11-12T23:59:59+0000"}