{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum pro rata"}}, "datePosted": "2020-10-23T12:31:00+0100", "description": "&lt;p&gt;&lt;span&gt;&lt;strong&gt;Consultant Psychiatrist in Child and Adolescent Psychiatry&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Full Time - 10 PAs&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Darwin Centre for Young People &lt;/strong&gt;&lt;strong&gt;Inpatient Adolescent Psychiatry&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Cambridgeshire and Peterborough NHS Foundation Trust is seeking to recruit a Child and Adolescent Consultant Psychiatrist to join a dynamic and supportive group of consultants in redesigning our inpatient care and crisis care pathways with a newly funded crisis pathway and home treatment team.&lt;/p&gt;\n&lt;p&gt;CPFT is a major partner in the transformation of Tier 4 service and bringing crises care closer to home. There is opportunity for the post holder to take part in the development of crises and home treatment services and how the pathways link with an inpatient unit.&lt;/p&gt;\n&lt;p&gt;Cambridge is also in an exciting phase of developing a new Children’s Hospital. The plan is to have an integrated physical and mental health hospital for Children and Young people. There is huge opportunity for the post holder to shape this integration and develop an international exemplar of integrated physical and mental health with research. These posts are an excellent opportunity to be part of this innovative development in the East of England in a partnership between CPFT, Cambridge University Hospitals and Cambridge University.&lt;/p&gt;\n&lt;p&gt;The Darwin Centre for Young People is a general adolescent unit currently based in Fulbourn, on the out skirts of Cambridge City. It is a well-resourced and well-run ward with a full complement of MDT staff. We are looking for a fulltime consultant to take over the ward from the current consultant. There are also two other inpatient wards, the Croft for under 12’s and the Phoenix Centre for adolescent with eating disorders. There is active planning to move the three wards into the new Cambridge Children’s Hospital on the Cambridge University Hospitals campus.&lt;/p&gt;\n&lt;p&gt;The crisis team is funded by the CCG to provide 9am to 8pm, 7 days a week crisis response and up to 2 weeks of brief intervention. The role of this part of the post will be to support the team with clinical leadership, training and supervision. There will be some assessments but the locality community consultants will be continuing to provide crisis assessments. We are also developing a home treatment team to offer alternatives to hospital admission. The two consultants will work together to cover these pathways.&lt;/p&gt;\n&lt;p&gt;CPFT is a designated Cambridge University Teaching Trust and provides comprehensive mental health services to the people of Cambridgeshire and Peterborough. CPFT is aligned with the University of Cambridge Department of Psychiatry which is internationally recognised as a 5* leading centre for research.&lt;/p&gt;\n&lt;p&gt;We have full electronic health records. The posts would suit energetic, creative and enthusiastic clinicians who wishes to improve the life chances of young people with severe mental health difficulties.&lt;/p&gt;\n&lt;p&gt;Depending on the interests of the post-holder there are excellent opportunities to be involved in research, management, service development, and under/post-graduate teaching. There are excellent links with the academic department.&lt;/p&gt;\n&lt;p&gt;Cambridgeshire and Peterborough have good road and rail links with London and the North. The area is surrounded by beautiful countryside and has a number of well-regarded state and private schools.&lt;/p&gt;\n&lt;p&gt;Applicants must have GMC registration with a Licence to Practice and be on the specialist register or be within 6 months of their CCT date at interview.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Dr Paul Millard, Consultant Psychiatrist, Clinical Director for Children, Young People and families Directorate&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;07983339078 / Paul.Millard@cpft.nhs.uk&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121760.JPG", "name": "Cambridgeshire and Peterborough NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121760"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Darwin Centre, Fulbourn, Cambridge, CB21 5EE, Cambridge", "postalCode": "CB21 5EE"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1858", "longitude": ".200772"}}, "title": "Consultant Psychiatrist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240533", "validThrough": "2020-11-23T23:59:59+0000"}