{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pro rata per annum"}}, "datePosted": "2020-10-20T15:01:30+0100", "description": "&lt;p&gt;We are looking for Registered Nurses to join our Rapid Response Team in West Kent. The role is diverse and the team work closely with other services to avoid admission to hospital, facilitate early discharge and provide unscheduled care to patients in their own homes. You will carry out holistic assessments, develop integrated care packages, support junior staff and actively participate in a multi-professional team to ensure high quality care is provided to our patients.&lt;/p&gt;\n&lt;p&gt;In West Kent Rapid Response works from 2 bases, Coxheath and Tonbridge. These vacancies are at our Coxheath site however cross site working is expected. The team operates 24 hours a day, 365 days per year.&lt;/p&gt;\n&lt;p&gt;You will be supervising Assistant Practitioners, Health Care Assistants and mentoring Student Nurses.&lt;/p&gt;\n&lt;p&gt;Caring for people in the community requires specialist knowledge and skills; we will develop you through our excellent educational opportunities that range from degrees to Apprenticeship- schemes.&lt;/p&gt;\n&lt;p&gt;Excellent communication skills both written and verbal are essential. You will be required to maintain a close working relationship with a range of other professionals within the Multi-Disciplinary Team. If you are the kind of person who is passionate about providing a quality service then we would like to hear from you.&lt;/p&gt;\n&lt;p&gt;KCHFT is a great place to work - but don’t just take our word for it. In our most recent report the CQC rated us as ‘outstanding’; and said:&lt;/p&gt;\n&lt;p&gt;Staff felt supported, valued and respected&lt;/p&gt;\n&lt;p&gt;They felt proud to work for the trust and were committed to the vision and values of the organisation&lt;/p&gt;\n&lt;p&gt;There are high levels of staff satisfaction&lt;/p&gt;\n&lt;p&gt;Staff are proud of the organisation as a place to work and spoke highly of the culture.&lt;/p&gt;\n&lt;p&gt;We are the only major NHS provider in the South East to be rated as ‘outstanding’ and one of only three community providers in the UK to have the highest rating; so why not join us? #cometocommunity&lt;/p&gt;\n&lt;p&gt;Although we have a full time vacancy, however part time hours will be considered and night shift only contracts are available to support home/work life balance. This is a community based post therefore, car owner/driver essential, subject to the provisions of the Equality Act (2010).&lt;/p&gt;\n&lt;p&gt;We welcome applications from all groups in the community and will accommodate needs and make adjustments wherever possible. We welcome applications from individuals from diverse backgrounds and those covered by the Equalities Act.&lt;/p&gt;\n&lt;p&gt;Interviews will be held via Microsoft Teams w/c 9th November 2020. You will also receive a call after the advert closes to have a chat about your aspirations.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Maureen Stephens, Matron - maureen.stephens2@nhs.net - 07920 184712&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120633.png", "name": "Kent Community Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120633"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Coxheath/Tonbridge", "postalCode": "ME17 4AH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.232", "longitude": ".497974"}}, "title": "Staff Nurse Rapid Response", "url": "https://www.jobs.nhs.uk/xi/vacancy/916234904", "validThrough": "2020-11-08T23:59:59+0000"}