{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pa pro rata"}}, "datePosted": "2020-11-02T17:01:15+0000", "description": "&lt;p&gt;We are seeking applicants keen to progress in a career in Adult Critical Care. At University Hospitals Bristol we have opportunities for both general and cardiac intensive care units. Both Units employ cutting edge technology; have an innovative bedside clinical information system in place and there are Critical Care Practice Educators in place in both areas to facilitate education and the development of new starters.&lt;/p&gt;\n&lt;p&gt;The Cardiac Intensive Care unit is a 24 bedded unit treating level 3 and level 2 patients on the cardiac surgical pathway pre and post operatively. The multidisciplinary team work closely together and include cardiac surgery surgical team, Cardiac anaesthetic team, nurse practitioners, clinical nurse specialists and allied health professionals.&lt;/p&gt;\n&lt;p&gt;General Intensive Care unit is a 21 bedded unit which caters for level 3 and 2 patients from many specialities including medical and surgical patients, oncology, and haematology, elective and emergency admissions. We are also a tertiary referral centre for out of hospital cardiac arrest patients out of hours.&lt;/p&gt;\n&lt;p&gt;Both Critical Care Units are dynamic, highly innovative departments and patients are cared for by a range of skilled healthcare professionals who provide expert, family centred care for patients with complex critical care needs.&lt;/p&gt;\n&lt;p&gt;We aim to recruit new staff into one of our cohorts which commence 4 times a year – this is to optimise educational and supernumerary pathways and provide good group peer support. Recognising that this may not work for all new starters we would be very happy to discuss alternate start dates if needed.&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;ul&gt;\n&lt;li&gt;Successful applicants can expect:&lt;/li&gt;\n&lt;li&gt;Allocation into a welcoming team who will support your development with mentorship and peer support.&lt;/li&gt;\n&lt;li&gt;A structured educational program with in-house and regional study sessions, including a series of critical care study days for staff new to the specialty.&lt;/li&gt;\n&lt;li&gt;Transparent, fair process for application for funding of relevant academic courses.&lt;/li&gt;\n&lt;li&gt;Exposure to a variety of clinical experiences with our diverse range of patients.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We would love to hear from nurses with a real passion for excellence in quality, patient-centered care.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Nurse in Charge General Intensive care A600 on 0117 3427600.&lt;/p&gt;\n&lt;p&gt;Or Nurse in charge Cardiac Intensive Care on 01173421599.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120778.png", "name": "University Hospitals Bristol and Weston NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120778"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bristol Royal Infirmary and Bristol Heart Institute, Bristol", "postalCode": "BS2 8HW"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4594", "longitude": "-2.59606"}}, "title": "Adult Critical Care Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252973", "validThrough": "2020-11-16T23:59:59+0000"}