{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62001", "minValue": "53168", "unitText": "YEAR", "value": "£53,168 - £62,001 Per Annum Pro Rata"}}, "datePosted": "2020-11-03T15:46:44+0000", "description": "&lt;p&gt;&lt;strong&gt;This post is only open to current employees of University Hospitals of Morecambe Bay NHS Foundation Trust.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for an enthusiastic, well-motivated Pharmacist to lead a new programme starting on the Furness General Hospital site. Applicants will have extensive experience in successfully managing projects within a Pharmacy setting and have previous experience with the requirements of a Wholesale Dealers License, good distribution practise and inspections.&lt;br /&gt;&lt;span&gt;&lt;br /&gt;&lt;/span&gt;As the lead pharmacist for this programme, you will manage the workflow and complex situations, produce new standard operating procedures and risk assessments, ensure staff are trained appropriately and have excellent communication skills. You will also have managerial responsibility and leadership of other Pharmacists and Technical staff within the team.&lt;br /&gt;&lt;span&gt;&lt;br /&gt;&lt;/span&gt;You must be a Non-Medical Prescriber and be able to participate in the Trusts DMARD service based at the Furness General site.&lt;br /&gt;&lt;span&gt;&lt;br /&gt;&lt;/span&gt;Applicants will be committed to improving patient care and delivering a high-quality pharmacy service.&lt;/p&gt;\n&lt;p&gt;Please note if you are shortlisted for interview you will be required to complete a Psychometric Test.&lt;/p&gt;\n&lt;p&gt;Anyone newly appointed to the trust will be subject to the completion of a satisfactory 6 month probationary period (this includes bank staff). This will give the new staff member an opportunity to become familiar with the role and working environment.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameAndrea ScottJob titleAssistant Chief Pharmacy TechnicianEmail addressandrea.scott2@mbht.nhs.ukTelephone number07970349998&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University Hospitals of Morecambe Bay NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121712"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Furness General Hospital, Barrow in Furness", "postalCode": "LA14 4LF"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.1364", "longitude": "-3.20788"}}, "title": "Lead Pharmacist - INTERNAL ONLY", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254636", "validThrough": "2020-11-10T23:59:59+0000"}