{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Depending on experience"}}, "datePosted": "2020-10-30T15:07:52+0000", "description": "&lt;p&gt;&lt;strong&gt;Job Title: Prescribing Pharmacist&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary: Depending on experience&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Contract: Permanent&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours: Full Time&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location: North West London Practices (Barlby Surgery, Kings Road Medical Centre, Cassidy Medical Centre, Canberra Old Oak Surgery, Earls Court Health and Wellbeing Centre, Randolph Surgery&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;A fantastic opportunity to work for London’s largest Primary Care organisation.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;AT Medics was founded by six GPs in 2004, our mission is ‘Improving Healthcare, Improving Lives’, and our services are characterised by great access, high quality, real innovation recognised and replicated at National level, and a real understanding of individual patient need.&lt;/p&gt;\n&lt;p&gt;AT Medics is London’s largest Primary Care Provider, with a strong reputation for our focus on quality improvement and investing in people.&lt;/p&gt;\n&lt;p&gt;This is a great time for individuals seeking a fulfilling qualified Prescribing Primary Care Pharmacists role to join us. We are expanding our services and have undergone a sustained period of growth.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;If you are an experienced, proactive and enthusiastic independent prescriber with primary care experience, we want to invest in you.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You must have a deep understanding of health services and people management, together with a passion for improving lives and improving healthcare.&lt;/p&gt;\n&lt;p&gt;Whilst you will bring your experience to the role, you will also receive significant support from the clinical team and Regional GP Director as part of your development.&lt;/p&gt;\n&lt;p&gt;The role: Our well-established practices have excellent performance against local and National requirements, and a committed multi-professional team. Collectively, we serve over 300,000 patients across 40 practices in 18 CCGs, and by joining AT Medics you will benefit from:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Continuous learning and development programmes&lt;/li&gt;\n&lt;li&gt;Access to NHS Discounts&lt;/li&gt;\n&lt;li&gt;NHS Pension&lt;/li&gt;\n&lt;li&gt;A comprehensive induction programme&lt;/li&gt;\n&lt;li&gt;5 weeks annual leave pro rata&lt;/li&gt;\n&lt;li&gt;1 x week CPD paid leave and a dedicated CPD budget&lt;/li&gt;\n&lt;li&gt;Support from Regional Manager, GP Director, and Clinical team&lt;/li&gt;\n&lt;li&gt;Unique and comprehensive in-house training opportunities&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;If you want to be part of a vibrant, forward-thinking organisation and you share our ideas, take the first step by applying for this position.&lt;/p&gt;\n&lt;p&gt;If you have not heard from us within 4 weeks of the closing date you should assume you have not been shortlisted but we would like to thank you for your interest in our organisation.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "AT Medics", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133634"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "London", "postalCode": "W10 6DZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5224", "longitude": "-.217393"}}, "title": "Prescribing Pharmacist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916250688", "validThrough": "2020-11-27T23:59:59+0000"}