{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30112", "minValue": "24214", "unitText": "YEAR", "value": "£24,214 - £30,112 pa pro rata"}}, "datePosted": "2020-10-12T09:46:39+0100", "description": "&lt;p&gt;An exciting opportunity has arisen at HMP Bedford for a Band 5 mental health practitioner. This will be a progressive developmental role to work as an integrated part of the care pathway.&lt;/p&gt;\n&lt;p&gt;Come and be a part of our friendly Mental Health In-Reach Team at HMP Bedford (Remand Category B male prison) in Bedfordshire. This is an ideal opportunity for a nurse who is looking to either develop their prison nursing career or diversify their career within this exciting and challenging area of Nursing.&lt;/p&gt;\n&lt;p&gt;The role is to work within a multi-disciplinary team setting within a high secure prison environment where you will work closely with other agencies. The role will incorporate both individual and group working with primary and secondary service individuals. A varied practical and theoretical role, utilising a full range of skills and expertise.&lt;/p&gt;\n&lt;p&gt;The team has now developed and now provides a 7 day service (8:30am - 16:30pm) working within a primary and secondary community model.&lt;/p&gt;\n&lt;p&gt;Therefore this role is for a dynamic individual with effective communication skills both verbal and written, to have an exceptional understanding and ability to complete person centered robust care plans, CPA and risk assessments including excellent IT literacy skills, they will have the ability to work as part of a team and as a role model empowering and motivating other team members, show appropriate professional and personal boundaries and have the ability to use own initiative, to enable contribution within a multi- disciplinary team approach.&lt;/p&gt;\n&lt;p&gt;To have the ability to advocate for the residents and support colleagues both on an individual and group setting, the ability to keep calm and respond effectively under pressure.&lt;/p&gt;\n&lt;p&gt;To show commitment and dedication through effective time management, organisational and decision making skills&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameLorraine MazwiJob titleMental Health In-Reach ManagerEmail addresslorraine.mazwi@nhft.nhs.ukTelephone number01234 373235&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Northamptonshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121219"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "HMP Bedford, Bedford", "postalCode": "MK40 1HG"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1389", "longitude": "-.470752"}}, "title": "Mental Health  Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916221750", "validThrough": "2020-11-30T23:59:59+0000"}