{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 per annum, pro rata"}}, "datePosted": "2020-10-26T10:01:25+0000", "description": "&lt;p&gt;The Intensive Dementia Support Service (IDSS) is a crisis service for people with cognitive impairment/dementia and challenging behaviours.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are seeking a support worker with a passion for Older Persons Mental Health Care with experience of working in the community to join our IDSS East team.&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;IDSS provides intensive support in the form of medication review, occupational assessment and support, and practical nursing approaches and strategies. The team is reactive and responsive to treating patients at points of crisis aiming to prevent admission into our Older Persons Mental Health Ward.&lt;/p&gt;\n&lt;p&gt;Support workers within the team need to possess good communication skills and be flexible in their approach in order to establish effective working relationships with patients and carers. They need to be able to deliver the care as defined by the registered nurse to the patient and report back any risk/concerns. This care may be around provision of personal care, encouraging and supporting the patient to engage in a care package and the monitoring patients physical and mental health. They need to possess skills in relation to provision of meaningful activity for patients. They need to possess good observation skills and be confident to participate in handovers and team discussions.&lt;/p&gt;\n&lt;p&gt;They are expected to lone work and visit patients in both their own homes, community hospitals, local nursing and residential homes. They will always have access to a registered professional within the team for advice and support as required. Being a car driver is essential.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The East team serves the population of Frome, Wells, Glastonbury, Yeovil, Chard, Crewkerne, Wincanton and surrounding villages. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The IDSS West Service will provide a 7 day service between 8am and 8pm. The team base is in Yeovil.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Staff are supplied with equipment to enable Agile working.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameBen HanscombJob titleTeam managerEmail addressbenjamin.hanscomb@somersetft.nhs.ukTelephone number01935 443602Additional contact information&lt;/p&gt;\n&lt;p&gt;Emma Norton Intensive Dementia Support Service Manager on 07825257177&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Somerset NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121360"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Summerlands Hospital Site, Preston Road, Yeovil, Yeovil", "postalCode": "BA20 2BN"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.946", "longitude": "-2.64626"}}, "title": "Community Support Worker, Band 3", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241947", "validThrough": "2020-11-09T23:59:59+0000"}