{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "AfC Band 6: £31,365 rising to £37,890 pro rata"}}, "datePosted": "2020-10-19T13:37:32+0100", "description": "&lt;p&gt;&lt;strong&gt;Are you a registered children’s nurse with a special interest in children’s continuing care? Do you have experience of working with children who are dependent on a ventilator and have complex health needs?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Lifetime Service is looking to recruit a nurse to join the very friendly and supportive Continuing Care Team (CCT) who are responsible for managing and delivering packages of care to children who meet the Children’s Continuing Care criteria.&lt;/p&gt;\n&lt;p&gt;The ideal candidate will be enthusiastic, motivated, resilient, and organised - with excellent communication skills and an ability to work in multi-disciplinary environments. The role is a combination of autonomous and team working, so you will need to be confident in both scenarios.&lt;/p&gt;\n&lt;p&gt;You will also manage Community Children’s nurses and Lifetime support workers and be responsible for designing and delivering training packages to support workers and service users.&lt;/p&gt;\n&lt;p&gt;The role is based at Corum One, Corum Office Park, Crown Way, Warmley, BS30 8FJ. It is a Full time post (Monday to Friday, with an expectation of working some weekends), working 7.5 hours a day between the hours of 8am – 6pm.&lt;/p&gt;\n&lt;p&gt;The post holder will spend time within an office environment and also be expected to travel across Bristol and South Gloucestershire, North Somerset, B&amp;NES and Somerset CCG areas as the clinical need dictates. Full driving license is essential.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/127274.jpg", "name": "Sirona care and health CIC", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127274"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Corum Office Park, Crown Way, Warmley, Bristol", "postalCode": "BS30 8FJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4577", "longitude": "-2.47598"}}, "title": "Community Children&#39;s Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916232515", "validThrough": "2020-11-09T23:59:59+0000"}