{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum pro rata"}}, "datePosted": "2020-10-31T08:15:22+0000", "description": "&lt;p&gt;The Ambulatory Emergency Care Unit (AECU) is a newly implemented service within the Unscheduled Care Division of Blackpool Teaching Hospitals. The AECU consists of an ambulatory assessment bay as well as male and female bedded bays (15 beds in total). The AECU aims to provide emergency care for patients who may not need to stay in hospital for an extended time and even admit, treat and discharge within the same day. The patients can be referred via GP, walk in centers, Urgent Care Center and other community based services, as well as suitable referrals from within the Emergency Department. The AECU works closely with the Acute Medical Unit to increase flow throughout the hospital, whilst ensuring patients are treated within the most appropriate setting from the start of their journey through hospital to their discharge. Patients will be triaged, clerked and senior reviewed whilst treatment is commenced and further investigations and plans are put in place.&lt;/p&gt;\n&lt;p&gt;We are looking to recruit to a number of fully rotational Staff Nurse Positions at Band 5 (part-time would be considered). Candidates must be enthusiastic about providing the highest standard of care to a diverse set of patients within the fast pace of the AECU. Successful candidates will need to be dynamic in their work and have the ability to work well within a close team, be forward thinking and be change orientated as we are always looking for new ways to improve the care provided. Skills will be developed in delegation and time management due to continuing flow through the unit and ensuring patients are treated and then transferred or discharged so that the Unit and hospital is able to continue to function effectively.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;These positions are available to Student Nurses, we would also welcome applicants who are interested in a Secondment Opportunity.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Flexible Working Patterns may also be available upon discussion, such as Night Shifts or Part-time hours, please discuss at Interview stage.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameHelen SherlockJob titleRecruitment SisterEmail addresshelen.sherlock2@nhs.netAdditional contact information&lt;/p&gt;\n&lt;p&gt;Laura Taylor, Ward Manager 01253 953418&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Blackpool Teaching Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120954"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Blackpool Teaching Hospitals NHS Foundation Trust, Blackpool", "postalCode": "FY3 8NR"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8207", "longitude": "-3.01626"}}, "title": "Staff Nurse AECU", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251121", "validThrough": "2020-11-15T23:59:59+0000"}