{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "19632", "minValue": "17669", "unitText": "YEAR", "value": "£17,669 - £19,632 per annum"}}, "datePosted": "2020-10-22T11:47:00+0100", "description": "&lt;p&gt;&lt;strong&gt;Permanent, Full-Time position: 35 hours per week, flexible working hours&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing Date: 12th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview Date: To be Confirmed&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We have an exciting new permanent opportunity, for a Housekeeping Supervisor to join us at our Marie Curie Hospice, Cardiff and the Vale, Penarth. Reporting to the Facilities Manager, you will be experienced in working in a regulated and clinical environment as well as managing a team. As a working Supervisor, you will lead by example and be flexible in your working hours as you could be required to undertake housekeeping duties on occasion, as well as undertaking weekly audits and inspections outside of core hours, so adjustments to your working pattern may be required.&lt;/p&gt;\n&lt;p&gt;You will prepare weekly staff rotas to ensure adequate housekeeping cover from 7am to 7pm daily, liaising with agencies to ensure cover at all times, carrying out annual staff performance reports for all housekeeping staff and hold and record monthly one to one meetings. Attention to detail, as well as strong administrative and IT skills are all essential in this role, as you will need to undertake and support the team in online mandatory training.&lt;/p&gt;\n&lt;p&gt;You and the housekeeping team are responsible for the deep cleaning of patient rooms as well as the general cleaning of the public and staff areas in accordance with departmental schedules and specifications, ensuring high levels of cleanliness at all time. Working alongside the catering team, the housekeeping team also provide hostess support on the wards to patients.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What we are looking for:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;ul&gt;\n&lt;li&gt;The ability to follow instructions and work without supervision, whilst ensuring that the team maintain the highest standards of hygiene, confidentiality, courtesy and consideration to all patients and visitors to the Hospice, is essential.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;ul&gt;\n&lt;li&gt;This is a really important role - Valuing what you do, respecting and working to Health and Safety regulations including CoSHH, and local procedures, observing manual handling and infection control, clinical waste management and the ability to complete daily paperwork are all vital.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;ul&gt;\n&lt;li&gt;You must be flexible and have a &#39;can do&#39; attitude to your work, together with very high personal housekeeping standards.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;ul&gt;\n&lt;li&gt;As a head of department, you will also be required to attend monthly hospice governance meetings representing housekeeping as well as disseminating management information to staff.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/ul&gt;\n&lt;p&gt;The most recent Health Inspectorate Wales inspection acknowledged a high level of cleanliness throughout the hospice and states &quot;the environment was of an excellent standard&quot;. So, if you have what it takes and want to work in an environment that really makes a difference, day in day out, we want to hear from you.&lt;br /&gt;&lt;br /&gt;&lt;strong&gt;What&#39;s in it for you:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Continued access to NHS Pension Scheme (subject to eligibility)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Marie Curie Group Personal Pension Scheme&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Season ticket loan&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Loan schemes for bikes; computers and satellite navigation systems&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Continuous development&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Industry leading training programmes&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Employee Assistance Programme&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Flexible Working&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;For more information, or an informal discussion please contact Alison Morgan, Facilities Manager on 02920426052.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Every day of your life matters - from the first to the last. When you work for Marie Curie, you understand that better than ever. We&#39;re a passionate, committed and diverse team of more than 4,400 staff and 12,000 volunteers, here for people living with any terminal illness, and their families. We offer expert care, guidance and support, to help them get the most from the time they have left.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Marie Curie is committed to its values, which underpin our work. We take stringent steps to ensure that the people who join our organisation through employment or volunteering, are suitable for their roles and are committed to safeguarding all our people from harm. This includes our staff, volunteers and all those who use or come into contact with our services. We are dedicated to creating not just a safe place to work but also a supportive and rewarding one.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;We are committed to a world where everyone can thrive and fulfil their potential. We are devoted to the social justice imperatives and organisational benefits of full diversity, inclusion and equity in the workplace, and are a Stonewall champion. We actively encourage and welcome applications from candidates of diverse cultures, perspectives and lived experiences.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;This role will be subject to receiving a satisfactory Standard criminal record check.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;W&lt;/em&gt;&lt;em&gt;e reserve the right to close this vacancy early. Agencies need not apply.&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Marie Curie", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=129502"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Cardiff and Vale Hospice", "postalCode": "CF64"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4255", "longitude": "-3.204"}}, "title": "Housekeeping Supervisor - Cardiff and Vale Hospice", "url": "https://www.jobs.nhs.uk/xi/vacancy/916238256", "validThrough": "2020-11-12T23:59:59+0000"}