{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "32146", "minValue": "26152", "unitText": "YEAR", "value": "£26,152 - £32,146 £24,907 to £30,615 per annum"}}, "datePosted": "2020-10-27T10:45:47+0000", "description": "&lt;p&gt;&lt;strong&gt;Community staff nurse (Adult nurse) – Windsor or Maidenhead&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We have openings to join our large community nursing teams based in either Windsor or Maidenhead as a band 5 community staff nurse. Suitable if you are either a nurse looking for your first job in community nursing or are looking to continue your community nursing career and possibly progress.&lt;/p&gt;\n&lt;p&gt;We continue to invest significantly into our future workforce with a thriving &lt;strong&gt;placement programme&lt;/strong&gt; for final year students, a &lt;strong&gt;comprehensive&lt;/strong&gt; &lt;strong&gt;preceptorship&lt;/strong&gt; process to ease all new nurses into the first year in practice and a workforce that includes some of the &lt;strong&gt;finest community nurses leading the line&lt;/strong&gt; who delivered a “good” in our most recent CQC report; the first community and mental health trust in the south to be awarded this rating.&lt;/p&gt;\n&lt;p&gt;Should you get to a stage where you are looking to make the next steps in your community nursing career whilst working within our team; you will be in an incredible position to do so with our trust being the largest provider of community services within the Berkshire County and with us being an organisation who recruited 87% of our band 6 community nursing staff in 2018 from our internal workforce.&lt;/p&gt;\n&lt;p&gt;This is a fantastic opportunity to join our energetic, friendly and progressive service where you will be well supported and supervised by our team. You will also be supported in your continuing professional development and preceptorship for newly qualified staff.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Further information about this opportunity;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;You will visit a number of patients on a daily basis in their own homes&lt;/li&gt;\n&lt;li&gt;You will provide high quality nursing care to a range of patients with varying healthcare needs&lt;/li&gt;\n&lt;li&gt;Some of the healthcare you will be expected to provide include; end of life care, wound management, and much more&lt;/li&gt;\n&lt;li&gt;Full time (37.5 hours per week) and part time opportunities available&lt;/li&gt;\n&lt;li&gt;Located at St. Marks Hospital, Maidenhead and covering surrounding areas or King Edward VII, Windsor and covering surrounding areas.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;strong&gt;Some of the benefits of joining our team: &lt;/strong&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;AfC Salary ranging from £24,907 to £30, 615 per annum (plus up to 5% HCAS)&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Flexible working opportunities&lt;/strong&gt; and a strong emphasis on your work , life balance&lt;/li&gt;\n&lt;li&gt;Annual leave – 27 days for new starters, &lt;strong&gt;plus bank holidays&lt;/strong&gt;. Increasing to 29 days after 5 years and 33 days after 10 years NHS service. Pro rata for part time staff&lt;/li&gt;\n&lt;li&gt;Excellent &lt;strong&gt;learning and development opportunities&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;Salary sacrifice scheme for a new car&lt;/li&gt;\n&lt;li&gt;Lease car scheme&lt;/li&gt;\n&lt;li&gt;Generous &lt;strong&gt;maternity, paternity and adoption leave&lt;/strong&gt; for eligible staff&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Advanced IT&lt;/strong&gt; enablement and support&lt;/li&gt;\n&lt;li&gt;Confidential telephone care service providing independent &lt;strong&gt;support and advice for staff&lt;/strong&gt;.&lt;/li&gt;\n&lt;li&gt;And so much more&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Are you familiar with Windsor and Maidenhead?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you are not familiar with Windsor, the town centre offers an attractive mix of quaint old streets below the castle and smart new shops from old family businesses to chain stores. Windsor also has the stunning rural countryside of 4,800 acres of Windsor Great Park close by. Great travel links to the M4, M25, M40 and M3 and is just a short trip from Heathrow international airport and central London. Maidenhead is a thameside town with small shops and a pedestrianised High Street, a multiplex cinema, health club and 2 michelin star restaurants. It has excellent motoring links being close to the M4, M40 and A4.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The 3 “must haves” for you to be considered for this role:&lt;/p&gt;\n&lt;ol&gt;\n&lt;li&gt;A passion for community nursing, that matches our passion to provide excellent healthcare for patients within their own homes,&lt;/li&gt;\n&lt;li&gt;Either a qualified adult nurse or currently in your last year of training (with NMC registration)&lt;/li&gt;\n&lt;li&gt;Hold a full UK Driving Licence and have use of a car for work purposes&lt;/li&gt;\n&lt;/ol&gt;\n&lt;p&gt;Should you match up to the 3 points listed above, then we would recommend you make your application for this role!&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;For further details about this role or questions in general about working for Berkshire Healthcare please contact Alan Sheridan, Clinical Nurse Manager, via email at: Alan.Sheridan@berkshire.nhs.uk or call Alan on: 07919112839.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120886.PNG", "name": "Berkshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120886"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St Marks, Maidenhead or King Edward VII, Windsor, Windsor or Maidenhead", "postalCode": "SL6 6DU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5248", "longitude": "-.744843"}}, "title": "Community Staff Nurse (District Nursing) - Windsor or Maidenhead", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244065", "validThrough": "2020-11-29T23:59:59+0000"}