{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "41318", "minValue": "41318", "unitText": "YEAR", "value": "£24.58 (including WTR)"}}, "datePosted": "2020-10-19T17:05:23+0100", "description": "&lt;p&gt;&lt;strong&gt;Imperial College Healthcare NHS Trust Value&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please note this is a Bank/Temporary advert to join the Temporary Staffing Bank&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are absolutely committed to ensuring that our patients have the best possible experience within our hospitals. We are looking for people who are committed to delivering excellent patient care, whatever their role, and who take pride in what they do. We place a high value on treating all patients, customers and colleagues with respect and dignity, and seek people who strive for excellence and innovation in all that they do.&lt;/p&gt;\n&lt;p&gt;We value all of our staff and aim to provide rewarding careers and benefits, fulfilling work environments and exciting opportunities.&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;&lt;strong&gt;Kind&lt;/strong&gt;- We are considerate and thoughtful, so you feel respected and included.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;&lt;strong&gt;Collaborative&lt;/strong&gt;- We actively seek others’ views and ideas, so we achieve more together.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;&lt;strong&gt;Expert&lt;/strong&gt;- We draw on our diverse skills, knowledge and experience, so we provide the best possible care.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;&lt;strong&gt;Aspirational&lt;/strong&gt;- We are receptive and responsive to new thinking, so we never stop learning, discovering and improving.&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;AIM OF THE ROLE:&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;To be an efficient flexible member of the laboratory providing a high quality service to Imperial College Healthcare Trust.&lt;/p&gt;\n&lt;p&gt;To maintain the required levels of laboratory safety and good laboratory practice, as specified in local and national guidelines.&lt;/p&gt;\n&lt;p&gt;To work with biomedical scientists and clinical scientists in the provision of a comprehensive and effective service for the Imperial College Healthcare NHS Trust, as directed by the Head of the Department.&lt;/p&gt;\n&lt;p&gt;To participate in the efficient handling, processing and analysis of samples in the laboratory, under supervision.&lt;/p&gt;\n&lt;p&gt;To maintain effective records of all activities and procedures, and to contribute towards the maintenance of the laboratory&#39;s quality system.&lt;/p&gt;\n&lt;p&gt;To check, keep clean and maintain laboratory equipment.&lt;/p&gt;\n&lt;p&gt;To carry out supervised laboratory procedures in all sections of the laboratory, as directed by the Head of the Unit and senior scientific staff.&lt;/p&gt;\n&lt;p&gt;To undergo appropriate teaching and training as directed and as necessary in order to maintain HPC registration and to maintain suitable records of all training activities undertaken.&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123032.jpg", "name": "Imperial College Healthcare NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123032"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "London", "postalCode": "W6 8RF"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4871", "longitude": "-.219912"}}, "title": "Bank - Band 6 Biomedical scientist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916233300", "validThrough": "2021-01-28T23:59:59+0000"}