{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668"}}, "datePosted": "2020-10-21T10:29:22+0100", "description": "&lt;p&gt;&lt;span&gt;The Sussex NHS Commissioners represent a joint way of working across three Clinical Commissioning Groups (CCGs). The Clinical Commissioning Groups are responsible for the planning and commissioning of health care services for their local area.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;During COVID 19 pandemic, the Sussex Clinical Commissioning Groups (Brighton &amp; Hove CCG, East Sussex CCG and West Sussex CCG) have been working closely together with their partners on both the response and the restoration and recovery of our services. The CCGs’ Medicines Management teams have particularly benefited from working as one team across Sussex, to resolve the challenges as they arose. We are now considering  which areas of these new ways of working across Sussex should be retained and what structures would best support delivery of our service going forward. This will form our new Integrated Medicines Optimisation Strategy from April 2021.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;An exciting opportunity has arisen for an experienced pharmacist to join our successful Medicines Management team working across Eastbourne, Hailsham, Seaford, Bexhill, Hastings / St Leonards and Rural Rother. The team is responsible for the delivery of a successful medicines optimisation strategy to a population of over 360,000.&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;You will be joining an innovative team who are working on nationally recognised medicines optimisation programmes e.g. supporting medication reviews in pain management.&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;The successful candidate will be leading the implementation of the primary care prescribing agenda, working with the newly formed Primary Care Networks and providing pharmaceutical advice to prescribers across a group of practices. &lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;You will be expected to collaborate with colleagues across Health and Social Care so that resources and expertise are shared to deliver optimum health and financial outcomes. &lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;span&gt;Due to the COVID pandemic, this role will be working from home initially, although your base will be Bexhill Hospital.  This position will be kept in review in line with CCG policy.  Interviews for this post will take place remotely via Microsoft Teams.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;For an informal discussion about this role please contact Helen Groves, Senior Medicines Management Adviser at &lt;/span&gt;&lt;span&gt;helen.groves2@nhs.net&lt;/span&gt;&lt;span&gt; or phone 07827 820264 (if contacting between 29th October and 1st November please e-mail Gill Ells &lt;/span&gt;&lt;span&gt;gillian.ells@nhs.net&lt;/span&gt;&lt;span&gt; / phone 07771 625734).&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Sussex NHS Commissioners", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128794"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bexhill Hospital", "postalCode": "TN40 2DZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8507", "longitude": ".475541"}}, "title": "Medicines Management Advisor", "url": "https://www.jobs.nhs.uk/xi/vacancy/916235854", "validThrough": "2020-11-08T23:59:59+0000"}