{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-10-28T09:15:45+0000", "description": "&lt;p&gt;We are looking for an enthusiastic and motivated individual with excellent communication skills to join our friendly clinical coding team as a team leader. Applicants must possess the National Clinical Coding Qualification (UK), have post-qualification experience and be able to demonstrate regular attendance on Refresher and Specialty Workshops.&lt;/p&gt;\n&lt;p&gt;In addition, you will require the communication and interpersonal skills to supervise, lead and provide ongoing day to day feedback to a team of staff. Reporting to the Clinical Coding Services Manager you will work alongside existing team leaders and a clinical coding trainer and auditors.&lt;/p&gt;\n&lt;p&gt;Applicants should have a sound understanding of Medical Terminology and Anatomy and Physiology and have a good knowledge of clinical terms.&lt;/p&gt;\n&lt;p&gt;A flexible approach to work is essential, as applicants may be required to work on other sites and in other areas within the Trust. The role will combine onsite and home based working. All applicants must be willing to maintain their skills by attendance on workshops and refresher training courses.&lt;/p&gt;\n&lt;p&gt;Applicants without the National Clinical Coding Qualification (UK) will not be considered.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Helen Kielty&lt;/p&gt;\n&lt;p&gt;For general enquiries please contact the Clinical Coding Manager on 0151 678 5111 extension 2610.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121461.jpg", "name": "Wirral University Teaching Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121461"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Arrowe Park, Wirral", "postalCode": "CH49 5PE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3709", "longitude": "-3.09545"}}, "title": "Clinical Coding Team Leader", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245795", "validThrough": "2020-11-11T23:59:59+0000"}