{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pa"}}, "datePosted": "2020-11-05T10:53:04+0000", "description": "&lt;p&gt;The Community and Intermediate Division has an exciting opportunity for qualified nurses to join our friendly, supportive, innovative nursing and allied health team, whom are committed to providing and maintaining high standards of patient care, in their own home, a hospital setting or a rehabilitation unit.&lt;/p&gt;\n&lt;p&gt;The Community and intermediate Division delivers nursing care within the community, this includes:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;6 rehabilitation wards who are led by supportive Ward managers and a specialist team of allied health professionals. The 6 community wards are:&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ol&gt;\n&lt;li&gt;Ward 16 – Burnley General Hospital&lt;/li&gt;\n&lt;li&gt;Ward 19 – Burnley General Hospital&lt;/li&gt;\n&lt;li&gt;Rakehead neurological rehabilitation – Burnley General Hospital&lt;/li&gt;\n&lt;li&gt;Ribblesdale Ward – Clitheroe Community Hospital&lt;/li&gt;\n&lt;li&gt;Hartley Ward – Pendle Community Hospital&lt;/li&gt;\n&lt;li&gt;Reedyford Ward –Pendle Community Hospital&lt;/li&gt;\n&lt;/ol&gt;\n&lt;p&gt;All of the teams within the community and intermediate care division are supported by dedicated team leaders (Nursing Sister or Therapy Leads), and a team of Team supervisors (Nursing Sisters and Therapy Staff), you will be working within beautiful surroundings of the East Lancashire district. Our feedback suggests we are the NHS Trust to work for, such as:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;2015 saw the Trust in the top 25 out of 135 in a national league table of how staff feel about working for their organisation, and the quality and safety of the care they are able to deliver.&lt;/li&gt;\n&lt;li&gt;ELHT was included in a shortlist of the 100 ‘Best Places to Work’ compiled by the Health Service Journal and Nursing Times. The Trust was also one of only 42 selected of Acute Trusts nationally recognised by the publications as leading the way as the best place to work.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;If you are keen to develop your clinical care skills then we have the opportunity for you. We work closely with specialist teams (including Clinical Nurse Specialists, Podiatry, Occupational therapy, physiotherapy, Social Workers, Lancashire County Council and housing to name a few). The Community and Intermediate Care division is a modern, dynamic Division with a fun and experienced team who are able to support new team members to pursue their career aspirations.&lt;/p&gt;\n&lt;p&gt;We are looking for staff that are committed to delivering a high standard of patient care and have an interest in community and intermediate nursing care. Excellent communication skills and the ability to work as part of a multidisciplinary team are essential. A flexible approach and the ability to respond to the demands of a rapidly changing environment are also essential.&lt;/p&gt;\n&lt;p&gt;In return we can offer you support with your interview process so this is as stress free as possible, a structured orientation programme with the support of our dedicated Ward Managers/Team leaders, supervisory Ward Sisters, Advanced Practitioners, Specialist Nurses, patient flow facilitation team and dedicated Practice educators. You will receive a supermunary period to enable you to gain the skills and competencies required to care for patients in the community setting. Your ongoing development will continue after 12 months to be able to support you in achieving your long term career goals; including rotating around teams should you require doing so.&lt;/p&gt;\n&lt;p&gt;Posts are offered on a full time and part time basis.&lt;/p&gt;\n&lt;p&gt;It is advised that you start to complete your application 6 months prior to qualifying so you can get the post you want. When you are successful the team will keep in contact with you during this time.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:Name: Gill CurrieJob title: Matron – Intermediate CareEmail address: Gillian.Currie@elht.nhs.ukTelephone number: 01282 804 824&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "East Lancashire Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120742"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "435|R104|Business Support Management|CIC, East Lancashire", "postalCode": "BB10 2PQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8098", "longitude": "-2.22817"}}, "title": "Staff Nurse - Community &amp; Intermediate Care Students Due to Qualify", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257325", "validThrough": "2020-11-20T23:59:59+0000"}