{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "35000", "minValue": "29500", "unitText": "YEAR", "value": "£29,500 - £35,000 depending on experience"}}, "datePosted": "2020-10-13T16:38:38+0100", "description": "&lt;p&gt;&lt;strong&gt;Chemotherapy Nurse | £29,500 - £35,000 depending on experience | Portsmouth | Full Time 37.5 hours a week Monday- Friday&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Spire Portsmouth Hospital has an exciting opportunity for a Chemotherapy Staff Nurse to join our experienced and dynamic team.&lt;/p&gt;\n&lt;p&gt;Spire Portsmouth Hospital holds a long standing reputation for providing high quality, comprehensive private hospital care. Our facilities are excellent and the hospital is staffed by a valued team of highly skilled professionals. We provide a dynamic and stimulating environment for highly motivated nurses&lt;strong&gt;.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Duties and Responsibilities:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Chemotherapy Nurse will assess patients’ health and well-being across a complex and changing caseload of cancer patients. You assist in the delivery of care to meet individuals’ health and wellbeing needs throughout the cancer treatment pathway. You will assist in maintaining and developing cancer services and contribute to quality improvement within cancer services.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Who we are looking for:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Registered Nurse&lt;/li&gt;\n&lt;li&gt;Qualified in venepuncture and cannulation and the use of CVAD’s with evidence of regular competency assessment&lt;/li&gt;\n&lt;li&gt;Qualified in the Safe handling and administration of SACT (accredited course) with evidence of regular competency assessment&lt;/li&gt;\n&lt;li&gt;Work with minimum supervision within a nurse led environment&lt;/li&gt;\n&lt;li&gt;Experience of applying clinical reasoning skills to a range of complex and varied patient case mixes in individuals with a cancer diagnosis&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Benefits&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We offer employees a competitive salary as well as a comprehensive benefits package which includes but is not limited to:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;35 days annual leave inclusive of bank holidays&lt;/li&gt;\n&lt;li&gt;Employer and employee contributory pension with flexible retirement options&lt;/li&gt;\n&lt;li&gt;‘Spire for you’ reward platform - discount and cashback for over 1000 retailers&lt;/li&gt;\n&lt;li&gt;Free Bupa wellness screening&lt;/li&gt;\n&lt;li&gt;Private medical insurance&lt;/li&gt;\n&lt;li&gt;Life assurance&lt;/li&gt;\n&lt;li&gt;Save an average of £50 per month with our free onsite car park&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We commit to our employees well-being through work life balance, on-going development, support and reward.&lt;/p&gt;\n&lt;p&gt;Spire Healthcare is a leading independent hospital group that has been putting patients at the heart of everything we do for over 40 years. We have 39 hospitals, 10 clinics and a Specialist Cancer Care Centre across England, Wales and Scotland.&lt;/p&gt;\n&lt;p&gt;For further information about this role or for an informal conversation about the range of career options available with Spire please contact Penny Lawless on 07715 055760 or penny.lawless@spirehealthcare.com&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;For us, it&#39;s more than just treating patients; it&#39;s about looking after people.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Closing date: In order to streamline our recruitment process, we reserve the right to expire vacancies prior to the advertised closing date once we have received a sufficient number of applications&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Spire Healthcare Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132894"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Portsmouth", "postalCode": "PO9 5NP"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8688", "longitude": "-.955234"}}, "title": "Chemotherapy Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916225093", "validThrough": "2020-11-13T23:59:59+0000"}