{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "47303", "minValue": "47303", "unitText": "YEAR", "value": "£28.14 p/h"}}, "datePosted": "2020-10-28T14:16:04+0000", "description": "&lt;ol&gt;\n&lt;li&gt;&lt;strong&gt; To provide specialist psychological assessment in relation to mental health, history of obesity and eating difficulties in people referred for bariatric surgery and medical management using a range of assessment methods as appropriate, making recommendations to the multi-disciplinary team.&lt;/strong&gt;&lt;/li&gt;\n&lt;/ol&gt;\n&lt;p&gt;1.2. To formulate and devise psychological treatment and management plans for referred clients and to provide psychological treatment, using a range of specialist psychological interventions (group and individual).&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;1.3. To provide input to the internal tier 3, weight management programme and bariatric surgery support group, alongside other core members of the team.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;1.4. To provide specialist psychological advice, guidance and consultation to other professionals e.g. dieticians and clinical nurse specialists, to assist in the formulation, diagnosis and treatment of clients.&lt;/p&gt;\n&lt;p&gt;1.5. To implement service development initiatives as discussed with lead psychology service manager&lt;/p&gt;\n&lt;p&gt;1.6. To exercise autonomous professional responsibility for the psychological assessment and treatment of patients within the service, referring to Senior Psychologists for guidance where appropriate.&lt;/p&gt;\n&lt;p&gt;1.7. To provide reports and communicate in a skilled and sensitive manner concerning the assessment, formulation and treatment plans of clients. To communicate across language and cultural barriers (utilising interpreters) remaining respectful of difference and responding to these appropriately within clinical contexts.&lt;/p&gt;\n&lt;p&gt;1.8. To liaise with other health, education, voluntary sector and social care staff, from a range of agencies, in the care provided to clients.&lt;/p&gt;\n&lt;p&gt;1.9. To develop a collaborative working relationship with other clinical psychologists within the department, and within the wider division.&lt;/p&gt;\n&lt;p&gt;1.10. To maintain high standards of clinical practice, record keeping, and report writing in accordance with the Healthcare Professions Council and the British Psychological Society’s code of conduct as well as Trust Policy.&lt;/p&gt;\n&lt;ol&gt;\n&lt;li&gt;&lt;strong&gt;2. &lt;/strong&gt;&lt;strong&gt;Teaching, Training and Supervision&lt;/strong&gt;&lt;/li&gt;\n&lt;/ol&gt;\n&lt;p&gt;2.1. To provide clinical placements for trainee clinical psychologists, ensuring the trainees acquire the necessary skills, competencies and experience to contribute effectively to health care, and to contribute to the assessment and evaluation of such competencies.&lt;/p&gt;\n&lt;p&gt;2.2. To continue to develop skills in the area of professional post-graduate teaching, training and supervision.&lt;/p&gt;\n&lt;p&gt;2.3. To contribute, where appropriate, to the supervision of assistant psychologists and to the supervision of individual cases of trainee clinical psychologists.&lt;/p&gt;\n&lt;p&gt;2.4. To contribute to the pre- and post-qualification teaching of clinical and/or other applied psychologists, as appropriate.&lt;/p&gt;\n&lt;p&gt;2.5. To provide advice, consultation, training and supervision, where appropriate, to other health and social care staff working with the client group.&lt;/p&gt;\n&lt;ol&gt;\n&lt;li&gt;&lt;strong&gt;3. &lt;/strong&gt;&lt;strong&gt;Management , Policy and Service Development&lt;/strong&gt;&lt;/li&gt;\n&lt;/ol&gt;\n&lt;p&gt;3.1. To advise on how services could improve and develop so that the psychological needs of patients are identified and met.&lt;/p&gt;\n&lt;p&gt;3.2. To contribute to the development, evaluation and monitoring of the team’s operational policies and services, through the deployment of professional skills in research, service evaluation and audit.&lt;/p&gt;\n&lt;p&gt;3.3. To manage the workloads of trainee psychologists and, where required, of assistant psychologists, within the framework of the service’s policies and procedures.&lt;/p&gt;\n&lt;p&gt;3.4. To be involved, as appropriate, in the short listing and interviewing of assistant psychologists and trainee psychologists.&lt;/p&gt;\n&lt;p&gt;3.5. To provide timely and accurate activity reports and data.&lt;/p&gt;\n&lt;ol&gt;\n&lt;li&gt;&lt;strong&gt;4. &lt;/strong&gt;&lt;strong&gt;Audit, Research and Service Evaluation&lt;/strong&gt;.&lt;/li&gt;\n&lt;/ol&gt;\n&lt;p&gt;4.1. To utilise theory, evidence based literature and research to support evidence-based practice in individual work and work with other staff.&lt;/p&gt;\n&lt;p&gt;4.2. Where appropriate, to collaborate with relevant academic, medical staff and allied medical professions in conducting research relevant to the clinical area and for improving service development.&lt;/p&gt;\n&lt;p&gt;4.3. To actively participate the preparation of clinical and research data for publication in scientific journals and presentation at scientific meetings.&lt;/p&gt;\n&lt;p&gt;4.4. To actively contribute to project management, including audit and service evaluation, with colleagues within the service to help develop and evaluate service provision.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;5. General&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;5.1 To ensure the development, maintenance and dissemination of the highest professional standards of practice, through active participation in internal and external CPD training and development programmes.&lt;/p&gt;\n&lt;p&gt;5.2 To ensure the development and articulation of best practice within the service area and contribute across the service, taking part in regular professional supervision and appraisal and maintaining an active engagement with current developments in this area.&lt;/p&gt;\n&lt;p&gt;5.3 To maintain and promote the highest standards of recording and report writing and the responsible exercise of professional self governance in accordance with professional codes of practice of the British Psychological Society and Trust policies and procedures.&lt;/p&gt;\n&lt;p&gt;5.4 To be accountable for adhering to the legal requirements of the Data Protection Act.&lt;/p&gt;\n&lt;p&gt;5.5 To maintain up to date knowledge of legislation, national and local policies and issues in relation to both the specific client group and mental health.&lt;/p&gt;\n&lt;p&gt;5.6 To participate in the collection and presentation of appropriate data in line with the Trusts requirements and clinical initiatives.&lt;/p&gt;\n&lt;p&gt;5.7 To be familiar with the use of the computer systems for client reports and correspondence and also for literature searches, research data entry and analysis.&lt;/p&gt;\n&lt;p&gt;5.8 To take professional responsibility for the use of equipment.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Other&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The job description is not intended to be exhaustive and it is likely that duties may be altered from time to time in the light of changing circumstances and after consultation with the potholder.&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "University College London Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120731"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "University College London Hospital", "postalCode": "NW1 2BU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5249", "longitude": "-.136987"}}, "title": "Bank Clinical Psychologist Band 8a", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246935", "validThrough": "2020-11-27T23:59:59+0000"}