{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 p.a. pro rata"}}, "datePosted": "2020-10-28T12:17:32+0000", "description": "&lt;p&gt;BAND 5 STAFF NURSE-POSITION OAU (Opal Assessment Unit)&lt;/p&gt;\n&lt;p&gt;Are you a dynamic and enthusiastic newly qualified or already registered band 5 nurse looking for a new challenge? The OPAL Assessment Unit (OAU) is an innovative multidisciplinary team specialising in the care of the older person living with frailty. We are a team who strive in developing and improving our expertise in assessing the holistic needs of patients in a dynamic and rapidly changing environment.&lt;/p&gt;\n&lt;p&gt;The OAU is a new unit built around comprehensive assessment through to discharge, whilst incorporating the whole MDT, which involves Nurses, Physiotherapy, Occupational Therapy, Specialist Nurses, Junior Doctors through to Consultants and Pharmacist. You will demonstrate that care and compassion are essential to effective nursing care, resulting in positive outcomes for patients and their families. The OAU is pivotal around the inpatient and outpatient journey and therefore provides opportunities for rotation within these areas.&lt;/p&gt;\n&lt;p&gt;We believe in maintaining high standards in everything we do, so we are looking for the best nurses to join us. You will benefit from a personal development plan and support from our dedicated educational team while assisting and supporting the development of this new unit.. We will invest in your on going growth as a Registered Nurse, ensure that you enhance your abilities and understanding, and encourage you to participate in the service development.&lt;/p&gt;\n&lt;p&gt;To join us, you should be a Registered Nurse with valid registration on the appropriate part of the NMC Register, have excellent written and verbal communication skills. Be able to support and contribute to a team approach, you&#39;ll have the ability to problem solve, analyse and resolve issues. In addition to this, you&#39;ll be motivated to develop personally and professionally and have exemplary personal standards of conduct. If you are a newly qualified member of staff you will be supported in your transition to your new role with our dedicated Preceptorship Programme.&lt;/p&gt;\n&lt;p&gt;We will be looking for enthusiasm, drive and passion where the delivery of outstanding levels of care can be nurtured. You will have excellent communication skills and the flexibility and adaptability to meet the needs of a fast paced service. You will be motivated and committed to delivering high quality care to your patients in a busy and challenging area.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameSuzanne WhittakerJob titleWard ManagerEmail addressSuzanne.whittaker@mft.nhs.ukTelephone number0161 291 6070Additional contact information&lt;/p&gt;\n&lt;p&gt;Suzanne Whittaker, Ward Manager/Vicky Mather, Sister direct on 01612916070 or email Suzanne.whittaker@mft.nhs.uk or Vicky.mather@mft.nhs.uk to discuss this position or also to arrange a visit and to meet the team.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Manchester University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121137"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wythenshawe Hospital, Wythenshawe", "postalCode": "M23 9LT"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3888", "longitude": "-2.29319"}}, "title": "Staff Nurse - OAU (Opal Assessment Unit)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246560", "validThrough": "2020-11-11T23:59:59+0000"}