{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-11-02T14:16:19+0000", "description": "&lt;p&gt;&lt;strong&gt;Mental Health Inpatient Band 7 Advanced Specialist Speech and Language Therapist&lt;/strong&gt; – Prospect Park Hospital, Reading, RG30 4EJ&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Therapy Team at Prospect Park Hospital comprises of Occupational Therapy, Physiotherapy, Dietetic and Speech and Language Therapy staff. You will receive clinical supervision and be supported to attend specialist clinical excellence groups through the RCSLT. You will work directly with Psychiatrists, Psychologists, Nursing Staff, and the Therapy Team. You will provide specialist Speech and Language Therapy assessment and intervention to working age and older adults within the mental health hospital. You will play a vital leadership role in managing and supervising colleagues within your team, supporting them to fulfil their capabilities. The role will also involve delivering the Dysphagia and Airway Obstruction in Mental Health training to all professional groups and staff in the hospital.&lt;/p&gt;\n&lt;p&gt;The wider BHFT Adult SLT services have excellent links with the University of Reading, the University of West London and the Royal Berkshire Hospital. Clinical education placements are provided for SLT students and for other HCP students such as OTs, Psychologists and CPNs.&lt;/p&gt;\n&lt;p&gt;Through strong clinical and evidence based practice leadership, the Advanced Specialist Speech and Language Therapist will provide specialist Speech and Language Therapy assessment and interventions to patients on their caseload. The post holder will ensure that all patients are treated with compassion, dignity and respect placing value on the diversity of the local community and beyond. The Specialist Speech and Language Therapist’s key responsibility is to ensure that the patient experience and clinical record is of the highest quality inspiring patient and public confidence. This will be achieved through high visibility and accessibility on the wards and in the Community Team. The post holder will be expected to work in clinical practice for the majority of their time and will be a specialist in the clinical area.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the Job&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Assessment and treatment of speech, language and communication difficulties and swallowing disorders on PPH mental health wards.&lt;/li&gt;\n&lt;li&gt;Providing SLT support and absence cover for MH SLT colleagues at PPH.&lt;/li&gt;\n&lt;li&gt;Developing the specialist speech and language therapy role within this service.&lt;/li&gt;\n&lt;li&gt;Liaison with other agencies and services working with adults.&lt;/li&gt;\n&lt;li&gt;Contributing to and participating in training on communication and swallowing disorders for other staff.&lt;/li&gt;\n&lt;li&gt;Contributing to protocols to enable a seamless service provision across this service and in partnership with acute SLT and community SLT services.&lt;/li&gt;\n&lt;li&gt;Undertaking teaching and supervision of speech and language therapists and other professionals within the specialist clinical area adult &amp; older adult mental health services&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Some of the benefits of joining our team:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Agenda for Change Salary ranging from &lt;strong&gt;£38,890 to £44,503 &lt;/strong&gt;per annum&lt;/li&gt;\n&lt;li&gt;Flexible working opportunities and a strong emphasis on your work, life balance&lt;/li&gt;\n&lt;li&gt;Annual leave – 27 days for new starters, plus bank holidays. Increasing to 29 days after 5 years and 33 days after 10 years NHS service. Pro rata for part time staff&lt;/li&gt;\n&lt;li&gt;Excellent learning and development opportunities&lt;/li&gt;\n&lt;li&gt;Salary sacrifice scheme for a new car&lt;/li&gt;\n&lt;li&gt;Access to onsite library&lt;/li&gt;\n&lt;li&gt;Generous maternity, paternity and adoption leave for eligible staff&lt;/li&gt;\n&lt;li&gt;Advanced IT enablement and support&lt;/li&gt;\n&lt;li&gt;Confidential telephone care service providing independent support and advice for staff.&lt;/li&gt;\n&lt;li&gt;And so much more&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The “must haves” for you to be considered for this role:&lt;/strong&gt;&lt;/p&gt;\n&lt;ol&gt;\n&lt;li&gt;Registered Speech and Language Therapy Degree Qualification or equivalent Licence to Practice&lt;/li&gt;\n&lt;li&gt;HCPC registration&lt;/li&gt;\n&lt;li&gt;MSc or at least two years’ experience in co-working with expert practitioners and undertaking specialist formal training.&lt;/li&gt;\n&lt;li&gt;Experience in developing and delivering training packages to other disciplines, carers and service users&lt;/li&gt;\n&lt;/ol&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;If you recognise yourself in these requirements, we would recommend you apply today!&lt;/p&gt;\n&lt;p&gt;We are happy to answer any questions that you may have. Please don’t hesitate to call: Jack Cairns on 0118 960 5170 or email: Jack.Cairns@berkshire.nhs.uk who’ll be delighted to help.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120886.PNG", "name": "Berkshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120886"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Reading", "postalCode": "RG30 4EJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4491", "longitude": "-1.0147"}}, "title": "Advanced Specialist Speech &amp; Language Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252379", "validThrough": "2020-11-15T23:59:59+0000"}