{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "49325", "minValue": "43712", "unitText": "YEAR", "value": "£43,712 to £49,325 per annum inc"}}, "datePosted": "2020-10-12T12:01:56+0100", "description": "&lt;p&gt;Barts Health NHS trust is one of the country&#96;s leading teaching hospitals with an international reputation for patient care, education and research.&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen within the occupational therapy service at one of our hospitals, Newham University Hospital.&lt;/p&gt;\n&lt;p&gt;We are looking to employ a Band 7 occupational Therapist as part of the Neurosciences/Stroke team.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be expected to provide leadership to and work as part of a dynamic and highly regarded Neurosciences/Stroke team, providing a high standard of Occupational Therapy assessment, treatment and advice to people with neurological related conditions within Newham university hospital.&lt;/p&gt;\n&lt;p&gt;If you are a Senior Occupational therapist, either Band 6 or 7, who has an interest in Neurosciences and Stroke, wants a new challenge and is looking to lead and develop a team? We are looking for an enthusiastic, motivated, dynamic and innovative OT with broad clinical skills with special interest in Stroke and/or Neuroscience to join our friendly and supportive integrated OT and PT service.&lt;/p&gt;\n&lt;p&gt;This post sits within the Stroke and Neuro team, and in conjunction with the Band 7 Physiotherapist for Stroke will support service provision to the Stroke ward and Neuroscience patients by providing expert support, advice and training to the ward therapy teams in their development of their skills and knowledge in these fields. Support will be provided by the OT/PT Clinical Lead and Head of Therapies.&lt;/p&gt;\n&lt;p&gt;The therapy team works closely together to provide high quality care to our patients. We are constantly reviewing our service delivery in order to meet the changing needs of our local population and ensuring evidence based clinical pathways are developed for each speciality. There is excellent support available across the Trust as well as within the Therapy department at Newham University Hospital. The onsite OT Clinical Lead (Band 8a) has a remit to support OT&lt;/p&gt;\n&lt;p&gt;professional development with close working relationships amongst the Barts Health Band 7 peer group.&lt;/p&gt;\n&lt;p&gt;Candidates must have current HCPC registration and experience working in the NHS at least Band 6 level.&lt;/p&gt;\n&lt;p&gt;Interested individuals should have:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Specialist interest and experience in Acute Stroke and Neurosciences&lt;/li&gt;\n&lt;li&gt;Evidence of CPD relevant to the post&lt;/li&gt;\n&lt;li&gt;Experience in leadership and management of others&lt;/li&gt;\n&lt;li&gt;Excellent MDT working and effective flexible communication skills&lt;/li&gt;\n&lt;li&gt;Experience in complex discharge planning&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;There is a strong commitment to staff development via education and training to improve clinical skills and evidence based practice. We actively encourage supervision, CPD and service development.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;For further information about the post please contact:&lt;/p&gt;\n&lt;p&gt;For further information about the post please e-mail Trish.kelly1@nhs.net or Philippa.nott@nhs.net&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;For further information about the post please e-mail Trish.kelly1@nhs.net or Philippa.nott@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120603.jpg", "name": "Barts Health NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120603"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Newham University Hospital, London", "postalCode": "E13 8SL"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.523", "longitude": ".035418"}}, "title": "Senior Occupational Therapist (Neuro and Stroke Services)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916222241", "validThrough": "2020-11-09T23:59:59+0000"}