{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 to £21,142 per annum/pro-rata"}}, "datePosted": "2020-10-27T16:30:47+0000", "description": "&lt;p&gt;The Oxford Cognitive Health Clinical Research Facility (CRF)was established in 2011, to support intensive research studies that are not feasible to conduct within the routine clinical care setting. The CRF was awarded significant funding from the NIHR to support infrastructure for experimental medicine and its aim is to be fully aligned with the strategy of the OHFT Biomedical Research Centre, BRC. The BRC is a joint partnership between OHFT and the University of Oxford. CRF studies in mental health and cognitive neuroscience range from research-ready observational cohort studies to CTIMPs with a strong focus on experimental medicine design. Disease areas include mood disorders, schizophrenia, and dementia.&lt;/p&gt;\n&lt;p&gt;The CRF provides a unique opportunity to work with a team delivering research protocols that aim to translate neuroscience into benefits for patients. The unit requires an experienced administrator to join the growing CRF team.&lt;/p&gt;\n&lt;p&gt;The role holder will provide administrative support to the CRF team and Out-patient Research Clinics running within the facility. This will include assistance to the CRF management team, study coordinators and to clinicians delivering the Research Clinics in the department.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Claudia Hurducas Job title CRF Manager / Research Delivery Manager Email address claudia.hurducas@oxfordhealth.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Oxford Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122233"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Clinical Research Facility, Warneford Hospital, Oxford", "postalCode": "OX3 7JX"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7508", "longitude": "-1.2223"}}, "title": "Clinical Research Facility Administration Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245423", "validThrough": "2020-11-10T23:59:59+0000"}