{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum pro rata"}}, "datePosted": "2020-10-28T10:46:54+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for a Nurse to join the Direct Delivery Team for Research within the Trust&lt;/p&gt;\n&lt;p&gt;The current vacancy in the Direct Delivery Team represents an excellent opportunity for a motivated and hardworking nurse with an interest in clinical trials to join our small and friendly team. You should ideally have experience of clinical research, or be able to transfer your previously gained relevant clinical skills and knowledge to the role of the research nurse. You will be responsible for identifying and recruiting patients, seeing the patient through the trial, performing study assessments and ensuring data is reported accurately and on time. You will work closely with a variety of healthcare professionals and teams so excellent communication skills are essential, as is attention to detail. You will need to be able to manage your own workload but also work as part of a team&lt;/p&gt;\n&lt;p&gt;The team is helping deliver studies across a wide range of specialties including Surgery and Adult and Children’s Medicine. At present the team are running a number of COVID-19 studies and have been able to support outcomes in fighting the virus&lt;/p&gt;\n&lt;p&gt;Previous experience of working with research studies and clinical trials is preferred but not essential as full induction, training and mentoring will be provided. The team works across a variety of clinical specialties within the Trust so you must be willing to be mobile and flexible in your working practices.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;South Warwickshire NHS Foundation Trust promotes flexible working options on all appropriate positions and our managers welcome these discussions during the recruitment process.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameJo WilliamsJob titleHead of Research &amp; DevelopmentEmail addressJo.Williams@swft.nhs.ukTelephone number01926 495321 extn. 8107Additional contact information&lt;/p&gt;\n&lt;p&gt;Penny Parsons – Senior Research Nurse penny.parsons@swft.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "South Warwickshire NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120990"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Research&amp;Development Alloc. C27025, Warwick", "postalCode": "CV34 5BW"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.29", "longitude": "-1.5832"}}, "title": "Research Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246170", "validThrough": "2020-11-09T23:59:59+0000"}