{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 Per Annum"}}, "datePosted": "2020-10-28T12:15:33+0000", "description": "&lt;p&gt;&lt;strong&gt;UNIVERSITY PLYMOUTH HOSPITALS NHS TRUST&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; DIRECTORATE OF HEALTHCARE SCIENCE &amp; TECHNOLOGY &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Clinical Measurements and Innovation - Healthy Bones Service&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Healthy Bones&lt;/strong&gt;&lt;strong&gt; Reporting Specialist Practitioner (DXA)&lt;/strong&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Band 6&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Full time – 1.0 WTE / Part time – WTE negotiable&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Permanent contract&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Applications are invited from suitably qualified and registered candidates for the position of Specialist Reporting Practitioner - Healthy Bones (Bone Densitometry) - within the Clinical Measurements &amp; Innovation Group (CMI), Directorate of Healthcare Science &amp; Technology. The CMI Group provides a range of services including the award-winning ‘Healthy Bones’ which delivers hospital and mobile clinical bone densitometry clinics across the locality.&lt;/p&gt;\n&lt;p&gt;Healthy Bones provides DXA scans, support and advice to primary and secondary care across 2500 square miles in the region and scans upwards of 3500 patients per year. The service is delivered by a small and friendly team of highly skilled and dedicated specialist Radiographers and supported closely by two admin team members. Clinical support is provided by a Consultant Practitioner Radiographer and MDT including consultant rheumatologist and orthogeriatrician.&lt;/p&gt;\n&lt;p&gt;Patients are seen by the service at our static unit based at Derriford Hospital and on our newly refurbished mobile DXA scanning unit visiting community hospitals across the region. Both units are equipped with brand new GE scanners – a Lunar iDXA with paediatric software at the static site, and a Prodigy Pro scanner in the mobile unit, performing a range of DXA techniques&lt;/p&gt;\n&lt;p&gt;The post holder will be fully immersed in the delivery of the Healthy Bones service, by performing and reporting DXA Scans, delivering results and advice to patients, and will also have a role in the operational management of the service, supervision and training of junior staff, delivering training material to other health professionals and participating in aspects of clinical audit.&lt;/p&gt;\n&lt;p&gt;A commitment to performing scans on the mobile unit at community locations via flexible rota is expected.&lt;/p&gt;\n&lt;p&gt;Applicants for this Band 6 post must hold a BSc(Hons) Diagnostic Radiography, professional qualification (e.g. DCR) in relevant subject area or equivalent level of knowledge in clinical science. Also they will ideally have a minimum of 4 years post qualification clinical experience and 2 years’ experience in DXA. Applicants also must have attained or be working towards the certificate of competency from the ROS National Training Scheme for Bone Densitometry and be HCPC registered. This is a reporting post and training and experience in DXA scan reporting will be an advantage although full training will be provided for the right candidate.&lt;/p&gt;\n&lt;p&gt;Candidates with lesser experience and without the ROS certificate would also be considered for an appointment at Band 5 with a development plan to achieve the competencies within an agreed timescale and progress to Band 6.&lt;/p&gt;\n&lt;p&gt;The post is funded as 1 WTE but we are open to applications from candidates looking for a part time position. The existing team is made up of part time radiographers and admin staff.&lt;/p&gt;\n&lt;p&gt;We are a friendly and supportive team and this is a great opportunity to work together to provide an excellent and flexible service across the Trust and into the community. We are a unique service in our delivery model and this a great opportunity to develop your skills in mobile service delivery, visit different areas in the region and develop relationships at community hospital sites as well as back at base.&lt;/p&gt;\n&lt;p&gt;This is an exciting time to join our team as we are currently working with STP partners, the ROS, and the Trauma, Orthopaedics and Rheumatology directorate to establish a new integrated fracture liaison / prevention service.&lt;/p&gt;\n&lt;p&gt;The Hospital operates a flexible working policy and the department is committed to Continuing Professional Development and staff are supported to attend relevant training courses.&lt;/p&gt;\n&lt;p&gt;At Plymouth Hospital NHS Trust we recognise that work is only part of your life.  Situated on the beautiful south west coast, Plymouth boasts many local Heritage sites and areas of ‘outstanding natural interest’. It is ideally located for walking, cycling, climbing, sailing and many other indoor / outdoor pursuits.  Plymouth has good road and rail links and access to the rest of the UK and Europe.&lt;/p&gt;\n&lt;p&gt;For further information or to arrange an informal visit please contact Jenny Knell, tel: 01752 439882, email:  jenny.knell@nhs.net&lt;/p&gt;\n&lt;p&gt;***Preference will be given to internal Trust staff, as well as ‘Priority’ and &#39;At Risk&#39; status including NHS At Risk staff throughout Devon who are able to display recent relevant experience as dictated by the Person Specification.***&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120815.jpg", "name": "University Hospitals Plymouth NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120815"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "PLYMOUTH", "postalCode": "PL6 8DH"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.4167", "longitude": "-4.11371"}}, "title": "Healthy Bones Reporting Specialist Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246499", "validThrough": "2020-11-11T23:59:59+0000"}