{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "negotiable"}}, "datePosted": "2020-10-22T10:33:36+0100", "description": "&lt;p&gt;&lt;span&gt;We are looking for 2 experienced Nurse Practitioners to join our enthusiastic practice team. Our practice is based in the West End of Darlington and we care for over 10,000 patients. Our nursing team currently consists of 1 Nurse Practitioner, 1 Health Care Assistant, 1 Phlebotomist &amp; 3 experienced Practice Nurses. We work closely to support patients with our: Practice Manager, 4 GP Partners, 2 salaried GPs and an excellent reception and administration team.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Your working day will be varied, delivering a plethora of autonomous evidence based care to the practice population. Experience in women’s health and contraceptive is particularly desirable for the role, as well as essential experience in minor ailments and a knowledge of chronic disease management. Key responsibilities include supporting the GPs and wider team in safeguarding, palliative care and QOF, QIF and PCN DES contracts. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We pride ourselves on delivering gold standard care to our population and going above and beyond for our patients. We will support you when transitioning into your new post with us at Carmel, with training provided where needed. We hope you can add your experience and enthusiasm for patient care to our team and look forward to hearing from you.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;For an informal discussion on the above position or for an informal visit please contact Holly Phillips, Lead Nurse, on 01325 809862. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are also accepting CV applications to holly.phillips7@nhs.net&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Central Advertising - General Practitioners", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130654"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Darlington", "postalCode": "DL3 8SQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.528", "longitude": "-1.57928"}}, "title": "Nurse Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916237956", "validThrough": "2020-11-09T23:59:59+0000"}