{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "39681", "minValue": "32933", "unitText": "YEAR", "value": "£32,933 - £39,681 inc Fringe HCAS"}}, "datePosted": "2020-10-20T10:55:34+0100", "description": "&lt;p&gt;&lt;span&gt;An exciting opportunity has arisen fora Care Co ordinaters to join the Mid Surrey Community Mental Health Team for Older People.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are looking for passionate practitioners who will focus on providing support and high quality nursing care for clients and carers, targeting and prioritising people with severe mental health problems to join the Mid Surrey Community Mental Health Team for Older People.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will be required to demonstrate a high level of commitment, motivation and knowledge working with people with severe and enduring mental health problems and/or dementia. You will also need to demonstrate clinically effective care management skills and interventions in accordance with the Care Programme Approach.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will manage a caseload of clients, and use evidence based/client centered principles to assess, plan, implement and evaluate interventions as part of the holistic approach. You will need to demonstrate excellent communication skills and be able to work collaboratively with a multi-disciplinary team. You will be committed to the delivery of a high quality service, working both independently and as part of a well-established, innovative and recovery focused team in meeting the needs of clients and their carers.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will be a flexible and keen nurse, social worker or occupational therapist and will have experience of the assessment of complex presentations. At the centre of your approach you will enthusiastically support the best interests and engagement of the individual and their carers and/or family&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;In return you will have a fulfilling and varied role within a friendly and supportive team. You will receive active management support and opportunities for personal and professional development&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Applicants must have a driving license suitable for use in the United Kingdom.&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121260.jpg", "name": "Surrey and Borders Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121260"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Epsom", "postalCode": "KT19 8GT"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.3393", "longitude": "-.301017"}}, "title": "Community Mental Health Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916233967", "validThrough": "2020-11-08T23:59:59+0000"}