{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "32762", "minValue": "31031", "unitText": "YEAR", "value": "£18.46 - £19.49 p/h plus enhancements &amp; bonuses"}}, "datePosted": "2020-10-09T16:32:18+0100", "description": "&lt;p&gt;An exciting opportunity has arisen for passionate and pro-active Telephone Triage Nurses and Paramedics to provide support and delivery to the integrated urgent care service within&lt;strong&gt;London Central and West Unscheduled Care Collaborative (LCW).&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Who are we?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;LCWUCC is a GP-led Social Enterprise organisation providing Integrated Urgent Care services (NHS111 and GP OOH) as well as several urgent care services across North West and North Central London.&lt;/p&gt;\n&lt;p&gt;The organisation has in its 26-year history expanded its portfolio of services and our skill mix of clinicians who now include GPs, Advanced Nurse Practitioners, Nurses, Paramedics, and Pharmacists. In addition, we have grown our non-clinical support team. Most of our work is in the urgent care environment working in partnership with Commissioners, Acute and Community Trusts, GP Federations and other health and social care organisations in the development of integrated services.&lt;/p&gt;\n&lt;p&gt;LCW is a consistently high performer in all aspects of service delivery as well as other patient safety initiatives and compliance with best practice and statutory regulation.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What will the role involve?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We’re looking for Telephone Triage Nuses/Paramedics to work within the Integrated Urgent Care Clinical Assessment Service to provide an enhanced assessment function for a range of patients. The post holder will use the available technology to provide a consultation and assessment of the patient with formulation of an initial treatment plan. Full systems training will be provided.&lt;/p&gt;\n&lt;p&gt;Using clinical assessment software and their own professional judgment, the post holder will provide triage, medication advice and health information to a range of individuals in a variety of emotional states. The post holder will liaise with other agencies and other clinicians within and outside of London Central &amp; West Unscheduled Care Collaborative as necessary. The post holder will work autonomously within agreed protocols, as well as working as part of a team contribution to the development of the role.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What can we offer you?&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Flexible working&lt;/li&gt;\n&lt;li&gt;Competitive rates&lt;/li&gt;\n&lt;li&gt;Opportunity to work in a diverse clinical team&lt;/li&gt;\n&lt;li&gt;Supportive work environment&lt;/li&gt;\n&lt;li&gt;Monthly clinical feedback&lt;/li&gt;\n&lt;li&gt;Regular clinical and safeguarding updates&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;If you are interested in this exciting role, please submit your CV and you will be contacted in due course. We look forward to your application and bringing you on board to help deliver urgent care services in these challenging times.&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "London Central and West Unscheduled Care Collaborative (LCW UCC)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132774"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Various Sites", "postalCode": "W10 6DZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5224", "longitude": "-.217393"}}, "title": "Clinical Advisor - Telephone Triage Nurse/Paramedic", "url": "https://www.jobs.nhs.uk/xi/vacancy/916221129", "validThrough": "2020-11-13T23:59:59+0000"}