{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "36738", "minValue": "29888", "unitText": "YEAR", "value": "£29,888 - £36,738 £29,888 - £36,738 per annum incl"}}, "datePosted": "2020-10-29T11:30:44+0000", "description": "&lt;p&gt;Panther Urology ward is one of the few specialised Urology wards in the UK. Our aim is to provide the highest possible care for children and their families with Urological conditions requiring surgical intervention and support. We care for many patients from across the country and globe with acute and chronic conditions such as Posterior-Urethral Valves, Bladder Exstrophy and Cloaca anomaly to name a few.&lt;/p&gt;\n&lt;p&gt;We have an exciting opportunity for a Band 5 Staff Nurse to join our amazing nursing team on Panther Urology to help provide a high level of nursing care and positive patient experiences.&lt;/p&gt;\n&lt;p&gt;On the ward we have 11 beds, 2 of which are developed further into a high dependency unit (HDU) to care for patients requiring additional support in the pre and post-operative period. Our patients vary in complexity and acuity, ranging from day case to high dependency care; you will develop an impressive repertoire of clinical and leadership skills. Panther- Urology is located into a brand new state-of-the-art ward in November 2017, this has allowed us to develop our urology team further.&lt;/p&gt;\n&lt;p&gt;We are seeking a full-time experienced nurse at Band 5 level who has a special interest in the care of children with both acute and chronic urology conditions requiring surgical intervention.&lt;/p&gt;\n&lt;p&gt;This post is suitable for experienced registered Children’s Band 5 nurses that are ready to progress to the next level in their nursing career. The role will involve communicating with a range of professionals, delegating tasks, organisational and time management skills, motivating a team of nurses, and problem solving.&lt;/p&gt;\n&lt;p&gt;As a Staff Nurse you will have the opportunity to further your skills and education, as well as supporting others in meeting their own career development needs. A great opportunity to be a role model for junior staff and become a preceptor and mentor.&lt;/p&gt;\n&lt;p&gt;For further information regarding this vacancy or to organise a visit to the ward, please contact&lt;/p&gt;\n&lt;p&gt;Farhana Patel - Ward Sister&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121180.png", "name": "Great Ormond Street Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121180"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Great Ormond Street Hospital for Children, London", "postalCode": "WC1N 3JH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5222", "longitude": "-.119898"}}, "title": "Experienced Staff Nurse (Panther Urology)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248115", "validThrough": "2020-11-12T23:59:59+0000"}