{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51393", "minValue": "45780", "unitText": "YEAR", "value": "£45,780 - £51,393 per annum including HCA"}}, "datePosted": "2020-11-05T13:01:50+0000", "description": "&lt;p&gt;The Senior Analyst, Population Health and Financial Strategy will use their advanced analytical experience of software such as SQL and R, and technical skills such as experience with machine learning approaches and spatial analysis, in combination with knowledge of the wider determinants of health and quality improvement processes to help identify how care can better meet the needs of the local population across Tower Hamlets, Waltham Forest and Newham NHS Clinical Commissioning Groups.&lt;/p&gt;\n&lt;p&gt;Quantitative analysis skills will be deployed to mine our innovative data set that links patient records across care settings.&lt;/p&gt;\n&lt;p&gt;The post holder will use this alongside qualitative analysis, other intelligence and quality improvement methodologies to help identify how resources can be used more effectively in the health and care system.&lt;/p&gt;\n&lt;p&gt;This role supports the organisation’s major strategic programmes and the wider health system objectives to enable commissioning of effective care and make best use of available resources.&lt;/p&gt;\n&lt;p&gt;This is a great opportunity for an analytically minded individual to continue to develop their skills and experience in a multidisciplinary professional environment.&lt;/p&gt;\n&lt;p&gt;The role offers opportunities to apply your analytical, economic and public health skills, knowledge and experience to improve the lives of people in East London.&lt;/p&gt;\n&lt;p&gt;We welcome applications with an economics, finance or health background that includes wider analytical experience, as well as those with a background in analysis with some finance or accounting experience.&lt;/p&gt;\n&lt;p&gt;Successful applicants could have experience in the health service or be looking to transfer skills gained in other sectors.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NamePeter GrummittJob titleSenior Manager Population Health and Financial StrategyEmail addressp.grummitt@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Tower Hamlets Clinical Commissioning Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128184"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Tower Hamlets CCG, London", "postalCode": "E1 4DG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5245", "longitude": "-.04262"}}, "title": "Senior Analyst Population Health and Financial Strategy", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257776", "validThrough": "2020-11-19T23:59:59+0000"}