{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 pa"}}, "datePosted": "2020-10-22T14:56:07+0100", "description": "&lt;p&gt;We have an excellent opportunity for a Band 5 mental health nurse to apply for this development post that provides structure and training to enable the successful candidate to grow professionally to meet the competencies of a band 6 Nurse.&lt;/p&gt;\n&lt;p&gt;To achieve this, we are looking to appoint an enthusiastic and forward thinking mental health nurse. Whether you are an experienced band 5 Nurse or a newly qualified Nurse looking to broaden your clinical experience and develop your career, we would love to see your application.&lt;/p&gt;\n&lt;p&gt;The older adults community divisions work with individuals with server and enduring conditions along side complete specialised memory assessmnts and working with individuals with cognitive difficulties/dementia.&lt;/p&gt;\n&lt;p&gt;Spalding Older Adults CMHT has worked hard to promote a good work-life balance to ensure the wellbeing of our staff. To achieve this, we pride ourselves in working very much as a multi– disciplinary team in sharing the responsibilities of managing the care provided in the community.&lt;/p&gt;\n&lt;p&gt;The Johnson hospital is a well maintained modern hospital that provides a pleasant environment for staff to work in as well as providing free car parking.&lt;/p&gt;\n&lt;p&gt;We welcome you to come and spend a day to meet the team and shadow a member of staff in this well established Multi-disciplinary team.&lt;/p&gt;\n&lt;p&gt;•The successful applicant will be required to assess, plan, co-ordinate and implement evidence based mental &amp; physical health care to services users whilst working collaboratively with the services users carer under the supervision of senior staff. &lt;br /&gt;•For you to support services users to work towards recovery goals, build resilience, enabling self-care and promoting self-management to live independently in the community. &lt;br /&gt;•You will be required to act as a Care co-ordinator under the Care Programme Approach, to liaise and work with other agencies and services within the Trust and with external agencies when required.&lt;br /&gt;•You will have the ability to travel independently in the community to deliver services and work as part of a well-established multi-disciplinary team.&lt;/p&gt;\n&lt;p&gt;All staff have access to: &lt;br /&gt;•Regular Clinical supervision and annual appraisal &lt;br /&gt;•NHS benefits&lt;br /&gt;•NHS Pension&lt;br /&gt;•Early access to the Trust staff wellbeing services and psychological therapies&lt;br /&gt;•Professional &amp; personal development training”&lt;/p&gt;\n&lt;p&gt;If you have any queries, please contact Mrs.  Ewa Michocka-Lowthian , team coordinator on ewa.michocka-lowthian@nhs.net, 01775 652300&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120663.jpg", "name": "Lincolnshire Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120663"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Johnsons Community Hospital, Spalding", "postalCode": "PE11 3DT"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.8018", "longitude": "-.150274"}}, "title": "Community Psychiatric Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916239020", "validThrough": "2020-11-06T23:59:59+0000"}