{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "31365", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 pa"}}, "datePosted": "2020-10-28T16:16:18+0000", "description": "&lt;p&gt;&lt;strong&gt;Be the link between leading-edge medical software and an outstanding NHS Trust.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Manchester University NHS Foundation Trust (MFT), is the largest combined acute and community trust in the UK, with over 23,000 staff that care for over million patients a year. We’re embarking on an unprecedented clinical transformation programme that will revolutionise the way we work. We’ve partnered with a world-class medical software company to introduce Hive, a brand-new Electronic Patient Record (EPR) solution that will bring all our patient information into one easily accessible place and make our services more effective than ever before.&lt;/p&gt;\n&lt;p&gt;Hive is the largest initiative of its kind and is backed by a significant multi-million-pound investment. It’s also an exciting opportunity to bring your expertise, join us at the beginning of our journey and develop through a challenging, complex project. With your help, we’ll build on our leading initiatives and transform our services for the benefit of patients and staff alike.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As a Clarity and Cogito Database Administrator, you’ll support on implementing and administrating our Caboodle and Business Objects environments. Running on MS SQL Server as well as multipurpose SQL Servers, these environments will form the core of our Trust’s data warehouse and a critical part of Hive as a whole.&lt;/p&gt;\n&lt;p&gt;Your work in maintaining high levels of availability and performance are crucial to Hive’s successful delivery. You’ll also support on the configuration and management of our reporting environments and proactively respond to issues as and when they arise.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Required skills and experience&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We’re looking for people with experience in database management, data manipulation and project management. You should also have strong SQL server skills, good scripting knowledge and an understanding of at least one RDBMS, e.g. Oracle or Informix.&lt;/p&gt;\n&lt;p&gt;Strong problem-solving skills, collaboration skills and communication skills are essential. You’ll also need a degree (or equivalent) in a relevant subject.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Benefits&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Join us at the forefront of change and you’ll enjoy plenty of opportunities, together with all the benefits you can expect as an NHS employee. Alongside a competitive salary, you can expect a comprehensive benefits package including generous holiday entitlement, childcare support, flexible working and an NHS pension.&lt;/p&gt;\n&lt;p&gt;Personal development is important to us at MFT, and you’ll also be able to move across different departments within the trust while taking advantage of quality training and learning schemes.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Diversity &amp; Inclusion at MFT&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;At MFT, our ambition is to be the best place to work for individuals from every background. That’s why we’re committed to promoting equality of opportunity, celebrating diversity and eliminating any form of unlawful discrimination across our workforce. This way, we can create a truly inclusive environment and make sure our staff represent the communities we serve.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Apply with us&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you’re excited by this opportunity and think you’re a great match in both skills and experience, we’d love to hear from you and hope you’ll consider submitting an application.&lt;/p&gt;\n&lt;p&gt;Alternatively, if you’d like to discuss it further, email hive@mft.nhs.uk for more information. We’re really excited to hear from you and demonstrate to you why MFT and HIVE really does have it all for you and your future career.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing Date: 8th Nov 2020. &lt;/strong&gt;If shortlisted, you can expect to hear from us within 5 working days of the advert closing.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Selection Process: &lt;/strong&gt;You’ll be advised by email what the selection process will consist of should you be shortlisted (this will be carried out via MS Teams so you will be required to have access to this software). For some roles, candidates will be required to partake in some online ability tests (Sphinx testing) before the final selection process. See below key dates that are relevant for this role to diary in the event you are shortlisted for this vacancy.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Sphinx Tests: 12th-15th Nov 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Virtual Final Selection Process: week commencing 16th Nov 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameHive@mft.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Manchester University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121137"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Working agilely across all MFT sites, Wythenshawe", "postalCode": "M23 9LT"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3888", "longitude": "-2.29319"}}, "title": "EPR Clarity &amp; Cogito DBA", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247353", "validThrough": "2020-11-08T23:59:59+0000"}