{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "46294", "minValue": "40681", "unitText": "YEAR", "value": "£40,681 - £46,294 pa inclusive of HCAS"}}, "datePosted": "2020-10-27T10:31:55+0000", "description": "&lt;p&gt;&lt;strong&gt;EPR Senior Configuration Analyst&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As part of an extensive clinical transformation programme at Frimley Health, and central to the Trust’s Digital Strategy, we are looking to recruit a number of staff who will be trained as EPR Senior Configuration Analysts. You will work as part of a dedicated team on the configuration of specific Epic modules, ensuring timely delivery as part of the Trust’s EPR Programme (in conjunction with supplier Epic). The Senior Configuration Analysts will work within their assigned team to develop one of the following modules:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Inpatient Clinical Systems (including ED, Clinical documentation, Maternity, Order Entry and Pharmacy)&lt;/li&gt;\n&lt;li&gt;Outpatient Clinical Systems (including Population Health, Ophthalmology, Orthopaedics and Pharmacy)&lt;/li&gt;\n&lt;li&gt;Specialty Clinical Systems (including Theatres, Anaesthesia, Radiology, Cardiology and Endoscopy)&lt;/li&gt;\n&lt;li&gt;Patient throughput (including PAS, Bed management (ADT), Scheduling &amp; Registration, and Coding)&lt;/li&gt;\n&lt;li&gt;Business Intelligence&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The EPR Senior Configuration Analysts will, along with subject matter experts from the Trust and EPR colleagues, including EPR Configuration Analysts (reporting to the role) map current working practices and design new ‘best practice’ ways of working. They will also be responsible for working on integrated areas of the configuration build within their assigned module whilst achieving multiple configuration build deadlines and targets. The post-holder will undertake training to learn complex Epic skills and will be expected to carry out configuration build requirements as well as supervising and supporting the team’s EPR Configuration Analysts.&lt;/p&gt;\n&lt;p&gt;This is a fast-paced role which will utilise the post-holder’s sound organisational knowledge (clinical and operational). We are seeking applicants from a wide variety of NHS disciplines and welcome those who possess excellent IT skills, have a thirst for learning something new and have a genuine interest in achieving improved patient pathways through the implementation of the Epic EPR system.&lt;/p&gt;\n&lt;p&gt;This position is a fixed term 18 month contract with potential for a further extension and/or permanent employment thereafter. Please note that applicants will be asked to undertake Epic aptitude testing before being invited to interview to determine their suitability for the role.&lt;/p&gt;\n&lt;p&gt;If you would like an informal discussion about this role please contact Fiona Joseph fiona.joseph2@nhs.net 07392 288763 or 0300 6142092 or Saraid Loughman saraid.loughman@nhs.net 07392 288762 or 0300 6142102&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameFiona JosephJob titleDigital Services AdministratorEmail addressfiona.joseph2@nhs.netTelephone number07392 288763&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121099.png", "name": "Frimley Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121099"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Heatherwood Hospital, Greenwood, Ascot", "postalCode": "SL5 8AA"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4102", "longitude": "-.68732"}}, "title": "EPR Senior Configuration Analyst", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244034", "validThrough": "2020-11-17T23:59:59+0000"}