{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62001", "minValue": "53168", "unitText": "YEAR", "value": "£53,168 - £62,001 per annum"}}, "datePosted": "2020-10-27T11:16:32+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for a Nurse Consultant to join our Immunodeficiency Service for Wales. We are looking to recruit a dynamic, competent and forward thinking individual to enhance and enable the provision of existing services in light of the significant growth in numbers and complexity of treatment for all Welsh patients. The postholder would be required to provide clinical expertise and as such will naturally allow provision of direct clinical care and clinical advice to all of the service users equitably across Wales.&lt;/p&gt;\n&lt;p&gt;The post holder will supervise the immunoglobulin and immunotherapy home therapy training programmes nationally and ensure equity of access for all Welsh patients with Primary Immunodeficiency (PID). It is expected that the post holder will play a significant role in analysing current services across Wales, identifying opportunities and shortfalls and addressing these for the direct benefit of patient care.&lt;/p&gt;\n&lt;p&gt;The post holder will be expected to sit on the IVIg Strategy Group for Wales and importantly manage, protect and negotiate supplies and shortages of immunoglobulin products and provide expert clinical advice on their use on a national level. This will be of benefit for patients directly receiving treatment and all HBs in securing a safe and economically efficient use of product.&lt;/p&gt;\n&lt;p&gt;It is the expectation that the post holder will work flexibly across all Health Boards in Wales, which will allow the individual to provide training sessions to both staff and patients and conduct individual patient reviews for complex cases routinely and on request and provide high level clinical advice on a national basis.&lt;/p&gt;\n&lt;p&gt;Above all we are looking for individuals who share our values;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;We care about people we serve and the people we work with.&lt;/li&gt;\n&lt;li&gt;We trust and respect one another.&lt;/li&gt;\n&lt;li&gt;We take personal responsibility.&lt;/li&gt;\n&lt;li&gt;We act with integrity.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Post holders will be expected at all times to behave in accordance with our values demonstrating commitment to the delivery of high quality services to patients.&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; Welsh and/or English speakers are equally welcome to apply.&lt;/p&gt;\n&lt;p&gt;Closing date: 10th November 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Professor Stephen Jolles - Consultant Clinical Immunologist&lt;/p&gt;\n&lt;p&gt;JollesSR@cardiff.ac.uk&lt;/p&gt;\n&lt;p&gt;02920745814&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/123193.jpg", "name": "Cardiff and Vale University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=123193"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "University Hospital of Wales, Cardiff", "postalCode": "CF14 4XW"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5068", "longitude": "-3.18937"}}, "title": "Consultant Nurse Immunology Services", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244193", "validThrough": "2020-11-10T23:59:59+0000"}