{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum pro rata"}}, "datePosted": "2020-11-02T11:01:18+0000", "description": "&lt;p&gt;Are you an experienced Children&#39;s Physiotherapist looking for a new challenge or a PT who wants to develop your experience in Children’s Physiotherapy?&lt;/p&gt;\n&lt;p&gt;Do you want to be part of an innovative and agile Children and Young People’s Therapy service committed to delivering high quality care? We are looking to recruit a Children&#39;s Physiotherapist to join our well-established Children&#39;s Physiotherapy team.&lt;/p&gt;\n&lt;p&gt;Hertfordshire Community NHS Trust provides integrated OT, Physiotherapy and Speech &amp; Language Therapy Services for families across the county. Our integrated service is jointly commissioned by health and education, allowing us to provide a seamless pathway of care from early years through to schools and specialist provisions.&lt;/p&gt;\n&lt;p&gt;Our integrated service provides opportunities for collaborative working, joint training and shared learning amongst each profession. We work closely with colleagues in education with well-established relationships.&lt;/p&gt;\n&lt;p&gt;We can offer a part time band 6 post working across the West of Hertfordshire with a base at Marlowes Health and Wellbeing Centre, Hemel Hempstead.&lt;/p&gt;\n&lt;p&gt;The successful applicant will be expected to hold a varied caseload for young people aged 0-19, providing interventions in a variety of settings such as homes, schools and clinics. Ideally candidates should have post graduate experience/training in assessment and treatment using neurodevelopmental techniques. However support, mentoring and further training will be provided to meet the individual needs of practitioners in areas where further up skilling and development is required.&lt;/p&gt;\n&lt;p&gt;The successful candidate must be computer literate and able to demonstrate good working knowledge of a variety of essential computer systems and programmes.&lt;/p&gt;\n&lt;p&gt;HCT is strongly committed to continuing professional development and the delivery of evidence based practice which is supported through access to regular in-service and external training, clinical supervision, peer support meetings and our staff appraisal scheme.&lt;/p&gt;\n&lt;p&gt;HCT is strongly committed to continuing professional development and the delivery of evidence based practice which is supported through access to regular in-service and external training, clinical supervision, peer support meetings and our staff appraisal scheme.&lt;/p&gt;\n&lt;p&gt;A full valid driving licence and access to a car to use regularly for business purposes is essential (unless you have a disability as defined by the Equality Act 2010).&lt;/p&gt;\n&lt;p&gt;In addition to the basic salary, this post attracts a High Cost Area Supplement of 5% of basic salary subject to a minimum payment of £1,017 and a maximum payment of £1,762 per annum (pro rata where applicable).&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Julie Baker&lt;/p&gt;\n&lt;p&gt;Job title: Clinical Quality Lead for Children&#39;s Physiotherapy&lt;/p&gt;\n&lt;p&gt;Telephone number: 07740 364181&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Hertfordshire Community NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126514"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Marlowes Health and Wellbeing Centre, Hemel Hempstead", "postalCode": "HP1 1LD"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7551", "longitude": "-.472202"}}, "title": "Children&#39;s Physiotherapist - Band 6", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251683", "validThrough": "2020-11-15T23:59:59+0000"}