{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 to £37,890 per annum"}}, "datePosted": "2020-10-13T11:30:12+0100", "description": "&lt;h2&gt;Clinical Rotation Pharmacist&lt;/h2&gt;\n&lt;p&gt;Portsmouth Hospitals University NHS Trust is one of the largest acute hospital trusts in the country. We provide acute and specialist services to people across Portsmouth, South East Hampshire and West Sussex. We continue to build our reputation for innovation and excellence, consistently delivering outstanding performance, whilst developing the skills and abilities of our staff.&lt;/p&gt;\n&lt;p&gt;We are looking for an enthusiastic band 6 pharmacist to join our rotation. You may be newly qualified, a pre-registration pharmacist or looking for a new challenge. We can offer you a comprehensive rotation through admissions, medical, including medicine for older people, surgical areas and specialities such as women and children. Working as part of the clinical pharmacy teams, you will be fully supported to further your development. There are 50 pharmacists in the department. 80% of their time is spent on patient-facing care. They are supported by ward-based medicine management technicians and pharmacist assistants. TTO turnaround times are the 6th best nationally and patient care metrics are some of the best in the country.&lt;/p&gt;\n&lt;p&gt;Portsmouth provides access to beautiful countryside and excellent seaside and sailing facilities, as well as being only 90 minutes from central London. The area offers the benefits of urban, rural and coastal life and has easy access to France and the continent by land, air and sea.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing date: 10/11/2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview date: 18/11/2020&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120645.png", "name": "Portsmouth Hospitals University NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120645"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Portsmouth", "postalCode": "PO6 3LY"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8502", "longitude": "-1.06936"}}, "title": "Clinical Rotation Pharmacist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916224025", "validThrough": "2020-11-10T23:59:59+0000"}