{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "28324", "minValue": "15482", "unitText": "YEAR", "value": "£9.21 - £16.85"}}, "datePosted": "2020-10-29T10:11:08+0000", "description": "&lt;p&gt;&lt;strong&gt;Job Ref: NHSP_FSA&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job Title and Grade: &lt;/strong&gt;Food Service Assistant Band 2&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location/Trust: &lt;/strong&gt;Queens Medical Centre Campus&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Department Covered: &lt;/strong&gt;Catering Services - Foodservice&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Locations:&lt;/strong&gt;Queens Medical Centre NG7 2UH&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Pay Rates: &lt;/strong&gt;£9.21 weekdays, £12.98 Sats,£16.85 Suns and bank holidays+ accrued holiday pay&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Shift pattern: &lt;/strong&gt;5 days per week.&lt;/p&gt;\n&lt;p&gt;Typically 07.30-15:00 or 15.30 to 18.30 5 days per week including most weekends,7 week rolling rotas (rota attached to advert).&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Duration&lt;/strong&gt;: Ongoing (Subject to reviews)&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Role: Food Service Assistant&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Are you approachable and a team player?&lt;/li&gt;\n&lt;li&gt;Have you had previous experience working in a retail, hospital, care home or in hospitality preparing and serving food?&lt;/li&gt;\n&lt;li&gt;Do you have a food safety level 2 certification within the last year or are willing to complete an online course for certification ?&lt;/li&gt;\n&lt;li&gt;Can you commit to a 7 week ongoing rota(subject to reviews) – 5 days a week, including most weekends ?&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;If so, would you like to be part of a Trust that value, recognise and celebrate staff members and are a person passionate about health care and want to make a difference?&lt;/p&gt;\n&lt;p&gt;Nottingham University Hospitals NHS Trust,are now one of the biggest and busiest NHS Trusts in the country and provide services to over 2.5 million residents of Nottingham, its surrounding communities, and a further 3-4 million people from across the region that need to use the specialist services we provide.&lt;/p&gt;\n&lt;p&gt;NHS Professionals run the temporary work placements at Nottingham University Hospitals NHS Trust, and we are looking for a Food Service Assistant to start ASAP !&lt;/p&gt;\n&lt;p&gt;We value your skills and experience and can provide you with a fantastic opportunity to work within the NHS and deliver a great experience for patients.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;General responsibilities &lt;/strong&gt;include the following. List not exhaustive.&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Store food in accordance with manufactured guidelines and food safety legislation.&lt;/li&gt;\n&lt;li&gt;Offer patients a choice of hot &amp; cold beverages, as and when required a minimum of 7 times a day.&lt;/li&gt;\n&lt;li&gt;Ensure a regular supply of fresh water is provided to each patient throughout the day.&lt;/li&gt;\n&lt;li&gt;Serve the patients their choice and portion size of main dish, vegetables, and accompaniments in an appealing and appetising way. Offer second portions if required.&lt;/li&gt;\n&lt;li&gt;Ensure patients with special dietary requirements receive the appropriate food following liaison with the dietician or nurse.&lt;/li&gt;\n&lt;li&gt;Identify appropriate meal choices to meet patient’s needs/preferences.&lt;/li&gt;\n&lt;li&gt;Movement of food to wards/RDU as required adhering to food safety legislation.&lt;/li&gt;\n&lt;li&gt;Maintain adequate stock levels to meet the needs of the patient e.g. milk, bread, tea, coffee, cereal, and preserves.&lt;/li&gt;\n&lt;li&gt;Order food using the hospital’s electronic ordering devices.&lt;/li&gt;\n&lt;li&gt;Identify shortages of crockery and cutlery to supervisors.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;In return for your hard work commitment NHS Professionals (NHSP) can offer you some fantastic benefits: –&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Competitive Pay Rates - work this week, get paid next week!&lt;/li&gt;\n&lt;li&gt;First choice of placements at over 50 NHS Trusts in England&lt;/li&gt;\n&lt;li&gt;Dedicated consultants&lt;/li&gt;\n&lt;li&gt;Flexible working options&lt;/li&gt;\n&lt;li&gt;Free DBS and free training&lt;/li&gt;\n&lt;li&gt;Build holiday allowance&lt;/li&gt;\n&lt;li&gt;Support when you need it – 24/7 365 days&lt;/li&gt;\n&lt;li&gt;Stakeholder pension scheme&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Who are NHS Professionals?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Working through the NHSP bank means Trusts do not have to rely on expensive agencies. Right now, we have over 126,000 members registered on our bank from various roles, grades, and specialities, saving the NHS over £70 million each year. This money is then reinvested back into the NHS. We look forward to hearing from you soon&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Disclaimer&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;NHS Professionals (NHSP), owned by the Department of Health and Social Care (DHSC), works in partnership with hospital trusts to provide a bank of highly skilled temporary workers who want to work flexibly within the NHS.&lt;/p&gt;\n&lt;p&gt;Please note, you will be contacted by email throughout the recruitment process, so please check your emails, including your junk/spam regularly. We regret we cannot contact everyone who is not selected for an interview, therefore if you do not hear from us within 21 days after submitting your application, please assume you have not been successful on this occasion.&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "NHS Professionals - Non-Clinical", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121070"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Nottingham", "postalCode": "NG7 2UH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9435", "longitude": "-1.1858"}}, "title": "Food Service Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247847", "validThrough": "2020-11-12T23:59:59+0000"}