{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "10086", "minValue": "10086", "unitText": "YEAR", "value": "Band 5/6 depending on Experience"}}, "datePosted": "2020-11-02T12:19:15+0000", "description": "&lt;p&gt;&lt;strong&gt;Scrub Nurse | Theatres | Orthopaedic | Band 5/6 depending on Experience| Yale – North Wales | Fantastic career development opportunities&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Spire Yale in Wrexham, North Wales are now recruiting a Scrub Theatre Practitioner to join their warm and supportive team. There are excellent career development opportunities are available with this role&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;** You may be eligible to receive a relocation bonus of up to £1500 for this role **&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Spire Yale Hospital is one of North Wales’ leading private hospitals and we take pride in delivering high-quality care. We offer fast access to consultations with specialists in a wide range of treatments, supported by advanced imaging and diagnostic technology.&lt;/p&gt;\n&lt;p&gt;Spire Yale Hospital is located in Wrexham and has additional consulting rooms on the North Wales coast at Abergele. Wrexham is only 12 miles from Chester and 30-50 minutes from Liverpool and Manchester. There are direct train links to London with a journey time of just over 2 hours. The Snowdonia National Park and the North Wales Coast are on our doorstep! We take pride in delivering high-quality care to patients across North Wales and the Borders&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Duties and responsibilities:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To provide exemplary planned care for patients within the perioperative department and to assist in the management and organisation of care provision within the Scrub Team in the operating department across a range of clinical specialities.&lt;/li&gt;\n&lt;li&gt;Discuss, agree and explain the responsibilities for the assessment of patients including their needs and any associated risks.&lt;/li&gt;\n&lt;li&gt;Explain the role responsibilities, accountability and scope of practice for the assessment of a group of patients requiring perioperative care.&lt;/li&gt;\n&lt;li&gt;Plan, delivery and evaluate care to meet patient’s health and wellbeing&lt;strong&gt;.&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Who we&#39;re looking for:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Operating Department Practitioner or Registered Nurse with a valid registration&lt;/li&gt;\n&lt;li&gt;Experience of applying clinical reasoning skills to a range of complex and varied patient case mixes&lt;/li&gt;\n&lt;li&gt;Competence across a range of scrub skills, supported by professional and clinical knowledge acquired through state registration/practitioner qualification and additional training.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Benefits:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;We offer employees a competitive salary as well as a comprehensive benefits package which includes but is not limited to:&lt;/li&gt;\n&lt;li&gt;35 days annual leave inclusive of bank holidays&lt;/li&gt;\n&lt;li&gt;Employer and employee contributory pension with flexible retirement options&lt;/li&gt;\n&lt;li&gt;‘Spire for you’ reward platform - discount and cashback for over 1000 retailers&lt;/li&gt;\n&lt;li&gt;Free Bupa wellness screening&lt;/li&gt;\n&lt;li&gt;Private medical insurance&lt;/li&gt;\n&lt;li&gt;Life assurance&lt;/li&gt;\n&lt;li&gt;Save an average of £50 per month with our free onsite car park&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Please see the attached benefits leaflet for more information.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We commit to our employees well-being through work life balance, on-going development, support and reward.&lt;/p&gt;\n&lt;p&gt;Spire Healthcare is a leading independent hospital group that has been putting patients at the heart of everything we do for over 40 years. We have 39 hospitals and 8 clinics across England, Wales and Scotland.&lt;/p&gt;\n&lt;p&gt;For further information about this role or for an informal conversation about the range of career options available with Spire please contact Sarah Whittaker at Sarah.whittaker@spirehealthcare.com&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;For us, it&#39;s more than just treating patients; it&#39;s about looking after people.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Closing date: In order to streamline our recruitment process, we reserve the right to expire vacancies prior to the advertised closing date once we have received a sufficient number of applications&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Spire Healthcare Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132894"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wrexham", "postalCode": "LL13 7YP"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.049", "longitude": "-3.01411"}}, "title": "Theatre Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252021", "validThrough": "2020-12-02T23:59:59+0000"}