{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "40000", "minValue": "38000", "unitText": "YEAR", "value": "£38,000 - £40,000 per annum"}}, "datePosted": "2020-11-05T11:19:03+0000", "description": "&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About The Role&lt;/strong&gt;  Your role as a Physician Associate will require you to participate in all aspects of patient care through knowledge gained from your PA training and experience in managing patients from cradle to grave.  &lt;/p&gt;\n&lt;p&gt;You will be responsible for the provision of care proportionate to the needs of the patient, acting within your scope of practice. This will include clinical assessment and care management, receiving patients as they present with undifferentiated and undiagnosed problems, offering advice, treatment or referral as appropriate.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will be able to demonstrate critical thinking in the clinical decision-making process, including assessment and diagnostic skills, leading to the delivery of safe care for all patients.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will be working as part of an allied healthcare professional team and will be supported and supervised by a dedicated, named GP.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;As a physician associate, you will:-&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Work as part of an extended MDT under the supervision of a named buddy GP&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Deliver Clinical Triage by telephone and carry out video consultations via AccuRx&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Have direct contact with Patients as appropriate, taking medical histories, carrying out physical examinations, updating records&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Make diagnoses, analyse test results and deliver treatment&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Work to a professional code of ethics&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Provide varied support and show flexibility in your role&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Show a caring attitude towards patients&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Have well-developed communication skills to provide treatment plans.&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;  &lt;strong&gt;About The Candidate&lt;/strong&gt; &lt;strong&gt; &lt;/strong&gt;Our current vacancies suit both newly qualified and primary care experienced Physician Associates keen to work in an exciting, rewarding and demanding Network   You will have the following skills and qualifications:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A Postgraduate Degree in Physician Associate Studies from an accredited PA Programme;&lt;/li&gt;\n&lt;li&gt;Membership of the Faculty of Physician Associates at the RCP, which includes UK Physician Associate Registration (the PA Managed Voluntary Register);&lt;/li&gt;\n&lt;li&gt;Current and valid certification or re-certification by the UK Physician Associate National Examination;&lt;/li&gt;\n&lt;li&gt;Experience of working in a medicine environment, including preventative medicine and chronic disease management;&lt;/li&gt;\n&lt;li&gt;Flexible and adaptable approach to a varied and high volume workload with the ability to multi-task and to work under pressure;&lt;/li&gt;\n&lt;li&gt;Consistently compassionate and respectful approach placing a high value on the dignity of patients, relatives, carers and colleagues.&lt;/li&gt;\n&lt;li&gt;Ability to communicate effectively with colleagues, patients, relatives, nurses, other staff and agencies;&lt;/li&gt;\n&lt;li&gt;Commitment to continuing professional development.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;About Us:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is an exciting time to join an innovative and forward thinking &lt;strong&gt;Primary Care Network in Grays &lt;/strong&gt;with a strong reputation for Quality Improvement and investing in people. Our PCN spans 10 member Practices embracing a patient list of almost 73,000 patients and is widening our scope of Practice and skill mix to enable improved access to high quality healthcare.&lt;/p&gt;\n&lt;p&gt;We are committed to improving the care provided to patients, reducing health inequalities and raising the quality and standards of GP practice. We are looking for a dedicated Clinical Care Coordinator to work with the Network Member Practices in order to deliver integrated care based around the needs of our local population.&lt;/p&gt;\n&lt;p&gt;As PCN Care Coordinator you will work as a key part of the primary care network (PCN) multi-disciplinary team. You will ensure care is seamless and that everyone involved is working together. You will provide the capacity and expertise to support patients in preparing for or in following-up clinical conversations they have with PCN primary care professionals.&lt;/p&gt;\n&lt;p&gt;You will work closely with the Clinical Directors, local GPs and other primary care professionals within the PCN to identify and manage a caseload of identified patients, making sure that appropriate support is made available to them and their carers, and ensuring that their changing needs are addressed.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;OTHER KEY BENEFITS &amp; REMUNERATION&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Indemnity paid in addition to salary&lt;/li&gt;\n&lt;li&gt;NHS Pension Scheme&lt;/li&gt;\n&lt;li&gt;6.5 Weeks Leave Inc. Bank Holidays (Pro Rata)&lt;/li&gt;\n&lt;li&gt;Study Leave and Protected Learning Time&lt;/li&gt;\n&lt;li&gt;PA Educational Sessions&lt;/li&gt;\n&lt;li&gt;Clinical Supervision and GP Buddy&lt;/li&gt;\n&lt;li&gt;Peer Support and Mentorship&lt;/li&gt;\n&lt;li&gt;Regular Clinical and PCN Meetings&lt;/li&gt;\n&lt;li&gt;Ongoing Training, Education and Development&lt;/li&gt;\n&lt;li&gt;PCN Opportunities and Progression&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;This role is also being advertised on the Essex Primary Care Careers website – please complete only one application.&lt;/p&gt;\n&lt;p&gt;We have the right to close the advert earlier if we reach the maximum number of applications.&lt;/p&gt;\n&lt;p&gt;NO AGENCIES PLEASE&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/135914.JPG", "name": "Essex Primary Care", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=135914"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Grays", "postalCode": "RM17 5JY"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4807", "longitude": ".327949"}}, "title": "Physician Associate - Grays PCN", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257427", "validThrough": "2020-11-20T23:59:59+0000"}