{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum pro rata"}}, "datePosted": "2020-10-23T14:32:38+0100", "description": "&lt;h2&gt;The role&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;&lt;em&gt;Are you someone looking for a career in one of the UK’s most respected mental health and learning disability trusts?&lt;/em&gt;&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;&lt;em&gt;Would you like to be part of a dedicated team committed to helping those with mental health &amp; learning disability problems enjoy a better future?&lt;/em&gt;&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;&lt;em&gt;Would you like to do a job that makes a difference every day?&lt;/em&gt;&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt; We are seeking highly motivated, enthusiastic, dynamic, forward thinking and experienced individuals to join the Learning Disability Service as Clinical Team Managers at Devon Partnership NHS Trust.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for candidates from professional health backgrounds, who have a strong focus and a desire for success with experience of working within Learning Disability Services and keen to make the difference in all that they do. This vacancy have arisen due to an internal promotion.&lt;/p&gt;\n&lt;p&gt;The Learning Disability service in Devon provides both community and inpatient specialist services.&lt;/p&gt;\n&lt;p&gt;Devon Partnership NHS Trust is growing as we establish ourselves us as one of the leading providers of mental health services in the country.&lt;/p&gt;\n&lt;p&gt;Working as part of Devon Partnership NHS Trust, you will make a difference to people’s lives from the moment you start.&lt;/p&gt;\n&lt;p&gt;£38,890 - £44,503 per annum pro rata (Band 7)&lt;/p&gt;\n&lt;h2&gt;About you&lt;/h2&gt;\n&lt;p&gt;The post holder is required to provide effective leadership and management to the Intensive Assessment and Treatment Teams (IATT) who support adults with learning disabilities and complex mental health, physical health and behavioural needs in the community.&lt;/p&gt;\n&lt;p&gt;The post holder will promote evidence based practice; implement quality and safety standards; ensure compliance with commissioning standards; and support the ongoing development of clinical pathways across the IATTs. Will also provide active visible local leadership, sound clinical advice and support to multidisciplinary teams of professionals.&lt;/p&gt;\n&lt;p&gt;You should have the skills to provide strong local clinical leadership, develop and motivate others, have a proactive and positive mind-set and be able to confidently prioritise workload, while demonstrating excellent interpersonal and communication skills.&lt;/p&gt;\n&lt;p&gt;In addition, you will have strong problem solving and organisational skills; and work effectively as part of the Multidisciplinary Learning Disability Intensive Assessment and Treatment Team in your geographic area, as well as working together as a network of Intensive Assessment and Treatment Team Managers.&lt;/p&gt;\n&lt;p&gt;We encourage and welcome telephone enquiries about the post and are happy to arrange further discussions ahead of interviews.&lt;/p&gt;\n&lt;h2&gt;The location&lt;/h2&gt;\n&lt;p&gt;Your base will be North / Mid Devon, however under the current COVID-19 conditions this may be subject to alternative arrangements / change for example home working. Please be assured that any alternatives will be discussed fully with you and the organisation. Please ask the appointing manager if you have any questions.&lt;/p&gt;\n&lt;h2&gt;About us&lt;/h2&gt;\n&lt;p&gt;Devon Partnership NHS Trust is looking to become a recognised centre of excellence and expertise, the successful applicant should hold the Trust’s values and have the competencies and confidence to inspire and involve staff to help reach this target over the next five years.&lt;/p&gt;\n&lt;p&gt;Join us at Devon Partnership NHS Trust and you’ll be joining an award-winning organisation that is passionate about mental health and learning disability. One that cares about the people it supports – and one that also cares about its staff.&lt;/p&gt;\n&lt;p&gt;You’ll be part of a team that is compassionate and supportive, and genuinely committed to working together with the people who use our services, their families and carers in everything that we say and do.&lt;/p&gt;\n&lt;h2&gt;Our offer to you&lt;/h2&gt;\n&lt;p&gt;We recognise our people want to learn and develop, becoming the best that they can be. We offer all our staff a range of training opportunities including a variety of in-house training programmes designed and delivered by experts, and opportunities to access external training where appropriate.&lt;/p&gt;\n&lt;p&gt;In addition to ongoing training and development opportunities, we are committed to providing an environment in which you can thrive. &lt;br /&gt; &lt;br /&gt; Benefits of working at Devon Partnership NHS Trust include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Commitment to flexible working where this is possible&lt;/li&gt;\n&lt;li&gt;27 days of annual leave per year plus bank holidays, increasing to 29 days after 5 years and 33 days after 10 years’ service withtheNHS so you can really enjoy what Devon has to offer&lt;/li&gt;\n&lt;li&gt;Individual personal development plans and a commitment to ongoing training&lt;/li&gt;\n&lt;li&gt;Generous NHS pension scheme&lt;/li&gt;\n&lt;li&gt;Good maternity, paternity and adoption benefits&lt;/li&gt;\n&lt;li&gt;Childcare voucher scheme&lt;/li&gt;\n&lt;li&gt;Health service discounts and online benefits&lt;/li&gt;\n&lt;li&gt;Incremental pay progression&lt;/li&gt;\n&lt;li&gt;Free confidential employee assistance programme 24/7&lt;/li&gt;\n&lt;li&gt;Access to our LGBTI+ network&lt;/li&gt;\n&lt;li&gt;Health and wellbeing opportunities&lt;/li&gt;\n&lt;li&gt;Cycle to Work Scheme and reduced public transport rates&lt;/li&gt;\n&lt;li&gt;Structured learning and development opportunities.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;Living here&lt;/h2&gt;\n&lt;p&gt;Great place to work. Great place to live&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120813.png", "name": "Devon Partnership NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120813"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "North / Mid Devon", "postalCode": "EX16 6LB"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.9018", "longitude": "-3.48738"}}, "title": "Clinical Team Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240956", "validThrough": "2020-11-06T23:59:59+0000"}