{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "31401", "minValue": "31401", "unitText": "YEAR", "value": "£18.68"}}, "datePosted": "2020-10-14T10:29:48+0100", "description": "&lt;p&gt;Providing quality, inspiring innovation and delivering value is what we set out to achieve at Priory Healthcare. Enabling our patients with mental health difficultiesto receive a truly integrated and holistic approach to their treatment, regardless of complexity or severity, thanks to the knowledge and expertise of our multidisciplinary clinical teams.&lt;/p&gt;\n&lt;p&gt;Priory Healthcare is one of the UK’s leading providers of independent specialist secure and step-down care across the UK.&lt;/p&gt;\n&lt;p&gt;With hospitals around the country, 30 years of experience in our sector and highly skilled and experienced teams, we help patients and commissioners find the right care pathways without the need for multiple reassessments.&lt;/p&gt;\n&lt;p&gt;The Priory Enfield provides a full care pathway from medium secure, low secure to a locked rehabilitation wing. The full multidisciplinary team works with men who have a diagnosis of mental disorder and associated challenging behaviour.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Our Bank RMN role involves:&lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Providing a high standard of care to people with learning disability and personality disorder.&lt;/li&gt;\n&lt;li&gt;Developing therapeutic relationships to optimise patient engagement&lt;/li&gt;\n&lt;li&gt;Following all codes of conduct, standards and legislation, respecting the rights of others and promoting ethical practice&lt;/li&gt;\n&lt;li&gt;Contributing to patient assessments, compiling a plan of care alongside the individual, and monitoring patient progress.&lt;/li&gt;\n&lt;li&gt;To accept personal and shared responsibility for the maintenance of quality nursing care, for all patients as part of a multidisciplinary team approach within a forensic setting.&lt;/li&gt;\n&lt;li&gt;To work as a Primary Nurse/Care Coordinator for an identified group of patients whilst consistently working within the clinical governance framework.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;To be successful as a Bank RMN, you’ll need:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A relevant nursing qualification and registration&lt;/li&gt;\n&lt;li&gt;Excellent team working skills, a high level of self-motivation and a flexible approach - our units operate 24 hours 7 days a week, and our nursing staff work shift patterns including weekends, bank holidays and nights.&lt;/li&gt;\n&lt;li&gt;A commitment to patient-centred care and to values-based and evidence-based practice&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Benefits:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Free meals while on duty&lt;/li&gt;\n&lt;li&gt;Free car parking (at most sites)&lt;/li&gt;\n&lt;li&gt;Weekly Pay in arrears&lt;/li&gt;\n&lt;/ul&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "Priory Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=133434"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Edmonton, London", "postalCode": "N9 9DY"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6258", "longitude": "-.063435"}}, "title": "Bank Registered Mental Health Nurse (RMN)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916225708", "validThrough": "2020-11-13T23:59:59+0000"}