{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615"}}, "datePosted": "2020-11-06T13:46:22+0000", "description": "&lt;p&gt;&lt;strong&gt;Band 5 Nursing Staff - Acute Ward&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Are you looking for a new challenge and want to make a direct difference to patients, carers and staff every day? If you are, then this is an exciting time to join our services, which have a strong reputation for innovation and as such you will support us to shape our services.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Black Country Healthcare NHS Foundation Trust provides specialist mental health, learning disability, and community healthcare services for the population of the Black Country.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Across the whole of the region we provide:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Adult and older adult mental health services.&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Specialist learning disability services.&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Mental health services for children and young people.&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Community healthcare services for children, young people and families in Dudley.&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Our purpose is to provide integrated healthcare services that empower people to make the most of their lives.”&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We now have vacancies available for Band 5 Registered Mental Health Nurses and Learning Disability Nurses to join us in our ward teams across the Dudley Acute Inpatient location within the Trust. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We can offer talented and caring individuals an opportunity to join us with a preference to working on any one of our 3 different acute wards. These vacancies have arisen due to our Nurses progressing into band 6 roles, either within the Inpatient Service Line or Associated Services within our Trust. Therefore this presents an exciting opportunity for either a newly qualified or experienced nurse to join us in an acute setting, where you will be supported through our preceptorship or band 5 staff development programs.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;It’s a very exciting time for our trust as we have joined partnership with our sister trust in order to become one. The Back Country healthcare NHS foundation trust now covers the whole of the Black Country area enabling us to work in partnership to ensure the best possible services for those needing to access them.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;There is a lot of investment in our growth as an organization and part of this is ensuring we have one electronic system across all our services. The electronic package Rio is currently being built and over the coming months should be ready for the next phase of implementation into our services.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Currently assessed as “Good” by the Care Quality Commission (CQC) this is an exciting time to join our dynamic and caring Trust as we progress. The Trust has also recently received sustained positive feedback from its staff in relation to its staff survey results, and we value the importance of staff engagement in the development of our service.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The vacancy&#39;s are for the following wards: &lt;strong&gt;Wrekin, Clee and Clent&lt;/strong&gt;.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Wrekin&lt;/strong&gt; is a mixed sex ward. Our aim is to promote recovery and ensure our service users are successfully discharged from Hospital. Wrekin ward provides a safe inpatient environment and we work in partnership with our service users as well as other agencies to help and support people through their recovery journey i.e. housing, benefits, welfare, education, employment and social reintegration.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Clee&lt;/strong&gt; is an acute admission /assessment ward for females only. Clee benefits from being recently re-designed and re-developed to fit the complex needs of the service users.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Clent&lt;/strong&gt; is an acute admission /assessment ward for males only. Clent and has just been refurbished to a high standard in order to improve the experience for both staff and patients.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;All 3 of our acute inpatient wards provide a comprehensive range of services for our service users who often have complex and challenging needs. We aim to support service users with a wide range of mental health needs during the acute phase of their illness. Our teams are passionate about the quality of care we deliver and are looking for nursing staff that can help to continue to deliver the excellent care we provide.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We hold regular Reflective Practice Sessions, Complex Case Discussions, Practice Development Sessions and Team Meetings as well as 1:1 supervision. All this is provided consistently to support all staff teams to work together. We would offer you comprehensive access to training, development, career opportunities and support from our development programs. We offer access to a preceptorship program of mentoring along with development sessions to all staff requiring it. We will offer you continued mentorship to help with your long-term professional development. We see this as a core function of our service - Preparing the nurses of today for the challenges of tomorrow. We want to prepare you, and support you for the journey you will undertake to be the best nurse you can be and we will at all times ensure you receive the right training and support to do this.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameEmma BateAdditional contact information&lt;/p&gt;\n&lt;p&gt;For further information or to arrange a visit to see what we can offer you, please do not hesitate to contact&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Emma Bate – Clee Manager 01384 325086&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Nzwanai Huhuyana – Clent Manager 01384 324601&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Dion Wilkinson – Wrekin Manager 01384 325088&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120845.png", "name": "Black Country Healthcare NHS Foundation Trust (formerly known as Black Country Partnership Foundation Trust)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120845"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bushey Fields Hospital, Dudley", "postalCode": "DY1 2LZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5029", "longitude": "-2.11685"}}, "title": "Band 5 Staff Nurse - Acute Wards", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259980", "validThrough": "2020-12-04T23:59:59+0000"}