{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "31365", "unitText": "YEAR", "value": "31,365 to £44,503 pa"}}, "datePosted": "2020-10-28T14:15:26+0000", "description": "&lt;p&gt;This band 7 vacancy is a 5 month fixed term contract of 37.5 hours per week, however a band 6 will be considered dependent on experience.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Prosthetics Rehabilitation Service, based in Plymouth is seeking an enthusiastic HCPC registered Prosthetist, to join its clinical team and help meet the current demands of the service at this time.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We provide a comprehensive in-house prosthetics service for patients in Plymouth, South West Devon, Cornwall and the Isles of Scilly. The service is based in The Thornberry Centre, a purpose built facility, with full fabrication and support services, you will work in a truly multi-disciplinary environment. A Satelite clinic is held in Camborne Hospital on a weekly basis.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will have a caseload of new and existing patients with a large degree of autonomy supported by experienced medical and rehabilitation staff.&lt;/p&gt;\n&lt;p&gt;Full mandatory training will be provided and you will receive regular clinical/caseload and line management supervision. We actively encourage professional and personal development as we look to further expand the services offered.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Highly motivated, with excellent clinical skills, you must be able to demonstrate a high standard of interpersonal skills and outstanding professional &amp; personal standards.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will enjoy team-working and be eager to make your mark in our unique environment.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Our location in the beautiful Southwest of England offers many opportunities to enjoy the coast and moorland and contribute positively to your sense of wellbeing during these challenging times.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Livewell Southwest values its staff and makes investment in their development a priority. Currently we offer the following development opportunities for staff:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A minimum of three days protected CPD for registered staff&lt;/li&gt;\n&lt;li&gt;Development pathways for unregistered staff from apprentice to bands 2, 3 and 4 and for registered staff in bands 5, 6, 7 and 8&lt;/li&gt;\n&lt;li&gt;Leadership programmes&lt;/li&gt;\n&lt;li&gt;Coaching and mentoring&lt;/li&gt;\n&lt;li&gt;Medicines Management, leg Ulcer Management and Assessment Training&lt;/li&gt;\n&lt;li&gt;Access and funding for training including Care Certificate, Assistant Practitioners Course and Scholarship Into Nurse Training&lt;/li&gt;\n&lt;li&gt;Robust Preceptorship&lt;/li&gt;\n&lt;li&gt;An induction programme tailored to your needs&lt;/li&gt;\n&lt;li&gt;Relocation package may be considered for the right candidate for certain roles&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Rewards and benefits &lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Discounts available from retailers, UK hotels and main attractions – often up to 15% savings&lt;/li&gt;\n&lt;li&gt;NHS Pension Scheme and competitive Pension Scheme with Scottish Widows and/or Government Pension scheme (conditions apply)&lt;/li&gt;\n&lt;li&gt;Lease car scheme (available after satisfactory completion of probation/conditions apply)&lt;/li&gt;\n&lt;li&gt;Cycle to work scheme (available after satisfactory completion of probation)&lt;/li&gt;\n&lt;li&gt;Childcare vouchers&lt;/li&gt;\n&lt;li&gt;School holiday childcare subsidies&lt;/li&gt;\n&lt;li&gt;Multiple flexible working options&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Livewell Southwest can allow existing members of the NHS Pension Scheme to continue their membership when they join the organisation.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;All Livewell Southwest staff are expected to able and willing to work across a 7 day service.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Job share(s) considered.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/127014.jpg", "name": "Livewell Southwest CIC", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127014"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Plymouth", "postalCode": "PL6 5XW"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.4157", "longitude": "-4.11899"}}, "title": "Prosthetist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246921", "validThrough": "2020-11-09T23:59:59+0000"}