{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "46635", "minValue": "46635", "unitText": "YEAR", "value": "Up to £46,635 per annum"}}, "datePosted": "2020-10-28T11:08:59+0000", "description": "&lt;p&gt;&lt;strong&gt;Team Manager (Family Assessment and Safeguarding Team) &lt;/strong&gt;&lt;strong&gt;CSN001 CHPE&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Up to £46,635 per annum + £2k welcome payment (Scale L)&lt;/p&gt;\n&lt;p&gt;37 hours per week&lt;/p&gt;\n&lt;p&gt;Excellent relocation package&lt;/p&gt;\n&lt;p&gt;Permanent contract&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are recruiting a Team Manager to lead, inspire, motivate and support the Family Assessment and Safeguarding Team in North Norfolk &amp; Broadland to achieve the best possible outcomes for children, young people and their families.&lt;/p&gt;\n&lt;p&gt;We have established a highly ambitious and successful transformation and improvement programme and already have lots to be proud of; our new ‘front door’ model has been glowingly endorsed as ‘transformed’ by Ofsted, our new edge of care services are reducing the need for children to be looked after and we have secured a multi-million pound investment in our core social care service model.&lt;/p&gt;\n&lt;p&gt;Through Vital Signs, our vision for Children in Norfolk, we use Signs of Safety practice to work with whole family networks and across the whole system to support families to build on their strengths and to achieve the best possible outcomes.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;All our office-based roles are currently working from home as part of our Smarter Working plans and to support the health and safety of all our colleagues. We anticipate that working remotely will be a key feature of this role and when offices re-open your office base will be in Hunstanton. Our technology platform and equipment are first class, enabling you to connect and collaborate remotely. We ask that you have in place good Broadband connectivity.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;If you are a Team Manager or an experienced Social Worker ready to take the next step in your career call us today for an informal discussion - Sarah Adams (Head of Social Work, North Norfolk &amp; Broadland) on 01603 222418 or email sarah.adams5@norfolk.gov.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Norfolk County Council", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=129523"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hunstanton", "postalCode": "PE36 5EF"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9394", "longitude": ".492976"}}, "title": "Team Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246226", "validThrough": "2020-11-15T23:59:59+0000"}