{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 £31365-£37890"}}, "datePosted": "2020-11-03T11:16:21+0000", "description": "&lt;p&gt;&lt;span&gt;&lt;strong&gt;Internal Only&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are looking for an experienced renal nurse to lead a well-established and highly skilled team who are committed to delivering high standards of care. You will be passionate about renal nursing, enthusiastic and professional with the ability to have a clear vision for running the current service. You will need extensive HD experience and knowledge and the ability to think quickly on your feet is vital.&lt;/p&gt;\n&lt;p&gt;Duties will include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Staff management responsibilities: recruitment, induction, training, absence management and performance management&lt;/li&gt;\n&lt;li&gt;Delivering high quality dialysis&lt;/li&gt;\n&lt;li&gt;Monitoring nursing standards, ensuring compliance with the NMC Code&lt;/li&gt;\n&lt;li&gt;Liaison with other dialysis unit managers in the Oxford Kidney Unit&lt;/li&gt;\n&lt;li&gt;Conducting dialysis assurance and Health and Safety audits, identifying areas for improvement&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;br /&gt;You will need to be self-motivated and have the ability to motivate and move forward a team of nurses to optimise and enhance patient care. You should be able to demonstrate a clear understanding of health care delivery and a patient centered approach to care.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;To be successful, you will need to be a qualified RN with a valid NMC registration. You will also need the appropriate skills in communication, organisation, leadership, and some HR experience. You must have excellent customer care, communication and interpersonal skills and be flexible and able to adapt to and support change.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Main Dialysis Unit is part of the Oxford Kidney Unit Network. The unit is a 24 bedded Haemodialysis unit , outpatient department. We also dialyze in patients from different wards, Churchill and The John Radcliffe . Services provided include haemodialysis and, haemodialfiltration, home haemodialysis, peritoneal dialysis and a pre dialysis service. Clinics include nephrology, transplantation, anaemia and renal replacement therapies. &lt;br /&gt;&lt;br /&gt;All candidates should arrange an informal visit prior to interview.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing Date-17th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameMyleen AlmanzaJob titleUnit ManagerEmail addressmyleen.almanza@ouh.nhs.ukTelephone number01865225813&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Oxford University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120889"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Main Dialysis Unit, Oxford", "postalCode": "OX3 7LE"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7503", "longitude": "-1.21469"}}, "title": "Deputy Sister", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253671", "validThrough": "2020-11-17T23:59:59+0000"}