{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pa, pro rata for part time"}}, "datePosted": "2020-11-05T15:01:54+0000", "description": "&lt;p&gt;There is more to working in our community hospital than meets the eye! The nursing care we provide is at the forefront of modern clinical nursing and providing excellent healthcare closer to home.&lt;/p&gt;\n&lt;p&gt;Based in Swanage in Dorset we are a busy, friendly hospital offering a wide range of services including; day surgery, out-patient, minor injuries, as well as a 15 bedded ward. There are plenty of opportunities to retain or upskill your acute clinical experience, focused on acute admission avoidance we look after a range of patients with complex needs and discharge plans.&lt;br /&gt;&lt;br /&gt;With a supportive League of Friends, passionate about their local hospital, we have a generous training budget and an assigned bursary for staff training as we strive to be better every day.&lt;br /&gt;&lt;br /&gt;We have won national recognition for treating dying patients with dignity and compassion. The Stanley Purser Ward at Swanage has achieved accreditation in the Gold Standard Framework (GSF) for end-of-life care, confirming Dorset HealthCare as one of the country’s leading NHS trusts in this field of work.&lt;br /&gt;&lt;br /&gt;We are also working towards a number of other accolades and accreditations including:&lt;br /&gt;&lt;br /&gt;• Gold Standard Framework Accreditation – end of life care&lt;br /&gt;• Quality Mark – care of the elderly&lt;br /&gt;• Patient and Family Centered Care project – end of life care&lt;br /&gt;&lt;br /&gt;This year Swanage Hospital had the biggest representation at the annual Community Hospital Association Conference, where there were plenty of developmental and learning opportunities to network with our peers in other community hospitals.&lt;/p&gt;\n&lt;p&gt;In addition to the following benefits we are also able to offer flexible shift patterns; for example working longer days/a shorter week:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Dedicated career pathways and great opportunities for continuing professional development&lt;/li&gt;\n&lt;li&gt;An excellent preceptorship programme for newly qualified nurses and the chance to further your career in a nurse led environment&lt;/li&gt;\n&lt;li&gt;You will receive a comprehensive and structured induction programme and training&lt;/li&gt;\n&lt;li&gt;Monthly pay plus enhancements for night, weekend and bank holiday working&lt;/li&gt;\n&lt;li&gt;NHS Pension scheme&lt;/li&gt;\n&lt;li&gt;Health &amp; Wellbeing service&lt;/li&gt;\n&lt;li&gt;Holiday pay of up to 33 days, plus bank holidays pro rata, dependent on service&lt;/li&gt;\n&lt;li&gt;NHS discounts&lt;/li&gt;\n&lt;li&gt;Salary sacrifice scheme including work related learning, childcare vouchers, cars, cycles, home technology equipment and buying and selling of annual leave&lt;/li&gt;\n&lt;li&gt;Not forgetting our unique selling point – our Trust beach huts located along the famous Sandbanks coastline&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Employment in this post requires an Enhanced Disclosure and Barring Service (DBS) check. The DBS levies a charge of £40 and the Trust will recover this cost in instalments from your first 3 salary payments.&lt;/p&gt;\n&lt;p&gt;This will only apply to candidates who are new to the Trust and not internal staff.&lt;/p&gt;\n&lt;p&gt;Applicants who subscribe to the DBS update service and are able to present a valid DBS certificate will not incur a charge.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;If you are interested in moving to Dorset we also offer a generous relocation package of up to £5,000. For further details on relocation expenses please email &lt;/em&gt;dhc.careers@nhs.net&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Recommend a friend or family member and earn cash!&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Do you have a friend or family member you would recommend to join us? Or do you know someone who wants to return to practice in the NHS? If the person you refer is appointed by the Trust and completes their probationary period you will receive £250 reward payment for the introduction! Please contact the recruitment team if you require further info!&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Please see further details in our video. Details are attached!&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Natasha Norman, Senior Sister, Telephone number: 01929 475013&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121022.png", "name": "Dorset HealthCare University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121022"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Swanage", "postalCode": "BH19 2ES"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.6055", "longitude": "-1.96121"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258246", "validThrough": "2020-11-19T23:59:59+0000"}