{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "27988", "minValue": "25736", "unitText": "YEAR", "value": "£15.31 - £16.65 Per Hour"}}, "datePosted": "2020-10-22T14:17:05+0100", "description": "&lt;p&gt;Nurse (Day Shifts), Capel Grange Nursing Home, Newport&lt;/p&gt;\n&lt;p&gt;39.38 hours per week&lt;/p&gt;\n&lt;p&gt;Up to £34,219.00 per annum&lt;/p&gt;\n&lt;p&gt;Looking for a Nurse position where you can make a real difference every day?&lt;/p&gt;\n&lt;p&gt;Linc Cymru are offering the opportunity to join our team as a Registered Nurse at Capel Grange Nursing Home, Newport. The role is working day shifts on a two week rolling rota. You will work 3 shifts one week, 4 shifts the next week and have every other weekend off - great for planning ahead and provides excellent work/ life balance!&lt;/p&gt;\n&lt;p&gt;Working alongside a well trained staff team of Care Assistants, our nurses lead by example on a daily basis to support approximately 15 elders by day within an assigned &#39;community&#39;. Our elders have a range of complex care needs allowing you to enhance your experience of working in Nursing and EMI care.&lt;/p&gt;\n&lt;p&gt;Taking responsibility and acting as &#39;named nurse&#39; gives our nurses the opportunity to build effective professional relationships, and ensure that the care we deliver always meets the changing circumstances and personal wishes of each individual.&lt;/p&gt;\n&lt;p&gt;Linc offer a flexible benefit system for our Nurses where you can pick from two benefit packages to suit your needs. Would you prefer an enhanced hourly rate or enhanced annual leave? You decide! The rate of pay varies from £15.31 to £16.65 per hour, depending on the benefit package chosen by the successful candidate.&lt;/p&gt;\n&lt;p&gt;We recognise the importance of Continuous Professional Development; you will be provided with significant opportunities to enhance your specialist clinical and management skills and be provided with full support with PIN revalidation.&lt;/p&gt;\n&lt;p&gt;So what are you waiting for?&lt;/p&gt;\n&lt;p&gt;Come and take the first steps towards your career with an organisation that is passionate about people, homes and their communities!&lt;/p&gt;\n&lt;p&gt;We look forward to hearing from you!&lt;/p&gt;\n&lt;p&gt;If you would like an informal chat about nursing with Linc or would like to arrange an informal look around our Nursing homes, please give the recruitment team a call on 02920 474 705. We look forward to hearing from you.&lt;/p&gt;\n&lt;p&gt;This advert will close at 23:45 on 5th November. Please note that we reserve the right to close this advert before this date when we are in receipt of sufficient applications.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Linc Care", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=131035"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Newport", "postalCode": "CF23 5YG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5015", "longitude": "-3.16073"}}, "title": "Nurse - Days", "url": "https://www.jobs.nhs.uk/xi/vacancy/916238856", "validThrough": "2020-11-21T23:59:59+0000"}