{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £37, 890"}}, "datePosted": "2020-10-26T16:18:08+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;span&gt;Speech and Language Therapy Band 5-6 Development Post &lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Adult Community Services&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Permanent &lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Full Time 37.5 hours per week &lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for 3 full time Band 5 Speech and Language Therapists with experience and interest in community adult services.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We require enthusiastic Speech and Language Therapists to manage a caseload for a range of clients with acquired disorders within community settings. This post will provide an excellent opportunity to develop and consolidate skills and knowledge across a broad range of client groups with acquired disorders of speech, language and dysphagia.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The post-holders will operate as part of the Speech and Language Therapy Adult team working for Midlands Partnership NHS Foundation Trust based at Bentilee Neighbourhood Centre, Stoke on Trent, supported by an excellent team of clerical and assistant staff. The scope and range of the work is varied and interesting, enabling therapists to work independently whilst being well supported within the wider Speech and Language Therapy team. The post holders will have the opportunity to contribute to clinical placements for students.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Post graduate dysphagia training and support to achieve competencies will be provided and a named mentor for support during the next 12 – 18 months of development with a realistic development plan towards Band 6 competencies including those based on the RCSLT Dysphagia Competency framework.&lt;/p&gt;\n&lt;p&gt;Employment as a Band 6 clinician will be offered:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;On successful completion of RCSLT accredited Post graduate Dysphagia Training&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;On completion of your RCSLT dysphagia competency framework at Level B, Foundation Dysphagia Practitioner&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;When jointly agreed with the Operational Lead of Speech and Language Therapy.&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Midlands Partnership NHS Foundation Trust (MPFT) has a strong commitment to supporting the CPD of our AHP workforce led by a Director of AHP. The Trust has excellent pastoral and professional support and supervision network and are able to offer:&lt;/p&gt;\n&lt;p&gt;• Regular Clinical Support and Supervision Groups and team meetings&lt;/p&gt;\n&lt;p&gt;• Professional development via our appraisal system&lt;/p&gt;\n&lt;p&gt;• In-service training and library facilities c/o Keele University Medical School&lt;/p&gt;\n&lt;p&gt;• A friendly working environment and flexible working arrangements.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Please see the attached documents for both Band 5 and Band 6 job descriptions and person specifications. Please ensure your application reflects your suitability for the band 5 post and your commitment to develop into a Band 6 post.&lt;/p&gt;\n&lt;p&gt;Staffordshire and Stoke-on-Trent is a vibrant area undergoing major re-development with an expanding city centre and housing market. It offers excellent transport links to scenic countryside and neighbouring cities, places of historic interest, a lively cultural scene. The Trust is a Keele University Teaching Trust and links with local universities.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal enquiries please contact:&lt;/p&gt;\n&lt;p&gt;Victoria Titley, Operational Lead for Speech and Language Therapy, on 01782 234481 or alternatively email: Victorial.titley@mpft.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;PLEASE NOTE:&lt;/p&gt;\n&lt;p&gt;All references from any previous employers will be sought. Therefore, when completing the reference section of your application form, please give the address, telephone number and work email address of each of your referees. Failure to complete this section may result in your application not being processed.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Midlands Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121040"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "North Staffordshire and Stoke and Trent", "postalCode": "ST16 3SR"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.8106", "longitude": "-2.10908"}}, "title": "Speech and Language Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243377", "validThrough": "2020-11-16T23:59:59+0000"}