{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "32000", "minValue": "30500", "unitText": "YEAR", "value": "£30,500 - £32,000 per annum (Pro Rata)"}}, "datePosted": "2020-10-16T16:58:51+0100", "description": "&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;About our service&lt;/span&gt; Mountain Healthcare is a leading provider of clinical based services who have a genuine concern for our clients, a sincere appreciation for our employees, and we want to do good things for other people. Mountain is built on core principals and commitments including quality, integrity, respect, kindness, courage, innovation and enjoyment. These values drive the understanding we care for our customers with and have helped us grow into the passionate company we are today. We are currently seeking Advanced Nurse Practitioner for a Secure Children’s Centre. This modern, safe and secure bedded unit caters for boys and girls aged between 10 and 17. It is inspected by Ofsted and approved and licensed by the Department for Children, Schools and Families. The centre comes under Sheffield City Council Children and Young People’s Directorate and has been rated Outstanding / Good in Ofsted inspections with the Youth Justice Board consistently rating as performing at the highest level. The purpose of the centre is to serve both local and national communities by looking after those children and young people who need a safe and controlled yet child centred secure residential environment in order to prevent harm to themselves or to others.&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Position Summary&lt;/span&gt; The secure centreis a dynamic environment, and you will be involved in continuing the delivery of a developmentally and trauma informed mental-health service model. This is based on the Secure Stairs framework across Young Peoples Secure Services and will including contact with the Secure Stairs National Clinical Implementation Team and NHS England Commissioners of services, to help ensure service delivery and fidelity to the model of care.To provide qualified speech and language therapy input for young people within the centre. To provide assessment and intervention as well as consultation and advice in relation to speech, language, and communication needs.The post holder will have knowledge and experience of working with a range of communication disorders and will be able to apply this knowledge within a secure setting working with young people with a variety of needs including mental health, learning disability, and autistic spectrum condition. The post will involve liaison and joint working with other clinical, educational, and wider professionals and other external agencies when appropriate.&lt;/p&gt;\n&lt;p&gt;Working Pattern: Part time position, Flexible 8 hours per week which can be made up of two 4 hour shifts or a single 8 hour shift.&lt;/p&gt;\n&lt;p&gt;Candidates must be available to start the position on 1st February 2021.&lt;/p&gt;\n&lt;p&gt;Education:&lt;/p&gt;\n&lt;p&gt;Recognised Royal College of Speech and language Therapists degree level qualification and be licenced to practise – evidenced by HPC registration.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;All successful candidates will be subject to pre-employment checks including; an Enhanced DBS check and 2 satisfactory references.&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Mountain Healthcare Ltd", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=134894"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Sheffield", "postalCode": "S17 3ES"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3344", "longitude": "-1.53764"}}, "title": "Speech &amp; Language Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916231194", "validThrough": "2020-11-15T23:59:59+0000"}