{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30112", "minValue": "24214", "unitText": "YEAR", "value": "£24,214 - £30,112"}}, "datePosted": "2020-11-06T11:16:09+0000", "description": "&lt;p&gt;&lt;span&gt;We&#39;re not currently recruiting overseas nurses - must have NMC Registration.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Come and join a Trust rated Outstanding by the CQC. South Warwickshire NHS Foundation have been rated as outstanding following our latest inspection by the CQC and we are recruiting new staff to come and help us improve even further.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;South Warwickshire NHS Foundation Trust (SWFT) is currently recruiting for the Orthopaedic unit. It is an innovative department that is focused on multidisciplinary team working who strive to provide a high quality service. The department has been recognized nationally as one of the top performing Centre’s.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are looking to recruit both experienced and newly qualified nurses who are dynamic, motivated caring and enthusiastic to join the well-established and friendly Orthopaedic team. The successful applicants will be able to demonstrate an ability to provide high quality, safe nursing care which is driven by patient experience and evidence-based best practice. They will need to have the ability to think quickly, promote effective utilisation of the beds on the unit and facilitate safe and timely discharge for patients.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;This is an excellent opportunity to gain knowledge and experience within all areas of the Orthopaedic specialty and further develop surgical clinical skills in addition to developing and expanding leadership and management skills.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The successful applicants will be supported by the Trust, the Ward Manager and ward team with a mentor/preceptor . In addition to these the trust practice based educator team through the Trust Preceptorship Programme and Band 5 Development Programme.&lt;/p&gt;\n&lt;p&gt;If you like an further information or would like to arrange an informal visit please contact Sarah Kirwan, Greville Ward 01926 495321 ext 6067 sarah.kirwan@swft.nhs.uk or Maria Richmond, Thomas Ward on 01926 495321 ext 6061.&lt;/p&gt;\n&lt;p&gt;Alternatively, please contact Claire Hawkins (Senior HR Advisor - Resourcing) on 01926 495321 ext 8437 or email Claire.hawkins@swft.nhs.uk&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;NURSE RECRUITMENT ASSESSMENT CENTRES&lt;/strong&gt;&lt;br /&gt;&lt;br /&gt;To help us achieve our vision of providing the best possible healthcare, South Warwickshire NHS Foundation Trust run Assessment Centres to select its future employees. These vary depending on the vacancy but their core purpose is to create an environment in which you, along with other candidates are able to demonstrate key workplace skills.&lt;/p&gt;\n&lt;p&gt;The Assessment Centre will be an opportunity for you get a feel for the culture, leadership, and learning opportunities within South Warwickshire NHS Foundation Trust. Assessment is based on a numeracy test, an interview and a group exercise which will be undertaken against the core values and behaviours that our employees pride themselves with.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We think South Warwickshire NHS Foundation Trust is a great place to work. We hope you will too.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameClaire HawkinsJob titleSenior HR AdvisorEmail addressclaire.hawkins@swft.nhs.ukTelephone number07887628247Additional contact information&lt;/p&gt;\n&lt;p&gt;Contact Claire Hawkins (Resourcing Advisor) on 01926 495321 ext 8437.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "South Warwickshire NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120990"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "South Warwickshire NHS Foundation Trust, Warwick", "postalCode": "CV34 5BW"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.29", "longitude": "-1.5832"}}, "title": "Nurse - Orthopaedic Wards", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259380", "validThrough": "2020-11-22T23:59:59+0000"}