{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890-£44,503"}}, "datePosted": "2020-11-02T08:17:06+0000", "description": "&lt;p&gt;We are looking for an enthusiastic, caring and committed Podiatrist to join the Brighton and Hove Podiatry team in the role of Podiatry Team Lead.&lt;/p&gt;\n&lt;p&gt;Applicants should have a keen interest in advancing their professional and leadership skills and have a commitment to staff and service development, including providing regular clinical supervision and in-service training. They should be able to demonstrate a strong team work ethic and contribution to positive team culture through excellent communication, support and relationship skills.&lt;/p&gt;\n&lt;p&gt;The successful applicant will be extremely organised and have the ability to work independently under their own initiative whilst recognising the importance and value of working within the wider specialist team. They must be caring, and committed to improving patient care and developing high quality services, focusing on improving patient outcomes. They should be able to lead the team to its full potential and have a keen interest in quality improvement as they will be responsible for development of service innovations involving collaboration of the wider healthcare community.&lt;/p&gt;\n&lt;p&gt;The post holder will also develop and lead a podiatric rotational programme to ensure Trust assurance of resilience within podiatry services and clinical competence of staff.&lt;/p&gt;\n&lt;p&gt;Applicants must be HCPC registered and be able to demonstrate up to date knowledge of working with podiatric patients, as well as having a broad range of experience working within the NHS.&lt;/p&gt;\n&lt;p&gt;It is essential that applicants hold a full UK driving licence and have a car available for work, as the Podiatry Team Lead will be required to travel between SCFT community sites.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Claire Parnaby&lt;/p&gt;\n&lt;p&gt;Clinical Service Manager&lt;/p&gt;\n&lt;p&gt;claire.parnaby@nhs.net&lt;/p&gt;\n&lt;p&gt;07917 246651&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Dave Atkins, Professional Lead for Podiatry&lt;/p&gt;\n&lt;p&gt;d.atkins@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Sussex Community NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120877"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Brighton General Hospital, Brighton", "postalCode": "BN2 3EW"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8309", "longitude": "-.114138"}}, "title": "Podiatry Team Lead", "url": "https://www.jobs.nhs.uk/xi/vacancy/916251325", "validThrough": "2020-11-12T23:59:59+0000"}