{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "36738", "minValue": "29888", "unitText": "YEAR", "value": "£29,888 - £36,738 per annum inclusive"}}, "datePosted": "2020-10-19T10:01:26+0100", "description": "&lt;p&gt;Everyone needs a heart.&lt;/p&gt;\n&lt;p&gt;When a child has a problem with their heart, they and their family are coping with a complex mix of physical, mental, emotional, and spiritual challenges. This year has brought a great increase in paediatric transplants, for a number of reasons. The challenges brought by every stage of these procedures are complex and this is where you come in. As a senior play Specialist in Cardiac/Respiratory cluster you will have the benefit of a welcoming MDT and access to a range of partnerships and resources that make for a powerful coalition. You will have creative freedom to of how you support patients and their families through the journey so they can have reduced anxiety, trauma, better recovery and hopefully a bright future.&lt;/p&gt;\n&lt;p&gt;Right now is a great time to join GOSH – we’re committed to change for the better and focusing on patient safety through ensuring excellent staff well-being, a culture of openness and accountability throughout the entire MDT. The GOSH Charity have committed 5 year funding for the Learning Academy within which GOSH Play team are creating modules of study to service pan-trust teams and external partners. We want you to join us and bring your skills and enthusiasm to develop further.&lt;/p&gt;\n&lt;p&gt;You will be able to support Siblings to cope, design social stories, contribute to research and create evidence based research through your practice. You will be joining a diverse and supportive team with many opportunities for collaboration, creativity, and designing excellent care together. This exciting opportunity offers the possibility to support patients through what may be the toughest events of their lives and you will use your skills through preparation, distraction and therapeutic play to reduce the anxiety and associated trauma that can follow a patient into adulthood.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;You will work across cardiac inpatient wards, CICU and PICU with colleagues who are knowledgeable and experienced and invested in your success.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;You will join a broader team of Play Specialists, Playworkers and Music Therapists who are committed to learning and improving, incredibly supportive of each other and their wider team, and have a culture of openness and emotional honesty as well as kindness. Play Services sits within the Nursing and Patient Experience directorate as is well respected and valued across the Trust and Charity.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please note:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Health Play Specialists are qualified professionals. Candidates MUST have a recognized Health Play Specialist qualification to apply, applicants who are not qualified Play Specialists will not be shortlisted.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameLaura WalshJob titleHead of Therapeutic Play ServicesEmail addressLaura.Walsh@gosh.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121180.png", "name": "Great Ormond Street Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121180"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Great Ormond Street Hospital for Children NHS Foundation Trust, London", "postalCode": "WC1N 3JH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5222", "longitude": "-.119898"}}, "title": "Senior Play Specialist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916231695", "validThrough": "2020-11-16T23:59:59+0000"}