{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "20437", "minValue": "18340", "unitText": "YEAR", "value": "£18,340 to £20,437 per annum"}}, "datePosted": "2020-11-03T15:18:54+0000", "description": "&lt;p&gt;An opportunity is available for a Practice Consultant to help lead and support the Discharge to Assess pathway from an acute hospital setting. You will work alongside the Community Response Team, working with our health colleagues to ensure timely, safe discharges.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This role will be a skilled and qualified Social Work or Occupational Therapy practitioner. Your knowledge and understanding of strength-based assessment, asset-based approaches and care management procedures will support our team practice.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We would like an enthusiastic, proactive person who is willing to be focussed on solutions and enjoy working within a supportive and caring management team. You will supervise Social Workers and Assistant Practitioners and you will be encouraged to use a coaching method and be supportive to help people develop solutions and answers to the questions our work poses.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Key aspects of the role mean you will:&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;be an expert in the field and act as specialist support for staff&lt;/li&gt;\n&lt;li&gt;be part of the hospital duty team on site&lt;/li&gt;\n&lt;li&gt;support or lead practice development within our team&lt;/li&gt;\n&lt;li&gt;support and lead on service improvement&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;If you are committed to working in a person-centred way, have the skills to work in a multi-disciplinary setting, and in complex situations, we would be interested to hear from you and in return can offer regular supervision and the support of the larger social care team based in South Norfolk as part of the Adult Social Care team.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For an informal discussion regarding this vacancy please contact Amanda Browne (Team Manager) 01953 450771 or Jo Blanchard (Team Manager) 01953 450777&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Norfolk County Council", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=129523"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Norfolk and Norwich University Hospital", "postalCode": "NR1 2DH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6154", "longitude": "1.30769"}}, "title": "Practice Consultant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254533", "validThrough": "2020-11-17T23:59:59+0000"}