{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "20014", "minValue": "18684", "unitText": "YEAR", "value": "£18, 684 to £20,014 per annum"}}, "datePosted": "2020-11-02T16:30:25+0000", "description": "&lt;h2&gt;Physiotherapy Technician Older Persons Medicine&lt;/h2&gt;\n&lt;p&gt;35.5 hrs.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;An exciting opportunity has arisen for a Physiotherapy Technician within the Older Person Therapy Team. The post is across the busy Older Persons Medicine Wards, providing support to patients admitted with falls, infections and other medical conditions affecting this specialist group of patients.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; You will assist the qualified team members in completing assessments and treatments for patients across our wards. You will be able to provide follow-up treatment to non-complex patients, including mobility progression and exercise provision, supported by the qualified team members. You will assist the other Physiotherapy Technicians to complete relevant jobs to support the team working, including inputting contact data, replenishing the team’s walking aid sub store, photocopying and filing, and referral sending. There is an expectation for all team members to be able to contribute to service improvement. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Applicants need to enjoy team working and treating this population of patients. You need to be able to communicate clearly and be able to adjust your communication for each individual dependent upon their need. You will require the ability to work using your own initiative in a proactive manner, whilst maintaining the awareness of when to ask for help. Applicants should be aware participation in personal care during therapy sessions can occur. We work in a busy and sometimes highly pressured environment so a calm, professional approach is required. &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Within Older Persons Medicine, we work within a strong MDT, including integrated working with our Occupational Therapy colleagues. We cover a bed base of roughly 140 patients. We strive to maintain patient independence and function during acute admission to hospital. You will be supported in achieving the required competencies for this role. The team has in-service training sessions to advance our service and provides individual learning opportunities. The post involves working as part of a 7 day working pattern, with a rough expectation of completing 1 weekend in 4.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;&lt;strong&gt;Closing date: 17/11/2020&lt;/strong&gt;&lt;br /&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120645.png", "name": "Portsmouth Hospitals University NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120645"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Portsmouth", "postalCode": "PO6 3LY"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.8502", "longitude": "-1.06936"}}, "title": "Physiotherapy Technician Older Persons Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252854", "validThrough": "2020-11-17T23:59:59+0000"}