{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum"}}, "datePosted": "2020-11-02T12:15:55+0000", "description": "&lt;p&gt;&lt;strong&gt;A unique and exciting opportunity has arisen for a Band 6 Nurse to work within the Children&#39;s Community Nursing Team (CCN) in West Hertfordshire. The post is full time, 37.5 hours per week on a fixed term contract or secondment until April 2021 with the possibility of this being extended.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The team has a base in Watford. It operates 7 days a week between 08:00-18:00 and this role will be supporting our Urgent Care Pathways referrals for children with Asthma, Bronchiolitis, Fever and Gastro-enteritis to help reduce admission to hospitals.&lt;/p&gt;\n&lt;p&gt;The Children’s Community Nursing Team in West Hertfordshire is committed to providing excellent nursing care to children in all appropriate community settings particularly the child’s home, thus minimising the effects of hospitalisation on the sick child. The work is varied, which requires flexible clinical skills.&lt;/p&gt;\n&lt;p&gt;The work includes:&lt;br /&gt;• Ambulatory care such as intravenous medication &lt;br /&gt;• Palliative Care of children&lt;br /&gt;• Post operative care&lt;br /&gt;• The ongoing Nursing Management of Children with chronic conditions, including oncology, juvenile arthritis and Cystic Fibrosis &lt;br /&gt;• The Nursing Care of Children with Complex Needs&lt;br /&gt;• work in partnership with children, parents and carers, together with other professionals and agencies to meet health, development and safeguarding needs&lt;/p&gt;\n&lt;p&gt;Mobile working is currently being used by the team&lt;/p&gt;\n&lt;p&gt;There is commitment to ongoing educational development of staff to meet the changing needs of Children’s Nursing. The successful applicant will be provided with a full induction programme across the CCN service. &lt;br /&gt;&lt;br /&gt;In addition to the basic salary, this post attracts a High Cost Area Supplement of 5% of basic salary subject to a minimum and a maximum payment per annum, pro rata where applicable.&lt;br /&gt;&lt;br /&gt;A full valid driving licence and access to a car to use for business purposes is essential (unless you have a disability as defined by the Equality Act 2010).&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Katie Randall&lt;/p&gt;\n&lt;p&gt;Job title: Children&#39;s Specialist Community Nursing Service Manager&lt;/p&gt;\n&lt;p&gt;Email address: katie.randall9@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number: 01923 470680&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;Contact name: Dena Raffe&lt;/p&gt;\n&lt;p&gt;Contact job title: Children&#39;s Specialist Community Nursing Team Leader&lt;/p&gt;\n&lt;p&gt;Contact telephone number: 01923 470680&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Hertfordshire Community NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126514"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Peace Childrens Centre, Watford, Watford", "postalCode": "WD17 3EW"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.659", "longitude": "-.404116"}}, "title": "Childrens Community Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252001", "validThrough": "2020-11-16T23:59:59+0000"}