{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51393", "minValue": "45780", "unitText": "YEAR", "value": "£45,780 - £51,393  pa Inc. HCAS"}}, "datePosted": "2020-10-13T12:16:18+0100", "description": "&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Nuclear Medicine Department&lt;/strong&gt;&lt;/p&gt;\n&lt;h2&gt;NUCLEAR MEDICINE PHYSICIST (CLINICAL SCIENTIST)&lt;/h2&gt;\n&lt;h2&gt;&lt;strong&gt;Full time, permanent,&lt;/strong&gt; &lt;strong&gt;Band 7&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;strong&gt;£45,780 – £51,393 (pa inc HCA)&lt;/strong&gt;&lt;strong&gt; Job reference: RB- 0434&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We invite a Nuclear Medicine Physicist to join our team based at the Royal Brompton Hospital where we provide specialist clinical, scientific and radiation protection services. In addition to heart and lung work at the Chelsea site, we provide support for a PET-CT centre located at a Trust site in central London. The cross-site departments provide Nuclear Medicine and PET diagnostic investigations including SPECT/CT (to be replaced), CZT (solid state) and PET/CT technology. The PET-CT centre provides a range of F-18 studies and Rb-82 cardiac PET-CT (using an on-site Rb-82 generator). The role will involve working for the Royal Brompton sites (Nuclear Medicine and PET) allowing the post holder to develop experience in a range of Nuclear Medicine/ PET studies, radiation protection and developmental work in both cardiac and non cardiac areas together with a Nuclear Medicine/ PET team including 2 other clinical scientists.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;As a Nuclear Medicine Physicist, you should have some experience in Nuclear Medicine Physics and Radiation Protection. Applicants should have an MSc in Medical Physics or an equivalent subject, completed (or just about to complete) basic training (NSHCS STP or equivalent) and either hold HCPC registration as a Clinical Scientist or be working towards achieving this. The post will be appointed at an appropriate level dependent on experience. You will be given training to fulfil RPS duties as required. The group offers flexible working, provides training for STP trainees, offers support for continuing professional development and for those wishing to work towards higher training/MPE/RWA/RPA certification.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Royal Brompton Hospital is situated in Chelsea, a vibrant and beautiful area famous for shopping, the arts and riverside walks. Hospital accommodation is available in Chelsea for those wishing to move into London.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For more information please contact Lucy Hossen, email &lt;/strong&gt;&lt;strong&gt;l.hossen@rbht.nhs.uk&lt;/strong&gt;&lt;strong&gt;. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing date: &lt;/strong&gt;&lt;strong&gt;Weds 11th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview date&lt;/strong&gt;: Possibly Monday 16th November 2020. Due to Covid-19 and the government guidance on social distancing your interview will be carried out via Microsoft Teams&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121402.jpg", "name": "Royal Brompton and Harefield NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121402"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Brompton Hospital  London  SW3 6NP", "postalCode": "SW3 6NP"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4897", "longitude": "-.170831"}}, "title": "Nuclear Medicine  Physicist (Clinical Scientist)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916224233", "validThrough": "2020-11-11T23:59:59+0000"}