{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "24,907.00 - 30,615.00"}}, "datePosted": "2020-11-04T16:18:58+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;span&gt;Community Nurse (District Nursing Team)&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Band 5&lt;/span&gt;&lt;/strong&gt;&lt;br /&gt;&lt;strong&gt;&lt;span&gt;Ormskirk based covering West Lancashire region&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;span&gt;      AfC 20/21 salary and terms and conditions– including an NHS pension&lt;/span&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;span&gt;        Access to our Strive for Better networks, a national support and professional network made up of NHS professionals like you, giving you the chance to constantly develop industry-leading care and quality&lt;/span&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;span&gt;        &lt;/span&gt;&lt;span&gt;&lt;span&gt;We’ll provide you with access to bespoke career pathways and opportunities to continue your professional development, working closely with universities and Health Education England to further your potential and support your progression via in house eLearning, workshops and courses. And with this role you could complete an SPQ qualification in future supported by Virgincare!&lt;/span&gt;&lt;/span&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;span&gt;        Access to our free Employee Assistance Programme, a service providing expert advice, 24/7/365 online and by telephone covering a wide range of support options such as; counsellors, post trauma incident support, legal, debt and practical life management helplines&lt;/span&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;span&gt;        Virgin Tribe - this grants you access to premier offers and discounts on Virgin Products such as holidays&lt;/span&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;span&gt;        Plus the benefits you’d expect from working with an NHS partner, &lt;/span&gt;&lt;span&gt;NHS discount, on-site parking, easy access to transport links, as well as extras such as free hot and cold drinks&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt; &lt;/span&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Full Time and Part Time opportunities available&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Are you a caring and dedicated Community Nurse based in the West Lancashire area? Are you looking to join an NHS Health and Social Care partner which is striving to make positive changes?&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;span&gt;Feel Valued&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;As a Community Nurse, you’ll be working as part of the NHS system in West Lancashire where we deliver services across the region including wider community services and two Urgent Care centres that have recently been rated as Good!&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We‘ll offer you:&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;span&gt;Working within the community nursing team you’ll care for patients and their families in the way that you believe is best, delivering our high service standards, sharing best practice, and actively improving the way we work to help us continue to change things for the better. We feel passionate that everyone should feel valued when they come into contact with our organisation, whether that&#39;s you, someone we care for or the wider community we operate in.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;span&gt;You will be a first level registered nurse with a diploma in health related area or equivalent experience.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;span&gt;As a Community Nurse you will work as part of the community nursing service, providing high quality holistic care to patients. You will take responsibility for a dedicated caseload enabling a true relationship to be built with patients. You will work as an effective team member to actively contribute to public health initiatives, including health needs assessments and projects to meet identified needs. You may be required to provide operational management in absence of the team leader giving you an opportunity for continual professional development.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;If you’d like to discuss the role further, or request the full job description, please contact Martha Finch via email: Martha.Finch@virgincare.co.uk&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We’re committed to equal opportunities and welcome a broad diversity of talent to apply. We reserve the right to cease any advertising prior to the published closing date for a role that receives a high number of applications.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;As a Disability Confident Committed company, we work in partnership with the Department of Work and Pensions (DWP) to provide facilities, work environment adjustments and technical solutions to make our business an inclusive place for all.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;span&gt;Virgin Care Limited, its subsidiary companies and the Virgin Care LLPs are part of the Virgin Group and provide publicly funded health and social care services. If you would like to know a little more about how we use your information, please see our website’s privacy policy.&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Virgin Care", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=127354"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "District Nurses - West Lancs", "postalCode": "L40 8JU"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.6004", "longitude": "-2.8657"}}, "title": "District Nurse (Full or Part Time)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256620", "validThrough": "2020-11-18T23:59:59+0000"}