{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "74661", "minValue": "40037", "unitText": "YEAR", "value": "£40,037-£74,661"}}, "datePosted": "2020-11-04T11:46:12+0000", "description": "&lt;p&gt;&lt;strong&gt;The Post&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Applications are invited for the post of Specialty Doctor in Anaesthetics. The post will be based at Colchester General Hospital.&lt;/p&gt;\n&lt;p&gt;The successful post-holder will participate in elective operating sessions and a three tier 1 in 8 rota covering main theatres, critical care and maternity to provide 24-hour care&lt;/p&gt;\n&lt;p&gt;Our specialty doctors are expected to participate in at least two of these three clinical areas for their on-call duties&lt;/p&gt;\n&lt;p&gt;Areas of special interest may be accommodated and will depend on previous clinical experience and seniority. We would also support any doctor in their preparation, if they wished to apply for a Certificate of Eligibility for Specialist Registration (CESR)&lt;/p&gt;\n&lt;p&gt;Responsibilities will include the supervision of junior staff and involvement in a regular teaching schedule ie core topics lectures, as well as participating in the clinical governance and audit programme. We are also preparing for Accreditation by the Royal College of Anaesthetists. We would welcome anyone with an interest in education. The department has a SimMan model for teaching and training purposes and we employ two dedicated sim fellows. As well as this there is a high fidelity simulation suite at our sister hospital in Ipswich.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;If you require any more information about this job, please contact Dr Kate Gardner (Anaesthetic clinical lead) by emailing kate.gardner@esneft.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120729.jpg", "name": "East Suffolk and North Essex NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120729"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Colchester, Colchester", "postalCode": "CO4 5JL"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.9102", "longitude": ".899214"}}, "title": "Specialty Doctor Anaesthetics", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255669", "validThrough": "2020-12-05T23:59:59+0000"}