{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "56490", "minValue": "50575", "unitText": "YEAR", "value": "£50,575 - £56,490 pa. Inc. of HCAS [15%] Pro-rata"}}, "datePosted": "2020-10-29T15:00:53+0000", "description": "&lt;h1&gt;Clinical Psychologist&lt;/h1&gt;\n&lt;p&gt;(Specialising in Pain Management))&lt;/p&gt;\n&lt;p&gt;Job Type: Fixed Term - 12 months [Maternity Cover]&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Job Ref: 2363-PCOJA-A&lt;/p&gt;\n&lt;p&gt;Salary: Agenda for Change Pay Band 8A&lt;/p&gt;\n&lt;p&gt;Hours: 1.0 WTE, 37.5 hours per week. Applicants prepared to work 0.8 WTE may be considered.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We are looking for an experienced practitioner psychologist to join our multidisciplinary pain management team at Kingston Hospital. Your work will involve individual assessment and therapy and taking a leading role in the delivery of an outpatient pain management group programme, helping people to develop effective pain management strategies in order to return to valued activities. You will be a key member of the Pain Management Service Team, who provide an integrated service to adults referred with persistent pain. The team includes clinical/counselling psychologists, specialist physiotherapists, a pain specialist nurse, an alexander technique teacher and acupuncturist who work closely alongside consultant anaesthetists who specialise in chronic pain management. We are a well-established, supportive and innovative service.&lt;/p&gt;\n&lt;p&gt;The role will:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;ul&gt;\n&lt;li&gt;Provide a qualified clinical/counselling/health psychology service to clients of the pain management service team.&lt;/li&gt;\n&lt;li&gt;Provide specialist psychological assessment and treatment to individuals and groups at the same time as offering advice and consultation to non-psychologist colleagues and to other non-professional carers.&lt;/li&gt;\n&lt;li&gt;Participate in audit, teaching and research initiatives within the Pain Management Service.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Applicants must have post-graduate doctoral level training in clinical/counselling/ health psychology, or its equivalent for those trained prior to 1996, as accredited by the British Psychological Society and registration as a Practitioner Psychologist with the HCPC. You will have significant post-qualification experience working in a pain management setting. Ability to communicate sensitively is essential. You will have recognised training and relevant post-qualification experience in delivering psychological therapies, particularly CBT and ACT. You will be a team player, IT literate and demonstrate commitment to updating and maintaining your clinical skills.&lt;/p&gt;\n&lt;p&gt;Interview Date to be confirmed.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Dr Jeanne Ling, Lead Psychologist/Pain Management MDT Manager on 020 8934 2563. Or by email: jeanne.ling@nhs.net&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Kingston Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120946"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "New Victoria Hospital, Kingston upon Thames", "postalCode": "KT2 7EG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4157", "longitude": "-.254266"}}, "title": "Clinical Psychologist - Pain Clinic", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248788", "validThrough": "2020-11-19T23:59:59+0000"}