{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503"}}, "datePosted": "2020-10-26T16:16:18+0000", "description": "&lt;p&gt;&lt;strong&gt;Hours: 37.5 per week&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The post sits within the Complex Needs Team, and will include working with people coming through Transition, young people with ADHD and ASD, and people with drug and alcohol misuse. You will provide positive leadership, support and advice to social work staff and assist the Principle Manager in ensuring the delivery of effective services for adults through the promotion of high standards of practice in assessment and care planning and duties at the direction of the Principle Manager in her/his absence.&lt;/p&gt;\n&lt;p&gt;Salford is at the forefront of the transformation agenda and this has led to the formation of an Integrated Care Organisation in which both health and social care staff work for the same organisation having a shared vision, shared values and working towards shared outcomes for the people of Salford as central to its service model. This has helped us to build a national reputation for high quality health and social care services and helped us to become one of just 50 vanguard sites across the country. The Care Quality Commission (CQC) rated Salford Care Organisation as an outstanding organisation following an inspection in 2015.&lt;/p&gt;\n&lt;p&gt;You will also undertake responsibility for managing specific aspects of practice in the absence of the Principle Manager and provide assessment and support to staff taking student social workers on placement with the Directorate as well as taking lead responsibility within their team for students.&lt;/p&gt;\n&lt;p&gt;You will be responsible for carrying out social work duties and will carry an appropriate case load in relation to the most complex cases requiring the highest levels of skills, knowledge and professional expertise.&lt;/p&gt;\n&lt;p&gt;Salford is an exciting place to work and live. The fastest growing economy in Greater Manchester, the city is already home to the BBC and Granada and is attracting many more digital media, creative and professional businesses. Salford’s growing success is testament to a unique partnership approach that runs through everything that we do.&lt;/p&gt;\n&lt;p&gt;If you want to be part of this, please complete the attached form and evidence your skills and knowledge in line with the essential and desirable criteria.&lt;/p&gt;\n&lt;p&gt;Salford Care Organisation is committed to supporting the recruitment and retention of its Social Work staff. It is recognised by the Trust that many experienced Social Work staff are currently likely to be employed by local government organisations, and to ensure there is clarity over terms and conditions of employment we offer NJC Pay Scales to Social Workers we appoint, rather than NHS pay-scales. Please see the document below for further details.&lt;br /&gt;This post is a temporary post initially for six months.&lt;/p&gt;\n&lt;p&gt;In line with the Trust’s Single Equality Scheme we welcome applications from everyone irrespective of ethnic origin, disability, age, gender, gender identity, sexual orientation, disability, nationality, religion, marital status, social back ground or trade union membership. However, as members of ethnicity minority groups and individuals with disabilities are currently under-represented at this level of post, we would encourage applications from members of these groups. Appointment will be based on merit alone.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameCaitlin ChapmanJob titleComplex Needs LeadEmail addressCaitlin.Chapman@srft.nhs.ukTelephone number07903 115223&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121715.jpg", "name": "Salford Royal NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121715"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "City Approach building 2, Salford", "postalCode": "M30 0BL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4848", "longitude": "-2.33763"}}, "title": "Advanced Social Work Practitioner - Complex Needs", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243351", "validThrough": "2020-11-09T23:59:59+0000"}