{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44780", "minValue": "37638", "unitText": "YEAR", "value": "£37,638 - £44,780 pro rata, inc HCA"}}, "datePosted": "2020-11-02T16:46:12+0000", "description": "&lt;p&gt;&lt;span&gt;King’s College Hospital NHS Foundation Trust part of King&#39;s Health Partners Academic Health Sciences Centre (AHSC), is one of the UK’s largest and busiest teaching hospitals with a turnover of nearly £1 billion, 1.5 million patient contacts a year and more than 12,600 staff based across 5 main sites in South East London and Kent.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Trust provides a full range of local hospital services across its different sites, and specialist services from King’s College Hospital (KCH) site in Camberwell and the Princess Royal University Hospital (PRUH) site in Bromley, Orpington Hospital, and some services at Beckenham Beacon and Queen Mary’s Sidcup.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Trust is recognised internationally for its work in liver disease and transplantation, neurosciences, cardiac, haemato-oncology, fetal medicine, stroke, major trauma, and Emergency Department.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We encourage everyone at the Trust to work together as part of Team Kings’ to ensure we achieve the best in everything we do – now and in the future. The chance to be part of our dedicated workforce in a Trust where innovation and the desire to make a difference are key in what attracts people from around the UK and the rest of the world to join Kings’. Patients are at the heart of these plans and their aim is to ensure that the local community has access to excellent healthcare.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are looking for a flexible and well organised Nurse either someone who would like the opportunity to be trained to be a Diabetes Specialist Nurse, or someone who has experience already. The post holder specifically will be employed to provide a service for people with diabetes who are inpatients. The position is for the Denmark Hill site of King&#39;s College Hospital NHS Foundation Trust.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We would welcome an application from you if you have:&lt;br /&gt;- Excellent people skills&lt;br /&gt;- Excellent team working skills&lt;br /&gt;- Good time management skills with the ability to prioritise work&lt;br /&gt;- Evidence of being involved in a project involving change management&lt;br /&gt;- Evidence of ongoing education &amp; research or audit&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;You will be part of an enthusiastic and dynamic team and you will play an instrumental part in the smooth running of the department. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For further details / informal visits contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Name Helen Rogers&lt;/p&gt;\n&lt;p&gt;Job title Nurse Consultant: Diabetes&lt;/p&gt;\n&lt;p&gt;Email address helenrogers@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number 02032991717&lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Kaylee Lovie &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;0203299 1709 &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;kaylee.lovie@nhs.net&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "King's College Hospital NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120921"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Denmark Hill, London", "postalCode": "SE5 9RS"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4684", "longitude": "-.09228"}}, "title": "Diabetes Specialist Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252926", "validThrough": "2020-11-15T23:59:59+0000"}