{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "39681", "minValue": "32933", "unitText": "YEAR", "value": "£32,933 - £39,681 per annum, pro rata"}}, "datePosted": "2020-11-06T09:46:05+0000", "description": "&lt;p&gt;&lt;strong&gt;What’s special about this opportunity?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Berkshire Healthcare NHS Foundation Trust can provide you with a dynamic, people-centred environment, where you will be empowered to provide care for patients with heart failure, supporting their families and carers in the community across West Berkshire, adopting a personalised approach to patient care that maximises independence, choice and control, following our philosophy of enabling people to reach and maintain their optimum level of health and wellbeing.&lt;/p&gt;\n&lt;p&gt;We value our employees and put people first. As a Global Digital Exemplar, we will provide you with an excellent working environment that has just been recognised as having a ‘Good’ rating overall, being an ‘Outstanding’, well-led, organisation, and having an ‘Outstanding’ Older Adults Mental Health Team in our latest CQC inspection, which found that: ‘Managers across Berkshire Healthcare promoted a positive culture that supported and valued staff, creating a sense of common purpose based on shared values.’&lt;/p&gt;\n&lt;p&gt;Working in a passionate and friendly team, you will have access to our Trust-wide Learning and Development programme and be supported in your career and personal growth with opportunities to help you to build your Continuing Professional Development portfolio, enabling you to extend your skills and ensure that you excel.&lt;/p&gt;\n&lt;p&gt;We are pioneers in compassionate leadership and Quality Improvement, which is about creating a culture where everyone has a voice and where service users and staff collaborate to have a direct impact on the things that matter most.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About you:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You are an enthusiastic and experienced nurse, with a warm personality and great people skills. Willing to undertake relevant training, you will have leadership experience and be able to demonstrate innovative practice. Showing effective management skills, you will take responsibility for case management of patients with heart failure in a community setting.&lt;/p&gt;\n&lt;p&gt;Supporting colleagues in the delivery of compassionate, safe and structured care, you will be enthusiastic to share your knowledge with our multi-disciplinary team, staff from external agencies, volunteers, patients and carers. Proactive, you will be dedicated to ensuring that patients and their loved ones experience a seamless service. An empathetic advocate for patients, you will ensure that they are supported in their preferences, that their dignity is maintained, and that their social, cultural and spiritual needs are met.&lt;/p&gt;\n&lt;p&gt;Working flexibly in response to service need, you will enjoy working across multiple sites and have access to your own car. Your energy and drive will be rewarded with the support of a dedicated team that strives to create a progressive, friendly and considerate environment.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What’s next?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you share our passion for people and the dedication to excel, we’d love to hear from you.&lt;/p&gt;\n&lt;p&gt;We are happy to answer any questions that you may have. Please don’t hesitate to call Cath Darby on 07584 481764 or email: Cath.Darby@berkshire.nhs.uk who’ll be delighted to help.&lt;/p&gt;\n&lt;p&gt;In addition to a competitive salary, as a valued member of our team, you will receive generous annual leave, have access to our salary car scheme, support with childcare and as a respected member of the NHS, discounts from high street retailers and restaurants.&lt;/p&gt;\n&lt;p&gt;We’d love to welcome you to our warm, friendly team, who want to help you to make your career reflect your ambitions.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Karen Clarke&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120886.PNG", "name": "Berkshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120886"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Reading", "postalCode": "RG1 6DL"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4463", "longitude": "-.984454"}}, "title": "Heart Function Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259085", "validThrough": "2020-11-16T23:59:59+0000"}