{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-11-04T11:02:05+0000", "description": "&lt;p&gt;&lt;span&gt;&lt;span&gt;This is an exciting opportunity for anyone looking to expand their skills in the health care setting, as a Band 5 Dialysis Nurse you will be learning how to deliver haemodialysis to our outpatient’s on the main dialysis unit at the Kent and Canterbury Hospital, which is Thomas Becket Renal unit.&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;We are looking for a caring and enthusiastic person to join our team on Thomas Becket Renal Unit This post is for 33 hours a week Band 5 Haemodialysis Nurse working Monday to Saturday over a roster pattern, no nights involved apart from working on a twilight / evening shift and bank holidays on a rotational basis&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;Our shifts are Early (06:30-14:40) and Late (11:40-19:30). Long Days (06:30-19:30), Evenings (16:30-00:20).&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;We will provide the in-house training you require to safely carry out your role in dialysis which includes specific dialysis training and further development opportunities within your role. You will have a registered nurse and Band 6 Sister as a mentor while you are orientated to the unit and support your learning.&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;&lt;span&gt;The main duties of this role include providing haemodialysis care to renal in and out-patients on a daily basis including fluid management, recording observations, daily weights intravenous medication, pressure sore prevention, vascular access care and diabetes management.&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;In addition.We are a leading Trust for the use of technology. We are currently introducing an electronic bed management system so will benefit from real-time reporting of up-to-date information for every patient, plus point of care testing. The Trust has 24/7 access to CT and stroke thrombolysis, and benefits from interventional radiology services in our sister hospital at Canterbury. William Harvey Hospital is the primary PCI hospital for Kent, provides acute Stroke services for the area and has trauma unit status.&lt;/p&gt;\n&lt;p&gt;Currently we have new and exciting opportunities for dynamic, motivated and enthusiastic &lt;strong&gt;&lt;em&gt;Registered Health Care Professionals / Nurses &lt;/em&gt;&lt;/strong&gt;who are passionate about caring for people with all forms of conditions.&lt;/p&gt;\n&lt;p&gt;We firmly believe that developing our staff is key to success; we have a dynamic and progressive training and development ethos, providing excellent opportunities to enhance your knowledge and competencies, nurturing your personal and professional development by encouraging and supporting you to reach your full potential. You will have plenty of opportunities to develop and grow here at East Kent Hospital University Foundation Trust, &lt;strong&gt;&lt;em&gt;you may have come for a job but you’ll stay for a career.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;A medical school will be opening in east Kent in 2020 with 100 training places a year.&lt;/p&gt;\n&lt;p&gt;We are proud that our dedicated and passionate employees from across East Kent Hospitals are featured in the biggest NHS recruitment drive in its 70 year history!&lt;/p&gt;\n&lt;p&gt;Filmed in William Harvey and Queen Elizabeth The Queen Mother hospitals, the &lt;strong&gt;&lt;em&gt;‘We are the NHS’&lt;/em&gt;&lt;/strong&gt; campaign highlights the extraordinary work that staff across EKHUFT do every single day. As one of the largest hospital trusts in England, with five hospitals and community clinics serving a population of over one million people, EKHUFT was perfectly placed to demonstrate the care, cutting-edge treatments, research, innovations and life-saving operations that the campaign needed.&lt;/p&gt;\n&lt;p&gt;Our mission is to provide &lt;strong&gt;&lt;em&gt;‘Great healthcare from great people’&lt;/em&gt;&lt;/strong&gt;, and our Trust Values form the foundation of the trusts organisational culture and how we deliver our services.&lt;/p&gt;\n&lt;p&gt;We are seeking applicants who embrace our Trust values and care so that:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;People feel &lt;strong&gt;&lt;em&gt;cared&lt;/em&gt;&lt;/strong&gt; for as individuals&lt;/li&gt;\n&lt;li&gt;People feel &lt;strong&gt;&lt;em&gt;safe&lt;/em&gt;&lt;/strong&gt;, reassured and involved&lt;/li&gt;\n&lt;li&gt;People feel &lt;strong&gt;&lt;em&gt;teamwork&lt;/em&gt;&lt;/strong&gt;, trust and respect sit at the heart of everything we do&lt;/li&gt;\n&lt;li&gt;People feel confident we are &lt;strong&gt;&lt;em&gt;making a difference&lt;/em&gt;&lt;/strong&gt;.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;At EKHUFT, we are not just &lt;strong&gt;&lt;em&gt;‘making a difference’&lt;/em&gt;&lt;/strong&gt; locally we also run The Healthcare Ethiopia Partnership (HEP) project to support healthcare workers to reduce maternal deaths and deaths in children under five years old in the region of Tigray in northern Ethiopia. The project has been running for eleven years, and HEP members visit twice each year to deliver training programmes to people across rural areas.&lt;/p&gt;\n&lt;p&gt;We really are committed to ensuring our Trust is a &lt;strong&gt;&lt;em&gt;Great Place to work!&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;EKHUFT is a great choice for people who want to develop their career in an ambitious, safe, caring, dynamic, innovative and respected environment; we also offer an excellent benefits package which includes onsite childcare facilities&lt;strong&gt;&lt;em&gt;, ‘We Care’ &lt;/em&gt;&lt;/strong&gt;Benefits, various salary sacrifice schemes and a generous annual leave entitlement.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "East Kent Hospitals University NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121462"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Kent And Canterbury Hospital, Canterbury", "postalCode": "CT1 3NG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2666", "longitude": "1.08711"}}, "title": "Registered Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255526", "validThrough": "2020-11-18T23:59:59+0000"}