{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157"}}, "datePosted": "2020-10-27T11:31:20+0000", "description": "&lt;p&gt;Our new Northern Care Alliance NHS Group unites five local hospitals to deliver high quality care across the North East of Greater Manchester.&lt;/p&gt;\n&lt;p&gt;The Alliance provides the benefits of scale but delivers this locally through multiple hospital sites which make up four new Care Organisations – Bury/Rochdale, North Manchester, Oldham and Salford. Using our mantra of ‘Saving lives, Improving lives’, the aim is for our Care Organisations to work closely with the communities they serve to deliver safe, high quality and reliable care, which are trusted, connected and pioneering.&lt;/p&gt;\n&lt;p&gt;Our Care Organisations are designed to operate within our group arrangement of hospitals, community and healthcare services which bring together over 17,000 staff and the services of The Pennine Acute Hospitals NHS Trust and Salford Royal NHS Foundation Trust. Our size and geographical reach means we are creating an environment each individual will be inspired and empowered by to be the best they can be. This is a really exciting time to join our new team.&lt;/p&gt;\n&lt;p&gt;An opportunity has arisen for an experienced and proactive Medical Personal Assistant to join our busy and dynamic team in Clinical Administration.&lt;/p&gt;\n&lt;p&gt;You must be highly motivated and committed to provide high quality administrative support to the clinical teams in the Ophthalmology Department.&lt;/p&gt;\n&lt;p&gt;You will have a good working knowledge of Microsoft Office packages, RSA III or equivalent typing, medical terminology and audio typing skills. You will possess excellent communication skills, be able to organise and prioritise your workload and must be able to work using your own initiative. As the role involves dealing with the public and professionals you must be able to demonstrate excellent interpersonal skills. You will have a flexible and professional approach.&lt;/p&gt;\n&lt;p&gt;In line with the Trust’s Single Equality Scheme we welcome applications from everyone irrespective of ethnic origin, disability, age, gender, gender identity, sexual orientation, disability, nationality, religion, marital status, social back ground or trade union membership.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Moira Zernovs&lt;/p&gt;\n&lt;p&gt;Clinical Administration Team Manager&lt;/p&gt;\n&lt;p&gt;moira.zernovs@pat.nhs.uk&lt;/p&gt;\n&lt;p&gt;01706 517743&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121091.jpg", "name": "The Pennine Acute  Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121091"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bury &amp; Rochdale Care Organisation, Rochdale", "postalCode": "OL12 0NB"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.6243", "longitude": "-2.16015"}}, "title": "Medical Personal Assistant", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244247", "validThrough": "2020-11-10T23:59:59+0000"}