{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum, pro rata"}}, "datePosted": "2020-11-06T14:16:22+0000", "description": "&lt;p&gt;Some exciting opportunities have arisen for Mental Health Practitioners with post registration experience, this would normally equate to three years, to join the South County Crisis Resolution and Home Treatment Team. Your main base will be the Radbourne Unit. The Derbyshire South County Crisis Team is a large team consisting of Consultant Psychiatrists, Service Manager, Senior Nurse, Lead Nurses, Registered Nurses, Occupational Therapist, Support Workers and Administration staff. They work closely with Neighbourhood Teams based in the city and county.&lt;/p&gt;\n&lt;p&gt;This well established, multi-disciplinary team offers a high quality assessment and home treatment service as an alternative to hospital admission, to individuals experiencing acute mental health crisis. Working in partnership with clients, families and existing service providers, the team offers a range of interventions and approaches aimed at emphasising hope and optimism and developing personal strengths to help achieve recovery. The CRHTT remit brings us into contact with clients with a range of mental health, social, psychological and situational difficulties within the diverse population of Derby City and the South County.&lt;/p&gt;\n&lt;p&gt;As a service we are looking for individuals who are genuinely warm and engaging and focussed on client / customer satisfaction. You will be a good communicator, demonstrate respect and dignity. We strive to display common courtesies, listen more than we speak, explain why and act when something is not right.&lt;/p&gt;\n&lt;p&gt;We Act as Gate Keepers to hospital admission and have the philosophy of a “hospital at home” vision. We work with patients with complex mental health needs and offer treatment in the least restrictive environment. We focus on empowerment and recovery for the service user and their families. The post holder will work on a rota to support the co-ordination of 136 assessments working with other outside agencies, such as the police and social care to ensure that least restrictive options are available for patients under assessment of section 136.&lt;/p&gt;\n&lt;p&gt;Risk assessment and formulation skills are essential, together with experience of working with people with severe mental illness. The applicant must hold a relevant Mental Health professional qualification with post registration experience (which would normally equate to three years) and applied knowledge and training in therapeutic interventions such as CBT, Solution Focussed Therapy is desirable. This is a 24 hour service across a 7 day week, 365 days per year and as such the successful candidate will be expected to work as part of a 24 hour rota, including nights.&lt;/p&gt;\n&lt;p&gt;As a large part of the team&#39;s work involves assessing people in mental health crisis within a variety of settings and challenging situations, applicants must be familiar with and engage in assessments on a regular basis and must be able to meet the travel requirements of the post.&lt;/p&gt;\n&lt;p&gt;Please note, the South County Crisis Team will shortly be splitting into two teams. So the successful candidates will either be working for the Derby City Team, or the South County Team. There will be negotiation as to preferences for the successful candidate.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This post requires applicants to have a Professional Mental Health Qualification - nursing desirable.&lt;br /&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further information please contact Adele Morrow, Interim Service Manager, on 01332 623700.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121834.jpg", "name": "Derbyshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121834"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Radbourne Unit, Royal Derby Hospital, Derby, Derby", "postalCode": "DE22 3WQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9126", "longitude": "-1.51002"}}, "title": "Lead Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916260091", "validThrough": "2020-11-22T23:59:59+0000"}