{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 per annum"}}, "datePosted": "2020-10-28T14:15:31+0000", "description": "&lt;p&gt;&lt;strong&gt;Job Title – MSK Physiotherapist – Band 5&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Base – Cirencester Hospital x 1. George Moore Community Clinic x 1&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary – £24,907 to £30,615 per annum&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours per week – 37.5&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We have two exciting job opportunities to be part of the musculoskeletal outpatient teams at Cirencester Hospital and George Moore Community Clinic (Bourton-on-the-water). We are seeking forward-thinking, motivated individuals looking to develop their skills and abilities within a supportive, positive environment. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Those interested must be focused on providing the highest level of care for our patients, as well as working with our close-knit team to develop the service for the present and the future.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What we offer:-&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;- &lt;strong&gt;A Comprehensive, monthly in-service training programme&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;- &lt;strong&gt;Countywide training days&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;- &lt;strong&gt;One to one mentorship, clinical supervision, peer review&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;- &lt;strong&gt;Direct access and working closely with musculoskeletal specialists in spinal, shoulder, hand, vestibular, rheumatology, hydrotherapy and women’s health&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;- &lt;strong&gt;Working closely with MSK Physiotherapy Teams, Advanced Practitioners and the clinical specialists&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;- &lt;strong&gt;Wide variety of clinical presentations referred from Orthopaedics, advanced practitioners, minor injuries unit, GPs and patient self-referral&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;- &lt;strong&gt;Full Musculoskeletal workload&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;- &lt;strong&gt;Yearly and 6 monthly clinical appraisal with a senior clinician&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;** In light of working during the current pandemic the musculoskeletal format of assessment and treatment has been adapted. At present we offer an initial telephone and or video assessment with the potential option of face to face assessment/treatment if deemed suitable. This current method will be ongoing until further notice. This ensures we are able to continue to offer the best possible practice to our local communities **&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For any informal enquires please contact: &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;• James Smith (Team lead, MSK Cotswolds) 0300 421 6270&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;• Miranda Cawkwell (Physiotherapist) 0300 421 6270&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The qualification, training &amp; experience requirements for the role are underlined in the Job Description/Person Specification.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing date: 16th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Shortlisting date: 17th November 2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Trust aims to recruit and retain the best possible staff who, through the application of their skills, qualification and experience, will make a positive contribution to our business of providing quality health care services. It is the Trust’s view that the costs associated with moving house in order to take up a post with us should not restrict our ability to recruit the excellent people we need, therefore we support staff to relocate with our relocation policy.&lt;/p&gt;\n&lt;p&gt;This post requires the post holder to be able to undertake all statutory and mandatory training and post holders must be able to undertake physical interventions. Fitness for physical intervention will be assessed by Occupational Health.&lt;/p&gt;\n&lt;p&gt;A valid UK driving licence plus the use of own transport for business purposes is essential. For qualifying staff the Trust has a Lease Car Scheme in place and also offers a popular Salary Sacrifice Car Scheme with our partner Tusker.&lt;/p&gt;\n&lt;p&gt;To ensure you fully understand how the Trust, as a Data Controller, will process and store your data please read the attached document ‘ Applicant and Staff Privacy Notice’ prior to applying for the role.&lt;/p&gt;\n&lt;p&gt;Candidates for any staff appointment shall, when making application, disclose in writing to the Trust whether they are related to any governor. Failure to disclose such a relationship may disqualify a candidate and, if appointed, may render him/her liable to dismissal.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120776.png", "name": "Gloucestershire Health and Care NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120776"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Cirencester", "postalCode": "GL7 1UY"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7121", "longitude": "-1.97595"}}, "title": "Musculoskeletal Physiotherapist - Band 5", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246927", "validThrough": "2020-11-16T23:59:59+0000"}