{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum, pro rata"}}, "datePosted": "2020-11-05T11:46:11+0000", "description": "&lt;p&gt;&lt;span&gt;&lt;strong&gt;Emergency Nurse Practitioner - Band 7&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;The Minor Injuries Unit based at Bridgwater, Minehead and Burnham on Sea Community Hospitals (rotational post) are looking to recruit an Emergency Nurse Practitioner/Emergency Practitioner to join one of the largest employers in the South West.&lt;/p&gt;\n&lt;p&gt;You will be a qualified ENP/EP with non-medical prescribing with a team of ENPS and EP&#39;s who deliver high-quality care within our busy Minor Injury’s Unit and Urgent Treatment Centre in Bridgwater.&lt;/p&gt;\n&lt;p&gt;Working with us you will be part of our Dynamic team with a broad scope of advanced practice including injury and illness. We embrace the variety and challenge of this role and it means we learn something new every day. We welcome applicants with a specialist interest in Emergency Care.&lt;/p&gt;\n&lt;p&gt;We have a supportive senior nursing and management team who actively encourage innovation and education in order to achieve the highest standards of care and have a comprehensive CPD programme.&lt;/p&gt;\n&lt;p&gt;If you have now decided this role is for you and you want to take on this challenge within our MIU and UTC, we can offer you structured support to expand your scope of practice within our dedicated team as well as our generous trust benefits (including &lt;strong&gt;FREE&lt;/strong&gt; Parking, &lt;strong&gt;FULL&lt;/strong&gt; paid DBS check, Corporate Induction and &lt;strong&gt;many more&lt;/strong&gt;!)&lt;/p&gt;\n&lt;p&gt;As part of the interview process, you will be required to bring the following with you: Proof of any essential qualifications stated on the Job Description, proof of NHS payslip if coming from another NHS Organisation and all ID to prove your identity and Right to Work (More details will follow for successful applicants invited to interview) Please note, interviews will be held remotely.&lt;/p&gt;\n&lt;p&gt;We look forward to hearing from you!&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Somerset NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121360"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bridgwater/Minehead/Burnham on Sea, Bridgwater/Minehead", "postalCode": "TA6 4GU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.1352", "longitude": "-3.00186"}}, "title": "Emergency Nurse Practitioner / EP (Band 7)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257501", "validThrough": "2020-11-19T23:59:59+0000"}