{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "35393", "minValue": "34102", "unitText": "YEAR", "value": "£34,102 to £35,393 per annum"}}, "datePosted": "2020-10-26T09:50:23+0000", "description": "&lt;p&gt;&lt;strong&gt;We invest in the best – We pay £9,000 Welcome Bonus for all Nurses&lt;/strong&gt; - * Terms &amp; conditions apply&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We would be delighted to speak to you If you’ve previously worked for the NHS&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are currently seeking &lt;strong&gt;Senior &lt;strong&gt;Staff Nurses (RMN)&lt;/strong&gt;&lt;/strong&gt; to join our &lt;strong&gt;Mental Health and Intellectual Disabilities PICU/Acute Service &lt;/strong&gt;at&lt;strong&gt; The Huntercombe Hospital Roehampton, &lt;/strong&gt;4 miles from&lt;strong&gt; Richmond &lt;/strong&gt;and 9 miles from&lt;strong&gt;central London.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Huntercombe Hospital Roehampton – London SW15&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The hospital is a 39 bedded purpose-built &lt;strong&gt;psychiatric intensive care&lt;/strong&gt; unit. The hospital provides a secure and safe, gender-specific environment for adults who have suffered an acute deterioration or relapse in their mental wellbeing.&lt;/p&gt;\n&lt;p&gt;We specialise in providing intensive and bespoke, individualised treatment plans working collaboratively with patients and their families or carers and employ staff in a variety of different roles providing ongoing support, comprehensive training, learning and development opportunities.&lt;/p&gt;\n&lt;p&gt;The hospital is located just off the &lt;strong&gt;A306 in Roehampton&lt;/strong&gt;, &lt;strong&gt;4 miles from Richmond&lt;/strong&gt; and 9 miles from central London. &lt;strong&gt;The nearest main line train station is Putney or Barnes&lt;/strong&gt; with good transport links to the hospital.&lt;/p&gt;\n&lt;p&gt;Our &lt;strong&gt;Staff Nurses &lt;/strong&gt;are highly respected and they shape how we deliver care. Our &lt;strong&gt;‘Conversation&lt;/strong&gt; &lt;strong&gt;into Action’&lt;/strong&gt; programme actively encourages everyone to get involved and drive change for the better.&lt;/p&gt;\n&lt;p&gt;Huntercombe can &lt;strong&gt;offer you a rewarding career&lt;/strong&gt; where you will be valued as a key member of our team and every day you’ll be able to &lt;strong&gt;make a difference&lt;/strong&gt; to the lives of our patients and residents, supporting and encouraging them to achieve their goals and ambitions.&lt;/p&gt;\n&lt;p&gt;When you join The Huntercombe Group as a &lt;strong&gt;Registered Nurse (RMN)&lt;/strong&gt;, you will be part of a company that is &lt;strong&gt;understanding&lt;/strong&gt;, &lt;strong&gt;strives towards excellence&lt;/strong&gt;, is &lt;strong&gt;innovative&lt;/strong&gt;, &lt;strong&gt;reliable&lt;/strong&gt; and &lt;strong&gt;accessible&lt;/strong&gt; and above all &lt;strong&gt;puts people first&lt;/strong&gt;.&lt;/p&gt;\n&lt;p&gt;Most patients and residents are referred &lt;strong&gt;via NHS and local authorities&lt;/strong&gt;. We play an integral part in contributing to new models of care outlined in the &lt;em&gt;Five Year Forward View.&lt;/em&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To work according to the NMC Code of Professional Conduct and relevant professional guidelines as a named nurse or key worker for a defined group of patients.&lt;/li&gt;\n&lt;li&gt;To provide clinical leadership to a designated nursing team and ensure the provision of high quality.&lt;/li&gt;\n&lt;li&gt;To provide a high quality individualised standard of care to a defined group of patients, relatives and carers.&lt;/li&gt;\n&lt;li&gt;Ensure the effective supervision and development of staff .&lt;/li&gt;\n&lt;li&gt;To work and act as a key member of the team, supporting each patient with achieving their planned outcomes.&lt;/li&gt;\n&lt;li&gt;To act as the primary nurse in the assessment of needs and organising of care.&lt;/li&gt;\n&lt;li&gt;To take charge of a designated clinical area.&lt;/li&gt;\n&lt;li&gt;To adopt a flexible approach to hours of duty, in order to meet the needs of the service over a 24 hour period.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Key Accountabilities:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To be the clinical expert within the speciality&lt;/li&gt;\n&lt;li&gt;To act as an advocate to the child or adult ensuring the provision of appropriate information and support services.&lt;/li&gt;\n&lt;li&gt;To be an active participant in the multidisciplinary team, formulating care plans and utilising appropriate assessments.&lt;/li&gt;\n&lt;li&gt;In conjunction with the MDT, assess and manage risks identified through assessment of patients.&lt;/li&gt;\n&lt;li&gt;To regularly review risk factors and work in conjunction with the MDT to modify care plans as appropriate.&lt;/li&gt;\n&lt;li&gt;To act as the primary nurse for inpatient stay.&lt;/li&gt;\n&lt;li&gt;To ensure that clinical practice is evidenced based and consistent with relevant NICE guidelines and the organisations policies and procedures&lt;/li&gt;\n&lt;li&gt;To undertake clinical supervision to further develop competence and clinical practice.&lt;/li&gt;\n&lt;li&gt;To act as a mentor/preceptor to students/support workers as appropriate.&lt;/li&gt;\n&lt;li&gt;To supervise junior staff in carrying out their care plans.&lt;/li&gt;\n&lt;li&gt;To liaise effectively with all stakeholders in the care process, including carers and relatives, aspiring to provide an effective, seamless and integrated service to patients.&lt;/li&gt;\n&lt;li&gt;To maintain and update relevant knowledge and skills, maintain a professional portfolio and participate in further training as appropriate, in order to enhance quality of care for patients and carers.&lt;/li&gt;\n&lt;li&gt;To comply with the Huntercombe Group Health and Safety Policies and Protocols in order to contribute to safe working practices.&lt;/li&gt;\n&lt;li&gt;To protect vulnerable adults / children from internal/external elements and act as a Patient Advocate.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;In return we offer you:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;A generous bonus payment - *Terms &amp; Conditions apply&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;A thorough induction programme tailored to the hospital where you will be working&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Generous annual leave entitlement&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Sick pay of 4 weeks full pay and 4 weeks half pay&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;The opportunity to participate in a company contributory pension scheme with up to 3% matching contributions&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Maternity leave at 3 month’s full pay and 3 month’s half pay&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;2 weeks paid paternity leave&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Shared parental leave, matching the maternity leave benefit&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;A fantastic preceptorship programme&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Death in service benefit equivalent to 2 x salary&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;A range of staff discounts&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Reimbursement for NMC registration fees&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Continuing Professional Development (CPD) including PICU Gold Standard Training as recommended by NAPICU&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Support for revalidation&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Support for BSc and MSc&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Professional support through Nurses forum&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Employee Assistance Programme (EAP)&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Relocation allowance of up to £8000.00&lt;/p&gt;\n&lt;p&gt;We welcome applications from everyone irrespective of ethnic origin, gender, age, gender identity, sexual orientation, religion, marital status, disability or social background. This is a great opportunity for someone to make a difference.&lt;/p&gt;\n&lt;p&gt;An enhanced DBS (England) or PVG/Disclosure Scotland (Scotland) Disclosure will be required for all successful applicants. Costs will be met by the Company.&lt;/p&gt;\n&lt;p&gt;If you like what you have read, are dynamic, forward thinking and keen to learn, with a confident ‘CAN DO’ approach in all you do, please click &lt;strong&gt;Apply&lt;/strong&gt; now.&lt;/p&gt;\n&lt;p&gt;*(conditions apply)&lt;/p&gt;\n&lt;p&gt;Posting Date: 26th October 2020&lt;/p&gt;\n&lt;p&gt;Closing Date: 25th November 2020&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/130001.jpg", "name": "The Huntercombe Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130001"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Roehampton, SW London", "postalCode": "SW15 4JD"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4486", "longitude": "-.24357"}}, "title": "Senior Staff Nurse (RMN)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241916", "validThrough": "2020-11-25T23:59:59+0000"}