{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 - £21,142 per annum, pro rata"}}, "datePosted": "2020-10-28T10:16:32+0000", "description": "&lt;p&gt;Posts have become available for 3 x housekeeping Supervisors working 37.5 to cover at the following Areas.&lt;/p&gt;\n&lt;p&gt;1 x will be to cover over Prestwich Site&lt;/p&gt;\n&lt;p&gt;1 x will be to supervise the Heavy Duty Team and will be part of the team at time, This post will also require the Successful Candidate to have Deep Clean experience with in an Hospital Environment, Able to Train staff on all Machinery including an industrial Fogging Machine .&lt;/p&gt;\n&lt;p&gt;1 x Mobile Supervisor to work throughout the GMMH footprint&lt;/p&gt;\n&lt;p&gt;This post will involve working a variety of shifts over a 7-day week including Bank Holidays..&lt;/p&gt;\n&lt;p&gt;The successful candidate in this post will be carrying out a wide range of supervisory duties, and on times involve covering at the other units. Supervision of housekeepers/Domestics (both part time and full time).&lt;/p&gt;\n&lt;p&gt;The post will include training and induction of new housekeeper/Domestic staff where needed. It will involve the attendance and chairing of unit housekeeping meetings held on a monthly basis. will include giving supervision&lt;/p&gt;\n&lt;p&gt;The successful candidate will receive ongoing line management supervision and will be accountable to the Soft service team leaders/ manager. The successful candidate will need to demonstrate previous housekeeper experience. Some supervisory experience is essential. The successful candidate will be required to demonstrate a good understanding of mental health issues.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameLisa Byrnes &amp; Julie BrierleyJob titleSoft Service team leadersEmail addressLisa.Byrnes@gmmh.nhs.ukTelephone number07748322244Additional contact information&lt;/p&gt;\n&lt;p&gt;Julie.Brierley@gmmh.nhs.uk - 07500975578&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121714.jpg", "name": "Greater Manchester Mental Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121714"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Prestwich Hospital, Prestwich", "postalCode": "M253BL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5368", "longitude": "-2.29146"}}, "title": "Housekeeping Supervisor", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246016", "validThrough": "2020-11-11T23:59:59+0000"}