{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 to £110,683 pa"}}, "datePosted": "2020-10-29T16:00:51+0000", "description": "&lt;p&gt;Consultant Physician in Stroke Medicine&lt;/p&gt;\n&lt;p&gt;(Joint Post with Cambridge University Hospitals)&lt;/p&gt;\n&lt;p&gt;This is a new post which offers an exciting opportunity to work both at WHFT and CUH. The applicant will be expected to cover the whole spectrum of stroke services on both sites, including hyperacute, acute and rehabilitation care as well as thrombolysis and the TIA assessment service.&lt;/p&gt;\n&lt;p&gt;The job will be split with 8 PAs at WSH and 2 PAs at CUH. The applicant will work one week in every 3 months in HASU at CUH. One day in a month will be worked at CUH with an AM SPA and a PM admin/stroke clinic. 4/5 weekends per year in CUH HASU will also be worked. The remainder of the time will be worked at WSH and will include board rounds, HASU/ASU ward rounds, outpatient clinic, ESOT work and TIA clinic. A 1:4 weekend rota is also in operation which the candidate will be part of.&lt;/p&gt;\n&lt;p&gt;You will be fully registered with the GMC and ideally have a CCT in geriatric medicine, Acute General Medicine or Neurology with an interest in stroke or be within six months of award of CCT at the time of interview. Applications are welcomed from those unable to work full time for personal reasons or those wishing to job share.&lt;/p&gt;\n&lt;p&gt;The applicant must have demonstrable skills in listening, reading and writing and speaking in English that enable effective communication about medical topics with patients and colleagues, as set out in the GMC’s Good Medical Practice (2013). Non-UK applicants must possess the IELTS/OET exam before obtaining a GMC license to practice.&lt;/p&gt;\n&lt;p&gt;Full registration and a Licence to Practice with the General Medical Council at time of application is required.&lt;/p&gt;\n&lt;p&gt;For further details/informal visits contact: &lt;strong&gt;Dr Abul Azim at WSHFT on 01284 712883 and Dr George Zachariah at CUH on email at &lt;/strong&gt;&lt;strong&gt;george.zachariah@addenbrookes.nhs.uk&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing Date: 5th January 2021&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview Date: 11th February 2021  (Interviews are to be held via Microsoft Teams)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please view the job description and apply online at NHS jobs quoting reference number 179-MSC35-20.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Applications from job seekers who require Tier 2 sponsorship to work in the UK are welcome and will be considered alongside all other applications. However, non-EEA candidates may not be appointed to a post if a suitably qualified, experienced and skilled EU/EEA candidate is available to take up the post as the employing body is unlikely, in these circumstances, to satisfy the Resident Labour Market Test. The UK Visas and Immigration department requires employers to complete this test to show that no suitably qualified&lt;/p&gt;\n&lt;p&gt;EEA or EU worker can fill the post. For further information please visit the UK Visas and Immigration website.&lt;/p&gt;\n&lt;p&gt;From 6 April 2017, Tier 2 skilled worker applicants, applying for entry clearance into the UK, must present a criminal record certificate from each country they have resided continuously or cumulatively for 12 months or more in the past 10 years. Adult dependants (over 18 years old) will also be subject to this requirement.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "West Suffolk NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120941"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bury St. Edmunds", "postalCode": "IP33 2QZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.2317", "longitude": ".709205"}}, "title": "Consultant Physician in Stroke Medicine", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248979", "validThrough": "2021-01-05T23:59:59+0000"}