{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum, pro rata"}}, "datePosted": "2020-10-27T08:30:47+0000", "description": "&lt;p&gt;&lt;span&gt;We are looking for a qualified mental health nurse for the role of staff nurse on our Mary Seacole ward 2. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Would you like to work for a supportive, motivated team with a focus on improving patient care and creating a positive working environment? MSW2 offers 24/7 nursing care for females with complex, severe and enduring mental health conditions. We support our service users through periods of crisis and difficulty using a diverse range of interventions including, day to day nursing care, collaborative care planning and discharge planning, goal setting and psychosocial interventions. We work closely within a multi-disciplinary team of consultant psychiatrists, medics, occupational therapists, dieticians, psychologists, physical therapists, house keepers and domestic staff to provide a high quality and caring service which involves working alongside community teams and provisions.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We will offer you regular management supervision to develop your skills and abilities and support you in your role as staff nurse. You will be encouraged to develop your own interests and specialisms and to support us in the continuous improvement of our service. You will be able to seek additional training opportunities to support your role on the ward. We offer monthly supervision with a psychologist to develop our practice and interventions as a team, as well as regular team meetings and debriefs.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We encourage applications from a variety of backgrounds, from both experienced nurses and students due to complete their nurse training within the next 6 months. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameAngela EatlyTelephone number0121 301 6127&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Birmingham and Solihull Mental Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120844"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Mary Seacole ward 2, Birmingham", "postalCode": "B18 5SD"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.494", "longitude": "-1.9328"}}, "title": "Band 5 Staff Nurse - Mary Seacole ward 2", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243715", "validThrough": "2020-11-10T23:59:59+0000"}