{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum pro rata"}}, "datePosted": "2020-11-06T08:30:35+0000", "description": "&lt;p&gt;We are looking for highly motivated, compassionate, caring and flexible individuals to join our mental health inpatient services on a bank basis in Somerset.&lt;/p&gt;\n&lt;p&gt;We are looking for staff who are confident, approachable, and sensitive to the issues faced by people who are in the acute and challenging phase of their journey towards recovery.&lt;/p&gt;\n&lt;p&gt;You will be a good communicator, able to demonstrate empathy, be non-judgemental, self-motivated and committed to delivering high-quality patient care. You will enjoy talking and listening to people and have the patience to spend time with service users to discuss their care and assist them with their daily needs.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;You will need to have 6 months post registration experience for this role.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We will provide a full corporate and local induction on appointment. In addition to which you will have training and development opportunities which will further enhance your skills as a healthcare worker.&lt;/p&gt;\n&lt;p&gt;As part of the interview process, you will be required to bring the following with you: Proof of any essential qualifications stated on the Job Description, proof of NHS payslip if coming from another NHS Organisation and all ID to prove your identity and Right to Work (More details will follow for successful applicants invited to interview)&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Bank Lead Nurses - 01823 343 531&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "Somerset NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121360"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Community", "postalCode": "TA1 5DA"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.012", "longitude": "-3.11979"}}, "title": "Bank Registered Mental Health Nurse, Band 5", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258912", "validThrough": "2020-11-22T23:59:59+0000"}