{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-11-05T08:45:28+0000", "description": "&lt;p&gt;The Cheshire and Mersey Specialist Perinatal Service consists of three teams working closely together across the Cheshire and Mersey footprint, within Mersey Care, Cheshire and Wirral Partnership, and North West Boroughs NHS Trusts. We support women who experience severe and complex mental health difficulties in the Perinatal period (throughout pregnancy and up to baby’s first birthday), providing a holistic package of care for mums, babies and families via our passionate and responsive multi-disciplinary team.&lt;/p&gt;\n&lt;p&gt;Clinical Psychologists play an integrative role in each of the MDTs and are valued and well supported by colleagues. While this post will be primarily focused on delivering support to individual families (both directly and by supervising and supporting MDT colleagues) there will also be scope for delivering training and consultation to partner agencies and to being involved with other aspects of service development.&lt;/p&gt;\n&lt;p&gt;We are looking for a clinician who is a strong team player and who has an understanding of the unique nature of the perinatal period and the need to balance the needs of mum, baby and the wider systems that surround them.&lt;/p&gt;\n&lt;p&gt;The applicant will join the Liverpool Perinatal Mental Health Team, working across the Mersey Care footprint. Practitioners will be closely integrated into and meet regularly with the MDT although they will be expected to work relatively autonomously across the footprint. They will be joining a supportive and engaged Clinical Psychology team, MDT and wider service, and will receive regular supervision and CPD as well as informal support.&lt;/p&gt;\n&lt;p&gt;Shortlisting is planned for 20th November 2020&lt;/p&gt;\n&lt;p&gt;Interviews are planned for 27th November 2020&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameDr Kelly TaylorJob titlePrincipal Clinical PsychologistEmail addresskelly.taylor@merseycare.nhs.ukTelephone number0151 702 4012&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121087.gif", "name": "Mersey Care NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121087"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Liverpool Women&#39;s Hospital Liverpool, Liverpool", "postalCode": "L8 7SS"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.3983", "longitude": "-2.95998"}}, "title": "Perinatal Clinical Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256946", "validThrough": "2020-11-19T23:59:59+0000"}