{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "43772", "minValue": "37570", "unitText": "YEAR", "value": "£37,570 - £43,772 Per Annum"}}, "datePosted": "2020-10-26T14:46:43+0000", "description": "&lt;p&gt;The Royal Cornwall Hospital is committed to delivering Brilliant Care to our patients through investing in our Brilliant People and Brilliant Improvement. We are looking for an enthusiastic pharmacist to support the Lead Pharmacist for Surgery and the Lead Pharmacist for Critical Care and Anaesthesia in the provision of a clinical pharmacy service to the critical care unit (approx. 50%), theatres and the surgical wards (approx. 50% combined). The post holder will provide advice to the critical care department and theatres, and works on behalf of pharmacy to lead on perioperative management. The pharmacist will be working alongside other members of the multidisciplinary team, including consultants, junior doctors and a range of specialist nurses, specialist pharmacists, junior pharmacists and pharmacy technicians to provide a robust clinical service.&lt;/p&gt;\n&lt;p&gt;Guided by the Lead pharmacists, the post holder will share in directorate work including teaching, guideline production and review, regular audit, participation in research, governance activities and reporting on trends in drug usage. They will work alongside medicines management technicians and participate in the core activities of medicines reconciliation, prescription review, discharge planning and medication counselling. They will also participate in the training of junior and pre-registration pharmacists on the critical care unit and surgical wards.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Royal Cornwall hospital pharmacy department is a forward thinking and friendly team with full deployment of electronic prescribing and administration in the inpatient and outpatient setting and fully automated dispensing. We provide an innovative clinical pharmacy service, combining technology and clinical pharmacy expertise. We are a recognised national leader for innovation in fields such as antimicrobial resistance and the adoption of Scan4Safety standards, as was recognised in the 2019 HSJ Patient Safety Awards. All these functions are supported by an excellent wholesale dealer supply service, a well-equipped licensed pharmacy technical services unit and the full range of medicines optimisation support services including medicines information, education and training, formulary support and digital medicines. We have approved funding for a new pharmacy department confirmed as part of an exciting multimillion investment which includes a new Women’s and Children’s hospital.&lt;/p&gt;\n&lt;p&gt;Critical care Cornwall are proud to have 2 members of their team representing Nationally within the Faculty of Intensive Care Medicine committees. The critical care team are focused on maximising rehabilitation following illness and employ a full rehab team including physiotherapists, dietitians, occupational therapists, speech and language team and a psychologist.&lt;/p&gt;\n&lt;p&gt;Cornwall is a wonderful place to live, offering an excellent quality of life and a truly stunning environment to live in. We have a vision of an integrated Cornwall pharmacy service: Working closely with the clinical commissioning group, local primary care services and retail pharmacists across organisational boundaries to achieve the best outcomes for our patients and provide seamless care.&lt;/p&gt;\n&lt;p&gt;Why visit Cornwall when you can work here youtube.com/watch?v=H53oq_XH_vY&lt;/p&gt;\n&lt;p&gt;This is a fulltime post of average 37.5 hours per week, however flexible working and job-share will be considered.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Helen McClay- Pharmacy Clinical Lead, 01872 255997 or helen.mcclay1@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120920.jpg", "name": "Royal Cornwall Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120920"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Truro", "postalCode": "TR1 3LJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.2667", "longitude": "-5.0915"}}, "title": "Specialist Clinical Pharmacist – Critical &amp; Perioperative Care", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242959", "validThrough": "2020-11-08T23:59:59+0000"}