{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "15482", "minValue": "15482", "unitText": "YEAR", "value": "£9.21ph+"}}, "datePosted": "2020-11-03T09:24:44+0000", "description": "&lt;p&gt;We are currently looking for flexible, adaptable, and reliable Bank Domestic Assistants who may already have some experience working within a hospital or care setting, to work as part of our friendly and growing team.&lt;/p&gt;\n&lt;p&gt;You will become part of a dedicated team who are passionate about supporting the NHS and its staff in their vital work by keeping premises clean, safe and hygienic. Bank contracts are great for those who need a bit more flexibility or an ideal opportunity to come in and try a role to see if it suits you before looking at a permanent contract.&lt;/p&gt;\n&lt;p&gt;Successful candidates will be expected to work across the Basingstoke site, carrying out services in a professional, efficient, friendly and polite manner.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What would you do?&lt;/strong&gt;&lt;br /&gt;• vacuum cleaning; mopping; dusting, cleaning mirrors, baths, showers, sinks, toilets, washing of tiled surfaces and paintwork; walls and ceilings; emptying and cleaning bins and making sure paper towels; toilet tissue; and hand soap dispensers are replenished&lt;br /&gt;• If you are working in a ward you will usually have additional duties such as washing up and cleaning the kitchen, helping to serve drinks and some basic laundry duties.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What experience and skills do you need?&lt;/strong&gt;&lt;br /&gt;• You do not need to have any experience as full training and support will be provided&lt;br /&gt;• We are looking for people with the right values who want to make a difference and play a part in the provision of excellent care to our patients&lt;br /&gt;• You will need to have good basic level of English because you may need to speak to patients, visitors and staff in a healthcare environment as well as reporting any issues, and keeping basic records.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What do you need to think about before applying?&lt;/strong&gt;&lt;br /&gt;• This role is physically demanding, and you will be moving/using equipment and furniture, stretching, reaching, bending and doing lots of repetitive movements&lt;br /&gt;• You will also be exposed to dirt, dust and smells&lt;br /&gt;• If you are applying for a role with an early start or part time hours, please make sure you think about how you will get to the site and that the hours will work for you.&lt;/p&gt;\n&lt;p&gt;If you have good communication skills, and work well in a fast paced environment, Hampshire Hospitals Foundation Trust welcomes your application.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121094.JPG", "name": "Hampshire Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121094"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Winchester Andover", "postalCode": "SO22 5DG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.0614", "longitude": "-1.33095"}}, "title": "Bank Domestic Assistant - Winchester &amp; Andover", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253264", "validThrough": "2020-11-17T23:59:59+0000"}