{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753.00 - £51,668.00 pa pr"}}, "datePosted": "2020-10-27T10:01:24+0000", "description": "&lt;p&gt;An opportunity to provide a specialist role and move into an established post. We are seeking a highly motivated and skilled Maxillofacial Prosthetist/Reconstructive Scientist to join our busy and stimulating service as Principle/Service Deputy.&lt;/p&gt;\n&lt;p&gt;Our Maxillofacial Prosthetics Service provides a comprehensive clinical and technical service for the whole of Dorset encompassing oncology, trauma, orthognathic surgery planning, facial and body prosthetics and implant rehabilitation work. We provide an on-call service to be available for traumatic emergencies and specialist case work.&lt;/p&gt;\n&lt;p&gt;We are committed to the personal and professional development of our staff and the service is part of the South West Training Consortium for Healthcare Science, Scientific Training Programme with a current cohort of Trainee’s. In addition we have close links to the Distance and Full Time MSc courses at King’s College, London.&lt;/p&gt;\n&lt;p&gt;If you are a Maxillofacial Prosthetist/Reconstructive Scientist with excellent communication skills, you enjoy working under pressure, using your initiative and would like to contribute to the work of a busy unit we look forward to hearing from you.&lt;/p&gt;\n&lt;p&gt;Please note: if this job requires you to have a DBS check to enable you to properly fulfil the requirements of the job, on appointment you will be required to repay the cost of obtaining a DBS check and this amount will be reclaimed from your salary.&lt;/p&gt;\n&lt;p&gt;Closing date: 08/11/2020&lt;/p&gt;\n&lt;p&gt;Provisional interview date: 30/11/2020&lt;/p&gt;\n&lt;p&gt;For more information concerning the post and to arrange an informal visit please contact: Heidi Silk heidi.silk@uhd.nhs.uk and Mark Townend mark.townend@uhd.nhs.uk Telephone: 0300 0192148. Subject to applicable pandemic restrictions&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120850.PNG", "name": "Royal Bournemouth and Christchurch Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120850"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Poole, Dorset", "postalCode": "BH15 2JB"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.722", "longitude": "-1.97311"}}, "title": "Maxillofacial Prosthetist - Principle/Service Deputy", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243896", "validThrough": "2020-11-08T23:59:59+0000"}