{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Band 6"}}, "datePosted": "2020-10-27T12:17:11+0000", "description": "&lt;p&gt;Specialist CAMHS Practitioner&lt;/p&gt;\n&lt;p&gt;Band 6&lt;/p&gt;\n&lt;p&gt;37.5 Hours&lt;/p&gt;\n&lt;p&gt;Permanent&lt;/p&gt;\n&lt;p&gt;Based at CAMHS, Lodge Road, West Bromwich&lt;/p&gt;\n&lt;p&gt;Black Country Healthcare NHS Foundation Trust is looking for a motivated and enthusiastic Specialist CAMHS Practitioner to join our diverse, multi-disciplinary community CAMHS team. You will be a confident, experienced and effective communicator with a good knowledge of the complexities of supporting the mental health needs of children and young people and their families. You will have experience of working with children and families through triage, assessment, intervention and discharge, across a range of settings to promote positive outcomes for children, young people and their families.&lt;/p&gt;\n&lt;p&gt;The team work Monday to Friday across The Black Country and are operational between 0900-1700, however flexibility to working times will be considered.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Please note, Dudley and Walsall Mental Health Partnership NHS Trust and Black Country Partnership NHS Foundation Trust have merged together as one organisation to create Black Country Healthcare NHS Foundation Trust from 1st April 2020. Our aim as one trust is to provide sustainable, high quality, accessible and responsive services. Combining resources, strategies and talented workforce enables us to deliver a wider variety of outstanding services that are based on best practice and are continually improving. We are really excited by this opportunity and hope that you are too, we look forward to you expressing an interest in working joining us.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Nicky Mountford Service Manager nicky.mountford@nhs.net or 0121 612 6620&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120845.png", "name": "Black Country Healthcare NHS Foundation Trust (formerly known as Black Country Partnership Foundation Trust)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120845"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "48 Lodge Road, West Bromwich", "postalCode": "B70 8NY"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5192", "longitude": "-1.99969"}}, "title": "Specialist CAMHS Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244456", "validThrough": "2020-11-10T23:59:59+0000"}