{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30426", "minValue": "16625", "unitText": "YEAR", "value": "£9.89 - £18.10 per hour"}}, "datePosted": "2020-11-06T16:30:17+0000", "description": "&lt;p&gt;&lt;strong&gt;Want to support our&lt;em&gt; NHS&lt;/em&gt; Nightingale Hospital Exeter?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The hospital has been set up to improve the resilience of the Peninsula/South West hospital network by providing up to 116 additional beds. &lt;/p&gt;\n&lt;p&gt;The NHS Nightingale Hospital Exeter will &lt;strong&gt;support the NHS to care for patients with coronavirus&lt;/strong&gt;. This hospital is designed to provide high quality specialist care for seriously ill coronavirus patients in Devon, Cornwall and the wider South West region.&lt;/p&gt;\n&lt;p&gt;As part of taking on the above role, full &lt;strong&gt;training and induction will be provided&lt;/strong&gt;, as well as &lt;strong&gt;hotel accommodation, free parking/park and ride, additional travel costs, and meal provision as appropriate&lt;/strong&gt;. You will also be provided with uniforms and ID.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please note:&lt;/strong&gt; this will be a highly challenging working environment, and it won’t be suitable for everyone. The Trust will support you to draw on your resilience and that of your colleagues too.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Staff welfare is paramount. &lt;/strong&gt; ‘The facility will only be able to run well if we take care of the wonderful staff who are working here. We recognise that they are at the core of the NHS Nightingale Hospital Exeter, and we will do everything within our power to take care of them, not just from an infection control perspective but also considering their physical and mental wellbeing, before, during and after their time working here.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Appropriate PPE will be provided for staff, and the hospital has been built to provide maximum infection control during high risk procedures. The hospital are working closely with experts in infection control to ensure that we have safe practices in place.’&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Who we are looking for:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for&lt;strong&gt; Healthcare Assistants (Band 2) - &lt;/strong&gt;people who share our values and passion for caring for patients at this time of need, and can&lt;strong&gt; commit to working rostered shifts at this hospital for at least 4 weeks, all in line with working time directive.&lt;/strong&gt; The post holder will have the following &lt;strong&gt;essential skills&lt;/strong&gt;:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Demonstrable relevant experience within a Healthcare Assistant role, ideally within the NHS, although care sector acceptable&lt;/li&gt;\n&lt;li&gt;Vocational qualification in healthcare and/or a first aid qualification&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The most important skills are the ability to keep calm under pressure, have a real empathy for people who need support and be ready to put a patient’s welfare first in what are unprecedented times.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Pay rate:              &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;-          &lt;strong&gt;Days £9.89 per hour&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;-          &lt;strong&gt;Nights and Saturdays £13.94 per hour&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;-          &lt;strong&gt;Sundays and Bank Holidays £18.10 per hour&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The post holder will:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Be responsible for participating and assisting in the delivery of care/services to patient/ service users within the Trust.&lt;/li&gt;\n&lt;li&gt;Work under the overall supervision of a registered member of staff.&lt;/li&gt;\n&lt;li&gt;Carry out a limited number of delegated procedures requiring a base level of theoretical knowledge, understanding and skill specific to the specialist area, whilst undergoing training.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Duties:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;These roles involve performing tasks and duties that enable the nursing and medical teams to remain on the frontline of patient care and in fighting the pandemic at NHS Nightingale. Typical duties will include, but not exhaustively be:&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Assists patients with compassion to undertake activities of daily living whilst ensuring the privacy, dignity and human rights are respected for the patients and promote patient wellbeing.&lt;/li&gt;\n&lt;li&gt;To follow care plans developed by the registered nurse or other health care professional and only undertake work which is within own competence and to identify any further work required to be undertaken by more senior staff.&lt;/li&gt;\n&lt;li&gt;To demonstrate effective communication with patients, staff and other members of the multi-disciplinary team.&lt;/li&gt;\n&lt;li&gt;To maintain accurate records, which are confidential, contemporaneous, and legible, with all care given documented at the time. These records may be paper or IT based system.&lt;/li&gt;\n&lt;li&gt;To perform basic life support and give assistance to professionals during advanced life support techniques.&lt;/li&gt;\n&lt;li&gt;To assist with the maintenance of ward cleanliness.&lt;/li&gt;\n&lt;li&gt;To undertake a range of routine procedures for the ward and department which may include ordering of stores and stationery, storage of patient records, photocopying, shredding of paper, maintenance and monitoring of equipment.&lt;/li&gt;\n&lt;li&gt;Promote and maintain a safe working environment by following any governance standards and management of Health and Safety Standards.&lt;/li&gt;\n&lt;li&gt;To comply with all infection control policies and guidance, attend relevant updates and report issues of concern to their immediate line manager.&lt;/li&gt;\n&lt;li&gt;To be responsible for using own initiative and be flexible when organising own workload on a day to day basis, which is often unpredictable in order to respond to the needs of the service.&lt;/li&gt;\n&lt;li&gt;To maintain and Preserve confidentiality at all times, and be aware of the Data Protection Act, Access to Health Records and Consent for Treatment.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt; &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Who are NHS Professionals?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;NHS Professionals (NHSP), owned by the Department of Health and Social Care (DHSC), we work in partnership with hospital trusts to provide a bank of highly skilled workers who want to work within the NHS. &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Apply &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Join today and let’s deliver the best patient care together.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;The Trust is committed to recruiting and supporting a diverse workforce and so we welcome applications from all sections of the community, regardless of age, disability, sex, race, religion, sexual orientation, maternity/pregnancy, marriage/civil partnership or transgender status The Trust expects all staff to behave in a way which recognises and respects this diversity, in line with the appropriate standards.&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "NHS Professionals - Flexible Workers", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121069"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Exeter", "postalCode": "HP2 4TZ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7556", "longitude": "-.425633"}}, "title": "Healthcare Assistant (Band 2) - NHS Nightingale Hospital Exeter", "url": "https://www.jobs.nhs.uk/xi/vacancy/916260610", "validThrough": "2020-12-08T23:59:59+0000"}