{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "21142", "minValue": "19737", "unitText": "YEAR", "value": "£19,737 to £21,142 pa"}}, "datePosted": "2020-11-03T17:00:20+0000", "description": "&lt;p&gt;Patient Flow Administration Assistants -Band 3&lt;/p&gt;\n&lt;p&gt;2.0 wte posts and we are seeking both full time and part time post holders; please state your preference within your application.&lt;/p&gt;\n&lt;p&gt;The roles will be required to cover a 7 day shift pattern and will therefore require weekend working.&lt;/p&gt;\n&lt;p&gt;We are seeking enthusiastic administrators who are passionate about high quality patient care to support effective patient flow within the Trust. The Trust operates across 3 main localities of Rotherham, Doncaster and North Lincolnshire and this role will be key to service delivery across these sites through delivering the following objectives:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To assist in the monitoring and reporting on the patient flow position across the Trust’s full portfolio of services to ensure that operational managers are equipped with the information required to manage the Trust’s capacity effectively and ensure timely access to services for patients. This will involve at least daily production of the Daily Flow State for the organisation.&lt;/li&gt;\n&lt;li&gt;To provide administrative support to the Patient Flow Manager to support with the management and oversight of patient flow across the Trust.&lt;/li&gt;\n&lt;li&gt;To support clinical teams through the provision of information in relation to bed availability for the organisation.&lt;/li&gt;\n&lt;li&gt;To be the first point of contact for the Patient Flow Team.&lt;/li&gt;\n&lt;li&gt;To support the monitoring of out of area bed availability, including support with sourcing and accessing beds as required.&lt;/li&gt;\n&lt;li&gt;To assist in the monitoring and reporting on out of area patients with the objective of delivery of care closer to home for patients and maximising local bed utilisation.&lt;/li&gt;\n&lt;li&gt;To support the Trust’s On Call Managers through provision of information relating to patient flow to support decision making out of hours.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;If you are highly organised and can effectively communicate with staff at all level and have good patient care at the heart of everything you do then we are looking for you to take on one of these roles. Experience of working in mental health or within clinical services is advantageous but not essential if you have the transferrable skills we are seeking.&lt;/p&gt;\n&lt;p&gt;For further details please contact: Jessica Green, Patient Flow Manager on 07970 049649&lt;/p&gt;\n&lt;p&gt;Interviews are scheduled to take place 16 November 2020&lt;/p&gt;\n&lt;p&gt;We reserve the right to close down this advert early should there be a high number of applicants.&lt;/p&gt;\n&lt;p&gt;PLEASE NOTE WE WILL CONTACT YOU VIA EMAIL ABOUT YOUR APPLICATION THEREFORE PLEASE CHECK YOUR EMAIL ACCOUNT&lt;/p&gt;\n&lt;p&gt;It is important that you check your NHS jobs account regularly. To access emails from us, log into your account and view &#39;My Applications&#39; however some emails have been known to end up in &#39;JUNK MAIL/SPAM BOX&#39; so please ensure you check this folder as well as your INBOX so you don&#39;t miss any important communication regarding your application.&lt;/p&gt;\n&lt;p&gt;If you have not received confirmation of an interview date within 6-8 weeks of your application, please assume on this occasion that you have been unsuccessful.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Rotherham Doncaster and South Humber NHS Foundation Trust is committed to our responsibilities for safeguarding and promoting the welfare of children, young people and adults at risk as outlined in Working Together to Safeguard Children 2015 and Care Act 2014. &lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;We are committed to recruiting candidates who share the commitment to safeguarding, and therefore we apply robust recruitment and selection procedures to ensure that the people selected are right for the job, and that all candidates are appropriately screened prior to appointment and periodically during their employment&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;DBS disclosures are mandatory before commencement of employment within the Trust. Therefore, if you are in a position that is deemed a regulated adult and/or child care role, you will not be able to start your employment until we have received a satisfactory DBS clearance.&lt;/p&gt;\n&lt;p&gt;Safeguarding Policies for the Trust can be accessed via the document links.&lt;/p&gt;\n&lt;p&gt;The Trust is committed to equal opportunities in employment and welcomes applications from all sections of the community in order to maintain a workforce as diverse as the population it serves.&lt;/p&gt;\n&lt;p&gt;The first 6 months of employment with the Trust will be a probationary period which may be extended by the Trust for a further 6 months.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121483.jpg", "name": "Rotherham Doncaster and South Humber NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121483"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Doncaster", "postalCode": "DN4 8QN"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4948", "longitude": "-1.14598"}}, "title": "Patient Flow Administration Assistant (Band 3)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254860", "validThrough": "2020-11-10T23:59:59+0000"}