{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62001", "minValue": "53168", "unitText": "YEAR", "value": "£53,168 - £62,001"}}, "datePosted": "2020-11-03T09:38:02+0000", "description": "&lt;p&gt;We are looking to recruit an experienced senior manager to the role of Directorate Manager for Theatres, Anaesthetics and Critical Care. This is a fantastic opportunity to join an experienced and motivated leadership team and play a key role in the Trust’s recovery. The successful candidate will have well-developed leadership skills and extensive operational management experience in an acute hospital setting. This is a challenging and exciting opportunity which offers the post holder a diverse role which spans multi-specialities and offers significant operational management experience. The post holder will have advanced communication skills and be able to build strong relationships with both clinical and non-clinical teams.&lt;/p&gt;\n&lt;p&gt;The most important qualities you will have are a passion for high quality and safe patient care and the persistence to overcome challenges that you can translate into sustained service improvement, taking the clinical teams with you. You will have a strong track record of managing clinical services and delivering against a range of operational and quality targets and objectives in agreed time scales. The successful candidate will have a collaborative approach to leadership and have the ability to motivate and communicate effectively with staff at all levels.&lt;/p&gt;\n&lt;p&gt;This position would be ideal for those who have aspirations to progress in their NHS career. The Trust is committed to individual personal development and succession planning and the successful candidate will be supported in this. If you are interested in discussing this opportunity, please contact; Victoria Bateman, Divisional General Manager, for the Surgery and Anaesthetic Services Division on 01254 735707&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;If you are interested in discussing this opportunity, please contact; Victoria Bateman, Divisional General Manager, for the Surgery and Anaesthetic Services Division on 01254 735707&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "East Lancashire Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120742"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Across ELHT Sites", "postalCode": "BB10 2PQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8098", "longitude": "-2.22817"}}, "title": "Directorate Manager Theatres, Anaesthetics &amp; Critical Care", "url": "https://www.jobs.nhs.uk/xi/vacancy/916253294", "validThrough": "2020-11-17T23:59:59+0000"}