{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24157", "minValue": "21892", "unitText": "YEAR", "value": "£21,892 - £24,157 Per Annum (Pro Rata)"}}, "datePosted": "2020-11-04T10:24:06+0000", "description": "&lt;h1&gt;&lt;strong&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Medical Records Governance Coordinator -Kitson Hall Torbay Hospital&lt;/span&gt;&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt;The role of the Medical Records Governance Co-ordinator is to have an overview of all health and social care records throughout the trust and to manage all aspects of these records all the way through their lifecycle.&lt;/p&gt;\n&lt;p&gt;Record keeping is an integral part of all clinical practice and good record keeping provides protection for the patient and clinical care staff in the case of litigation. You will be enthusiastic about helping others achieve best practice, identifying areas of learning, looking at solutions to problems and analysing the outcome of your actions. You will be interested in working towards effective solutions and interested in researching best practice.&lt;/p&gt;\n&lt;p&gt;Depending on experience, the post may be considered on a part time basis.&lt;/p&gt;\n&lt;p&gt;You will be part of the Information Governance team and will work closely with Medical Records and the trust&#39;s Data Protection Officer providing wide ranging support to the national standards of medical records and associated guidance, taking a lead on issues as required&lt;/p&gt;\n&lt;p&gt;Please see the combined job description and person specification for more information regarding the role responsibilities and entry requirements.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Working Pattern&lt;/strong&gt;: 37.5 Hours per week on a permanent contract&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;*We reserve the right to close vacancies early if we receive a high volume of applications. Please apply promptly. *&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120957.jpg", "name": "Torbay and South Devon NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120957"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Kitson Hall Torbay Hospital", "postalCode": "TQ2 7BN"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.4785", "longitude": "-3.54954"}}, "title": "Medical Records Governance Coordinator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255357", "validThrough": "2020-11-11T23:59:59+0000"}