{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum (pro rata)"}}, "datePosted": "2020-10-16T17:30:54+0100", "description": "&lt;p&gt;Band 7 Team Leader Children’s Complex Care:&lt;/p&gt;\n&lt;p&gt;12 Months Fixed Term / possible secondment.&lt;/p&gt;\n&lt;p&gt;A new opportunity has arisen to support the clinical and operational leadership of the Children’s Complex Care team in Birmingham and to ensure the highest level of nursing care is delivered to some of our most vulnerable children.&lt;/p&gt;\n&lt;p&gt;The team works as part of a multi-disciplinary system supporting children and families to live as independently as possible away from hospital.&lt;/p&gt;\n&lt;p&gt;If you have a passion for working with children with long term conditions within the community and are ready for your next challenge, we’d love to hear from you.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;IMPORTANT&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Please ensure you check your Trac account regularly as this is how we will communicate with you during the shortlisting and selection process&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Please ensure all sections of the application form are completed fully. Please particularly ensure that you provide full details of all referees including business email address, telephone contact details and postal address&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Please be aware that BCHC utilises a third party recruitment system (TRAC). When applying via NHS Jobs, your submitted application will be imported into TRAC and any correspondence will be sent via TRAC. We advise that you check your junk/spam emails.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Be Part of Our Team...&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Birmingham Community Healthcare NHS Foundation Trust (BCHC) has more than 5000 staff working across Birmingham and the West Midlands in a wide range of community nursing and specialist healthcare roles. BCHC delivers over 100 clinical services, in people&#39;s homes, health centres, clinics and inpatient facilities. We deliver a wide range of services for children, young people, parents and families as well as adults and community services, two community hospitals, services for people with learning disabilities, the internationally recognised West Midlands Rehabilitation Centre and one of Europe’s leading Dental Hospitals and School of Dentistry. We deliver all of this with a commitment to integrated, personalised care that is rooted in our local communities. We have an ambition to deliver outstanding, integrated care as one of the key NHS providers in the West Midlands.&lt;/p&gt;\n&lt;p&gt;If you want to ‘Be Part of Our Team’ and work with a Foundation Trust which is continuously striving for better care and healthier communities, we want to hear from you.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;For more information please contact Service Manager Kate Scobie on 07864949047&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/125654.jpg", "name": "Birmingham Community Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=125654"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Lansdowne Health Centre, Birmingham", "postalCode": "B18 7EE"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.4892", "longitude": "-1.93388"}}, "title": "Band 7 Team Leader Children&#39;s Complex Care", "url": "https://www.jobs.nhs.uk/xi/vacancy/916231261", "validThrough": "2020-11-06T23:59:59+0000"}