{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51668", "minValue": "45753", "unitText": "YEAR", "value": "£45,753 - £51,668 Pro rata per annum"}}, "datePosted": "2020-10-26T15:46:55+0000", "description": "&lt;p&gt;An exciting opportunity has arisen to be part the Patient Safety and Clinical Improvement team – we are looking to appoint an Improvement Project Manager.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be an integral member of the Patient Safety and Clinical Improvement team which is responsible for delivering projects of varying size and complexity, improving the care of a range of patients in a range of specialities. The role offers a chance to improve the safety of healthcare across the Oxford AHSN area and participate in large scale improvement and patient safety projects being led across England.&lt;/p&gt;\n&lt;p&gt;The successful candidate will:&lt;/p&gt;\n&lt;p&gt;- Have a good understanding of the healthcare system, quality improvement methodology and patient safety;&lt;/p&gt;\n&lt;p&gt;- Be a strong self-motivated and flexible team player;&lt;/p&gt;\n&lt;p&gt;- Demonstrate a strong background in managing and delivering complex projects;&lt;/p&gt;\n&lt;p&gt;- Be skilled in building credibility and strong relationships across the health and care system;&lt;/p&gt;\n&lt;p&gt;- Have excellent verbal and written communication skills.&lt;/p&gt;\n&lt;p&gt;The job description and person specification are an outline of the tasks, responsibilities and outcomes required for the role. The post holder will carry out any other duties as may reasonably be required by their line manager to fulfil the objectives of the team.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Contract Term:&lt;/strong&gt; FTC 18 months or secondment opportunity&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location:&lt;/strong&gt; The post holder will be based at the AHSN Office, Magdalen Centre, The Whitehead Building, Oxford Science Park. However, the post holder will be required to travel throughout the AHSN area (Oxfordshire, Berkshire, Buckinghamshire and Milton Keynes), and occasionally to other locations in England.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Closing date 16th November 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Katherine EdwardsEmail addresskatherine.edwards@oxfordahsn.org&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Oxford University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120889"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Oxford Academic Health Science Network, Oxford", "postalCode": "OX4 4GA"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7165", "longitude": "-1.21804"}}, "title": "Improvement Project Manager – Patient Safety", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243224", "validThrough": "2020-11-16T23:59:59+0000"}