{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "51393", "minValue": "37638", "unitText": "YEAR", "value": "£37,638 - £51,393 per annum inclusive HCA"}}, "datePosted": "2020-10-26T17:30:28+0000", "description": "&lt;p&gt;Band 6/7 Occupational Therapist, London Pathways Unit, HMP Brixton &lt;br /&gt;The London Pathways Partnership (LPP) is a consortium of NHS Trusts delivering services in the community in London and across three prisons as part of the national Offender Personality Disorder (OPD) programme.&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for a committed and enthusiastic Occupational Therapist with experience of working with Personality Disorder in the community, secure environments or prison settings.&lt;/p&gt;\n&lt;p&gt;This is a full-time post on the London Pathways Unit (LPU) at HMP Brixton. The position will be offered at Band 6 or 7 depending on experience. The post holder will be responsible for the provision of the Occupational Therapy service in the LPU, providing professional leadership in the design and delivery of interventions to high risk prisoners with severe personality difficulties, to assist their progression through their sentence and resettlement in the community. Opportunities may arise to take up part of the in the LPP community services which would involve joint development and delivery of the service user involvement programme and Hub. The post holder will be the professional lead for Occupational Therapy for the LPU, with commensurate supervision and line management responsibilities. &lt;br /&gt;This is an innovative role which aims to enhance the development of appropriate pathways through custody and into the community for service users.&lt;/p&gt;\n&lt;p&gt;There is a wide range of Training and CPD opportunities within the OPD.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120781.jpg", "name": "East London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120781"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "LONDON", "postalCode": "SW2 5XF"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.452", "longitude": "-.124685"}}, "title": "Occupational Therapist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243568", "validThrough": "2020-11-22T23:59:59+0000"}