{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "73664", "minValue": "63751", "unitText": "YEAR", "value": "£63,751 - £73,664 per annum"}}, "datePosted": "2020-11-04T09:46:16+0000", "description": "&lt;p&gt;&lt;span&gt;The aim is to deliver high quality strategic estates advice across the NHS, facilitating STPs/ICSs to create better healthcare environments and generate cost efficiencies that will benefit clinicians, patients and the wider health economy.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This is a regional role in the Estates team. It is a challenging and diverse role working across the healthcare, social care and wider public-sector system as part of an independent strategic estates advisory function.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;SELs will be partnering with senior stakeholders in STPs to support delivery of the NHS England Five Year Forward View (FYFV) by developing estates strategies and programmes which empower the transformation of care and are clearly linked to other infrastructure enablers. Critical skills in stakeholder management, thorough knowledge of the NHS, oversight of capital project delivery, commercial awareness, estates operational issues and programme management are required to be most successful.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This is a results focused role, which requires a full understanding of national health policy objectives to ensure that consequential benefits in efficiency, surplus land release, capital receipts and new housing targets are achieved.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;The Estates function provides impartial advice across the wider NHS system, regardless of property ownership, advising a full range of stakeholders including Commissioners and Providers in relation to a broad range of optimisation, rationalisation, acquisition, disposal, and lease restructuring opportunities.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Sue Hardy&lt;/p&gt;\n&lt;p&gt;Regional Delivery Director&lt;/p&gt;\n&lt;p&gt;Sue.Hardy@london.gov.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/126694.png", "name": "NHS England and NHS Improvement", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126694"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Skipton House, London", "postalCode": "SE1 6LH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4963", "longitude": "-.100723"}}, "title": "Strategic Estates Lead", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255234", "validThrough": "2020-11-18T23:59:59+0000"}