{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "73664", "minValue": "63751", "unitText": "YEAR", "value": "£63,751 - £73,664 pa plus HACS"}}, "datePosted": "2020-11-05T12:16:51+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for a consultant clinical psychologist to join the BHRUT Pain Management team. BHRUT serves a large catchment of 780,000 people from hugely diverse ethnic and socioeconomic backgrounds. At the moment the Pain Management Service sees over 2,500 new referrals per annum between three Chronic Pain Doctors. Referrals come from primary care in the form of GPs, Extended Scope Practitioner Physiotherapists and secondary care in the form of other medical specialties such as Neurosurgeons, Rheumatologists, Haematologists, Oncology/Palliative Care and Orthopaedic surgeons.&lt;/p&gt;\n&lt;p&gt;The post holder will work closely alongside the strategic and professional leads for Clinical Health Psychological Services (CHPS), and the consultants and multidisciplinary team at BHRUT, to develop an evidence-based, highly effective psychological assessment and treatment service for patients/carers referred to the Pain Management Programme. The post holder will have significant existing expertise in working within pain management programmes and chronic pain services, and developing Pain Management Programmes (PMP) as well as within a wider physical health/ clinical health psychological context.&lt;/p&gt;\n&lt;p&gt;The successful applicant will need to show skill and flexibility in working within a team, understand or at least appreciate the medical aspects of pain management and show enthusiasm, in working with the doctors and physiotherapists to design a PMP.&lt;/p&gt;\n&lt;p&gt;There will be a strong leadership role, with experience required in triage and signposting, as well as managing caseloads, complexity of risk and individual/ group psychology programmes within a timely and professional manner.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameMarc KingsleyJob titleStrategic and Clinical Lead for Clinical Health PsychologyEmail addressmarc.kingsley@nelft.nhs.ukTelephone number07967380685&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NELFT NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120606"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Queens Hospital/ KGH Hospital, Romford", "postalCode": "RM13 8GQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5218", "longitude": ".172052"}}, "title": "Consultant Clinical Psychologist in Pain Management", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257633", "validThrough": "2020-11-19T23:59:59+0000"}