{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "32000", "minValue": "32000", "unitText": "YEAR", "value": "up to £32,000  per annum DOE"}}, "datePosted": "2020-10-23T10:06:27+0100", "description": "&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;I help to make a difference!&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Are you looking for a new challenge in an environment where no two days are the same?&lt;/p&gt;\n&lt;p&gt;Are you looking to work for a company that offers support and development opportunities? &lt;br /&gt;If so, then this could be the role for you!&lt;/p&gt;\n&lt;p&gt;Prisons are one of the most challenging, yet rewarding places for healthcare professionals to work - if you’re looking for a role where you can develop your existing skills and learn something new every day, then this is the place to be.&lt;/p&gt;\n&lt;p&gt;Practice Plus Group are Health in Justice Market leader, providing healthcare services to offenders across the country. Our model of care is our Wellbeing Approach – an integrated, comprehensive approach in recognition of the fact prisoners are a socially-excluded group with healthcare needs which are complex and often associated with poor outcomes. It adopts the premise no single health/wellbeing factor can be taken in isolation of other motivational issues which might impact a person’s care.&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Interested in clinical development?&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;We could give you the opportunity to develop in to a specialist role of your interest and benefit to the service i.e. ANP, BBV, sexual health, CBT, plastering, ILS, ALS, health promotion, phlebotomy, vaccinations, suturing, wound care, RCGP, and long term condition courses.&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;In return for your hard work you will...&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Receive an annual salary up to £32,000 per annum – dependent on experience. You&#39;ll also get a number of benefits including:&lt;/p&gt;\n&lt;p&gt;• Training and development opportunities&lt;br /&gt;• Company contributory pension scheme&lt;br /&gt;• 25 days annual leave plus 8 bank holidays&lt;br /&gt;• Staff well-being and recognition scheme&lt;br /&gt;• Access to bank hours&lt;br /&gt;• CPD and re-validation support&lt;br /&gt;• Cycle to work scheme as well as online retail discounts&lt;br /&gt;• Online retail discounts&lt;br /&gt;• Two onsite gyms with FREE access&lt;br /&gt;• Onsite FREE parking&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;What do we need from you so you can do the job?&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;As a Staff Nurse (RGN/RMN) you will be an integral part of the healthcare team and will be involved in everything from clinical triage to the evaluation of patient care and standards. You’ll carry out – and potentially develop – nurse led clinics, reviewing patient’s histories, undertaking relevant examinations and tests, organising any necessary treatment and referring patients to other healthcare professionals when you need to.&lt;/p&gt;\n&lt;p&gt;We have 2 Staff Nurse positions available, working within the wings and also in the Inpatient Healthcare Unit.&lt;/p&gt;\n&lt;p&gt;Our two sites based Primary Healthcare Centres provide a comprehensive primary care service, GP appointments, chronic disease nurse led clinics, screening programmes and health promotion work. An emergency response service to prison wings is also provided within the working core day 07.30-17.30, seven days a week.&lt;/p&gt;\n&lt;p&gt;The IHU provides care to prisoners with both mental and physical health problems, minor surgery, medical, rehabilitation/post operative care and palliative care. The Unit also provides a safe environment for the stabilisation and detoxification of prisoners with substance misuse problems. IHU delivers care over a 24hr period and rotation will be expected from days to nights.&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Next Steps&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;If you are shortlisted, you will be contacted by, the Internal Recruiter for this role. &lt;br /&gt;The recruiter will submit your application to the hiring manager and in turn Wendy will arrange an interview for you to attend at HMP Isle of Wight if the hiring manager feels that you are suitable for the job.&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;More information&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;We invite applications from those wishing to work full or part time We also welcome applications from newly qualified nurses seeking that important first post. We can offer the full range of preceptor ship in a clinical environment where you can expect to see and work with a wider range of health issues than you would experience in most other areas of the NHS.&lt;/p&gt;\n&lt;p&gt;If you are looking for a challenging work environment and the opportunity to be at the forefront of developments in prison healthcare, then do please get in touch.&lt;/p&gt;\n&lt;p&gt;For informal discussions and visits, please contact:&lt;br /&gt;Teresa Fendyke – Modern Matron on 01983 635728 – or email to teresa.fendyke@practiceplusgroup.com.&lt;/p&gt;\n&lt;p&gt;Please note that offers of employment are subject to Practice Plus Group Terms &amp; Conditions and receipt of satisfactory references, enhanced DBS check and prison vetting. We also reserve the right to close the role early should a sufficient number of applications be received.&lt;/p&gt;\n&lt;p&gt;At Practice Plus Group we actively promote diversity and equal opportunities.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Practice Plus Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130136"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Isle of Wight", "postalCode": "PO30 5RS"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7121", "longitude": "-1.30498"}}, "title": "Inpatient Primary Care Nurse- HMP Isle of Wight", "url": "https://www.jobs.nhs.uk/xi/vacancy/916239972", "validThrough": "2020-11-06T23:59:59+0000"}