{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "107668", "minValue": "79860", "unitText": "YEAR", "value": "£79,860 to £107,668 per annum"}}, "datePosted": "2020-10-13T15:46:14+0100", "description": "&lt;p&gt;&lt;strong&gt;Job Title: Consultant Psychiatrist (Innovative)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary: &lt;/strong&gt;&lt;strong&gt;£82,096 - £110,683 per annum&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Would you like to work in a CQC ‘Outstanding’ rated Mental Health and Learning Disability Trust? &lt;/strong&gt;Do you want to make a difference in changing people’s lives? If you are passionate about delivering excellent patient care, we are looking for you to join our Medical Workforce team. In return you will work with a dynamic multi-disciplinary team, receive superb training and development opportunities and excellent staff benefits.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Post Details&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The post will enable the Consultant to work across a variety of psychiatric services and specialties depending upon availability of a post and experience. The concept of this post is to create a role for a specialist in the field of psychiatry, who will rotate into vacant posts for variable periods of time as agreed with the post holder and taking into account service need.&lt;/p&gt;\n&lt;p&gt;The post holder is expected to demonstrate a commitment to delivering excellence in clinical care, to working effectively with multi-disciplinary community teams and inpatient teams and to promoting the safety and wellbeing of the patients. The post holder is expected to respect the rights and the dignity of patients, to consider the individual and cultural needs of patients and to work with families and carers in the best interest of the patient (in line with the Trust Carers Charter).&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Why us? &lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;A flexible approach to job planning to ensure work-life balance.&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Dedicated and protected SPA time.&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Excellent Continuing Professional Development (CPD) and study leave arrangements. &lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Relocation package available &lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Focus on staff health and wellbeing &lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;A Global Digital Exemplar for Mental Health.&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The Trust is located in the North East of England and Cumbria which is an area of outstanding natural beauty, containing national parks, ancient heritage sites and major cities supported by excellent national and international transport links. The area is predominantly rural and contains the Lake District National Park which is considered one of England’s finest areas of natural beauty.&lt;/p&gt;\n&lt;p&gt;Interviews will be held on a rolling basis, as needed and can be via Microsoft Teams.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121049.jpg", "name": "Cumbria, Northumberland, Tyne and Wear NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121049"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "St Nicholas Hospital, Newcastle upon Tyne", "postalCode": "NE3 3XT"}, "geo": {"@type": "GeoCoordinates", "latitude": "55.0063", "longitude": "-1.63477"}}, "title": "Consultant Psychiatrist (Innovative)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916224926", "validThrough": "2020-11-10T23:59:59+0000"}