{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 pa"}}, "datePosted": "2020-10-28T15:45:15+0000", "description": "&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We have an exciting opportunity for Band 5 Speech and Language Therapists to join our community Paediatric Speech and Language Therapy Team here in North East Essex. You will work as part of a multidisciplinary paediatric team and work closely alongside Physiotherapists, Occupational Therapists, therapy assistants and a continence nurse.  Experience of working with children, young people and their families with or without disabilities is desirable but not essential. We welcome applications from qualified therapists who are looking for a change or from newly qualified therapists with a strong desire to work in the area of community paediatrics. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;This post will offer the successful candidates the opportunity to work alongside a supportive team of highly experienced therapists and assistants in providing Speech and Language Therapy input to children aged 0-19 years, with diverse needs, to develop their communication skills and encourage child-centered treatment goals.  You will work within community settings seeing children in schools or nurseries, as well as in a clinic and home setting. You will work collaboratively with carers, education staff and other professionals to deliver a highly effective service to children.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;It is essential that you are a car driver as you will be expected to travel across the North East Essex area. You will need to be flexible, able to work autonomously and committed to the culture of transformational change around care in the community and within paediatric services.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;To arrange an informal visit or for more information, please contact Emma Blowers, Paediatric Services Lead on 07866784106 or by email: &lt;/span&gt;&lt;span&gt;Emma.Blowers@acecic.nhs.uk&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;This post is classified as Regulated Activity and is exempt from the Rehabilitation of Offenders Act 1974 (Exceptions) Order 1975 (as amended in 2013). You must therefore disclose on your application form all convictions,    cautions, youth cautions and youth conditional cautions, which are not protected. Guidance and criteria on the filtering of cautions and convictions and what you must therefore disclose on your application form can be found on the Disclosure and Barring Service website. If you are offered the post we will need to obtain a satisfactory Disclosure and Barring Service (DBS) Check for you. You will also be expected to join the DBS update service and renew this annually, the cost of which will be reimbursed to you. You are advised to read the attached leaflet regarding the Disclosure and Barring Service.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;&lt;span&gt;ACE is commissioned to provide a number of services including Community based health services (Care Closer to Home). We have been advised by North East Essex Clinical Commissioning Group that this contract will be provided by another organisation after 30&lt;/span&gt;&lt;span&gt;th&lt;/span&gt;&lt;span&gt; June 2021. This is not as a reflection of ACE but due to the Commissioner wanting to make changes to the way the service is delivered. At the present time we don’t know who the new provider will be but the CCG is working to determine this by the end of 2020. This change does not affect our ability to recruit and should you be employed at the end of June 2021 you will transfer to the new provider on the same terms and conditions  &lt;/span&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Working for ACE puts you right at the heart that all North East Essex has to offer. If you are looking to re-locate to the area then we may be able to help with your moving costs. Further information can be found in the Relocation policy.  &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Colchester is Britain’s oldest recorded town and now one of its fastest growing with a range of recreational facilities to match. The jewel in the crown of its historic past is its Norman castle, built on Roman foundations. A wealth of new homes is complemented by an equally broad selection of character homes in the plethora of picture-postcards villages that surround the town. The likes of Sible Hedingham, Finchingfield and Dedham (the latter being the heart of Constable Country made famous by the artist John Constable) are much sought-after location. Within a stone’s throw of Colchester you have 60kms of beautiful coastline including Blue Flag beaches, the gentile charm of Frinton and the more bustling Clacton – one of the driest places to live in the UK!  In addition North Essex boasts several nationally acclaimed schools, including Colchester Royal Grammar School and Colchester County High School for Girls. London Stansted Airport is less than an hour’s drive away while all the attractions of London itself are within easy reach. &lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Anglian Community Enterprise (CIC)", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=125574"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Colchester", "postalCode": "CO4 9YQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.9237", "longitude": ".921483"}}, "title": "Speech and Language Therapist, Band 5", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247227", "validThrough": "2020-11-10T23:59:59+0000"}