{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "26324", "minValue": "26324", "unitText": "YEAR", "value": "15.66"}}, "datePosted": "2020-11-05T14:58:29+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;span&gt;PFI &amp; FACILITIES CONTRACTS MANAGEMENT ADMINISTRATOR&lt;/span&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Location: &lt;strong&gt;Stoke Mandeville Hospital, HP21 8AL with the requirement to Travel to other trust locations&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Job reference: 36711&lt;/p&gt;\n&lt;p&gt;Would you like to be part of a team that has a real supportive and inclusive ethos and sense of community?&lt;/p&gt;\n&lt;p&gt;If you answered ‘yes’ to the above, we would love to hear from you!&lt;/p&gt;\n&lt;p&gt;We have &lt;strong&gt;Full Time&lt;/strong&gt; placement opportunities available for a &lt;span&gt;&lt;strong&gt;&lt;span&gt;PFI &amp; FACILITIES CONTRACTS MANAGEMENT ADMINISTRATOR&lt;/span&gt;&lt;/strong&gt;&lt;/span&gt;available at Buckinghamshire Healthcare NHS Trust specifically providing the following:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;To provide a high level, comprehensive and confidential business and administrative management support to the PFI team for two high value PFI contracts, and other Facilities contracts on the acute sites not delegated to other staff. The post holder will participate in our vision to provide a high quality contracts management service, to ensure financial resources are maximized, adhering to Trust Financial Instructions, and providing a comprehensive business support function.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Organise and produce reports, papers, presentations and other similar documentation in accordance with organisational timeframes.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Support the management of activities, gathering information, updating documentation and undertaking enquiries as necessary for the Facilities Performance Manager&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Support budgeting, forecasting and tracking spend of activities; ensuring&lt;/p&gt;\n&lt;p&gt;that appropriate justification exists, and that authorisation has been granted for all expenditure&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Buckinghamshire Healthcare provides acute, community and specialist healthcare services to patients across the county of Buckinghamshire, and neighboring areas. Overall, the Trust has around 6,000 highly trained, qualified doctors, nurses, midwives, health visitors, therapists, healthcare scientists and other support staff caring for more than half a million patients every year. Our patients are at the heart of everything that we do, and our aim is to provide safe and compassionate care, every time. Our focus is on providing right care, right place, right time, first time and everything we do is aimed at delivering high-quality care when and where our patients need it.&lt;/p&gt;\n&lt;p&gt;In return for your hard work commitment NHS Professionals (NHSP) can offer you some fantastic benefits: –&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Competitive Pay Rates&lt;/strong&gt;- work this week, get paid next week!&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;First choice of placements at over 50 NHS Trusts in England&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Dedicated consultants&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Flexible working options&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Free DBS and free training&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Build holiday allowance&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Support when you need it – 24/7 365 days&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Stakeholder pension scheme&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Who are NHS Professionals?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;NHS Professionals (NHSP), owned by the Department of Health and Social Care (DHSC), works in partnership with hospital trusts to provide a bank of highly skilled temporary workers who want to work flexibly within the NHS.&lt;/p&gt;\n&lt;p&gt;Working through the NHSP bank means Trusts do not have to rely on expensive agencies. Right now, we have over 130,000 members registered on our bank from various roles, grades, and specialties, saving the NHS over&lt;strong&gt;£70 million&lt;/strong&gt;each year. This money is then reinvested back into the NHS.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Apply&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Register today for various flexible working options and long-term placement opportunities.&lt;/p&gt;\n&lt;p&gt;For more information on the roles or details on how to join NHS Professionals, simply get in touch with the admin and clerical team on 03330 144354.&lt;/p&gt;\n&lt;p&gt;We look forward to hearing from you soon.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Disclaimer&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Please note, you will be contacted by email throughout the recruitment process, so please check your emails, including your junk/spam regularly. We regret we cannot contact everyone who is not selected for an interview, therefore if you do not hear from us within 21 days after submitting your application, please assume you have not been successful on this occasion&lt;/p&gt;\n&lt;p&gt;&lt;span&gt; &lt;/span&gt;&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "name": "NHS Professionals - Non-Clinical", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121070"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Stoke Mandeville Hospital", "postalCode": "HP21 8AL"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7983", "longitude": "-.802734"}}, "title": "PFI &amp; FACILITIES CONTRACTS MANAGEMENT ADMINISTRATOR", "url": "https://www.jobs.nhs.uk/xi/vacancy/916258208", "validThrough": "2020-11-19T23:59:59+0000"}