{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "58558", "minValue": "52643", "unitText": "YEAR", "value": "£52,643 - £58,558 per annum inclusive"}}, "datePosted": "2020-10-26T13:17:07+0000", "description": "&lt;p&gt;&lt;strong&gt;UCLH NHS Foundation Trust&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Radiotherapy/Proton Beam Therapy Department&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Band 8A Radiographer&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Research and Development Specialist Therapeutic Radiographer&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;2.0 WTE permanent&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Cancer Research UK (CRUK) have awarded funding to the CRUK City of London (CoL) Centre to create a CRUK Radiation Research Unit (RRU). The unit will feature an ambitious research programme for radiation oncology and radiation biology called RadNet. This network, is CRUK’s largest ever investment in radiotherapy research, is aimed to accelerate the development of advanced radiotherapy techniques, challenging the boundaries of this mainstay treatment through world-first exploratory projects.&lt;/p&gt;\n&lt;p&gt;The Radiotherapy and Proton Beam Therapy (PBT) departments, in academic partnership with UCL, have an exciting opportunity for two Research and Development Specialist Therapeutic Radiographer posts. The successful post holders will be at the forefront of cutting edge research and technological developments across the departments. In addition, a requirement of each post is to undertake a UCL postgraduate doctorate which will be funded by the University.&lt;/p&gt;\n&lt;p&gt;The post holders will lead research and development in key areas including motion management, advanced imaging, including functional imaging, and adaptive techniques across the Radiotherapy and PBT services. It will be the responsibility of the post holders to lead on site-specific research and development as part of the academic collaboration with UCL. They will be required to facilitate the opening of clinical studies and trials in accordance with ICH Good Clinical Practice Guidelines and Research Governance requirements and to obtain informed patient consent for clinical trials. The post holder will agree, document, communicate and implement policies, protocols, guidelines and procedures necessary for optimum participation in, and recruitment to, clinical trials within the remit of their area of chosen doctorate research and other trials. The roles involve the collation and analysis of research data and the dissemination of findings locally, nationally and internationally via presentations and publications.&lt;/p&gt;\n&lt;p&gt;UCLH and UCL are seeking committed individuals with the energy and focus to continue building on the existing service of excellence and deliver the projects to completion.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;UCLH Cancer&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Cancer care is one of the top three strategic priorities for UCLH. Our vision is to become Europe’s premier Cancer centre. An ambitious programme of transformation and investment underpins this vision. Highlights include the centralisation of complex care across north and east London to UCLH encompassing haemato-oncology, urology, head &amp; neck, neuro-oncology and upper GI, and building a new hospital containing 135 haematology beds, 10 theatres, leading edge imaging and the nationally commissioned PBT Service.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Department overview&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;UCLH is situated in the Heart of London’s west end with easy access by all forms of public transport.&lt;/p&gt;\n&lt;p&gt;The radiotherapy department delivers radiotherapy services for a broad spectrum of cancers which include a wide range of common cancers as well as specialist treatments including a paediatric and adolescent workload, brachytherapy and molecular targeted therapies workload, total body irradiation and sarcoma radiotherapy. The department is delivering SABR through the commissioning through evaluation programme and currently mentoring 3 hospitals as part of the NHSE national SABR roll-out programme; as well as cranial SRT. The service is accessed by 2400 new patients per year. The Radiotherapy department has 4 Varian Truebeams, a Siemens CT-scanner in pre-treatment, radiotherapy imaging also takes place in the hospital MRI and PET-CT suites. The department additionally boasts a comprehensive brachytherapy theatre suite and a Gulmay skin unit, as well as an adult and paediatric and adolescent molecular targeted therapy service in conjunction with the nuclear medicine department.&lt;/p&gt;\n&lt;p&gt;UCLH has been designated as one of two national PBT centres for the UK. The PBT department is situated in the new Grafton Way Building and is equipped with four Varian Probeam gantries and a pre-treatment suite consisting of a Spectral CT scanner and a 1.5T MRI scanner. Once fully established, this service will treat up to 750 NHS patients and up to 250 privately funded patients a year. The department will focus on the treatment of CNS tumours, head and neck cancers and spinal/pelvic sarcomas. Paediatrics, and teenage and young adults, will make up approximately one third of the patient cohort. Commissioning and training are currently taking place in the centre and there will be a gradual ramp up of the PBT service in 2021.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Want to know more? Please feel free to contact:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Nazima Haji, Radiotherapy Services Manager/ Laura Allington, Operational Lead for Proton Beam Therapy&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;e-mail:nazima.haji1@nhs.net/l.allington@nhs.net &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Telephone 07950884024/07506737778&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University College London Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120731"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "UCLH, London", "postalCode": "NW1 2PG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5257", "longitude": "-.13737"}}, "title": "Research and Development Specialist Therapeutic Radiographer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916242636", "validThrough": "2020-11-23T23:59:59+0000"}