{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "62001", "minValue": "53168", "unitText": "YEAR", "value": "£53,168 - £62,001 per annum"}}, "datePosted": "2020-10-23T10:31:52+0100", "description": "&lt;p&gt;An opportunity has arisen for a System Delivery Manger for Greater Manchester, working in the Planning and Assurance Team within the Performance and Improvement Directorate in the North West of England. The post holder will work closely with regional, and local teams to support the ambitious programme of work set out in the annual operational plans and The Long Term Plan for the NHS over the next five to ten years.&lt;/p&gt;\n&lt;p&gt;The purpose of the Performance and Improvement (P&amp;I) team is to lead on operational planning, to monitor performance/assurance against annual operating plans and delivery of NHS constitutional standards. The team also supports providers and systems to optimise their overall performance, to reduce unwarranted clinical variation and to provide assurance as to the most effective and efficient use of resources across the health service.&lt;/p&gt;\n&lt;p&gt;A team of four System Delivery Managers will work across the North West Region, however this post will be focused on the delivery of effective healthcare services within Greater Manchester, working closely with the NHS providers (with and through the provider federation board) as well as linking to the Greater Manchester Health and Social Care Partnership. The role will work with the Head of System Delivery for Greater Manchester to support the system, deliver improvements to support constitutional standards.&lt;/p&gt;\n&lt;p&gt;The postholder will be responsible for the delivery of an effective annual operational and strategic planning process for the providers across the locality and contributing positively to a regional position, avoiding duplication within a streamlined single process.&lt;br /&gt;The postholder will be also focus on the performance management and assurance of the locality within the region as a whole, as well as all of the constituent organisations within the locality, identifying inequalities of care provision in systems and supporting the reduction of those inequalities.&lt;/p&gt;\n&lt;p&gt;The postholder will support the development and refining of current assurance processes. The postholder will be part of the directorate’s locality presence, supporting an effective system planning process and providing assurance of system delivery.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;We would particularly welcome applications from people with protected characteristics and those from a BAME background who are under-represented in our workforce.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;We are also open to considering all types of flexible working arrangements. All roles are currently working virtually until 31st December 2020.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Iain Cameron,Head of System Delivery; iain.cameron@nhs.net or 07710114851&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/126694.png", "name": "NHS England and NHS Improvement", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126694"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Manchester Piccadilly Place, Manchester", "postalCode": "M1 3BN"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4777", "longitude": "-2.23275"}}, "title": "System Delivery Manager GM", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240061", "validThrough": "2020-11-08T23:59:59+0000"}