{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 Per Annum, Pro Rata"}}, "datePosted": "2020-11-04T14:46:38+0000", "description": "&lt;p&gt;&lt;strong&gt;Come along and join our Renal Dialysis Unit team at Royal Preston hospital!&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Our specialty makes us exciting, ambitious and forward-thinking and we are looking for enthusiastic and motivated individuals to join our nursing team.&lt;/p&gt;\n&lt;p&gt;The renal unit at Preston is part a large renal directorate which delivers haemodialysis to our patients with established renal failure throughout Lancashire and South Cumbria. We are devoted to continually improving the quality of care delivered and enhancing the patients’ experience which includes delivering holistic care by our specialist nurses; such as, the anaemia team, the vascular team, the transplant team, the dialysis adequacy nurse and the kidney choices team.&lt;/p&gt;\n&lt;p&gt;In return for commitment and dedication we offer a comprehensive preceptorship/development package and the opportunities to learn and develop nursing skills to support renal patients with chronic renal failure and acute and complex conditions. Furthermore we will provide:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;SUPPORTIVE ENVIRONMENT&lt;/strong&gt; – where individual staff contribution is recognised&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;FAMILY FRIENDLY POLICIES&lt;/strong&gt; - flexible working, child care facilities&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;OPPORTUNITIES FOR DEVELOPMENT AND TRAINING&lt;/strong&gt; - internal/external courses&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;This is a great opportunity to join our clinical team to create a positive and motivating environment within our trust. Come and join our team in this exciting time of change as we pride ourselves, our staff and our services on excellence.&lt;/p&gt;\n&lt;p&gt;Don’t be put off if you do not have haemodialysis experience; we have clinical competencies that can be worked through when you start with us and are trained.&lt;/p&gt;\n&lt;p&gt;If you are highly motivated, wish to learn new skills and be part of a team that delivers an excellent quality service then please apply today.&lt;/p&gt;\n&lt;p&gt;Interview Date: TBC&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameChristina McCroneJob titleUnit ManagerEmail addressChristina.McCrone@lthtr.nhs.ukTelephone number01772522755&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Lancashire Teaching Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121125"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Preston, Preston", "postalCode": "PR2 9HT"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.7909", "longitude": "-2.70449"}}, "title": "Staff Nurse - Renal Dialysis", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256292", "validThrough": "2020-11-18T23:59:59+0000"}