{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-10-28T12:31:21+0000", "description": "&lt;p&gt;&lt;strong&gt;&lt;em&gt;Band 7 Clinical Psychologist wanted in specialist community MDT for adults affected by a Learning Disability in Oxford area. Requests for part-time working and job shares will be considered.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for a committed and enthusiastic person to join a friendly and supportive community team for people with learning disabilities, based in Oxford.&lt;/p&gt;\n&lt;p&gt;In this role, you will be in a position to offer a range of psychological interventions and assessments with service users, their family, and professional support networks. The work will appeal to psychologists who enjoy being creative, adapting approaches, and engaging a range of other agencies and services – working with big picture as well as the details of what helps people to thrive.&lt;/p&gt;\n&lt;p&gt;The psychology team in the Oxford LDT comprises three qualified psychologists. We use a range of therapeutic approaches, and between us cover various special interests. You’d also be part of the larger group of psychologists covering LD services in Oxon. Psychologists are well regarded and valued within the MDT, with lots of opportunities for joint working. Involvement in service development work is also encouraged.&lt;/p&gt;\n&lt;p&gt;The psychology team have long-standing links with the University of Oxford Clinical Psychology Doctorate course, and we routinely have trainees on placement. We also have support from psychology assistants in the team. So there will be opportunities to take on supervisory roles. We support a range of training opportunities and ongoing professional development through appraisal and regular clinical, professional and management supervision.&lt;/p&gt;\n&lt;p&gt;Own car or access to alternative travel for business use is essential.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Dr Judith Mann, Principal Clinical Psychologist, on 07827-983115 or email judith.mann@oxfordhealth.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Oxford Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122233"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Oxford", "postalCode": "OX3 7JH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.7435", "longitude": "-1.19866"}}, "title": "Clinical Psychologist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916246599", "validThrough": "2020-11-23T23:59:59+0000"}