{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 pa pro rata"}}, "datePosted": "2020-10-27T17:00:54+0000", "description": "&lt;p&gt;Part and Full time including rotation to night duty&lt;/p&gt;\n&lt;p&gt;Long Day Shifts also offered.&lt;/p&gt;\n&lt;p&gt;This is an exciting time for Northamptonshire Community Hospitals as we continue to widen our provision of care to enable care closer to home for patients. This includes providing step up and step down facilities to avoid acute hospital admissions and facilitate early discharge.&lt;/p&gt;\n&lt;p&gt;There is the opportunity to work at the ward based at Danetre inpatient unit specialising in rehabilitation, sub acute care, palliative care beds and step up from the Community preventing acute hospital admissions&lt;/p&gt;\n&lt;p&gt;If you are a newly qualified General Nurse looking for the right experience to consolidate your learning or an experienced nurse who would like to further develop their skills and management abilities in a more nurse led unit then we would like to hear from you.&lt;/p&gt;\n&lt;p&gt;The opportunity is also provided to facilitate rotation to our Trusts community based District Nurse and Intermediate Care Teams and our Hospices to advance learning and skill development opportunities.&lt;/p&gt;\n&lt;p&gt;Applications from experienced RMNs will also be welcomed as we strive to optimise the rehabilitation environment for our patients who have physical care needs but also underlying mental health needs such as dementia or high psychological care needs post brain injury trauma.&lt;/p&gt;\n&lt;p&gt;Multi-disciplinary working is key on all of the wards and individuals are required to be highly motivated, forward thinking with excellent communication and interpersonal skills. Good literacy and IT skills are essential as the units maintain electronic patient records.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;In addition to the benefits offered under the NHS terms and conditions of service, this post additionally attracts an incentive of £3000 pro rata for the successful applicant/s paid over the first 12 months of employment. Please refer to the attached FAQ document or contact the Recruitment team for further information. Please note incentive payments are not applicable to existing NHFT substantive staff. Terms and conditions apply. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameVanessa CrossJob titlepractice and service development facilitatorEmail addressvanessa.cross@nhft.nhs.ukAdditional contact information&lt;/p&gt;\n&lt;p&gt;For more information please contact Vanessa Cross: Practice and Service Development Facilitator for the Community Hospitals on &lt;span&gt;vanessa.cross@nhft.nhs.uk&lt;/span&gt; or susan.lee@nhft.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Northamptonshire Healthcare NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121219"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Danetre hospital, Daventry", "postalCode": "NN11 4DY"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.2525", "longitude": "-1.16034"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916245514", "validThrough": "2020-11-10T23:59:59+0000"}