{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-10-26T15:46:46+0000", "description": "&lt;p&gt;&lt;strong&gt;Job title&lt;/strong&gt;: Clinical Dietitian&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Employer: &lt;/strong&gt;Tameside and Glossop Integrated Care NHS Foundation Trust&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Department: &lt;/strong&gt;Community Dietitians&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location: &lt;/strong&gt;&lt;strong&gt;Greater Manchester&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An opportunity has arisen for a dietitian who wishes to gain experience with a broad range of patients in different clinical settings, making this an ideal post for maintaining skills in both a ward and community environment.&lt;/p&gt;\n&lt;p&gt;We are looking for a motivated and enthusiastic Dietitian to join our community team&lt;/p&gt;\n&lt;p&gt;The post has a varied clinical caseload with patients in a range of locations including clinics (virtual currently), patients own homes, inpatient intermediate care and nursing homes and you will support the acute dietitians as/if needed.&lt;/p&gt;\n&lt;p&gt;You will offer face to face, telephone and virtual assessments to meet the patient need&lt;/p&gt;\n&lt;p&gt;You will have the opportunity to gain a broad practical experience by seeing patients with a range of medical conditions including gastrointestinal conditions, neurological conditions, cancers, dysphagia, dementia, and diabetes.&lt;/p&gt;\n&lt;p&gt;You will be interested in oral nutritional support and will support the team with appropriate prescribing initiatives. You will have the opportunity to gain tube feeding experience for patients on the intermediate care unit&lt;/p&gt;\n&lt;p&gt;Quality improvement initiatives are welcomed in the department. You would be encouraged and supported in considering improved and more effective ways of working.&lt;/p&gt;\n&lt;p&gt;We have strong links to the acute hospital Dietitian team and work closely with other members of the MDT.&lt;/p&gt;\n&lt;p&gt;You will be actively involved in the training of student dietitians from Chester University during their placements .&lt;/p&gt;\n&lt;p&gt;You will participate in patient education e.g. cardiac/pulmonary rehabilitation as needed&lt;/p&gt;\n&lt;p&gt;If successful you will join a friendly team with 7 dietitians, a dietetic support worker and clerical support based within easy access of Manchester and the peak district&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;You will require a full driving licence and access to a car for work &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;If you want to be part of a friendly, sociable department, which is committed to high quality Dietetic care we look forward to hearing from you.&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;For further details / informal visits contact:&lt;br /&gt;&lt;br /&gt;&lt;/strong&gt;&lt;/span&gt;Clare Berry - Community Dietetics Lead &lt;br /&gt;clare.berry@tgh.nhs.uk 07796958796&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Tameside and Glossop Integrated Care NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121286"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Community, Greater Manchester", "postalCode": "SK14 1NG"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4495", "longitude": "-2.07708"}}, "title": "Clinical Dietitian (Community)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916243218", "validThrough": "2020-11-08T23:59:59+0000"}