{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "43307", "minValue": "33660", "unitText": "YEAR", "value": "£33,660 - £43,307 per annum inclusive of HCAS"}}, "datePosted": "2020-10-27T12:46:07+0000", "description": "&lt;p&gt;The Royal Free Hospital is looking to recruit band 6 staff nurses to join our Critical Care Team on a new 8 bedded High Dependency Unit (HDU). The HDU will admit adult surgical patients from a wide variety of specialities including hepato-biliary, vascular and colorectal.&lt;/p&gt;\n&lt;p&gt;We are looking to appoint enthusiastic and motivated Band 6 Registered Nurses who are either at the start of developing their leadership skills post HDU/ICU course or have band 6 experience in HDU / ICU and are looking for and exciting new challenge.&lt;/p&gt;\n&lt;p&gt;We are committed to developing and supporting a modern career framework for our Nurses in HDU / Critical Care, you will be supported through every step of your critical care career pathway by our Clinical Practice education team and senior team, In order to equip you with knowledge, skills and attitude to become a competent and confident Band 6 HDU / Critical Care Registered Nurse.&lt;/p&gt;\n&lt;p&gt;We will provide you with:&lt;/p&gt;\n&lt;p&gt;* Supernumerary orientation programme that will be individualised to your professional needs.&lt;/p&gt;\n&lt;p&gt;* ILS course&lt;/p&gt;\n&lt;p&gt;* In house leadership programme and support you to attend various NHS Leadership Courses.&lt;/p&gt;\n&lt;p&gt;Applicants must be NMC Registered RGN, with a critical care course, relevant HDU / ICU experience, experience in teaching and mentoring, excellent communication skills and able to manage total patient care and work independently.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;The Royal Free Hospital also has a 34 bedded Intensive Care Unit which admits in excess of 1700 patients per year. Career development opportunities include the potential to rotate between both ICU and HDU.&lt;/p&gt;\n&lt;p&gt;We support flexible working and part time working, with the whole department offer self-rostering via our electronic rota to ensure a healthy work life balance and Joy at work.&lt;/p&gt;\n&lt;p&gt;Please note that this vacancy may close prior to the advertised closing date, subject to the high number of applicants anticipated.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Deny Chacko Matron (Royal Free HDU) deny.chacko@nhs.net&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Mohammed Senior Matron (Royal Free HDU) Noor mohammad.noor@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120624.jpg", "name": "Royal Free London NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120624"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Royal Free Site, Hampstead", "postalCode": "NW3 2QG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5532", "longitude": "-.165298"}}, "title": "Band 6 Staff Nurse - High Dependency Unit", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244577", "validThrough": "2020-11-10T23:59:59+0000"}