{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "20725", "minValue": "20725", "unitText": "YEAR", "value": "£20,725 plus London Weighting"}}, "datePosted": "2020-11-05T10:57:37+0000", "description": "&lt;p&gt;&lt;strong&gt;Job title: &lt;/strong&gt;Administrator to Chief Executive &amp; Team Coordinator – NHS Clinical Commissioners&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location: &lt;/strong&gt;London (home based initially due to Covid-19)&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Role: &lt;/strong&gt;Permanent&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary&lt;/strong&gt;: £20,725 plus £4,000 London weighting allowance&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The person&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Do you have excellent interpersonal skills?&lt;/li&gt;\n&lt;li&gt;Are you able to foster good working relationships when dealing with internal and external customers and stakeholders, including senior individuals.&lt;/li&gt;\n&lt;li&gt;Does this sound like you?&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;We would love to hear from you if you:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;are flexible and proactive&lt;/li&gt;\n&lt;li&gt;able to prioritise work, sometimes at short notice depending on the needs of the organisation&lt;/li&gt;\n&lt;li&gt;have great communication skills&lt;/li&gt;\n&lt;li&gt;have excellent computer skills&lt;/li&gt;\n&lt;li&gt;enjoy being part of a passionate and successful team&lt;/li&gt;\n&lt;li&gt;are willing to go the extra mile.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;The role&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Based in our London office the Administrator to Chief Executive &amp; Team Coordinator provides effective and comprehensive administrative support to the NHSCC team and acts as the first point of contact for the Chief Executive.&lt;/p&gt;\n&lt;p&gt;The role will include some contact with Board members and on a regular basis with their support staff. The post-holder will need to have excellent interpersonal skills and be able to promote a positive image of the organisation and foster good working relationships when dealing with internal and external customers and stakeholders, including senior individuals.&lt;/p&gt;\n&lt;p&gt;The post-holder will be supporting a small team, and as such may be expected to adapt their approach to the specific needs of the individuals that they are supporting.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The organisation&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;NHS Clinical Commissioners (NHSCC), the independent membership body of Clinical Commissioning Groups (CCGs), is looking for a proactive individual with excellent organisational skills and an ability to prioritise a constantly changing workload within a busy office.&lt;/p&gt;\n&lt;p&gt;Founded in 2012, NHSCC is a rapidly developing organisation which now has 91% of all CCGs in membership. As part of the organisation’s ongoing development, NHSCC has a democratically elected board which makes it able to represent CCGs effectively on the issues that matter most to them.&lt;/p&gt;\n&lt;p&gt;You will receive an excellent benefits package, including 30 days annual leave, pension scheme, flexible working, salary sacrifice schemes and travel season ticket loans.&lt;/p&gt;\n&lt;p&gt;Equality, diversity and inclusion is at the heart of the NHS Confederation and we are actively seeking to increase diversity in our workforce through a process that is fair, open, consistent, and free from discrimination. We welcome all applications from all backgrounds and encourage applications from our BAME communities, our LGBTQ+ communities and from individuals who identify as being disabled, as well as all other protected characteristics. We are committed to building a diverse and inclusive company culture where all employees feel valued, respected, and acknowledged.&lt;/p&gt;\n&lt;p&gt;The NHS Confederation is committed to being a flexible employer. We understand the value and benefit to our employees being able to work flexibly to respond to changing circumstances and we want to ensure we do as much as possible to help support a work life balance and take care of employee health and wellbeing.&lt;/p&gt;\n&lt;p&gt;The NHS Confederation is a membership body that brings together and speaks on behalf of all organisation’s that plan, commission and provide NHS services with our members drawn from every part of the health and care system. At the NHS Confederation we are passionate about our values (voice, openness, integrity, challenge, empowerment and respect). These are supported by a set of behaviours that demonstrate the attitudes and approach we take to work.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;How to apply&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;To apply please read the job description and submit your application.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Application deadline&lt;/strong&gt;: 13th November 2020 (midnight)&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview date&lt;/strong&gt;: 18th November 2020&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "NHS Confederation", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122712"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "London", "postalCode": "SW1H 0DB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5", "longitude": "-.133449"}}, "title": "Administrator to Chief Executive &amp; Team Coordinator", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257328", "validThrough": "2020-11-13T23:59:59+0000"}