{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "36738", "minValue": "29888", "unitText": "YEAR", "value": "£29,888 - £36,738 per annum"}}, "datePosted": "2020-10-27T12:05:04+0000", "description": "&lt;h2&gt;&lt;strong&gt;Nurse Opportunities (Eqv. to Band 5)&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;strong&gt;Salary: £29,888 - £36,738per annum(dependent onexperience).&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Salary includes LondonWeighting and is exclusive of shift enhancements, which are also applicable.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Full Time positions available (open to discussion). &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Why not make a great decision to join our friendly, fun, dynamic and supportive team where you have time to provide high quality care to a small caseload of children.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We are looking for enthusiastic and passionate Children’s Nurses with varying experience to join our Specialist Centre rated as Outstanding in care by CQC.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Our ambitionis for all children with brain injury and neurodisability to have the opportunity to live the best life possible.This is a chance to develop your skills where you will provide an outstanding service to the children and families we support.&lt;/p&gt;\n&lt;p&gt;Operating within our existing shift patterns, which includes rotational day, evening and night shifts, you will work within a Multidisciplinary Team providing a high quality of service to children/young people and their families, ensuring their care, education &amp; therapy needs are met.&lt;/p&gt;\n&lt;p&gt;You will be based in any one of our unique services: Intensive Rehabilitation, Step down from Hospital to Home, Continuing Care, Long-Term Ventilation and Short Breaks or in one of our Residential Houses attached to The Children’s Trust School.&lt;/p&gt;\n&lt;p&gt;This is a great opportunity to develop a career where you make a significant and lasting difference to the lives of thousands of children and families.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For an informal discussion please contact the People Operations Team who will be more than happy to help you on 01737 365 880 or email recruitment@thechildrenstrust.org.uk.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please note that our early shift commences at 7amand you will need to be available to fulfil this shift in order to be successfully shortlisted.Please also note public transport is limited for certain shifts and this will needto be considered when applying.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing Date: Sunday, 22 November 2020.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Interview Date(s): Every Tuesday and Thursday mornings.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Strictly no agencies please.&lt;/span&gt;&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Children’s Trust is the UK’s leading charity for children with acquired brain injury, providing expert rehabilitation, education, therapy and care at our national specialist centre in Tadworth, and to children and their families across the UK, via our Brain Injury Community Service.&lt;/p&gt;\n&lt;p&gt;Boasting a beautiful 24-acre site in Surrey, we are located just outside of London, close to the M25 (accessible via Junction 8, A217 to Tadworth) and easily accessible via National Rail, by way of: Clapham Junction, Sutton and Epsom.&lt;/p&gt;\n&lt;p&gt;The work we do is highly rewarding, and in addition to an attractive salary, &lt;strong&gt;we offer a&lt;/strong&gt; &lt;strong&gt;valuable range of benefits, including&lt;/strong&gt;: &lt;strong&gt;free on-site parking&lt;/strong&gt;; &lt;strong&gt;subsidised cafeteria&lt;/strong&gt;; &lt;strong&gt;on-site staff accommodation&lt;/strong&gt; (subject to availability); &lt;strong&gt;the ability to &lt;/strong&gt;&lt;strong&gt;retain your NHS pension &lt;/strong&gt;(where applicable) or the opportunity to join an alternative scheme; and the opportunity to develop and implement your expertise in an environment that is as unusual in its beautiful historic nature, as it is unique in its state-of-the-art facilities.&lt;/p&gt;\n&lt;p&gt;The Children’s Trust is fully committed to protecting children and young people. All posts at The Children&#39;s Trust are subject to an enhanced DBS check. If you are applying to The Children&#39;s Trust, and are already registered with the DBS update service, this will speed up the recruitment process significantly. We are an equal opportunities employer, and welcome applications from all suitably qualified candidates, regardless of their race, sex, disabilities, religion/beliefs, sexual orientation, or age.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "The Children's Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=128594"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Tadworth, Surrey", "postalCode": "KT20 5RU"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.295", "longitude": "-.226042"}}, "title": "Registered Nurse Opportunities (Eqv. to Band 5)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244403", "validThrough": "2020-11-22T23:59:59+0000"}