{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "76751", "minValue": "41158", "unitText": "YEAR", "value": "£41,158.00-£76,751.00 Per Annum"}}, "datePosted": "2020-10-22T14:31:56+0100", "description": "&lt;p&gt;&lt;strong&gt; Specialty Doctors in Emergency Medicine (4 posts)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Applications are invited for these new Specialty Doctor posts at this Trust. This is an exciting opportunity to join an excellent Emergency Department team in a Trust that genuinely sees Emergency Medicine as a major priority. We have a strong track record in terms of the 4hr ED Performance Metric, and were rated as “Outstanding” for Emergency Care Leadership by the CQC (and “Good” in all other aspects of Emergency Care). The Department has an up to date Resus area and plans are in progress for a complete re-design of the rest of the department to provide a modern, purpose-built ED fit for the future. We have an award-winning Acute Medicine and Ambulatory Care unit situated right next to the ED, with very good relations between the Emergency and Acute Medicine consultants.&lt;/p&gt;\n&lt;p&gt;The existing team of 8 WTE consultants and 15 Specialty Doctors/Registrars is friendly and dynamic and these posts are part of a planned major expansion in senior Medical Staff numbers. The aim is to consistently provide 2 Senior doctors on duty overnight (on a 1 in 8 basis), an acceptable weekend working frequency (1 in 4) and a good depth of senior cover at all other times. This expansion will also enable us to ensure regular secondments to other relevant specialties for those Specialty Doctors who wish to work towards CESR.&lt;/p&gt;\n&lt;p&gt;We are committed to helping you develop your career in whatever way you choose, and will provide full support for those wishing to go down the CESR path, for those who wish to develop a special interest, and for those who simply want a reasonable work-life balance in a very supportive department.&lt;/p&gt;\n&lt;p&gt;The Trust consistently performs highly on the GMC trainees’ survey, reflecting our commitment to providing a high quality training environment and looking after our specialty doctors and trainees as valued colleagues.&lt;/p&gt;\n&lt;p&gt;The Hospital is situated in a mainly rural area in one of the most open, picturesque, safe and unspoilt parts of the country, offering a range of inexpensive properties, good schools, easy access to the coast and an abundance of outdoor, sporting and recreational activities. &lt;br /&gt;The post will appeal to candidates who seek a high quality of life combined with a practical clinical role within a secure and well-run hospital distinguished by its supportive and friendly culture.&lt;/p&gt;\n&lt;p&gt;A relocation package is available.&lt;/p&gt;\n&lt;p&gt;To learn more about the Trust, please see our web site.&lt;/p&gt;\n&lt;p&gt;Someone recently described our hospital as a “hidden gem”. We certainly think it is. Come and see for yourself.&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;For an informal discussion or visit please contact: &lt;strong&gt;Dr Jim Crawfurd (Lead Consultant in Emergency Medicine 01493 452318).&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121320.jpg", "name": "James Paget University Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121320"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "James Paget University Hospital, Gorleston", "postalCode": "NR31 6LA"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5617", "longitude": "1.718"}}, "title": "Specialty Doctor/SAS in A&amp;E", "url": "https://www.jobs.nhs.uk/xi/vacancy/916238931", "validThrough": "2020-11-15T23:59:59+0000"}