{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "26450", "minValue": "26450", "unitText": "YEAR", "value": "£26,450 + Shift Enhancements"}}, "datePosted": "2020-10-26T10:16:48+0000", "description": "&lt;p&gt;&lt;strong&gt;St Andrew’s Healthcare&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Newly Qualified Nurses&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Northampton&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Are you ready to empower your nursing career?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Choosing your first nursing role is a difficult decision. We believe there’s nowhere better to start your career than St Andrew’s Healthcare. Here are seven reasons why.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ol&gt;\n&lt;li&gt;You’ll be coming to a world-class facility with its own teaching hospital and academic centre.&lt;/li&gt;\n&lt;li&gt;We’re a specialist charity that invests in innovative, patient-centric, holistic care.&lt;/li&gt;\n&lt;li&gt;Chance to be part of an expert multi-disciplinary team working on highly complex cases.&lt;/li&gt;\n&lt;li&gt;You will gain wide experience initially, then get to specialise in an area that interests you.&lt;/li&gt;\n&lt;li&gt;Expect to earn over &lt;strong&gt;£30,000&lt;/strong&gt; (including Shift enhancements) in your first year.&lt;/li&gt;\n&lt;li&gt;We offer a supportive preceptorship where you’re given a mentor to support you in your first 6 months&lt;/li&gt;\n&lt;li&gt;The cost of housing and living make Northampton a far more affordable place to live than major metropolitan centres – you can live a great lifestyle.&lt;/li&gt;\n&lt;/ol&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Career empowerment for Newly Qualified&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Your career journey will starts with a supportive preceptorship programme. Then you get to work in roles across different Nursing Integrated Practice Units (IPU’s) to broaden your experience and expertise.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Our Northampton Site houses all of ours IPU’s, including CAMHS, Learning Disabilities (LD), Autistic Spectrum Disorder (ASD), Psychiatric Intensive Care Unit (PICU), Men’s, Women’s, Dementia &amp; Huntington’s disease and Brain Injury.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;This allows you to specialise in the service of your interest and choice. That might be in outpatient, inpatient or rehabilitative care, or in supporting services such as nutrition, social work or behavioural health, patient education and engagement.&lt;/p&gt;\n&lt;p&gt;We also uniquely offer a full DBT programme, opportunities to attend events and training, and life enhancing skills.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Up to £2,500 support for your move to Northampton.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Our Northampton site is a world-class facility set in beautiful grounds near the centre of Northampton. The transport links mean the site is commutable from many parts of the Midlands. The career opportunities here make it well worth making the move if you currently live further afield.&lt;/p&gt;\n&lt;p&gt;Depending on your current location, we offer relocation support of up to &lt;strong&gt;£2,500&lt;/strong&gt;. There is lots of guidance and advice available too. We’ve had many nurses relocate to join us - Northampton offers affordable housing and a good choice of properties and areas to live in. You can definitely enjoy a good quality of life here – Northampton is one of the UK’s largest towns with lots to offer in terms of shops, restaurants, bars, sport, leisure, arts, culture, and plenty of green space on the doorstep.&lt;/p&gt;\n&lt;p&gt;Apply today and empower your nursing career…..&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/129496.jpg", "name": "St Andrew’s Healthcare", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=129496"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Northampton", "postalCode": "NN1 5DG"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.2382", "longitude": "-.873687"}}, "title": "Student Nurses / Newly Qualified Nurses - Mental Health and LD", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241988", "validThrough": "2020-11-29T23:59:59+0000"}