{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum pro rata"}}, "datePosted": "2020-11-02T15:32:19+0000", "description": "&lt;p&gt;The Clatterbridge Cancer Centre NHS Foundation Trust is one of the UK’s leading providers of non-surgical cancer treatment, caring for a population of 2.4 million people across Cheshire &amp; Merseyside, North Wales, the Isle of Man and parts of Lancashire.&lt;/p&gt;\n&lt;p&gt;In June 2020 we expanded our expert services into central Liverpool when we opened a brand new specialist cancer hospital. Based on the same thriving research and healthcare campus as the University of Liverpool and the Royal Liverpool University Hospital, the new hospital will ensure every patient has access to the most advanced treatments and clinical trials.&lt;/p&gt;\n&lt;p&gt;Together, working across all sites and operating a practised network of chemotherapy clinics we deliver a comprehensive range of inpatient care, advanced radiotherapy, chemotherapy and other systemic anti-cancer therapies including gene therapies and immunotherapies. We are also the only facility in the UK providing low-energy proton beam therapy to treat rare eye cancers and host the region’s Teenage and Young Adult Unit, (supported by the Teenage Cancer Trust).&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for an enthusiastic and highly motivated individual to work as a Staff Nurse rotating within the &lt;strong&gt; Day Care Department&lt;/strong&gt; &lt;strong&gt;and Chemotherapy outpatient service. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking to recruit individuals to undertake this role and be committed, motivated and compassionate, with good organisational and communication skills, to complement the existing team.&lt;/p&gt;\n&lt;p&gt;You will be encouraged to expand and develop your knowledge, skills and competencies within a supportive and friendly environment. Whilst haemato-oncology/general oncology experience is not necessary, there must be a willingness to learn about the specialty. Integrity, vision and a desire to take the service forward and expand the nursing role are also a requirement. The job is challenging and interesting and the many different protocols means treatment plans are varied and there is a lot to learn, making this an exciting place to work. &lt;strong&gt;Hours are fixed at 08:00 to 18:00 over 6 days. There are 2 posts available 1 full time 37.5 hours and 1 part time 28.5 hour post.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We&#39;re here to deliver the best cancer care to the people we serve and we’re looking for applications from those who share that commitment and our values: Putting people first; Achieving excellence; Passionate about what we do; Always improving our care; and Looking to the future.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;If you want to be part of a fantastic team and help support the Trust with our vision for providing the best cancer care in the country, then we want to hear from you.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;br /&gt;The Clatterbridge Cancer Centre NHS Foundation Trust &lt;/em&gt;&lt;em&gt;is committed to safeguarding and promoting the welfare of children, young people and adults and expects all staff and volunteers to share this commitment.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;We take an active responsibility for &lt;/em&gt;&lt;em&gt;ensuring systems, policies and processes are in place to safeguard children, young people and adults. We support the national and local safeguarding agenda, including local arrangements for the protection of children young person and adults at risk.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;This job is unlikely to attract a Tier 2 Certificate of Sponsorship (formerly a work permit). Applications from candidates who require Tier 2 immigration status to work in the UK may not be considered if there are a sufficient number of other suitable candidates. To apply for a Tier 2 Certificate of Sponsorship, employers need to demonstrate that they are unable to recruit a resident worker before recruiting an individual overseas. &lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameEmma AnsteyJob titleWard ManagerEmail addressemma.anstey@nhs.netTelephone number0151 318 8561Additional contact information&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Ward Manager- Emma Anstey&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;via email: emma.anstey@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone: 0151 318 8561&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121459.png", "name": "The Clatterbridge Cancer Centre NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121459"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Clatterbridge Cancer Centre - Liverpool, Liverpool", "postalCode": "L7 8XP"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4095", "longitude": "-2.96481"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252639", "validThrough": "2020-11-09T23:59:59+0000"}