{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "24907", "minValue": "24907", "unitText": "YEAR", "value": "From £24,907 per annum"}}, "datePosted": "2020-11-06T13:30:56+0000", "description": "&lt;p&gt;An excellent opportunity for Registered Learning Disability Nurse/Registered Mental Health Nurses to join Secure Service Medium Secure Service for men with learning disabilities and/or autism spectrum disorders who have a forensic history. This is an exciting career opportunity for Registered Learning Disability &amp; Mental Health Nurses to join an already hard working and committed team, and who are up for the challenge of a different type of service, developing strategies and pathways.&lt;/p&gt;\n&lt;p&gt;Cary ward is within Fromeside medium secure unit. The service will links in with the Forensic, Intellectual, Neuropsychiatric and Developmental Disorders (FIND) Team, which provides gatekeeping, case management and consultation regarding adults with learning disabilities and/or autism spectrum disorders who may require secure services, and with the new specialist Forensic Outreach and Liaison Service, which supports adults with learning disabilities and/or autism spectrum services to move out of secure services and safely reintegrate into the community.&lt;/p&gt;\n&lt;p&gt;This is an exciting challenge in a secure setting and requires outward thinking and innovative approaches from our staff to deliver this, whilst remaining committed to maintaining safety and security.&lt;/p&gt;\n&lt;p&gt;All new staff will be actively supported to develop their skills within these settings and encouraged to be involved in service development projects that happen within the service.&lt;/p&gt;\n&lt;p&gt;This role is suitable for newly qualified and experienced nurses.&lt;/p&gt;\n&lt;p&gt;Service users will be involved with the recruitment process.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Dave McKendrick, Ward Manager&lt;/p&gt;\n&lt;p&gt;Email address david.mckendrick@nhs.net Telephone number0117 378 4054&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121159.jpg", "name": "Avon and Wiltshire Mental Health Partnership NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121159"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Bristol", "postalCode": "BS16 1EG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.485", "longitude": "-2.53971"}}, "title": "Band 5  Learning Disabilities &amp; Mental Health Nurses", "url": "https://www.jobs.nhs.uk/xi/vacancy/916259916", "validThrough": "2020-11-22T23:59:59+0000"}