{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 per annum pro rata"}}, "datePosted": "2020-10-19T11:09:56+0100", "description": "&lt;p&gt;&lt;strong&gt;This is an exciting opportunity for a band 6 nurse to join our friendly team on Fortescue Ward.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Fortescue ward specialises in the care of people living with Dementia, Frailty and long term conditions requiring management and rehabilitation, and is part of the Unscheduled Care Directorate.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Our aim is to promote and maintain independence in patients with a focus on “home first” as our priority. Successful applicants will have the opportunity to engage with the wider community and voluntary groups. We have a full time discharge coordinator and health and social care support to facilitate complex discharges.&lt;/p&gt;\n&lt;p&gt;We have 5 qualified mentors on the ward including 2 sign off mentors and actively encourage learners at whatever stage of their career. We are pleased to have 5 apprentices on the ward, 2 nursing associate students and student nurses. We also support workplace experience for college students and work shadowing days. The ward provides a strong opportunity for candidates who wish to develop their teaching and mentoring skills.&lt;/p&gt;\n&lt;p&gt;We also have an Activities Coordinator, and Fortescue ward works very closely with the Dementia Admiral Nurse. The Ward works closely with the wider multidisciplinary including therapists and volunteers who run an exercise group daily, and cream tea afternoon on a Tuesday.&lt;/p&gt;\n&lt;p&gt;We are proud of our low falls rate and use bay tagging and sensor mats to keep patients safe. We are also proud of the positive feedback from patients, visitors and patient surveys which is a credit to our team.&lt;/p&gt;\n&lt;p&gt;North Devon is a fantastic place to live and work and successful candidates will benefit from the supportive environment in a smaller Trust such as Northern Devon Healthcare Trust.&lt;/p&gt;\n&lt;p&gt;We are looking to recruit a nurse into a band 6 role who wishes to develop skills in ward management and leadership but also has a passion for enhancing the care of the older person and those with dementia. This is a fantastic opportunity to develop within the organisation and support will be given to attend events to widen your experience, including deputising in the ward manager&#39;s absence. Some experience of managing the acutely unwell patient is also desirable as we firmly believe that patients with dementia should not be moved to other areas when in hospital, and where possible they should remain on Fortescue ward.&lt;/p&gt;\n&lt;p&gt;We would welcome existing Band 6 post-holders or Band 5 post-holders wishing to develop into the Band 6 role. Please contact Rebecca Bennett, Clinical Matron, for further information.      &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Closing Date: 15/11/2020&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;**As this post is in a shortage occupation code it qualifies for the Trust’s Recommend a Friend Scheme, please find further information on the attached link**&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120959.jpg", "name": "Northern Devon Healthcare Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120959"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "NDDH", "postalCode": "EX31 4JB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.0922", "longitude": "-4.05116"}}, "title": "Senior Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916231966", "validThrough": "2020-11-15T23:59:59+0000"}