{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum (*Indicative)"}}, "datePosted": "2020-11-04T13:41:50+0000", "description": "&lt;p&gt;Are you an experienced operational level manager?  Are you looking for a new challenge or opportunity to use your skills in managing an essential support service team in the Ambulance Service?  This could be the role for you!&lt;/p&gt;\n&lt;p&gt;We are looking for a Stores Site Manager as a key member of a new stores management structure which has been developed in the Trust.&lt;/p&gt;\n&lt;p&gt;The work of the stores team has never been more in focus in supporting frontline colleagues in securing and helping the distribution of personal protective equipment, a range of consumables and other products and medicines.&lt;/p&gt;\n&lt;p&gt;This is an exciting time to join this small and friendly team, ahead of our preparations for increased support and activity during winter and as we prepare for the impact of EU exit.&lt;/p&gt;\n&lt;p&gt;The role will act as site manager, initially based at Chippenham Ambulance Station.  They will oversee the management of stock and operating arrangements in the current site.  The post holder will be instrumental in supporting the development of the Trust’s stock management system, liaising with Operations through the County Coordination Centres and overseeing the distribution of PPE and other stocks.&lt;/p&gt;\n&lt;p&gt;The post holder will also lead the relocation to a new facility in Corsham, early in 2021 and will become the as site responsible officer for the new premises.&lt;/p&gt;\n&lt;p&gt;If you think you are the right person for the role, but would like to find out more, please email jody.james@swast.nhs.uk to arrange a mutually convenient time and date for a discussion.&lt;/p&gt;\n&lt;p&gt;Applicants should note that interviews will take place on 26th and 27th November 2020.  It is anticipated that the interviews may take place through Skype.  Candidates should indicate at application if they require support to complete remote interviews.&lt;/p&gt;\n&lt;p&gt;This role is also available as a secondment opportunity.  &lt;/p&gt;\n&lt;p&gt;&lt;em&gt;*Please note that this role is currently going through the Job Evaluation process and advertised as indicative, and therefore may be subject to change.&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121045.png", "name": "South Western Ambulance Service NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121045"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Chippenham Ambulance Station (Relocation to Corsham in early 2021)", "postalCode": "SN15 5LN"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.4749", "longitude": "-2.12569"}}, "title": "Stores Site Manager", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256042", "validThrough": "2020-11-18T23:59:59+0000"}