{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "31500", "minValue": "26100", "unitText": "YEAR", "value": "£26,100. - £31,500. per annum inc of supplement"}}, "datePosted": "2020-11-04T11:26:08+0000", "description": "&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;St Luke&#39;s Hospice is an outstanding provider of expert palliative and end of life care. We are also a prominent and respected charity at the heart of the local community with a large range of specialist services to support patients, their families and friends, and a new build Hospice site shortly due to open in Thurrock.&lt;/p&gt;\n&lt;p&gt;This newly developed post offers a unique chance for a Registered Nurse to gain a broad range of experience in all of our Nursing services, working flexibly as needed and utilising and developing excellent clinical skills in a friendly, supportive environment where you can provide the highest standards of personalised care. Initially you will be based in our Hospice Community Services team, supporting our frailty and care home palliative support team.You will also have opportunity to work across a number of varied clinical departments, including the St. Luke’s Hospice Community Services and In Patient Unit.&lt;/p&gt;\n&lt;p&gt;Previous experience in palliative care and related study/courses is desirable, and a willingness to advance skills (with opportunities for personal and professional development) within a creative and unique environment is essential.&lt;/p&gt;\n&lt;p&gt;Our staff satisfaction and staff retention rates are both high and we also offer:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Funded Clinical Supervision&lt;/li&gt;\n&lt;li&gt;Variable shift pattern with flexibly to meet your needs&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Discounted gym membership&lt;/li&gt;\n&lt;li&gt;Home cooked staff meals cooked on site at subsidised rate.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Pension package, opportunity to continue in the NHS Pension if already a member.&lt;/li&gt;\n&lt;li&gt;27 days annual leave, in addition to public holidays&lt;/li&gt;\n&lt;li&gt;Excellent commitment to learning and development including external training&lt;/li&gt;\n&lt;li&gt;Active Staff Wellbeing programme&lt;/li&gt;\n&lt;/ul&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "St Luke's Hospice", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132494"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Basildon", "postalCode": "SS16 5NJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5613", "longitude": ".451789"}}, "title": "Registered Nurse Hospice Services", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255588", "validThrough": "2020-11-11T23:59:59+0000"}