{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 pa"}}, "datePosted": "2020-11-04T14:15:24+0000", "description": "&lt;p&gt;Anstey ward is offering a fantastic development opportunity for a motivated, forward thinking individual who is dedicated to providing excellent Nursing Care. This is an exciting opportunity to demonstrate your skills as a nurse who is focused on continually improving patient outcomes. We are looking for Band 5 nurses to cover all working patterns however we pride ourselves on flexibility and work life balance. Southern Health is passionate about training and development and we committed to deliver current evidence based practice.&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;If you are interested in working in a dynamic rehabilitation ward that focuses on promoting patient independence and holistic nursing care we want to hear from you. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;With the launch of Integrated Intermediate Care, Alton Community Hospital is focusing on new initiatives and aims to prevent acute hospital admissions. With increased patient acuity we are now able to offer IV therapy, enteral support and end of life care. This is an exciting opportunity to deliver more acute complex nursing care in the community setting.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;You will work closely with the wider MDT (Occupational Therapy, Physiotherapy, and Social Services) plus Community Care teams to provide the local population with seamless health care services.&lt;/p&gt;\n&lt;p&gt;Alton Community Hospital is a short drive away from Winchester, Basingstoke and Guildford and offers free parking. Alton has a direct train line to London so is a perfect commuter town.&lt;/p&gt;\n&lt;p&gt;If you are a newly qualified and experienced Band 5 nurse we would love to hear from you.&lt;/p&gt;\n&lt;p&gt;Informal visits are welcomed or please telephone to discuss what Anstey ward has to offer.&lt;/p&gt;\n&lt;p&gt;Follow us on Facebook and on Twitter:&lt;/p&gt;\n&lt;p&gt;facebook.com/SouthernHealthNHS&lt;/p&gt;\n&lt;p&gt;@Southern_NHSFT&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Southern Health NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120646"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Alton", "postalCode": "GU34 1RJ"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.14", "longitude": "-.989792"}}, "title": "Staff Nurse", "url": "https://www.jobs.nhs.uk/xi/vacancy/916256166", "validThrough": "2020-11-30T23:59:59+0000"}