{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "17163", "minValue": "16490", "unitText": "YEAR", "value": "£9.81 to £10.21 an hour"}}, "datePosted": "2020-11-02T14:29:16+0000", "description": "&lt;p&gt;Are you looking for a rewarding career in adult social care? Do you want to make a difference?&lt;/p&gt;\n&lt;p&gt;The Cambridgeshire County Council reablement team provides a life changing service to people by helping them to regain or attain as much independence as they can in their own homes.&lt;/p&gt;\n&lt;p&gt;Here’s what some of our service users have to say about our team:&lt;/p&gt;\n&lt;p&gt;‘Wish to send a sincere thank you to Cambridgeshire County Council Reablement Team for this excellent service, without it when I first got home from Addenbrookes I would have been a very different person, completely lost and sad.’&lt;/p&gt;\n&lt;p&gt;‘All of the carers that came in treated dad, with dignity and respect, they were encouraging and efficient. Their care has given dad some confidence back.’&lt;/p&gt;\n&lt;p&gt;‘I have nothing but praise for the attention and many many thank yous for the care I have received, from all who attended me. Initially they started as carers, and finished as very dear friends, who I cherished dearly.’&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;About the role:&lt;/p&gt;\n&lt;p&gt;Our reablement support workers help people regain their independence by motivating and inspiring people to re-learn daily skills and enhance their quality of life.&lt;/p&gt;\n&lt;p&gt;You will be fully trained to assist our service users to meet their care needs, which can range from motivational support to personal care.&lt;/p&gt;\n&lt;p&gt;You will work to individualised goal plans, with the aim of encouraging service users to do these things for themselves, wherever possible. We also promote and supply tech equipment to help people.&lt;/p&gt;\n&lt;p&gt;Not only will you make a positive difference to people’s lives, but you will also have the pleasure of seeing that change first hand.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;About you:&lt;/p&gt;\n&lt;p&gt;Whether you have years of experience in the care sector or just a caring attitude, we will help support you to reach your full potential by providing you with training, guidance and career development.&lt;/p&gt;\n&lt;p&gt;You will want to help people and have good communication skills.&lt;/p&gt;\n&lt;p&gt;The role involves travel across Cambridgeshire, so you must be a car driver, and have access to a vehicle.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Benefits:&lt;/p&gt;\n&lt;p&gt;We will support you to gain your Care Certificate and your Level 2 or 3 Diploma in Health and Social Care, as well as:&lt;br /&gt;• Variable hours and working patterns: This role is shift based and you can choose to work up to 35 hours, either on a flexible rota pattern or evening and/or weekends only. There are also opportunities for you to work additional hours.&lt;br /&gt;• Both permanent and 1 Year fixed term positions are available&lt;br /&gt;• Enhanced pay rates for weekends, evenings and bank holidays, up to double time.&lt;br /&gt;• Generous mileage allowance of 45p per mile (up to first 10,000 miles and then 25p per mile).&lt;br /&gt;• Up to 30 days’ annual leave entitlement, plus bank holidays (pro-rata) and subject to length of service.&lt;br /&gt;• Membership of the Local Government Pension Scheme.&lt;br /&gt;• Professional career development.&lt;br /&gt;• Excellent management support.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;Further Information:&lt;/p&gt;\n&lt;p&gt;Please bear in mind that a full job history is required and any gaps in employment will need to be clearly explained.&lt;/p&gt;\n&lt;p&gt;For further information please email Recruitment.CFA@cambridgeshire.gov.uk. Please note that the role will be based in Cambridgeshire and not Peterborough.&lt;/p&gt;\n&lt;p&gt;To be considered for this role please upload your CV, or alternatively, complete an application form (found in the additional documents section) and upload this instead.&lt;/p&gt;\n&lt;p&gt;DBS – enhanced adults check is needed for this role. Previous applicants need not apply.&lt;/p&gt;\n&lt;p&gt;This is a rolling campaign for a Cambridgeshire County Council position and we will review applications daily: please don&#39;t wait for the closing date to apply, we want to speak to you now!&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Peterborough City Council", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130834"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Cambridge", "postalCode": "PE1 1HL"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.5714", "longitude": "-.24173"}}, "title": "Reablement Support Worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916252420", "validThrough": "2020-11-30T23:59:59+0000"}