{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum pro rata"}}, "datePosted": "2020-10-23T17:00:49+0100", "description": "&lt;p&gt;We are looking to develop a bank of Podiatrist to enhance the ability of the service to respond in a more flexible manner. Work will be available on a bank basis in a variety of community settings.&lt;/p&gt;\n&lt;p&gt;Some experience of working within the NHS is beneficial.&lt;/p&gt;\n&lt;p&gt;You must hold a BSc (Hons) in Podiatry or a Diploma in Podiatric Medicine, together with a Certificate in Local Anaesthesia. Evidence of Continued Professional Development is also essential.&lt;/p&gt;\n&lt;p&gt;The service provides routine nail care for high risk patients, wound care, nail surgery, biomechanical assessment and orthotic provision, and a domiciliary service.&lt;/p&gt;\n&lt;p&gt;The service is offered in variety of settings across a large geographical area, including hospital inpatients, community clinics, health centres and GP surgeries providing a range of advanced clinical foot services to the local population. &lt;br /&gt; &lt;br /&gt;The successful candidate will need to be a team player with excellent clinical, communication and organisational skills. They will also require a positive attitude to personal and professional development. An interest in Biomechanics/MSK is desirable.&lt;br /&gt; &lt;br /&gt;Travel is an integral part of this post and you must state on your application form how you intend to fulfil this essential requirement.&lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;This post is BANK&lt;/p&gt;\n&lt;p&gt;Hours per week: Zero&lt;/p&gt;\n&lt;p&gt;Closing date: 8th November 2020&lt;/p&gt;\n&lt;p&gt;Please be aware that this post requires an Enhanced with Barred list Disclosure and Barring Service (DBS) check, the cost of which is payable by the successful candidate.&lt;/p&gt;\n&lt;p&gt;If you have lived or worked abroad for 6 months or more in the last 5 years you will need to obtain an overseas police clearance. Further information can be found on the additional information links at the bottom of the advert.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;To keep up to date with all of our latest Recruitment activity here at East Cheshire NHS Trust, take a look at our Careers website with lots of information on how to join our team and Facebook and Twitter pages, links to which can be found on the right hand side:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Visit our Facebook page: Careers at East Cheshire NHS Trust&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Follow us on Twitter: @CareersECT&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Hannah Jackson Job title Clinical Lead Podiatrist Email address hannah.jackson@nhs.net Telephone number 07969440880&lt;/p&gt;", "employmentType": "TEMPORARY", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121085.jpg", "name": "East Cheshire NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121085"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Sanders Square Clinic, Macclesfield", "postalCode": "SK11 7SE"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.2473", "longitude": "-2.12728"}}, "title": "Bank Podiatrist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241385", "validThrough": "2020-11-08T23:59:59+0000"}