{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "42712", "minValue": "36070", "unitText": "YEAR", "value": "£36,070 - £42,712 £28,691 to £35,207 Per Annum Inc"}}, "datePosted": "2020-11-05T12:30:35+0000", "description": "&lt;p&gt;Barking, Havering and Redbridge University Hospitals NHS Trust (BHRUT) is a large teaching Trust located in North East London. Our Vision is to provide outstanding healthcare to our community, delivered with pride.&lt;/p&gt;\n&lt;p&gt;Queen&#39;s Hospital and King George Hospital provide a wide range of acute hospital services including: Emergency Department (A&amp;E), outpatients, surgery, inpatient medical care and critical care. Together both hospitals have more than 1,000 inpatient beds.&lt;/p&gt;\n&lt;p&gt;We take PRIDE in everything we do, our five core values reflect that PRIDE. These values were developed together with our staff. We work hard to provide outstanding care to our community, delivered with PRIDE.&lt;/p&gt;\n&lt;p&gt;Our PRIDE values of Passion; Responsibility; Innovation; Drive and Empowerment inspire us and keep our patients at the heart of everything we do.&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen in our Clinical Audit Department for a Clinical Audit Officer. This role will require a motivated and enthusiastic individual with the ability to work on their own initiative and as part of a team whilst remaining adaptable to the needs of the service.&lt;br /&gt;&lt;br /&gt;The Clinical Audit Officer will work closely with the Clinical Audit Manager in the facilitation and administration of the Trust’s audit process and all related activities as well as providing excellent support to the Clinical teams undertaking audits. &lt;br /&gt;&lt;br /&gt;The post holder will be an excellent communicator, able to work to deadlines and proficient in word, excel and PowerPoint. &lt;br /&gt;&lt;br /&gt;There is the opportunity to work flexibly across our two sites at Queens Hospital and King George Hospital. &lt;br /&gt;&lt;br /&gt;For further information or to arrange an informal visit please contact Lorraine Hunter-Brown on 01708 435000 ext. 4947 or email lorraine.hunter-brown@nhs.net&lt;br /&gt;&lt;br /&gt;All newly appointed members of staff at the Trust are subject to a probationary period in order to provide the appointee the opportunity to familiarise with the culture and working environment of the Trust.&lt;/p&gt;\n&lt;p&gt;All new staff appointed to posts at the Trust are subject to a probationary period. This will give the new staff member an opportunity to become familiar with the culture and working environment of the Trust.&lt;br /&gt;&lt;br /&gt;Applications should be made online, however, queries regarding the application process or assistance with completion of the form (for applicants with a disability) can be made to Amanda Vickers, Recruitment Advisor, on 01708 435000 ext. 3861.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Lorraine Hunter-Brown, email lorraine.hunter-brown@nhs.net&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Barking, Havering and Redbridge University Hospitals Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120782"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Across Site, Romford", "postalCode": "RM7 0AG"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.5686", "longitude": ".178941"}}, "title": "Band 6 Clinical Audit Officer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916257662", "validThrough": "2020-11-10T23:59:59+0000"}