{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum / pro rata"}}, "datePosted": "2020-11-04T12:31:31+0000", "description": "&lt;p&gt;We are looking for an experienced, highly motivated, innovative, and friendly Occupational Therapist. If these qualities describe you then you are exactly who we are looking for to join our team of therapists at The Shrewsbury and Telford Hospital NHS Trust.&lt;/p&gt;\n&lt;p&gt;This post is based at The Royal Shrewsbury Hospital working in the Acute Inpatient team. You will be supporting colleagues in providing rapid and complex assessments for discharge across the medical and surgical wards. This is a lead therapist position and you will be working alongside a job share partner to provide training and development to the team of Occupational Therapists.&lt;/p&gt;\n&lt;p&gt;We are looking for someone who has experience at a band 6 or band 7 level who has knowledge and skills in the training and education of clinicians, and in supporting both patients and colleagues through complex discharge planning in the ever-changing environment of the NHS. You will ideally be a clinical educator and have experience of delivering supervision of staff within a team. You will be required to undertake and / or support one piece of audit per year relevant to your clinical area.&lt;/p&gt;\n&lt;p&gt;The Shrewsbury and Telford Hospital NHS Trust has been in the national media over recent years for a variety of issues and we are committed to change for patient and staff benefit. Within therapies we have a strong culture of professional leadership and support within each profession having a head of profession leading on delivering local, regional and national professional strategy. This includes but is not exhaustive of AHP’s into action, job planning, electronic rostering, electronic data capture, quality improvement strategy, and representation at internal and external meetings raising the profile of therapies at all times.&lt;/p&gt;\n&lt;p&gt;As a Trust Shrewsbury and Telford Hospital have for the last 5 years been advantaged by being linked with the Virginia Mason Institute in Seattle, USA. This affiliation has seen the implementation of improvement tools focusing on the patient at the centre across the organisation with Therapies being trained in Lean methodologies at not only lean for leaders and also advanced lean training levels. We are proud to have a culture of patient focused care utilising our resourced to the best of our abilities. You will have the opportunity to be training in lean methodology and supporting in service review and improvement supported by dedicated therapy quality improvement leads and management.&lt;/p&gt;\n&lt;p&gt;As part of our patient centred care we require all staff to support our weekend working rota and therefore this role will be required to work across a 7 day working pattern .&lt;/p&gt;\n&lt;p&gt;We look forward to meeting you at interview and exploring all the opportunities you will gain by joining us in this exciting and essential role.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Nicola Froggatt&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt; Email: &lt;/strong&gt; Nicola.froggatt@nhs.net&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;&lt;strong&gt;Phone: 01743 261000 bleep 823&lt;/strong&gt;&lt;/em&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120882.png", "name": "Shrewsbury and Telford Hospital NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120882"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Royal Shrewsbury Hospital, Shrewsbury", "postalCode": "SY3 8XQ"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.7094", "longitude": "-2.79375"}}, "title": "Clinical Lead OT for Acute Inpatients", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255858", "validThrough": "2020-11-18T23:59:59+0000"}