{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "32146", "minValue": "26152", "unitText": "YEAR", "value": "£26,152 - £32,146 pa inc HCA"}}, "datePosted": "2020-10-27T11:46:20+0000", "description": "&lt;p&gt;&lt;strong&gt;We are committed to providing the best care for every child every day! &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Join our Team!&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We have exciting opportunities for Paediatric Trained Staff Nurses to join us here in Children’s Services at West Hertfordshire Hospitals NHS Trust.&lt;/p&gt;\n&lt;p&gt;The Trust is committed to providing outstanding care and this is something we are extremely proud of. We are a friendly, enthusiastic and innovative team who strive to do the best for every child, young person and their family.&lt;/p&gt;\n&lt;p&gt;West Hertfordshire Hospitals NHS Trust provides extremely comprehensive Paediatric and Neonatal services. The Paediatric service operates across two hospital sites. (Watford has acute Paediatrics and out patients and Hemel Hempstead has a Paediatric outpatient service).&lt;/p&gt;\n&lt;p&gt;We provide both Acute Paediatric Inpatient Care and an Ambulatory Service. Our service configuration is a Paediatric Inpatient Ward which includes High Dependency Unit, Children’s Emergency Department, and a brand new Paediatric Assessment, Paediatric Day-care and Paediatric Outpatients. In addition there is neonatal special care, high dependency and intensive care.&lt;/p&gt;\n&lt;p&gt;If you are excited by the challenges of working within our Paediatric Team, have a passion for high standards of care, a mature and progressive attitude this could be the role waiting for you.&lt;br /&gt;&lt;br /&gt;We believe in investing in those who put so much effort into keeping our patients safe and well. We help our staff to develop in their role and career and offer a wide range of benefits and opportunities, which supports a healthy work / life balance. We have lots of courses such as HDU course, oncology course and nurse practitioner opportunities.&lt;/p&gt;\n&lt;p&gt;Watford General Hospital is within easy walking distance of the Metropolitan line (underground) and London Midland overland Train at Watford Junction Station, which is a 20 minute journey away from London Euston. Car drivers also have easy access via main motorways.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Karen Stow&lt;/p&gt;\n&lt;p&gt;Paediatric Matron&lt;/p&gt;\n&lt;p&gt;Email:karen.stow@whht.nhs.uk&lt;/p&gt;\n&lt;p&gt;Tel: 01923 244366 ext 8693&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "West Hertfordshire Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120820"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Watford General Hospital, Watford", "postalCode": "WD18 0HB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.6491", "longitude": "-.404449"}}, "title": "Band 5 - Paediatric Staff Nurse, Children&#39;s Services", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244293", "validThrough": "2020-11-10T23:59:59+0000"}