{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "14826", "minValue": "14826", "unitText": "YEAR", "value": "£8.82 per hour"}}, "datePosted": "2020-10-13T11:19:35+0100", "description": "&lt;p&gt;We are currently seeking Support Workers to join our Adult Mental Health Service at The Huntercombe Centre Redbourne, North Lincolnshire, located in Redbourne and only one mile from the A15.&lt;/p&gt;\n&lt;p&gt;The Huntercombe Centre Redbourne – North Lincolnshire&lt;/p&gt;\n&lt;p&gt;The centre is a specialist care home with nursing. We provide a supportive, therapeutic, homely environment for men aged 18+ with mental health disorders, mild to moderate intellectual disability, Autistic Spectrum Conditions, challenging behaviour and complex needs. Some individuals may have a forensic background with associated risk and be on a Community Treatment Order.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The focus of the Centre is on rehabilitation and community reintegration.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;At Huntercombe, our Support Workers do something extraordinary every day. They make a difference to the lives of children and adults with complex needs such as mental health conditions, learning difficulties or brain injuries.&lt;/p&gt;\n&lt;p&gt;We’re looking for caring and committed individuals who want to work with a company that understands how important Support Workers are to our patients and residents.&lt;/p&gt;\n&lt;p&gt;Many of our patients arrive with complex and challenging needs. Huntercombe Support Workers work in small teams and together they make a world of difference to people’s lives. This exciting and dynamic role will place you at the heart of the team, working closely with residents/patients and other external professionals to deliver the best care and rehabilitation.&lt;/p&gt;\n&lt;p&gt;When you join The Huntercombe Group as a &lt;strong&gt;Support Worker&lt;/strong&gt;, you will be part of a company that is &lt;strong&gt;understanding&lt;/strong&gt;, &lt;strong&gt;strives towards excellence&lt;/strong&gt;, is &lt;strong&gt;innovative&lt;/strong&gt;, &lt;strong&gt;reliable&lt;/strong&gt; and &lt;strong&gt;accessible &lt;/strong&gt;and above all &lt;strong&gt;puts people first&lt;/strong&gt;.&lt;/p&gt;\n&lt;p&gt;As a&lt;strong&gt; Support Worker &lt;/strong&gt;your main duties will be:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To provide an excellent caring service in conjunction with the senior team&lt;/li&gt;\n&lt;li&gt;Be actively involved in patient care&lt;/li&gt;\n&lt;li&gt;Assist in maintaining and developing high standard of resident/patient care&lt;/li&gt;\n&lt;li&gt;Work and act as a key member of the team, supporting each resident/patient in achievement of their planned outcomes.&lt;/li&gt;\n&lt;li&gt;Provide practical assistance to the resident/patient, where needed, in carrying out everyday living tasks whilst encouraging them to develop their daily living skills&lt;/li&gt;\n&lt;li&gt;Be actively involved with the day to day routine in individual and group activities&lt;/li&gt;\n&lt;li&gt;Practice within a legal framework encompassing statutory, organisational policy and guidelines&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;So as a Support Worker what do you need to do to make this happen:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;You will need to show empathy and have a desire to make a difference&lt;/li&gt;\n&lt;li&gt;Be passionate about forming therapeutic relationships&lt;/li&gt;\n&lt;li&gt;Committed to a person-centred approach to recovery&lt;/li&gt;\n&lt;li&gt;Enthusiastic about working as part of a dedicated team&lt;/li&gt;\n&lt;li&gt;Resilient and able to work under pressure&lt;/li&gt;\n&lt;li&gt;Show leadership qualities and be willing to take ownership for the delivery of quality care&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;In return we offer you:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A thorough induction programme tailored to the hospital where you will be working&lt;/li&gt;\n&lt;li&gt;Clear pay structure, with competitive rates&lt;/li&gt;\n&lt;li&gt;Generous annual leave entitlement&lt;/li&gt;\n&lt;li&gt;Sick pay of 4 weeks full pay and 4 weeks half pay&lt;/li&gt;\n&lt;li&gt;The opportunity to participate in a company contributory pension scheme with up to 3% matching contributions&lt;/li&gt;\n&lt;li&gt;Maternity leave at 3 month’s full pay and 3 month’s half pay,&lt;/li&gt;\n&lt;li&gt;2 weeks paid paternity leave&lt;/li&gt;\n&lt;li&gt;Shared parental leave, matching the maternity leave benefit&lt;/li&gt;\n&lt;li&gt;Death in service benefit equivalent to 2 x salary&lt;/li&gt;\n&lt;li&gt;A range of staff discounts&lt;/li&gt;\n&lt;li&gt;Opportunity to train to become a nurse through our ‘grow our own’ nurses programme&lt;/li&gt;\n&lt;li&gt;Employee Assistance Programme (EAP)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We welcome applications from everyone irrespective of ethnic origin, gender, age, gender identity, sexual orientation, religion, marital status, disability or social background. This is a great opportunity for someone to make a difference.&lt;/p&gt;\n&lt;p&gt;An enhanced DBS (England) or PVG/Disclosure Scotland (Scotland) Disclosure will be required for all successful applicants. Costs will be met by the Company.&lt;/p&gt;\n&lt;p&gt;If you like what you have read, are dynamic, forward thinking and keen to learn, with a confident ‘CAN DO’ approach in all you do, please click &lt;strong&gt;Apply&lt;/strong&gt; now.&lt;/p&gt;\n&lt;p&gt;To learn more about The Huntercombe Group please visit our website.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/130001.jpg", "name": "The Huntercombe Group", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=130001"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Redbourne, Lincolnshire", "postalCode": "DN21 4QU"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4882", "longitude": "-.535249"}}, "title": "Support Worker", "url": "https://www.jobs.nhs.uk/xi/vacancy/916224008", "validThrough": "2020-11-18T23:59:59+0000"}