{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 to £30,615 Pro Rata Per Annum"}}, "datePosted": "2020-10-23T13:46:05+0100", "description": "&lt;p&gt;We are looking to appoint a Band 5 Staff Nurse who is enthusiastic and motivated to join our established integrated intermediate care team, primarily based at Castleberg Hospital in Giggleswick.&lt;/p&gt;\n&lt;p&gt;The Intermediate Care Teams have undergone recent developments and have expanded to include Castleberg Hospital (10 beds). The 2016 CQC report described the Intermediate Care Teams as an outstanding example of community working.&lt;/p&gt;\n&lt;p&gt;The service at Castleberg provides bed-based intermediate care to support people who are in an acute but stable condition. The service also provides palliative care to people during their last days of life if they cannot be cared for safely in their own home.&lt;/p&gt;\n&lt;p&gt;The Intermediate Care Team’s includes Physiotherapists, Occupational therapists, Mental Health Nurses, Advanced Nurse Practitioners, Staff Nurses and Community Support Workers. It is important to be able to work within a multidisciplinary team as well as independently. We utilise the Calderdale competency framework for skill sharing&lt;/p&gt;\n&lt;p&gt;Applicants must be prepared to work shifts covering 24/7 and have access to own transport, car driver and access to vehicle essential (Car leasing schemes available). The successful candidate may be required to rotate across Intermediate Care services (Collaborative Care Teams). This rotation is a great development opportunity and chance to develop skills, increase knowledge across a range of community setting.&lt;/p&gt;\n&lt;p&gt;Full time and part time hours available.&lt;/p&gt;\n&lt;p&gt;Closing Date: 8th November 2020&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Tracey Mothersdale, Craven Collaborative Care Team Leader, on 01756 793206&lt;/strong&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Airedale NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120636"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Castleberg Hospital, Giggleswick Settle", "postalCode": "BD20 6TD"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.898", "longitude": "-1.9627"}}, "title": "Castleberg Community Staff Nurse (Band 5)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240761", "validThrough": "2020-11-08T23:59:59+0000"}