{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "45214", "minValue": "38903", "unitText": "YEAR", "value": "£38,903 to £45,214 per annum"}}, "datePosted": "2020-10-19T16:02:05+0100", "description": "&lt;p&gt;Are you an experienced Clinical Nurse Specialist with excellent leadership skills and a passion for delivering Person Centered Care?&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for an experienced Senior Nurse to join the Saint Francis Hospice team as one of the Referrals Hub Leads&lt;/p&gt;\n&lt;p&gt;Saint Francis Hospice is a dynamic, forward thinking organization delivering a full range of specialist palliative care services for all patients with life limiting illness. We achieved ‘Outstanding’ in our CQC inspection in April 2016. We have recently adapted and reconfigured our services to meet the changing needs of our local community.&lt;/p&gt;\n&lt;p&gt;The hospice supports five Clinical Commissioning Groups and has a robust governance structure in place. We provide inpatient clinical services within a modern, personal and friendly 18-bedded unit, as well as Specialist Community Crisis &amp; Support Service (SCCS), Hospice at Home Service and Specialist Outpatient Services provided at Pemberton Place. Alongside these clinical services, we have the hospice Pepperell Education Centre that has an excellent reputation for delivering high quality education programs and study days.&lt;/p&gt;\n&lt;p&gt;The post holder will be responsible for patient assessment and processing referrals, received to the hospice, and will promote and monitor safe and effective practice over a 7 day rota. They will enhance the service user experience, and provide effective leadership/collaborative team working and contribute to the delivery of the organization’s objectives and strategy.&lt;/p&gt;\n&lt;p&gt;They will work closely with a part time Referrals Hub Lead, Referrals Assistant post and Referrals &amp; Admissions Coordinator role&lt;/p&gt;\n&lt;p&gt;The Referrals Hub Lead will work pro-actively across all service areas within Saint Francis Hospice to ensure that all plans and arrangements are in place for a person’s admission to hospice services.&lt;/p&gt;\n&lt;p&gt;If you are a highly motivated and dynamic individual with specialist clinical experience as well as being a team player with strong interpersonal and communication skills, we would love to hear from you.&lt;/p&gt;\n&lt;p&gt;We in return will offer supervision, reflective practice, staff support, professional development opportunities and a supportive working environment. Transfer of NHS superannuation scheme or a private pension scheme is also available.&lt;/p&gt;\n&lt;p&gt;Please note that a DBS (Disclosure &amp; Barring Service) criminal record check will be undertaken as part of our pre-employment screening for the successful candidate.&lt;/p&gt;\n&lt;p&gt;If you are excited by this opportunity and would like to discuss this opportunity or arrange an informal visit, we would be delighted to hear from you. Please contact Lesley Burrows Head of Community Services by email lesleyburrows@sfh.org.uk or SCCS Leads Maria Stripe/Jane Elmer 01708 753319 ext. 2343 mariastripe@sfh.org.uk or janeelmer@sfh.org.&lt;/p&gt;\n&lt;h2&gt;&lt;strong&gt;CLOSING DATE: 7th December 2020 &lt;/strong&gt;&lt;/h2&gt;\n&lt;h2&gt;&lt;strong&gt;INTERVIEW DATE: to be confirmed&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;All communication regarding your application including invitations to interviews will be sent to the email address you have stated on your application form and not via your NHS Jobs account. Therefore please ensure that you provide your email address. Please note that if you do not get a response to an application within two weeks of the closing date, then you have been unsuccessful on this occasion.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please provide contact business email addresses for your referees one of which must be your current or most recent employer.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Saint Francis Hospice is a centre of excellence in the care of those with life limiting illnesses. Our team of specialist consultants, doctors, nurses and health care assistants provide practical and emotional support for adults of all ages and give specialist bereavement support to family members from as young as 20 months.&lt;/p&gt;\n&lt;p&gt;PLEASE NOTE THAT SAINT FRANCIS HOSPICE IS A CHARITY AND NOT PART OF AN NHS TRUST. THE HOSPICE IS SITUATED IN A QUIET LOCATION IN THE VILLAGE OF HAVERING-ATTE-BOWER ON THE OUTSKIRTS OF ROMFORD; THEREFORE YOU ARE ADVISED TO CONSIDER OUR LOCATION WHEN APPLYING.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Our Organisational Values&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;These values underpin all that our charity aspires to do and shape our external and internal behaviour.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;SUPPORTIVE&lt;/strong&gt;- I will actively listen to, engage with and show appreciation for everyone I meet.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;COMPASSIONATE&lt;/strong&gt;- I will treat everyone with kindness, compassion and dignity and as an individual.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;INCLUSIVE &amp; RESPECTFUL&lt;/strong&gt;- I will value and respect everyone&#39;s differences and individuality and appreciate others&#39; experience, skills and needs.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;PROFESSIONAL&lt;/strong&gt;- I will always be professional and deliver a high quality service, which is responsive to need, always seeking to give my best.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;ALWAYS LEARNING&lt;/strong&gt;- I will embrace change, learn and adapt to meet the changing needs of local people and the Hospice as our world adapts and changes around us.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Saint Francis Hospice", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=134274"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Havering-atte-Bower, outskirts of Romford", "postalCode": "RM4 1QH"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.617", "longitude": ".196975"}}, "title": "REFERRALS HUB LEAD", "url": "https://www.jobs.nhs.uk/xi/vacancy/916233070", "validThrough": "2020-12-07T23:59:59+0000"}