{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-10-29T10:31:28+0000", "description": "&lt;p&gt;The Leadership and Lifelong Learning Team in the East of England is part of the People Directorate within NHS England and Improvement. The aim of the team is to deliver outstanding leadership development, at all levels across the healthcare workforce in support of the NHS People Plan.&lt;/p&gt;\n&lt;p&gt;The team works with our colleagues nationally and our stakeholders across the east of England region to provide opportunities to participate in high impact, high quality development which supports transformation. We pride ourselves on the relationships we hold and continue to build with our stakeholders. The person we are looking for will be happy working collaboratively with a diverse range of individuals, teams, and system organisations.&lt;/p&gt;\n&lt;p&gt;The Business and Performance Officer will work as part of a dynamic team in delivering an effective service supporting managers and staff in the business management function of Leadership and Lifelong Learning in the region.&lt;/p&gt;\n&lt;p&gt;In particular the post holder will provide high quality project, service, initiative and administrative support including financial and performance information and analysis. As well as communicating and engaging with a range of internal and external stakeholders and the management and coordination of programme events.&lt;/p&gt;\n&lt;p&gt;Our successful candidate will be highly organised, experienced and flexible, capable of using their own skills and expertise to provide co-ordination and support to enable successful delivery of national and regional priorities and initiatives. You will be self-motivated with excellent attention to detail, a natural ability to plan ahead, be keen to apply and grow your skills and be able to communicate effectively with individuals at all levels.&lt;/p&gt;\n&lt;p&gt;The post holder is a key member of the team whose overarching goal is to enable, promote and support the effective use of data, information, knowledge and technology to improve, inform and support a portfolio of projects, services, and initiatives.&lt;/p&gt;\n&lt;p&gt;In return for this commitment we will support you in your own development.&lt;/p&gt;\n&lt;p&gt;As you would expect, all our interviews will take place using video calls on MS Teams.&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Deborah Peacock&lt;/p&gt;\n&lt;p&gt;Job title: Business and Performance Manager&lt;/p&gt;\n&lt;p&gt;Email address: deborah.peacock@leadershipacademy.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number: 0208 103 1367&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/126694.png", "name": "NHS England and NHS Improvement", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126694"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Cambridge", "postalCode": "CB21 5XA"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.1848", "longitude": ".19314"}}, "title": "Business and Performance Officer", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247908", "validThrough": "2020-11-12T23:59:59+0000"}