{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 to £44,503 pa"}}, "datePosted": "2020-11-04T08:24:17+0000", "description": "&lt;h1&gt;&lt;strong&gt;&lt;span&gt;Costing Team - Band 7 Corporate Accountant&lt;/span&gt;&lt;/strong&gt;&lt;/h1&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;An opportunity has arisen to join the award-winning Costing Team at The Leeds Teaching Hospitals NHS Trust to support our use and development of Patient Level Costing information (PLICS). It is a diverse and rewarding role that will allow you to contribute towards improving our patient services and their financial sustainability. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We have a pioneering spirit of working collaboratively with the wider organisation to continuously develop our information, with real benefits flowing from its use. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;We are looking for someone to help with supporting the expanding number of clinical teams we work with, and to adapt, innovate and make best use of our PLICS outputs. You will need to be enthusiastic and motivated with a passion for converting data into information, possessing strong technical and communication skills to explain results to clinicians and colleagues in a focused and impactful manner. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Key aspects of the role include; &lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Taking the lead on collaborating with Finance, Operational and Clinical staff in helping them to understand and make use of both our PLICS outputs and the clinical data we use to create this to identify opportunities, realise cost savings and improve the overall patient experience.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Unifying and analysing large volumes of diverse clinical and finance data to create bespoke, inventive tools that help our stakeholders to understand and address variations in service provision, or to improve patient pathways.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Continual refinement of costing methodologies through both internal quality reviews and external contact with stakeholders.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Supporting in our monthly production and evolution of PLICS as well as all nationally mandated collections.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;span&gt;The candidate must possess and demonstrate knowledge and experience of the following;&lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Creating and engaging others in the use of Patient Level Costing information, developing relationships with stakeholders, presenting often complex information in a clear and focused manner within an environment where the information is potentially challenged.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Using SQL to extract information and join together different data sets,and work alongside non-finance colleagues to create powerful tools that enable review, understanding and opportunity identification.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Strong technical knowledge, particularly in the use of Excel to develop new spread sheet tools that help to maximise the use of our available data.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Experience of training other members of staff (both finance and non-finance).&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;span&gt;For further information or to organise a chat about this role, please contact:&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Vinod Bassi&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;Assistant Director of Finance&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span&gt;vinod.bassi@nhs.net&lt;/span&gt;&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122972.jpg", "name": "Finance", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122972"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Leeds General Infirmary", "postalCode": "LS1 3EX"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.8015", "longitude": "-1.55175"}}, "title": "Corporate Accountant (XN07)", "url": "https://www.jobs.nhs.uk/xi/vacancy/916255082", "validThrough": "2020-11-24T23:59:59+0000"}