{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum"}}, "datePosted": "2020-10-27T11:16:28+0000", "description": "&lt;p&gt;&lt;strong&gt;Band 7 Midwifery Advocate&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;22.5 hours per week&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;1 Year Fixed Term&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Are you highly motivated, have a strong sense of empathy and keen to develop? Excited to be working in a new role?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity for a midwife to join our dynamic team of Professional Midwifery Advocates (PMAs). It will provide the applicant with an insight in to how the PMA team works, an opportunity to support the provision of the A-Equip Model and provide career and professional development. It will be 22.5 hours per week, topped up by your clinical hours.&lt;/p&gt;\n&lt;p&gt;The successful candidate will be supported to complete the Professional Midwifery Advocate Module and on successful completion will be eligible to apply for an 8a PMA role.&lt;/p&gt;\n&lt;p&gt;This will be a supportive role to the Professional Midwifery Advocates (PMA). The PMA is a new role that has been developed to replace the role of the Supervisor of Midwives that was deselected in April 2017 due to legislative change. The model that supports the deployment of this role is called “A-EQUIP” which provides a continuous improvement process that builds upon personal and professional resilience, enhances quality of care for women and supports preparedness for midwives in appraisal and professional revalidation.&lt;/p&gt;\n&lt;p&gt;The ultimate aim is that this continuous improvement process of the “A-EQUIP” model will become an intrinsic part of everyone’s job, every day in all parts of the system (NHS England 2016). Thus the post holder will assist the PMA team by implementing the elements of the A-EQUIP model utilising the guidance issued by NHS England in April 2017.&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;You will be supporting the PMA team to improve care for women by supporting and caring for our staff.&lt;/li&gt;\n&lt;li&gt;Able to support the PMA team providing clinical supervision by delivering the NHS England A Equip model of midwifery supervision&lt;/li&gt;\n&lt;li&gt;Able to be part of a team and support the PMA team providing Restorative Clinical Supervision to midwives throughout NUH, individually and in groups&lt;/li&gt;\n&lt;li&gt;Working with the PMA team to support midwives with learning from incidents and events&lt;/li&gt;\n&lt;li&gt;Support the PMA team to deliver whole service working across the City QMC and Community settings&lt;/li&gt;\n&lt;li&gt;Taking part in Audit and supporting the drive for quality improvement in care&lt;/li&gt;\n&lt;li&gt;Be part of the Senior Midwifery Team (SMT) team and an opportunity to develop leadership skills&lt;/li&gt;\n&lt;li&gt;Working alongside the PMA team be able to influence service development and be part of developing guidelines for service developments&lt;/li&gt;\n&lt;li&gt;To have a clear knowledge of the NHS England A Equip 1 year on principle aims to reduce workplace stress, reduce burnout increasing team working and resilience. Providing support and innovation to reduce attrition and increase retention and recruitment.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Susan Bateman&lt;/p&gt;\n&lt;p&gt;Job title Deputy Head of Midwifery&lt;/p&gt;\n&lt;p&gt;Email address susan.bateman@nuh.nhs.uk&lt;/p&gt;\n&lt;p&gt;Telephone number 7812275388&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/122234.jpg", "name": "Nottingham University Hospitals NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=122234"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "QMC Campus, Nottingham", "postalCode": "NG7 2UH"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.9435", "longitude": "-1.1858"}}, "title": "Midwifery Advocate", "url": "https://www.jobs.nhs.uk/xi/vacancy/916244191", "validThrough": "2020-11-09T23:59:59+0000"}