{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "unitText": "YEAR", "value": "Competitive"}}, "datePosted": "2020-11-03T17:39:37+0000", "description": "&lt;p&gt;Doctors Direct are part of NHS Professionals and owned by the Department of Health and Social Care, which means that we are part of the NHS family and sets us apart from locum agencies. Saving money and providing only the highest quality locum cover to our partner Trusts is at the very heart of what we do.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We have an exciting opportunity for a ST3+ to work with us at&lt;/strong&gt; &lt;strong&gt;Greater Manchester Mental Health NHS Trust in Forensic Psychiatry.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for a dedicated doctor ready to work at one of the leading mental health Trusts in the UK. Greater Manchester Mental Health NHS Trust (GMMH) employs around 4,750 people who make a difference across 130 locations.&lt;/p&gt;\n&lt;p&gt;Serving a population of 1.2 million people, GMMH provides community and inpatient mental health care, alongside substance misuse services across the North West. GMMH is one of the most active research Trusts in the UK, with one of the highest levels of recruitment to clinical trials for mental health. This puts staff and service users at the leading edge of new mental health treatment.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Requirements&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Doctors Direct recruit to the highest of NHS standards and all applicants for this role should meet pre-screening requirements before applying.&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Full GMC licence to practice&lt;/li&gt;\n&lt;li&gt;Minimum of 6 months experience in and NHS Trust within the last 2 years&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Why Choose Doctors Direct?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Doctors Direct are part of the NHS and do not charge our partner Trusts the expensive fees associated with private locum agencies. That means every shift worked by one of our members helps save money for the Trust and the wider NHS. These vital saving can then be reinvested into what matters most, patient care and safety.&lt;/p&gt;\n&lt;p&gt;Not only do members of Doctors Direct help save money for the NHS, they receive fantastic benefits including;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Competitive rates of pay&lt;/li&gt;\n&lt;li&gt;Paid annual leave&lt;/li&gt;\n&lt;li&gt;A dedicated account manager&lt;/li&gt;\n&lt;li&gt;Flexibility of work, with shifts that suit you&lt;/li&gt;\n&lt;li&gt;Book and review shifts online&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Want to know more?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Find out more about how working locum shifts through Doctors Direct canwork for youor visit our onsite teams. Find yournearest Trust here.&lt;/p&gt;\n&lt;p&gt;We have exciting career opportunities available for doctors across many grades and specialties. Once registered, you will be able to view and work in your chosen specialty and grade at any of our partner Trusts across England. If you would like to discuss career opportunities further, call us on 03330 143 652 or email doctors@nhsprofessionals.nhs.uk where our dedicated team can help you find your next opportunity.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121068.JPG", "name": "NHS Professionals - Doctors", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121068"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Manchester", "postalCode": "M25 3BL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.5368", "longitude": "-2.29146"}}, "title": "ST3+", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254955", "validThrough": "2020-12-31T23:59:59+0000"}