{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 per annum pro rata"}}, "datePosted": "2020-10-23T15:16:21+0100", "description": "&lt;p&gt;&lt;strong&gt;University Hospitals of Morecambe Bay NHS Foundation Trust &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Advanced Dietitian – Paediatric Diabetes (0.5 wte)&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Location: Furness General Hospital, Barrow in Furness&lt;/p&gt;\n&lt;p&gt;Salary: £38,890 - £44,503 per annum pro rata Please can ES check correct&lt;/p&gt;\n&lt;p&gt;Type: Permanent&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt;An exciting vacancy has arisen for an enthusiastic and self-motivated Dietitian to work as a Paediatric Diabetes Dietitian for Morecambe Bay Hospitals NHS Foundation Trust. This part time (0.5wte) post would ideally be suited to a specialist Dietitian looking to advance their skills and knowledge or an advanced Dietitian with relevant clinical experience.&lt;/p&gt;\n&lt;p&gt;The post holder will be responsible for managing a complex caseload of Paediatric patients with Diabetes. You will be joining a supportive and experienced team of Consultants, Specialist Nurses, Dietitians, Dietetic Assistants and supporting admin and clerical staff who are responsible for providing a service across social and health care boundaries. You will work closely with the Paediatric Diabetes team, Dietitians and other professionals in both acute and primary care.&lt;/p&gt;\n&lt;p&gt;As a Trust we actively support you to develop your knowledge and skills through our Annual Development Review programme. You will use your knowledge and skills to support the learning and development of colleagues and contribute towards updating protocols and resources. You will be encouraged to develop your skills as a Clinical Educator supporting, with others, undergraduate students from a range of disciplines.&lt;/p&gt;\n&lt;p&gt;Barrow in Furness is a coastal town in Cumbria very close to the Lake District National Park. The area has miles of wild and diverse coastline to explore with views of Morecambe Bay and the nearby Lakeland fells, whilst still having easy access to the main cities in the UK through road and rail links.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;Anyone newly appointed to the trust will be subject to the completion of a satisfactory 6 month probationary period. This will give the new staff member an opportunity to become familiar with the role and working environment.&lt;/p&gt;\n&lt;p&gt;Applicants will be HCPC registered dietitians. The post is based at Furness General Hospital, Barrow and will require you to travel to other sites and clinic locations.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further information and informal enquiries or to arrange a visit, please contact&lt;/p&gt;\n&lt;p&gt;Lucy Budden, Nutrition and Dietetic Team Manager (Furness General and Westmorland General Hospitals) 01229 403968 lucy.budden@mbht.nhs.uk&lt;/p&gt;\n&lt;p&gt;Or&lt;/p&gt;\n&lt;p&gt;Dr Helen Peace, Consultant Paediatrician, 01229 491123 (secretary) helen.peace@mbht.nhs.uk&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;br /&gt;&lt;br /&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameLucy BuddenJob titleNutrition &amp; Dietetic Team ManagerEmail addresslucy.budden@mbht.nhs.ukTelephone number01229 403968Additional contact information&lt;/p&gt;\n&lt;p&gt;Dr Helen Peace, Consultant Paediatrician, 01229 491123 (secretary) helen.peace@mbht.nhs.uk&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "University Hospitals of Morecambe Bay NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121712"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Furness General Hospital, Barrow in Furness", "postalCode": "LA14 4LF"}, "geo": {"@type": "GeoCoordinates", "latitude": "54.1364", "longitude": "-3.20788"}}, "title": "Paediatric Diabetes Dietitian", "url": "https://www.jobs.nhs.uk/xi/vacancy/916241076", "validThrough": "2020-11-08T23:59:59+0000"}