{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 Per annum"}}, "datePosted": "2020-11-03T15:46:15+0000", "description": "&lt;p&gt;&lt;strong&gt;Mental Health Support Team Manager&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;In line with the government’s Green Paper priority to increase access and availability of mental health and wellbeing support for children and young people, the new Mental Health Support Teams (MHST) is an exciting opportunity to deliver evidence-based early interventions for children and young people, working across both educational settings and healthcare sectors in England.&lt;/p&gt;\n&lt;p&gt;Successful candidates will be employed on a two year fixed term basis by Cornwall Partnership Foundation Trust. You must be a Registered Nurse, Dip SW or equivalent social work qualification (CSS, CQSW, degree in social work), or Allied Health Professional registered with the HCPC.&lt;/p&gt;\n&lt;p&gt;In Wave 1 of this initiative we have Mental Health Support Teams in Cornwall delivering in the Restormel and Kerrier. We have been successful in Wave 3 and are looking for two more Team Managers to extend our reach into NE Cornwall.&lt;/p&gt;\n&lt;p&gt;Alongside your relevant professional registration you will have experience of managing or supervising staff. You will have extensive knowledge of child development, understanding the impact of early trauma, identification and assessment of mental health disorders in children, formulation based interventions and working in multi-disciplinary mental health settings. Further to this experience an understanding of the educational system in England and the Trauma Informed Schools approach we have adopted in Cornwall is essential. Please note that we are focussing our support into Primary Schools so a desirability to work with this younger age range is really important.&lt;/p&gt;\n&lt;p&gt;This post will include providing training for education professionals in line with the new Ofsted framework that implements a whole systems school approach to pupils’ mental health and wellbeing.&lt;/p&gt;\n&lt;p&gt;Whilst a significant portion of your time will comprise of managerial support, over time, you will hold an active caseload of children with mild moderate emotional and mental health difficulties and will deliver low intensity cognitive behaviour therapy with 1:1 or group interventions, employing the principles underpinning the national CYP-IAPT programme (Children and Young Peoples Improving Access to Psychological Therapies).&lt;/p&gt;\n&lt;p&gt;Please find attached the job description and person/role specification.&lt;/p&gt;\n&lt;p&gt;For further information, please contact: Lesley.Leadbeater@nhs.net or 07909995517&lt;/p&gt;\n&lt;p&gt;Face-face interviews will be taking place on &lt;strong&gt;Monday 30th November&lt;/strong&gt; at Shaw House, St Austell Hospital, Porthpean Road, St Austell, PL26 6AA This environment has a Covid 19 risk assessment in place.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;em&gt;We reserve the right to bring the closing date forward for this vacancy at any time should we receive an overwhelming number of applications. We therefore encourage applicants to apply early if you wish to be considered for this post.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameLesley LeadbeaterJob titleMental Health Support Team Service LeadEmail addresslesley.leadbeater@nhs.netTelephone number07909 995517Additional contact information&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120947.png", "name": "Cornwall Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120947"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Shaw House, St Austell", "postalCode": "PL26 6AD"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.3271", "longitude": "-4.77309"}}, "title": "Mental Health Support Team Manager - Band 7", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254616", "validThrough": "2020-11-16T23:59:59+0000"}