{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "44503", "minValue": "38890", "unitText": "YEAR", "value": "£38,890 - £44,503 £38,890 To £44,503 pa pro rata f"}}, "datePosted": "2020-11-03T17:16:05+0000", "description": "&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;This Vacancy &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for a highly motivated, innovative and dynamic individual to join the integrated Tissue Viability team at Sheffield Teaching Hospitals NHS Foundation Trust as a full time Band 7 Tissue Viability Clinical Nurse Specialist.&lt;/p&gt;\n&lt;p&gt;You will work across both the acute and community setting, offering clinical advice and education on the prevention and management of pressure ulcers, complex wounds and leg ulcers.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About Us&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is an exciting time to join our team. The Tissue Viability team integrated in 2018, and the successful candidate will support the continued development of this specialist service.&lt;/p&gt;\n&lt;p&gt;Many of the services at our hospitals are considered regional, national or international centres of excellence. The Tissue Viability team, therefore, has the opportunity to work closely with these teams, particularly specialties such as Vascular Surgery, Orthopaedics, Plastic Surgery, Dermatology and Spinal Injuries, in order to develop and shape wound care across Sheffield and beyond.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Who we are looking for&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking to recruit an individual who is committed to improving patient care, experience, outcomes and reducing avoidable harm.&lt;/p&gt;\n&lt;p&gt;You must be a registered nurse, educated to degree level, with extensive post registration experience within the speciality of Tissue Viability. You will possess advanced clinical skills, and qualifications in both Tissue Viability and teaching. You will have the ability to deliver education and training, both formally and informally, to health care professionals, patients and carers.&lt;/p&gt;\n&lt;p&gt;You will have excellent communication, decision making and leadership skills. You will lead by example, demonstrating and promoting STH PROUD values at all times. In order to meet the challenges and demands of this busy Trust wide service, you must be organised, flexible, open to change and able to challenge the status quo in order to make a difference.&lt;/p&gt;\n&lt;p&gt;The successful candidate will support the Lead Clinical Nurse Specialist in Tissue Viability to shape and develop the service, as it continues to evolve.&lt;/p&gt;\n&lt;p&gt;The ability to travel between sites is essential, and a full valid United Kingdom driving license is required to use regularly for business purposes&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What you can expect from Sheffield Teaching Hospital NHS Foundation Trust&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will be working for an organisation which values and respects all of its staff and the community it serves. The Trust is a leader in the NHS and research sectors and provides excellent benefits for its staff. This includes commitments to professional development but also many policies to support employees in balancing their personal and professional lives.&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;p&gt;For further details&lt;/p&gt;\n&lt;p&gt;Paula MacDonald, Lead Clinical Nurse Specialist – Tissue Viability&lt;/p&gt;\n&lt;p&gt;Email address paula.macdonald5@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number 0114 2714544&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121486.png", "name": "Sheffield Teaching Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121486"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Northern General Hospital, Sheffield", "postalCode": "S5 7AU"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.4098", "longitude": "-1.45604"}}, "title": "Tissue Viability Nurse Specialist", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254911", "validThrough": "2020-11-10T23:59:59+0000"}