{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "46800", "minValue": "44606", "unitText": "YEAR", "value": "£44,606 - £46,800 per annum"}}, "datePosted": "2020-10-29T13:14:38+0000", "description": "\n\n\n\n&lt;p&gt;Community Care Collaborative (CCC) is a three practice, friendly and innovative Community Interest Company based in Wrexham, North Wales with circa 17,000 patients. &lt;br /&gt; &lt;br /&gt; CCC was established as a joint venture with Capacity in 2018 and secured a contract later that year to deliver General Medical Services from three previously Betsi Cadwaladr University Health Board managed practices - Hillcrest Surgery, Forge Road Surgery and Borras Park Surgery. In 2019 and early 2020, CCC took over the management and operation of the practices. &lt;br /&gt; &lt;br /&gt; CCC is undergoing an exciting phase of transformation as we merge three practices into one inventive and efficient organisation with the singular commitment of eliminating health inequalities in underserved communities through multi-disciplinary, whole-person care. &lt;br /&gt; &lt;br /&gt; We are recruiting several Advanced Nurse Practitioners to join our team of skilled clinicians and administrators. &lt;br /&gt; &lt;br /&gt;  *17,000 patient list with good demographic mix &lt;br /&gt; *Emotional Wellbeing Team in place to manage mental health case load &lt;br /&gt; *Care Coordination Team in place to manage complex care and nursing home patients &lt;br /&gt; *EMIS Web and eConsult&lt;br /&gt; *27 days annual leave matched up to 33 excluding Bank Holidays&lt;br /&gt; *NHS Pension&lt;/p&gt;\n&lt;p&gt;The ability to speak Welsh is desirable for this post; English and/or Welsh speakers are equally welcome to apply&lt;/p&gt;\n\n\n\n", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/132734.png", "name": "GP Practices - Betsi Cadwaladr University Health Board", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=132734"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Wrexham", "postalCode": "LL13 8RG"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.0495", "longitude": "-2.98426"}}, "title": "Advanced Nurse Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248461", "validThrough": "2020-11-08T23:59:59+0000"}