{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "17761", "minValue": "17761", "unitText": "YEAR", "value": "£17,761.06"}}, "datePosted": "2020-11-03T14:37:23+0000", "description": "&lt;h1&gt;&lt;strong&gt;Admin Support Officer&lt;/strong&gt;&lt;/h1&gt;\n&lt;h1&gt;&lt;strong&gt;Salary &lt;/strong&gt;&lt;strong&gt;£17,761.06 per annum &lt;/strong&gt;&lt;/h1&gt;\n&lt;h2&gt;&lt;strong&gt;37.5 hours per week - &lt;/strong&gt;&lt;strong&gt;including evenings/weekend/bank holidays – Job Share and Part-time applications considered &lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;strong&gt;This initally is intially offered on a 4 month fixed-term contract basis, which may be extended.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Are you a forward-thinking, attentive and passionate administrator looking to join a &lt;/strong&gt;&lt;strong&gt;team that makes a real difference to people’s live&lt;/strong&gt;&lt;strong&gt;s?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the Role:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Providing effective administrative support to our Mountbatten Co-ordination Centre, as part of our team of administrators working on a shift rotation you will take the lead in answering calls into our Co-ordination Centre.&lt;/p&gt;\n&lt;p&gt;You will be responsible for acting on call information and dealing with this in the most appropriate manner to ensure the caller’s outcome is positive and they are provided with assistance/information as swiftly as possible&lt;/p&gt;\n&lt;p&gt;You will be supporting the triaging of referrals into our Mountbatten at Home team. You will be required to handle a wide range of administrative support related tasks, to include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Delivering a value driven administration support service&lt;/li&gt;\n&lt;li&gt;Maintaining efficient administration systems&lt;/li&gt;\n&lt;li&gt;Processing referrals into Mountbatten services, in a timely manner ensuring urgent requests are given priority&lt;/li&gt;\n&lt;li&gt;Preparing/transcribing reports, clinic letters, general correspondence&lt;/li&gt;\n&lt;li&gt;Input accurately all information received into SystmOne within department timescales&lt;/li&gt;\n&lt;li&gt;Collating, compiling and reporting of statistical data, outcome data and training evaluations related to the team’s activity&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;About you:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will be an experienced administrator who is used to working within a busy office environment, who has a “can do attitude”. You will treat everyone with compassion and kindness, ensuring they feel valued and listened to and enjoy working as part of a multi-disciplinary team. You will have strong communication skills both verbally and in writing and be able to establish working relationships quickly across all areas of the Hospice. You will be required to work your hours in accordance with the teams shift rotation, which will include evenings, weekends and bank holidays.&lt;/p&gt;\n&lt;p&gt;You will have strong IT skills including Word and Excel and Powerpoint and be able to work to deadlines whilst maintaining accuracy and attention to detail always. You will ideally have previous experience of working within a similar position in either a Hospice or Hospital or Charity or Care organisation.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/135458.png", "name": "Mountbatten Isle of Wight", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=135458"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Isle of Wight", "postalCode": "PO30 2ER"}, "geo": {"@type": "GeoCoordinates", "latitude": "50.7066", "longitude": "-1.28246"}}, "title": "Admin Support Officer - Clinical", "url": "https://www.jobs.nhs.uk/xi/vacancy/916254364", "validThrough": "2020-11-11T23:59:59+0000"}