{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "110683", "minValue": "82096", "unitText": "YEAR", "value": "£82,096 - £110,683 per annum pro rata"}}, "datePosted": "2020-10-29T10:02:23+0000", "description": "&lt;p&gt;An exciting opportunity has arisen for a Locum Consultant General Surgeon with a Specialist Interest in Colorectal Surgery to join an innovative team dedicated to the delivery of high quality care within Sherwood Forest Hospitals NHS Foundation Trust.&lt;/p&gt;\n&lt;p&gt;We are a busy general surgical unit, providing comprehensive emergency, in and outpatient diagnostic and treatment for colorectal, UGI, thyroid and endocrine patients serving a population of more than 400,000. You will help us to continue to provide a high quality service and maintain national cancer and 18 week referral to treatment targets.&lt;/p&gt;\n&lt;p&gt;You will be a team player able to embrace change and modernisation.&lt;/p&gt;\n&lt;p&gt;You will be part of a team which includes 11 Consultant General Surgeons plus visiting Consultants from Nottingham University Hospitals NHS Trust, 5 Speciality Doctors, a full junior medical team and 4 Specialist Nurses.&lt;/p&gt;\n&lt;p&gt;We are active in the teaching of both Medical Students and Surgical Trainees as part of the Nottingham Medical School rotation.&lt;/p&gt;\n&lt;p&gt;Applicants must have full GMC registration with a licence to practise and have had extensive experience in General Surgery and in particular Colorectal Surgery. The post holder will be able to demonstrate a wide range of skills and will be asked to work flexibly within the department.&lt;/p&gt;\n&lt;p&gt;Participation in some out of hours work will be expected and this will be remunerated as per terms and conditions set out in the Consultant contract.&lt;/p&gt;\n&lt;p&gt;This post attracts 10 PA’s. Part time/job share applicants will also be considered. The post is offered on a fixed term contract for twelve months.&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Sherwood Forest Hospitals NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120977"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "King&#39;s Mill Hospital, Sutton-In-Ashfield", "postalCode": "NG17 4JL"}, "geo": {"@type": "GeoCoordinates", "latitude": "53.1345", "longitude": "-1.23627"}}, "title": "Locum Consultant General Surgeon with Interest in Colorectal Surgery", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247837", "validThrough": "2020-11-18T23:59:59+0000"}