{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "87754", "minValue": "63751", "unitText": "YEAR", "value": "£63,751 - £87,754 per annum"}}, "datePosted": "2020-10-28T15:02:02+0000", "description": "&lt;p&gt;&lt;strong&gt;**Banding subject to confirmation of Agenda for Change evaluation (8c or 8d)**&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Shrewsbury and Telford Hospital NHS Trust (SaTH) is currently establishing a new Strategy and Planning Directorate to support the delivery of the Trust’s vision and strategic goals.&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity for a professional to drive analytics and lead a Business Intelligence team to support The Shrewsbury and Telford Hospital NHS Trust (SaTH). The successful candidate will develop a team tasked with implementing and optimising tools and strategies to translate raw data into valuable insights that guide the Trust. You will focus on developing and optimising core analytics visualisation tools, delivering insights that empower the Trust and Senior Management team. As you will play a meaningful role in the team, we expect you to have strong logical reasoning skills, strong insight and analytics development skills, and be experienced in optimising data visualisation. You will drive requirement gathering and analytics developments with an aim towards providing data visualisation tools to guide short-term and long-term decisions for the Trust.&lt;/p&gt;\n&lt;p&gt;The primary purpose of the Business Intelligence team is to create central reporting system from clinical and non-clinical data sources to enhance the day to day job for staff at all levels. This will help the Trust to lead on the delivery of integrated care vision.&lt;/p&gt;\n&lt;p&gt;Can you demonstrate the following skills and experiences?&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Background in analytics, business intelligence and/or data science and significant experience of SQL and Data warehousing;&lt;/li&gt;\n&lt;li&gt;Highly developed leadership skills with an ability to build successful networks and work collaboratively;&lt;/li&gt;\n&lt;li&gt;Business focused, sensitive to clinical and political demands with the know how to cut through barriers to change;&lt;/li&gt;\n&lt;li&gt;An ability to build relationships quickly and work effectively with other senior leaders in the Trust to deliver the right outcomes, whilst ensuring that patient safety and quality of care is maintained and improved;&lt;/li&gt;\n&lt;li&gt;As a strong team player, you will can engage individuals and teams in delivering the outcomes needed;&lt;/li&gt;\n&lt;li&gt;&lt;span&gt;Desirable - operational healthcare experience.&lt;/span&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;NameChris PrestonJob titleDirector of Strategy and PlanningEmail addresschris.preston2@nhs.netTelephone number01743 261030Additional contact information&lt;/p&gt;\n&lt;p&gt;Kelly Hall - Executive Assistant to Director of Strategy and Planning&lt;/p&gt;\n&lt;p&gt;kelly.hall15@nhs.net&lt;/p&gt;\n&lt;p&gt;01743 261030&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/120882.png", "name": "Shrewsbury and Telford Hospital NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=120882"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "The Royal Shrewsbury Hospital", "postalCode": "SY2 6HY"}, "geo": {"@type": "GeoCoordinates", "latitude": "52.6899", "longitude": "-2.72775"}}, "title": "Head of Business Intelligence", "url": "https://www.jobs.nhs.uk/xi/vacancy/916247118", "validThrough": "2020-11-06T23:59:59+0000"}