{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "37890", "minValue": "31365", "unitText": "YEAR", "value": "£31,365 - £37,890 pa"}}, "datePosted": "2020-10-23T14:16:11+0100", "description": "&lt;p&gt;&lt;strong&gt;CAMHS Mental Health Practitioner&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Cognitive Behaviour Therapy Training for Senior Mental Health Practitioners (CAMHS).&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Children and Young Peoples Improving Access to Psychological Therapies (CYP IAPT)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hours: One year fixed term training post. &lt;/strong&gt;Full Time (Minimum of 0.8wte accepted due to University course commitments)&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location: To be confirmed on offer of appointment. &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is a one year fixed term training post for Social Workers, Occupational Therapists and Registered Mental Health Nurses with post registration experience to work as a Senior Mental Health Practitioner in our established Community Services for Children and Young People with Mental Health Problems. This post provides the opportunity to complete the Children and Young People Improving Access to Psychological Therapies (CYP-IAPT) training in Cognitive Behavioural Therapy (CBT) that is being run in collaboration with the University of Reading. &lt;br /&gt;&lt;br /&gt;The successful candidates would be working as Senior Mental Health Practitioners within one of the CAMHS community teams for the duration of the one year course and would split their time between training and carrying out clinical work. After successful completion of the course the fixed term training contract will end however applicants would be encouraged to apply for any vacant posts within the service.&lt;/p&gt;\n&lt;p&gt;The CBT course provides a thorough and robust cognitive behavioural theoretical base with particular focus on the protocols with the soundest evidence. In addition to providing practical, intensive and detailed skills training to facilitate skill development to a defined standard of competency, the course will aim to increase trainees’ knowledge base of theory and research in CBT and to promote a critical approach to the subject. It will aim to equip trainees to become skilled, creative and independent CBT practitioners who appropriately value and adhere to treatment protocols with fidelity. We provide a BABCP level 2 postgraduate diploma in CBT.&lt;/p&gt;\n&lt;p&gt;The training involves teaching blocks as well as weekly teaching and supervision days at the University of Reading. Applicants must be willing to travel.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Course Entry requirements&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Postgraduate Diploma in Evidence-Based Psychological treatments for C&amp;YP (CBT route)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Academic&lt;/p&gt;\n&lt;p&gt; &lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Relevant Honours Degree graded at 2.2 or above &lt;strong&gt;&lt;em&gt;or&lt;/em&gt;;&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;Successful completion of pre-entry essay, which is marked at Masters level, prior to acceptance on training programme.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Professional&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Core profession as defined by BABCP, &lt;strong&gt;&lt;em&gt;or&lt;/em&gt;&lt;/strong&gt;;&lt;/li&gt;\n&lt;li&gt;Completion of KSA (Knowledge, Skills and Attitudes) portfolio.&lt;/li&gt;\n&lt;li&gt;Membership of the BABCP if undertaking the KSA route.&lt;/li&gt;\n&lt;li&gt;Access to appropriate cases during and after training.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;NOTE: &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;· Applicants must have a relevant degree and/&lt;em&gt;or&lt;/em&gt; a core profession.&lt;/p&gt;\n&lt;p&gt;· Students cannot be accepted onto any training programme if they are currently undertaking studies elsewhere or registered with another university.&lt;/p&gt;\n&lt;p&gt;The clinical work involves being part of a multi-disciplinary CAMHS team and successful candidates will carry their own caseload of CBT training cases. Workplace supervision will be provided weekly.&lt;/p&gt;\n&lt;p&gt;Please note in this instance the course is not optional; there will be a joint interview process including University of Reading to appoint to these roles. Due to the fixed term nature of these roles, all applicants to this advertisement (including any new/additional internal applicants) would need to take a break in service of 9 days. The roles are dependent on meeting all course requirements.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Please note that the start date for this post is 4th January 2021 so candidates would need to be able to start by this point. A professional/qualification would be required or a completed KSA by the point of interview.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;All applicants will need to be available to start the training in January 2021&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name Richard Levell&lt;/p&gt;\n&lt;p&gt;Job title General Manager&lt;/p&gt;\n&lt;p&gt;Email address richardlevell@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number 07391400341&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "logo": "https://www.jobs.nhs.uk/xi/db_image/logo/121074.jpg", "name": "Sussex Partnership NHS Foundation Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=121074"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Hampshire Wide, Various", "postalCode": "SP10 2PE"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.2061", "longitude": "-1.47527"}}, "title": "Cognitive Behavioural Training for Senior Mental Health Practitioner", "url": "https://www.jobs.nhs.uk/xi/vacancy/916240877", "validThrough": "2020-11-08T23:59:59+0000"}