{"@context": "http://schema.org", "@type": "JobPosting", "baseSalary": {"@type": "MonetaryAmount", "currency": "GBP", "value": {"@type": "QuantitativeValue", "maxValue": "30615", "minValue": "24907", "unitText": "YEAR", "value": "£24,907 - £30,615 per annum"}}, "datePosted": "2020-10-29T12:46:41+0000", "description": "&lt;p&gt;&lt;strong&gt;Band 5 Acute Dietitian &lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;An exciting opportunity has arisen for a dietitian to join the acute team at Lister Hospital as part of the Hertfordshire Nutrition and Dietetic Service. You will be providing dietetic care and input for the inpatient service in areas such as care of the elderly, surgical and general medicine as well as outpatient clinics within East and North Hertfordshire. Additionally you will input into group education sessions such as the cardiac rehabilitation programme.&lt;/p&gt;\n&lt;p&gt;As a member of this friendly and dedicated team, you will gain varied experience across inpatient and outpatient settings, develop strong links with health and social care professionals and will act as a valuable resource for both patients and professionals in this role.&lt;/p&gt;\n&lt;p&gt;This post joins a larger team of Dietitians working across Hertfordshire within a number of specialities including paediatrics, neurology, home enteral feeding and diabetes. We also work in collaboration with a number of other Trusts and stakeholders providing aspects of dietetic care to patients within Hertfordshire.&lt;/p&gt;\n&lt;p&gt;Staff are well supported and continuing professional development is encouraged through appraisal, mentoring and training. There will be opportunity to partake in shadowing specialties such as critical care, oncology and paediatrics. Training of student dietitians from University of Hertfordshire is a key element of this role and you will be supported in your position as a student educator.&lt;/p&gt;\n&lt;p&gt;The service is supported by a team of administrators as well as dietetic assistants and there are excellent IT facilities to enable mobile working.&lt;/p&gt;\n&lt;p&gt;You must hold a full valid driving licence and access to a car to use regularly for business purposes is essential (unless you have a disability as defined by the Equality Act 2010).&lt;/p&gt;\n&lt;p&gt;We will communicate any interview arrangements with applicants via e-mail so it is advisable that you check the email address you give on your application on a regular basis.&lt;/p&gt;\n&lt;p&gt;Interview date - Thursday 19th November&lt;/p&gt;\n&lt;p&gt;For further details / informal visits contact:&lt;/p&gt;\n&lt;p&gt;Name: Helen Arora&lt;/p&gt;\n&lt;p&gt;Job title: Acute Team Lead&lt;/p&gt;\n&lt;p&gt;Email address: helen.arora@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone number: 01438 284 113&lt;/p&gt;\n&lt;p&gt;Additional contact information&lt;/p&gt;\n&lt;p&gt;Name: Carissa Shaw&lt;/p&gt;\n&lt;p&gt;Job Title: Chief Dietitian&lt;/p&gt;\n&lt;p&gt;Email Address: carissa.shaw@nhs.net&lt;/p&gt;\n&lt;p&gt;Telephone Number: 07768 888390&lt;/p&gt;", "employmentType": "FULL_TIME", "hiringOrganization": {"@type": "Organization", "name": "Hertfordshire Community NHS Trust", "url": "https://www.jobs.nhs.uk/xi/agency_info/?agency_id=126514"}, "industry": "Healthcare", "jobLocation": {"@type": "Place", "address": {"@type": "PostalAddress", "addressCountry": "GB", "addressLocality": "Lister Hospital, Stevenage", "postalCode": "SG1 4AB"}, "geo": {"@type": "GeoCoordinates", "latitude": "51.9242", "longitude": "-.211889"}}, "title": "Acute Dietitian", "url": "https://www.jobs.nhs.uk/xi/vacancy/916248391", "validThrough": "2020-11-11T23:59:59+0000"}